Alhadis/Silos/Solaris-11.3/zh_CN.UTF-8/man1/chgrp.1
'\" te
.\" Copyright 1989 AT&T Copyright (c) 1983 Regents of the University of California.All rights reserved.The Berkeley software License Agreement specifies the terms and conditions for redistribution.
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\"  Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation.Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation.In the following statement, the phrase "this text" refers to portions of the system documentation.Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group.In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document.The original Standard can be obtained online at http://www.opengroup.org/unix/online.html.This notice shall appear on any product containing this material. 
.TH chgrp 1 "2008 年 7 月 11 日" "SunOS 5.11" "用户命令"
.SH 名称
chgrp \- 更改文件组所有权
.SH 用法概要
.LP
.nf
\fBchgrp\fR [\fB-fhR\fR] \fIgroup\fR \fIfile\fR...
.fi

.LP
.nf
\fBchgrp\fR \fB-s\fR [\fB-fhR\fR] \fIgroupsid\fR \fIfile\fR...
.fi

.LP
.nf
\fBchgrp\fR \fB-R\fR [f] [\fB-H\fR | \fB-L\fR | \fB-P\fR] \fIgroup\fR \fIfile\fR...
.fi

.LP
.nf
\fBchgrp\fR \fB-s\fR \fB-R\fR [f] [\fB-H\fR | \fB-L\fR | \fB-P\fR] \fIgroupsid\fR \fIfile\fR...
.fi

.SH 描述
.sp
.LP
\fBchgrp\fR 实用程序可将由每个 \fIfile\fR 操作数指定的文件的组 ID 设置为由 \fIgroup\fR 操作数指定的组 ID。
.sp
.LP
对于每个 \fIfile\fR 操作数，它执行的操作等效于使用以下参数调用 \fBchown\fR(2) 函数：
.RS +4
.TP
.ie t \(bu
.el o
\fIfile\fR 操作数将用作 \fIpath\fR 参数。
.RE
.RS +4
.TP
.ie t \(bu
.el o
文件的用户 ID 将用作 \fIowner\fR 参数。
.RE
.RS +4
.TP
.ie t \(bu
.el o
指定的组 ID 将用作 \fIgroup\fR 参数。
.RE
.sp
.LP
除非 \fBchgrp\fR 由具有相应特权的进程调用，否则将在成功完成后清除正规文件的 set-user-ID 和 set-group-ID 位；可能会清除其他文件类型的 set-user-ID 和 set-group-ID 位。
.sp
.LP
操作系统带有一个配置选项 \fB_POSIX_CHOWN_RESTRICTED\fR，用于限制所有权更改。如果启用了该选项，则文件的所有者只能将文件的组更改为所有者所属的组。只有超级用户可以任意更改所有者 ID，而不受是否启用该选项的限制。要设置该配置选项，请在 \fB/etc/system\fR 中添加以下行：
.sp
.in +2
.nf
set rstchown = 1
.fi
.in -2

.sp
.LP
要禁用该选项，请在 \fB/etc/system\fR 中添加以下行：
.sp
.in +2
.nf
set rstchown = 0
.fi
.in -2

.sp
.LP
缺省情况下，\fB_POSIX_CHOWN_RESTRICTED\fR 处于启用状态。请参见 \fBsystem\fR(4) 和 \fBfpathconf\fR(2)。
.SH 选项
.sp
.LP
支持以下选项。
.SS "/usr/bin/chgrp and /usr/xpg4/bin/chgrp"
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 6n
.rt  
强制。不报告错误。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 6n
.rt  
如果文件是符号链接，该选项将更改符号链接的组。如果不使用该选项，将更改符号链接引用的文件的组。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR\fR
.ad
.RS 6n
.rt  
如果在命令行中指定的文件是符号链接且符号链接引用的文件类型是目录，则该选项将更改符号链接引用的目录的组，以及文件分层结构中该目录下方所有文件的组。如果遍历文件分层结构时遇到符号链接，则将更改目标文件的组，但是不执行递归。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fR
.ad
.RS 6n
.rt  
如果文件是符号链接，该选项将更改符号链接引用的文件的组。如果在命令行中指定的文件或者遍历文件分层结构时遇到的文件是符号链接且符号链接引用的文件类型是目录，则该选项将更改符号链接引用的目录的组，以及文件分层结构中该目录下方所有文件的组。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR\fR
.ad
.RS 6n
.rt  
如果在命令行中指定的文件或者遍历文件分层结构时遇到的文件是符号链接，该选项将更改符号链接的组。该选项不会跟随符号链接转至文件分层结构的其他任何部分。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
.rt  
指定的组为 Windows SID。该选项要求使用支持存储 SID 的文件系统，例如 ZFS。
.RE

.sp
.LP
指定多个互斥选项 \fB-H\fR、\fB-L\fR 或 \fB-P\fR 不会视为错误。指定的最后一个选项将决定 \fBchgrp\fR 的行为。
.SS "/usr/bin/chgrp"
.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.RS 6n
.rt  
递归。\fBchgrp\fR 将在目录和所有子目录中向下延伸，在此过程中设置指定的组 \fBID\fR。如果遇到符号链接，除非指定 \fB-h\fR 或 \fB-P\fR 选项，否则将更改目标文件的组。但是，除非指定 \fB-H\fR 或 \fB-L\fR 选项，否则不执行递归。
.RE

.SS "/usr/xpg4/bin/chgrp"
.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.RS 6n
.rt  
递归。\fBchgrp\fR 将在目录和所有子目录中向下延伸，在此过程中设置指定的组 \fBID\fR。如果遇到符号链接，除非指定 \fB-h\fR 或 \fB-P\fR 选项，否则将更改目标文件的组。除非指定 \fB-H\fR、\fB-L\fR 或 \fB-P\fR 选项，否则 \fB-L\fR 选项将用作缺省模式。
.RE

.SH 操作数
.sp
.LP
支持下列操作数：
.sp
.ne 2
.mk
.na
\fB\fIgroup\fR\fR
.ad
.RS 9n
.rt  
组数据库中的组名称或数字组 ID。两者均可指定要提供给由 \fIfile\fR 操作数之一指定的每个文件的组 ID。如果组数据库中存在数字 \fIgroup\fR 操作数作为一个组名称，则与该组名称关联的组 ID 号将用作组 ID。
.RE

.sp
.ne 2
.mk
.na
\fB\fIfile\fR\fR
.ad
.RS 9n
.rt  
要修改其组 ID 的文件的路径名。
.RE

.SH 用法
.sp
.LP
有关 \fBchgrp\fR 遇到大于或等于 2 GB（2^31 字节）文件时行为的说明，请参见 \fBlargefile\fR(5)。
.SH 环境变量
.sp
.LP
有关影响 \fBchgrp\fR 执行的以下环境变量的说明，请参见 \fBenviron\fR(5)：\fBLANG\fR、\fBLC_ALL\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR 和 \fBNLSPATH\fR。
.SH 退出状态
.sp
.LP
将返回以下退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
实用程序成功执行，请求的所有更改都已执行。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
出现错误。
.RE

.SH 文件
.sp
.ne 2
.mk
.na
\fB\fB/etc/group\fR\fR
.ad
.RS 14n
.rt  
组文件
.RE

.SH 属性
.sp
.LP
有关下列属性的说明，请参见 \fBattributes\fR(5)：
.SS "/usr/bin/chgrp"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
_
CSIT{
Enabled（已启用）。请参见“附注”部分。
T}
_
接口稳定性Committed（已确定）
_
标准请参见 \fBstandards\fR(5)。
.TE

.SS "/usr/xpg4/bin/chgrp"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/xopen/xcu4
_
CSIT{
Enabled（已启用）。请参见“附注”部分。
T}
_
接口稳定性Committed（已确定）
_
标准请参见 \fBstandards\fR(5)。
.TE

.SH 另请参见
.sp
.LP
\fBchmod\fR(1)、\fBchown\fR(1)、\fBid\fR(1M)、\fBchown\fR(2)、\fBfpathconf\fR(2)、\fBgroup\fR(4)、\fBpasswd\fR(4)、\fBsystem\fR(4)、\fBattributes\fR(5)、\fBenviron\fR(5)、\fBlargefile\fR(5)、\fBstandards\fR(5)
.SH 附注
.sp
.LP
\fBchgrp\fR 已启用 CSI，但 \fIgroup\fR 名称除外。
