Alhadis/Silos/Solaris-11.3/zh_CN.UTF-8/man1/mv.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\" Portions Copyright (c) 2007, 2010, Oracle and/or its affiliates.All rights reserved.
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation.Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/. 
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation.In the following statement, the phrase "this text" refers to portions of the system documentation.Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group.In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document.The original Standard can be obtained online at http://www.opengroup.org/unix/online.html.This notice shall appear on any product containing this material. 
.TH mv 1 "2010 年 11 月 19 日" "SunOS 5.11" "用户命令"
.SH 名称
mv \- 移动文件
.SH 用法概要
.LP
.nf
\fB/usr/bin/mv\fR [\fB-fi\fR] \fIsource\fR \fItarget_file\fR
.fi

.LP
.nf
\fB/usr/bin/mv\fR [\fB-fi\fR] \fIsource\fR... \fItarget_dir\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/mv\fR [\fB-fi\fR] \fIsource\fR \fItarget_file\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/mv\fR [\fB-fi\fR] \fIsource\fR... \fItarget_dir\fR
.fi

.SH 描述
.sp
.LP
在第一种用法概要形式中，\fBmv\fR 实用程序将 \fIsource\fR 操作数指定的文件移到 \fItarget_file\fR 指定的目标。\fIsource\fR 和 \fItarget_file\fR 不能重名。如果 \fItarget_file\fR 不存在，\fBmv\fR 将创建名为 \fItarget_file\fR 的文件。如果 \fItarget_file\fR 存在，则将覆盖其内容。使用第一种用法概要形式的前提是最终操作数没有指定现有的目录。
.sp
.LP
在第二种用法概要形式中，\fBmv\fR 将 \fIsource\fR 操作数指定的每个文件移到 \fItarget_dir\fR 操作数指定的现有目录中的目标文件。每个 \fIsource\fR 的目标路径是目标目录、一个斜杠字符 (\fB/\fR) 以及 \fIsource\fR 的最后一个路径名组成部分的串联。使用第二种形式的前提是最终操作数指定了现有目录。
.sp
.LP
如果 \fBmv\fR 确定 \fItarget_file\fR 的模式禁止写入，则将列显该模式（请参见 \fBchmod\fR(2)），要求响应，并读取一行的标准输入。如果响应是肯定的，则发生 \fBmv\fR（如果允许）；否则退出命令。请注意，如果 \fItarget\fR 与 \fBACL\fR 关联，则显示的模式不能完全代表访问权限。当 \fIsource\fR 的父目录可写入，并且设置了粘滞位时，以下一个或多个条件必须成立：
.RS +4
.TP
.ie t \(bu
.el o
用户必须拥有文件
.RE
.RS +4
.TP
.ie t \(bu
.el o
用户必须拥有目录
.RE
.RS +4
.TP
.ie t \(bu
.el o
用户必须能够写入文件
.RE
.RS +4
.TP
.ie t \(bu
.el o
用户必须是特权用户
.RE
.sp
.LP
如果 \fIsource\fR 是一个文件，\fItarget_file\fR 是到有多个链接的另一个文件的一个链接，则其他文件将保留，并且 \fItarget_file\fR 将成为新的文件。
.sp
.LP
如果 \fIsource\fR 和 \fItarget_file\fR/\fItarget_dir\fR 在不同的文件系统上，则 \fBmv\fR 将复制源并删除原始文件。到其他文件的任何硬链接将丢失。\fBmv\fR 会尝试将源文件特征复制到目标，其中包括所有者和组 ID、权限模式、修改和访问的次数、\fBACL\fR 以及扩展属性（如果适用）。对于符号链接，\fBmv\fR 仅保留链接本身的所有者和组。
.sp
.LP
如果无法保留所有者和组 ID，\fBmv\fR 将清除目标中的 \fBS_ISUID\fR 和 \fBS_ISGID\fR 位。如果无法清除这些位，\fBmv\fR 会将诊断消息列显到标准错误，但退出代码不受影响。如果目标文件系统不支持扩展属性，\fBmv\fR 可能无法保留扩展属性。对于其他所有复制文件特征的失败尝试，\fB/usr/xpg4/bin/mv\fR 会将诊断消息列显到标准错误。退出代码不受影响。
.sp
.LP
要保留源文件特征，用户必须拥有相应的文件访问权限。其中包括成为超级用户，或者拥有与目标文件相同的所有者 ID。
.SH 选项
.sp
.LP
支持以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 6n
.rt  
\fBmv\fR 在移动文件时不提示，即使在要覆盖现有的 \fItarget\fR 目标时也不提示。请注意，这是标准输出不是终端时的缺省行为。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.RS 6n
.rt  
只要移动操作将覆盖现有目标，\fBmv\fR 就会提示确认。无论是否从终端输入，都会执行该操作。如果提示确认失败，这就相当于被用户否决。确定的响应表示应继续移动。其他任何响应都将阻止 \fBmv\fR 覆盖 \fItarget\fR。
.RE

.SS "/usr/bin/mv"
.sp
.LP
同时指定 \fB-f\fR 和 \fB-i\fR 选项不算错误。\fB-f\fR 选项优先于 \fB-i\fR 选项。
.SS "/usr/xpg4/bin/mv"
.sp
.LP
同时指定 \fB-f\fR 和 \fB-i\fR 选项不算错误。最后指定的选项决定 \fBmv\fR 的行为。
.SH 操作数
.sp
.LP
支持下列操作数：
.sp
.ne 2
.mk
.na
\fB\fIsource\fR\fR
.ad
.RS 15n
.rt  
要移动的文件或目录的路径名。
.RE

.sp
.ne 2
.mk
.na
\fB\fItarget_file\fR\fR
.ad
.RS 15n
.rt  
被移动的文件或目录的新路径名。
.RE

.sp
.ne 2
.mk
.na
\fB\fItarget_dir\fR\fR
.ad
.RS 15n
.rt  
要将输入文件移到其中的现有目录的路径名。
.RE

.SH 用法
.sp
.LP
有关 \fBmv\fR 遇到大于或等于 2 GB（2^31 字节）文件时行为的说明，请参见 \fBlargefile\fR(5)。
.SH 环境变量
.sp
.LP
有关影响 \fBmv\fR 执行的以下环境变量的说明，请参见 \fBenviron\fR(5)：\fBLANG\fR、\fBLC_ALL\fR、\fBLC_COLLATE\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR 和 \fBNLSPATH\fR。
.sp
.LP
肯定的回答使用为用户语言环境中 \fBLC_MESSAGES\fR 类别的 \fByesexpr\fR 关键字定义的扩展正则表达式进行处理。\fBLC_COLLATE\fR 类别中指定的语言环境定义为 \fByesexpr\fR 定义的表达式中使用的范围、等效类和多字符整理元素的行为。\fBLC_CTYPE\fR 中指定的语言环境确定文本数据字符字节序列解释的语言环境，以及为 \fByesexpr\fR 定义的表达式中使用的字符类的行为。请参见 \fBlocale\fR(5)。
.SH 退出状态
.sp
.LP
将返回以下退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
已成功移动所有输入文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
出现错误。
.RE

.SH 属性
.sp
.LP
有关下列属性的说明，请参见 \fBattributes\fR(5)：
.SS "/usr/bin/mv"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
_
CSIEnabled（已启用）
_
接口稳定性Committed（已确定）
.TE

.SS "/usr/xpg4/bin/mv"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/xopen/xcu4
_
CSIEnabled（已启用）
_
接口稳定性Standard（标准）
.TE

.SH 另请参见
.sp
.LP
\fBcp\fR(1)、\fBcpio\fR(1)、\fBln\fR(1)、\fBrm\fR(1)、\fBsetfacl\fR(1)、\fBchmod\fR(2)、\fBattributes\fR(5)、\fBenviron\fR(5)、\fBfsattr\fR(5)、\fBlargefile\fR(5)、\fBstandards\fR(5)
.SH 附注
.sp
.LP
\fB--\fR 允许用户显式标记任何命令行选项的末尾，从而使 \fBmv\fR 可以识别以 \fB-\fR 开头的文件名参数。作为 BSD 迁移的辅助功能，\fBmv\fR 接受将 \fB-\fR 作为 \fB--\fR 的等效字符。将来的版本可能会取消这项迁移辅助功能。
