Alhadis/Silos/Solaris-11.3/zh_CN.UTF-8/man1/svcs.1
'\" te
.\" Copyright (c) 2008, 2015, Oracle and/or its affiliates.All rights reserved.
.TH svcs 1 "2015 年 6 月 2 日" "SunOS 5.11" "用户命令"
.SH 名称
svcs \- 报告服务状态
.SH 用法概要
.LP
.nf
\fBsvcs\fR [\fB-aHpv?\fR] [\fB-o\fR \fIcol\fR[,\fIcol\fR]]... [\fB-R\fR \fIFMRI-instance\fR]... 
     [\fB-sS\fR \fIcol\fR]... [\fIFMRI\fR | \fIpattern\fR]...
.fi

.LP
.nf
\fBsvcs\fR {\fB-d\fR | \fB-D\fR} [\fB-Hpv?\fR] [\fB-o\fR \fIcol\fR[,\fIcol\fR]]... [\fB-sS\fR \fIcol\fR]... 
     [\fIFMRI\fR | \fIpattern\fR] ...
.fi

.LP
.nf
\fBsvcs\fR \fB-n\fR [\fIFMRI\fR] ...
.fi

.LP
.nf
\fBsvcs\fR \fB-l\fR [\fB-v\fR] [\fIFMRI\fR | \fIpattern\fR]...
.fi

.LP
.nf
\fBsvcs\fR \fB-L\fR [\fB-v\fR] [\fIFMRI\fR]...
.fi

.LP
.nf
\fBsvcs\fR \fB-x\fR [\fB-v\fR] [\fB-L\fR] [\fIFMRI\fR]...
.fi

.SH 描述
.sp
.LP
\fBsvcs\fR 命令显示有关服务配置系统信息库中记录的服务实例的信息。
.sp
.LP
第一种命令形式输出由参数指定的服务实例的单行状态列表。每个实例只列出一次。如果不指定任何参数，则会列出所有已启用的服务实例（即使被临时禁用），这些服务实例将包含以下各列。
.sp
.LP
第二种命令形式输出由参数指定的服务实例的依赖项或相关项的单行状态列表。
.sp
.LP
第三种命令形式输出有关特定服务和实例的详细信息。
.sp
.LP
第四种命令形式说明服务实例的状态。每个参数都对应一组可读的文本，用于说明服务的状态以及服务处于这种状态的原因。如果不指定任何参数，将描述有问题的服务。
.sp
.LP
标准错误流将列显错误消息。
.sp
.LP
该命令的输出可适当用作 \fBsvcadm\fR(1M) 命令的输入。
.SH 选项
.sp
.LP
支持以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-?\fR\fR
.ad
.sp .6
.RS 4n
显示一条扩展的用法消息，包含列说明符。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
显示所有服务，包括禁用的以及不完整的服务。可以使用 \fBsvcs —x\fR\fI<service>\fR 进一步说明不完整的服务。 
.sp
如果选定多个服务，则该选项无效。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
显示指定的服务实例所依赖的服务或服务实例。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR\fR
.ad
.sp .6
.RS 4n
显示依赖于指定的服务或服务实例的服务实例。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR\fR
.ad
.sp .6
.RS 4n
省略列标题。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
（字母 ell。）显示有关选定的服务和服务实例的所有可用信息。每行显示一个服务属性。不同实例的信息由空行隔开。
.sp
以下的特定属性需要进行详细说明：
.sp
.ne 2
.mk
.na
\fB\fBdependency\fR\fR
.ad
.sp .6
.RS 4n
有关依赖项的信息。首先显示分组与 \fBrestart_on\fR 属性，并用正斜杠 (\fB/\fR) 隔开。然后列出每个实体及其状态。有关状态的信息，请参见 \fBsmf\fR(5)。除了标准状态，每个服务依赖项还可以具有以下状态说明：
.sp
.ne 2
.mk
.na
\fB\fBabsent\fR\fR
.ad
.sp .6
.RS 4n
系统中未定义此类服务。
.RE

.sp
.ne 2
.mk
.na
\fB\fBinvalid\fR\fR
.ad
.sp .6
.RS 4n
故障管理资源标识符 (Fault Management Resource Identifier, FMRI) 无效。请参见 \fBsmf\fR(5)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmultiple\fR\fR
.ad
.sp .6
.RS 4n
该实体是一个有多个实例的服务。
.RE

文件依赖项只能具有以下状态说明之一：
.sp
.ne 2
.mk
.na
\fB\fBabsent\fR\fR
.ad
.sp .6
.RS 4n
系统中不存在此类文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fBonline（联机）\fR\fR
.ad
.sp .6
.RS 4n
该文件存在。
.sp
如果该文件在 \fBsvc.startd\fR 上次评估服务的依赖项时不存在，该命令可能会认为依赖项不符合条件。\fBsvcadm refresh\fR 将强制重新评估依赖项。
.RE

.sp
.ne 2
.mk
.na
\fB\fBunknown（未知）\fR\fR
.ad
.sp .6
.RS 4n
\fBstat\fR(2) 由于 \fBENOENT\fR 之外的原因失败。
.RE

有关依赖项、分组以及 \fBrestart_on\fR 值的其他详细信息，请参见 \fBsmf\fR(5)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBenabled（已启用）\fR\fR
.ad
.sp .6
.RS 4n
是否启用服务，以及是临时启用还是禁用服务（直到系统下一次重新引导）。前者指定为 \fBtrue\fR 或 \fBfalse\fR，后者根据是否存在 \fB(temporary)\fR 的情况进行指定。
.sp
服务可能会因管理员运行 \fBsvcadm disable -t\fR、使用 \fBsvcadm milestone\fR 或将系统引导到特定里程碑而被临时禁用。有关详细信息，请参见 \fBsvcadm\fR(1M)。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fR
.ad
.sp .6
.RS 4n
列显选定服务实例的服务重启程序创建的日志文件的路径。
.sp
使用 \fB-x\fR 时，要么从正常退出、没有错误的方法的最后一条日志消息之后开始输出日志文件内容，要么输出日志文件的最后 10 行（取两者中距离该服务实例说明的末尾最近的那一个）。如果正常退出、没有错误的方法的日志消息位于日志文件的最后一行，则输出日志文件的最后 5 行。
.sp
使用 \fB-v\fR 时，如果只有一个服务实例与输入匹配，则输出其日志文件的内容。如果有多个服务实例与输入匹配，则输出每个服务实例的日志文件的最后 10 行。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
列显通知参数。请参见 \fBsmf\fR(5)。无论选定的 FMRI 或模式如何，该选项都会列显 FMA 事件通知参数以及系统范围内的 SMF 状态转换通知参数。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIcol\fR[,\fI col\fR]...\fR
.ad
.sp .6
.RS 4n
列显特定的列。每个 \fIcol\fR 应为一个列名。有关可用列，请参见下文的\fB列\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
列出每个服务实例关联的进程。服务实例也可能没有关联的进程。将显示每个进程的进程 ID、开始时间以及命令名称（对应 \fBps\fR(1) 命令中的 \fBPID\fR、\fBSTIME\fR 以及 \fBCMD\fR 字段）。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIFMRI-instance\fR\fR
.ad
.sp .6
.RS 4n
选择将给定的服务实例作为其重启程序的服务实例。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIcol\fR\fR
.ad
.sp .6
.RS 4n
将输出按列排序。\fIcol\fR 应为一个列名。有关可用列，请参见下文的\fB列\fR。多个 \fB-s\fR 选项的行为是累积的。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR \fIcol\fR\fR
.ad
.sp .6
.RS 4n
与 \fB-s\fR 选项一样按 \fIcol\fR 的相反顺序排序。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
如果不指定 \fB-x\fR 或 \fB-l\fR 选项，则显示详细的列：\fBSTATE\fR、\fBNSTATE\fR、\fBSTIME\fR、\fBCTID\fR 和 \fBFMRI\fR。
.sp
如果指定了 \fB-x\fR 选项，则显示每列说明的附加信息。
.sp
如果指定了 \fB-l\fR 选项，则显示\fB应用程序\fR类型的属性组中用户可见的属性及其说明。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.sp .6
.RS 4n
显示对服务状态的说明。 
.sp
如果不带参数，\fB-x\fR 选项将对以下服务的状态进行说明： 
.RS +4
.TP
.ie t \(bu
.el o
已经启用但未运行。
.RE
.RS +4
.TP
.ie t \(bu
.el o
阻止其他已经启用的服务运行。
.RE
.RE

.SH 操作数
.sp
.LP
支持下列操作数：
.sp
.ne 2
.mk
.na
\fB\fIFMRI\fR\fR
.ad
.sp .6
.RS 4n
故障管理资源标识符 (Fault Management Resource Identifier, FMRI)，用于指定一个或多个实例（请参见 \fBsmf\fR(5)）。可以通过指定实例名称或服务名称的结尾部分使用 FMRI 的缩写形式。例如，以下给定的 FMRI：
.sp
.in +2
.nf
svc:/network/smtp:sendmail
.fi
.in -2
.sp

以下是有效的缩写形式：
.sp
.in +2
.nf
sendmail
:sendmail
smtp
smtp:sendmail
network/smtp
.fi
.in -2
.sp

以下是无效的缩写形式：
.sp
.in +2
.nf
mail
network
network/smt
.fi
.in -2
.sp

如果 FMRI 指定了一个服务，则该命令适用于此服务的所有实例，但与 \fB-D\fR 选项结合使用除外。
.sp
FMRI 的缩写形式不稳定，不应在脚本或其他永久性工具中使用。
.RE

.sp
.ne 2
.mk
.na
\fB\fIpattern\fR\fR
.ad
.sp .6
.RS 4n
一种模式，根据 \fBfnmatch\fR(5) 中描述的“通配”规则，与服务实例的 \fIFMRI\fR 匹配。如果模式不以 \fBsvc:\fR 开头，则前置 \fBsvc:/\fR。以下是一个典型的通配模式示例：
.sp
.in +2
.nf
qexample% svcs \e*keyserv\e*
STATE          STIME     FMRI
disabled       Aug_02    svc:/network/rpc/keyserv:default
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fIFMRI-instance\fR\fR
.ad
.sp .6
.RS 4n
用于指定实例的 FMRI。
.RE

.SH 列
.sp
.LP
列名不区分大小写。缺省的输出格式等效于 "\fB-o\fR \fBstate,stime,fmri\fR"。缺省的排序列为 \fBSTATE\fR、\fBSTIME\fR 以及 \fBFMRI\fR。
.sp
.ne 2
.mk
.na
\fB\fBCTID\fR\fR
.ad
.sp .6
.RS 4n
服务实例的主合同 ID。并不是所有的服务实例都有有效的主合同 ID。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDESC\fR\fR
.ad
.sp .6
.RS 4n
根据服务的模板元素对服务进行简单介绍。服务可能没有可用的说明，在这种情况下将使用连字符 (\fB -\fR) 表示空值。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFMRI\fR\fR
.ad
.sp .6
.RS 4n
服务实例的 \fIFMRI\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBINST\fR\fR
.ad
.sp .6
.RS 4n
服务实例的实例名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBNSTA\fR\fR
.ad
.sp .6
.RS 4n
服务实例下一状态的缩写，如 \fBSTA\fR 列中的说明所示。连字符表示实例没有在转换。其他方面与 \fBSTA\fR 相同。
.RE

.sp
.ne 2
.mk
.na
\fB\fBNSTATE\fR\fR
.ad
.sp .6
.RS 4n
服务的下一状态。连字符用于表示实例没有在转换。其他方面与 \fBSTATE\fR 相同。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSCOPE\fR\fR
.ad
.sp .6
.RS 4n
服务实例的作用域名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSVC\fR\fR
.ad
.sp .6
.RS 4n
服务实例的服务名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTA\fR\fR
.ad
.sp .6
.RS 4n
服务实例状态的缩写（请参见 \fBsmf\fR(5)）：
.sp
.ne 2
.mk
.na
\fB\fBDGD\fR\fR
.ad
.sp .6
.RS 4n
降级
.RE

.sp
.ne 2
.mk
.na
\fB\fBDIS\fR\fR
.ad
.sp .6
.RS 4n
禁用
.RE

.sp
.ne 2
.mk
.na
\fB\fBLRC\fR\fR
.ad
.sp .6
.RS 4n
传统的 \fBrc*.d\fR 脚本启动式实例
.RE

.sp
.ne 2
.mk
.na
\fB\fBMNT\fR\fR
.ad
.sp .6
.RS 4n
maintenance
.RE

.sp
.ne 2
.mk
.na
\fB\fBOFF\fR\fR
.ad
.sp .6
.RS 4n
脱机
.RE

.sp
.ne 2
.mk
.na
\fB\fBON\fR\fR
.ad
.sp .6
.RS 4n
联机
.RE

.sp
.ne 2
.mk
.na
\fB\fBUN\fR\fR
.ad
.sp .6
.RS 4n
未初始化
.RE

不存在的状态或无法识别的状态用问号 (\fB?\fR) 字符表示。除非同时显示了 \fBNSTA\fR 或 \fBNSTATE\fR 列，否则正在转换的实例后面将附加一个星号 (\fB*\fR)。
.sp
有关服务状态的说明，请参见 \fBsmf\fR(5)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
服务实例的状态。除非同时显示了 \fBNSTA\fR 或 \fBNSTATE\fR 列，否则正在转换的实例后面将附加一个星号。
.sp
有关服务状态的说明，请参见 \fBsmf\fR(5)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTIME\fR\fR
.ad
.sp .6
.RS 4n
如果服务实例在过去 24 小时内进入了当前状态，该列将显示服务实例进入当前状态的时间。否则，该列会显示服务实例进入当前状态的日期，并在空白的位置列显下划线 (\fB_\fR)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBASTATE\fR\fR
.ad
.sp .6
.RS 4n
服务实例的辅助状态（如果适用）。没有辅助状态的服务实例将在此列中显示一个 '-' 符号。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLRUN\fR\fR
.ad
.sp .6
.RS 4n
定期服务实例上次运行的时间。不是定期且上次未执行的服务实例会在此列中显示一个 '-' 字符。
.sp
有关定期服务的说明，请参见 \fBsvc.periodicd\fR(1M)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBNRUN\fR\fR
.ad
.sp .6
.RS 4n
定期服务实例下次预定运行的时间。不是定期并因此下次预定运行的服务实例会在此列中显示一个 '-' 字符。
.sp
有关定期服务的说明，请参见 \fBsvc.periodicd\fR(1M)。
.RE

.SH 示例
.LP
\fB示例 1 \fR显示缺省输出
.sp
.LP
以下示例显示缺省输出：

.sp
.in +2
.nf
example% svcs
STATE          STIME    FMRI
\&...
legacy_run     13:25:04 lrc:/etc/rc3_d/S42myscript
\&...
online         13:21:50 svc:/system/svc/restarter:default
\&...
online         13:25:03 svc:/milestone/multi-user:default
\&...
online         13:25:07 svc:/milestone/multi-user-server:default
\&...
.fi
.in -2
.sp

.LP
\fB示例 2 \fR列出所有的本地实例
.sp
.LP
以下示例列出 \fBservice1\fR 服务的所有本地实例。

.sp
.in +2
.nf
example% svcs -o state,nstate,fmri service1
STATE        NSTATE        FMRI
online       -             svc:/service1:instance1
disabled     -             svc:/service1:instance2
.fi
.in -2
.sp

.LP
\fB示例 3 \fR列出详细信息
.sp
.LP
以下示例列出详细信息。

.sp
.in +2
.nf
example% svcs -v network/rpc/rstat:udp
STATE          NSTATE        STIME    CTID   FMRI
online         -             Aug_09        - svc:/network/rpc/rstat:udp
.fi
.in -2
.sp

.LP
\fB示例 4 \fR列出详细信息
.sp
.LP
以下示例列出有关 \fBsystem/service3\fR 的所有实例的详细信息。可以根据管理的重启程序相应显示其他字段。 

.sp
.in +2
.nf
example% svcs -l network/rpc/rstat:udp

fmri         svc:/network/rpc/rstat:udp
enabled      true
state        online
next_state   none
restarter    svc:/network/inetd:default
contract_id
dependency   require_all/error svc:/network/rpc/bind (online)
.fi
.in -2
.sp

.LP
\fB示例 5 \fR列出进程
.sp
.in +2
.nf
example% svcs -p sendmail
STATE          STIME    FMRI
online         13:25:13 svc:/network/smtp:sendmail
               13:25:15   100939 sendmail
13:25:15   100940 sendmail  
.fi
.in -2
.sp

.LP
\fB示例 6 \fR使用 \fBsvcs\fR \fB-x\fR 说明服务状态
.sp
.LP
(a) 在以下示例中，\fBsvcs\fR \fB-x\fR 标识了被禁用的 print/server 服务是两个已启用但尚未联机的服务的根源。\fBsvcs\fR \fB- xv\fR 显示这两个服务是 \fBprint/rfc1179\fR 和 \fBprint/ipp-listener\fR。这种情况可通过启用 \fBprint/server\fR 或禁用 \fBrfc1179\fR 和 \fBipp-listener\fR 进行纠正。

.sp
.in +2
.nf
example% svcs -x
svc:/application/print/server:default (LP print server)
 State: disabled since Mon Feb 13 17:56:21 2006
Reason: Disabled by an administrator.
   See: http://support.oracle.com/msg/SMF-8000-05
   See: lpsched(1M)
Impact: 2 dependent services are not running. (Use -v for list.)
.fi
.in -2
.sp

.sp
.LP
(b) 在以下示例中，NFS（远程文件系统）并未运行：

.sp
.in +2
.nf
example$ svcs nfs/client
STATE          STIME    FMRI
offline        16:03:23 svc:/network/nfs/client:default
.fi
.in -2
.sp

.sp
.LP
(c) 以下示例表明问题在于 \fBnfs/status\fR。\fBnfs/client\fR 正处于等待状态，因为其依赖于 \fBnfs/nlockmgr\fR，而后者依赖于 \fBnfs/status\fR：

.sp
.in +2
.nf
example$ svcs -xv nfs/client
svc:/network/nfs/client:default (NFS client)
 State: offline since Mon Feb 27 16:03:23 2006
Reason: Service svc:/network/nfs/status:default
        is not running because a method failed repeatedly.
   See: http://support.oracle.com/msg/SMF-8000-GE
  Path: svc:/network/nfs/client:default
          svc:/network/nfs/nlockmgr:default
            svc:/network/nfs/status:default
   See: man -M /usr/share/man -s 1M mount_nfs
   See: /var/svc/log/network-nfs-client:default.log
Impact: This service is not running.
.fi
.in -2
.sp

.SH 退出状态
.sp
.LP
将返回以下退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
命令调用成功。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.sp .6
.RS 4n
致命错误。
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.sp .6
.RS 4n
指定的命令行选项无效。
.RE

.SH 属性
.sp
.LP
有关下列属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
_
接口稳定性请参见下文。
.TE

.sp
.LP
屏幕输出为 Uncommitted（未确定）。调用为 Committed（已确定）。
.SH 另请参见
.sp
.LP
\fBps\fR(1)、\fBsvcprop\fR(1)、\fBsvcadm\fR(1M)、\fBsvccfg\fR(1M)、\fBsvc.startd\fR(1M)、\fBstat\fR(2)、\fBlibscf\fR(3LIB)、\fBattributes\fR(5)、\fBfnmatch\fR(5)、\fBsmf\fR(5)、\fBsvc.periodicd\fR(1M)
