Alhadis/Silos/Solaris-11.3/man8/cups-deviced.8
'\" te
.\"
.\" "$Id: cups-deviced.man.in 8421 2009-03-09 21:59:55Z mike $"
.\"
.\"   cups-deviced man page for the Common UNIX Printing System (CUPS).
.\"
.\"   Copyright 2007-2009 by Apple Inc.
.\"   Copyright 1997-2006 by Easy Software Products.
.\"
.\"   These coded instructions, statements, and computer programs are the
.\"   property of Apple Inc. and are protected by Federal copyright
.\"   law.  Distribution and use rights are outlined in the file "LICENSE.txt"
.\"   which should have been included with this file.  If this file is
.\"   file is missing or damaged, see the license at "http://www.cups.org/".
.\"
.TH cups-deviced 8 "CUPS" "16 June 2008" "Apple Inc."
.SH NAME
cups-deviced \- cups device daemon
.SH SYNOPSIS
.B cups-deviced
.I request-id limit user-id options
.SH DESCRIPTION
\fIcups-deviced\fR polls the backends in
\fI/usr/lib/cups/backend\fR for a list of available devices.
It is run by \fIcupsd(8)\fR in response to a
\fICUPS-Get-Devices\fR request. The output format is an IPP
response message. The \fIrequest-id\fR argument is the request ID
from the original IPP request, typically 1. The \fIlimit\fR
argument is the limit value from the original IPP request - 0
means no limit. The \fIuser-id\fR argument is the
requesting-user-name value from the original IPP request.
Finally, the \fIoptions\fR argument is a space-delimited list of
attributes ("name=value name=value \...") that were passed in
with the request. Currently \fIcups-deviced\fR looks for the
\fIrequested-attributes\fR attribute and tailors the output
accordingly.

.\" Oracle has added the ARC stability level to this manual page
.SH ATTRIBUTES
See
.BR attributes (5)
for descriptions of the following attributes:
.sp
.TS
box;
cbp-1 | cbp-1
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE 
=
Availability	print/cups
=
Stability	Volatile
.TE 
.PP
.SH SEE ALSO
backend(7), cupsd(8), cupsd.conf(5),
.br
http://localhost:631/help
.SH COPYRIGHT
Copyright 2007-2009 by Apple Inc.
.\"
.\" End of "$Id: cups-deviced.man.in 8421 2009-03-09 21:59:55Z mike $".
.\"


.SH NOTES

.\" Oracle has added source availability information to this manual page
This software was built from source available at https://java.net/projects/solaris-userland.  The original community source was downloaded from  http://ftp.easysw.com/pub/cups/1.4.5/cups-1.4.5-source.tar.bz2

Further information about this software can be found on the open source community website at http://www.cups.org/.
