Alhadis/Silos/Solaris-11.3/man8/foomatic-addpjloptions.8
'\" te
.\" This -*- nroff -*- source file is part of foomatic.
.\"
.TH FOOMATIC-ADDPJLOPTIONS 8 "2001-05-07" "Foomatic Project"
.SH NAME
foomatic-addpjloptions \- Format PJL option information the for foomatic database
.SH SYNOPSIS

.B "foomatic-addpjloptions [-dafis][-o dir] -p printer_ID [pjl_info_file]"

.B "foomatic-addpjloptions [-dafq] [pjl_info_file]"

.B "foomatic-addpjloptions \-h"

.SH Description
.B foomatic-addpjloptions
formats the PJL information file (or STDIN) into a format usable by the Foomatic database.


.SS Options
.TP 5
.B \-a
Convert all PJL options in the information file.

.TP 5
.BI -d
Enable debugging information.

.TP 5
.B \-f
Do not ask for permission, force conversion.

.TP 5
.B \-h
Print a help message and exit.

.TP 5
.B \-q
Print a summary of the PJL information.  This output is not compatible with
the foomatic database, and is useful for debugging.

.TP 5
.B \-s
Produce a single option file containing all the option values.

.TP 5
.BI \-o " dir"
The directory the option information files are written to.

.TP 5
.BI \-p " printer_ID"
Name of the printer in the foomatic database.
This is used to extract printer manufacturer and model information.

.TP 5
.B pjl_info_file
File with PJL information returned by the printer. If this filename is not
provided, the PJL options are taken from standard input.

.SH FILES
.TP 5
.B /usr/share/foomatic/templates/pjl*.xml
Template files for option information.

.TP 5
.B ./foomatic-db/opts
Option information stored in this directory.

.PD 0

.SH EXIT STATUS
.B foomatic-addpjloptions
returns 0 on success, and a nonzero value on failure.

.SH AUTHOR
Manfred Wassmann <\fImanolo@NCC-1701.B.Shuttle.de\fR> for the foomatic
project using output from the associated binary.

Modified by Patrick Powell (<papowell at astart.com>).

.SH BUGS

Please post bug reports on

http://lists.freestandards.org/mailman/listinfo/printing-foomatic



.\" Oracle has added the ARC stability level to this manual page
.SH ATTRIBUTES
See
.BR attributes (5)
for descriptions of the following attributes:
.sp
.TS
box;
cbp-1 | cbp-1
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE 
=
Availability	print/cups/filter/foomatic-db-engine
=
Stability	Volatile
.TE 
.PP

.SH NOTES

.\" Oracle has added source availability information to this manual page
This software was built from source available at https://java.net/projects/solaris-userland.  The original community source was downloaded from  /foomatic-db-engine-3.0-20080903.tar.gz

Further information about this software can be found on the open source community website at http://www.linuxfoundation.org/collaborate/workgroups/openprinting/database/foomatic/.
