Alhadis/Silos/Solaris 11.3/man8/foomatic-preferred-driver.8
'\" te
.\" This -*- nroff -*- source file is part of foomatic.
.\"
.TH FOOMATIC-PREFERRED-DRIVER 8 "2001-05-07" "Foomatic Project"
.SH NAME
foomatic-preferred-driver \- <put a short description here>
.SH SYNOPSIS
.B foomatic-preferred-driver
.\"[\fIOPTION\fR]...

[To be edited]


.\" Oracle has added the ARC stability level to this manual page
.SH ATTRIBUTES
See
.BR attributes (5)
for descriptions of the following attributes:
.sp
.TS
box;
cbp-1 | cbp-1
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE 
=
Availability	print/cups/filter/foomatic-db-engine
=
Stability	Volatile
.TE 
.PP
.SH SEE ALSO
.IR foomatic-XXX (1),

.SH EXIT STATUS
.B foomatic-preferred-driver
returns ...

.SH AUTHOR
Manfred Wassmann <\fImanolo@NCC-1701.B.Shuttle.de\fR> for the foomatic
project using output from the associated binary.

.SH BUGS
This manpage contains no useful information.



.SH NOTES

.\" Oracle has added source availability information to this manual page
This software was built from source available at https://java.net/projects/solaris-userland.  The original community source was downloaded from  /foomatic-db-engine-3.0-20080903.tar.gz

Further information about this software can be found on the open source community website at http://www.linuxfoundation.org/collaborate/workgroups/openprinting/database/foomatic/.
