Alhadis/Silos/Solaris 11.3/man8/foomatic-getpjloptions.8
'\" te
.\" This -*- nroff -*- source file is part of foomatic.
.\"
.TH FOOMATIC-GETPJLOPTIONS 8 "2001-05-07" "Foomatic Project"
.SH NAME
foomatic-getpjloptions \- <put a short description here>
.SH SYNOPSIS
.BI foomatic-getpjloptions " device"

.BI foomatic-getpjloptions " hostname\ port"

.SH DESCRIPTION
.B foomatic-getpjloptions
Sends a set of PJL commands and reads back
the PJL options and status from a printer over a network connection
or device bidirectional interface such as parallel, USB, serial.
printers to standard output. The
output can be piped into foomatic-addpjloptions to add options to the database.


.SS Options
.TP 10
.BI device
The interface to which a local printer is connected, e.g. /dev/lp0, /dev/usb/lp0,
/dev/tty00, etc.
For a parallel port,
you must have bidirectional support enabled at the
BIOS level and the parallel port driver must support the bidirectional mode.
Check your parallel port BIOS settings for  EPP/bi-directional mode.

.TP 10
.BI hostname
Host name or IP address of a network printer (HP JetDirect, DLINK, etc.).

.TP 10
.BI port
Port on which your network printer listens for socket (Appsocket) connections.
Most common ports are 9100 (JetDirect), 10000 (DLINK).  Usually you can configure
the port via a configuration interface.

.SH EXIT STATUS
.B foomatic-getpjloptions
returns ???

.SH AUTHOR
Manfred Wassmann <\fImanolo@NCC-1701.B.Shuttle.de\fR> for the foomatic
project using output from the associated binary.
Modified by Patrick Powell <papowell at lprng.com> to provide betters
support for network printers, error messages, and remove CR and FF from output.

.SH WARNINGS
Uni-directional protocols as remote LPD are not supported as no status is returned.
Some network print servers which attach to a printer parallel port do not
support bidirectional mode.



.\" Oracle has added the ARC stability level to this manual page
.SH ATTRIBUTES
See
.BR attributes (5)
for descriptions of the following attributes:
.sp
.TS
box;
cbp-1 | cbp-1
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE 
=
Availability	print/cups/filter/foomatic-db-engine
=
Stability	Volatile
.TE 
.PP

.SH NOTES

.\" Oracle has added source availability information to this manual page
This software was built from source available at https://java.net/projects/solaris-userland.  The original community source was downloaded from  /foomatic-db-engine-3.0-20080903.tar.gz

Further information about this software can be found on the open source community website at http://www.linuxfoundation.org/collaborate/workgroups/openprinting/database/foomatic/.
