Alhadis/Silos/Solaris 11.3/man8/ftpdctl.8
'\" te
.TH ftpdctl 8 "November 2003"
.\" Process with
.\" groff -man -Tascii ftpdctl.8 
.\"
.SH NAME
ftpdctl \- ProFTPD control program
.SH SYNOPSIS
.B ftpdctl
[
.B \-hv
] [
.BI \-s " Unix domain socket"
]
.BI action " action-parameters"
.SH DESCRIPTION
.B ftpdctl
is the control program for the Professional File Transfer Protocol (FTP) server
daemon.  The control program is used to control the daemon while it is
running, supporting actions like restarting or shutting down the daemon,
disabling or enabling specific virtual servers, kicking FTP users, etc.
.PP
The specific \fBactions\fP available via
.B ftpdctl
depend on the modules compiled into
.B proftpd.
Check the modules documentation for more information on the specific
\fBactions\fP supported by the modules.
.PD
.SH OPTIONS
.TP 12
.B \-h,\--help
Display a short usage description, including all available options.
.TP
.B \-s,\--socket
Specifies an alternate \fBpath\fP to be used for communicating with
.B proftpd
rather than the default Unix domain socket.  The default controls socket is
.B /var/run/proftpd/proftpd.sock
.TP
.B \-v,\--verbose
Display informational messages while communicating with the
.B proftpd
daemon.
.TP
.PD
.SH AUTHORS
.PP
ProFTPD is written and maintained by a number of people, full credits
can be found on
.BR http://www.proftpd.org/credits.html
.PD

.\" Oracle has added the ARC stability level to this manual page
.SH ATTRIBUTES
See
.BR attributes (5)
for descriptions of the following attributes:
.sp
.TS
box;
cbp-1 | cbp-1
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE 
=
Availability	service/network/ftp
=
Stability	Uncommitted
.TE 
.PP
.SH SEE ALSO
.BR proftpd(8), ftp(1), ftpwho(1), ftpcount(1), ftpshut(8)
.PP
Full documentation on ProFTPD, including configuration and FAQs, is available at
.BR http://www.proftpd.org/
.PP 
For help/support, try the ProFTPD mailing lists, detailed on
.BR http://www.proftpd.org/lists.html
.PP
Report bugs at
.BR http://bugs.proftpd.org/


.SH NOTES

.\" Oracle has added source availability information to this manual page
This software was built from source available at https://java.net/projects/solaris-userland.  The original community source was downloaded from  ftp://ftp.proftpd.org/distrib/source/proftpd-1.3.5.tar.gz

Further information about this software can be found on the open source community website at http://www.proftpd.org/.
