Alhadis/Silos/Solaris 11.3/man8/ftpscrub.8
'\" te
.TH ftpscrub 8 "November 2008"
.\" Process with
.\" groff -man -Tascii ftpscrub.8 
.\"
.SH NAME
ftpscrub \- scrub the proftpd scoreboard file of stale entries
.SH SYNOPSIS
.B ftpscrub
.SH DESCRIPTION
The
.BI ftpscrub
command provides a way to scrub the scoreboard file on demand, at times
which suit the site best.  This should be run periodically on sites
which run proftpd in
.I inetd
mode.
.SH OPTIONS
.TP 12
.B \-h,\--help
Display a short usage description, including all available options.
.TP
.BI \-f,\--file " scoreboard\-file"
Specify the full path to proftpd's run\-time scoreboard file (configured
via the \fBScoreboardFile\fP directive in
.I proftpd.conf
).  If proftpd's
default directory has been changed via this directive, \fBftpscrub\fP
must either be recompiled, or this option must be used in order to find
proftpd's scoreboard.
.TP
.B \-v,\--verbose
Reports additional information while scrubbing the scoreboard.
.SH FILES
.PD 0
.B /usr/sbin/ftpscrub
.br
.B /var/run/proftpd.scoreboard
.PD
.SH AUTHORS
.PP
ProFTPD is written and maintained by a number of people, full credits
can be found on
.BR http://www.proftpd.org/credits.html
.PD

.\" Oracle has added the ARC stability level to this manual page
.SH ATTRIBUTES
See
.BR attributes (5)
for descriptions of the following attributes:
.sp
.TS
box;
cbp-1 | cbp-1
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE 
=
Availability	service/network/ftp
=
Stability	Uncommitted
.TE 
.PP
.SH SEE ALSO
.BR inetd(8), ftp(1), proftpd(8), ftpwho(1), ftpcount(1)
.PP
Full documentation on ProFTPD, including configuration and FAQs, is available at
.BR http://www.proftpd.org/
.PP
For help/support, try the ProFTPD mailing lists, detailed on
.BR http://www.proftpd.org/lists.html
.PP
Report bugs at
.BR http://bugs.proftpd.org/


.SH NOTES

.\" Oracle has added source availability information to this manual page
This software was built from source available at https://java.net/projects/solaris-userland.  The original community source was downloaded from  ftp://ftp.proftpd.org/distrib/source/proftpd-1.3.5.tar.gz

Further information about this software can be found on the open source community website at http://www.proftpd.org/.
