Alhadis/Silos/Solaris-11.3/man4/defaultrouter.4
'\" te
.\" Copyright (c) 2000, 2012, Oracle and/or its affiliates. All rights reserved.
.TH defaultrouter 4 "23 Jul 2012" "SunOS 5.11" "File Formats"
.SH NAME
defaultrouter \- configuration file for default router(s)
.SH SYNOPSIS
.LP
.nf
\fB/etc/defaultrouter\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fB/etc/defaultrouter\fR file specifies a IPv4 host's default router(s).
.sp
.LP
The format of the file is as follows:
.sp
.in +2
.nf
IP_address
\&...
.fi
.in -2
.sp

.sp
.LP
The \fB/etc/defaultrouter\fR file can contain the IP addresses or hostnames of one or more default routers, with each entry on its own line. If you use hostnames, each hostname must also be listed in the local \fB/etc/hosts\fR file, because no name services are running at the time that \fBdefaultrouter\fR is read.
.sp
.LP
Lines beginning with the ``#'' character are treated as comments.
.sp
.LP
Use of a default route, whether received from a \fBDHCP\fR server or from \fB/etc/defaultrouter\fR, prevents a machine from acting as an IPv4 router. You can use \fBrouteadm\fR(1M) to override this behavior.
.sp
.LP
Any default routes specified in \fB/etc/defaultrouter\fR will be applied during boot, and will not be preserved across changes to the active Network Configuration Profile. The \fBroute\fR(1M) command, with its \fB-p\fR option, provides a means to set per-NCP static routes. In addition, a default router may be identified for a specific interface within a given NCP; see the descriptions of the \fBipv4-default-route\fR and \fBipv6-default-route\fR NCU properties in the \fBnetcfg\fR(1M) manual page.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/defaultrouter\fR\fR
.ad
.RS 22n
.rt  
Configuration file containing the hostnames or IP addresses of one or more default routers.
.RE

.SH SEE ALSO
.sp
.LP
\fBin.rdisc\fR(1M), \fBin.routed\fR(1M), \fBnetcfg\fR(1M), \fBroute\fR(1M), \fBrouteadm\fR(1M), \fBhosts\fR(4)
