Alhadis/Silos/Solaris-11.3/man4/defaultdomain.4
'\" te
.\" Copyright (c) 2000, 2012, Oracle and/or its affiliates. All rights reserved.
.TH defaultdomain 4 "5 Jun 2012" "SunOS 5.11" "File Formats"
.SH NAME
defaultdomain \- specify host's domain name
.SH SYNOPSIS
.LP
.nf
\fBsvc:/network/nis/domain\fR
.fi

.LP
.nf
\fB/etc/defaultdomain\fR
.fi

.SH DESCRIPTION
.sp
.LP
The service \fBsvc:/network/nis/domain\fR determines a host's domain name for direct use by the NIS name service.  For the purposes of backwards compatibility, the service also generates the \fBdefaultdomain\fR file.
.sp
.LP
The property \fBgroup/property config/domainname\fR represents the NIS \fBdomainname\fR represented by \fB/etc/defaultdomain\fR. 
.sp
.LP
The contents of \fBdefaultdomain\fR consists of a single line containing a host's domain name.
.SS "Interaction with Location Profiles"
.sp
.LP
The \fBdefaultdomain\fR property is managed in Location profiles (refer to \fBnetcfg\fR(1M) for more information about location profiles). These profiles are either fixed, meaning the network configuration is being managed in the traditional way, or reactive, meaning the network configuration is being managed automatically, reacting to changes in the network environment according to policy rules specified in the profiles.
.sp
.LP
When a fixed location (there can currently be only one, the DefaultFixed location) is active, changes made to the SMF repository will be applied to the location when it is disabled, and thus will be restored if that location is later re-enabled.
.sp
.LP
When a reactive location is active, changes should not be applied directly to the SMF repository; these changes will not be preserved in the location profile, and will thus be lost if the location is disabled, or if the system's network configuration, as managed by \fBsvc:/network/physical:default\fR and \fBsvc:/network/location:default\fR, is refreshed or restarted. Changes should instead be applied to the location itself, using the \fBnetcfg\fR(1M) command; this will save the change to the location profile repository, and will also apply it to the SMF repository (if the change is made to the currently active location).
.sp
.LP
The \fBdefaultdomain\fR setting is stored in the \fBdefault-domain\fR property of a location profile.
.SH EXAMPLES
.LP
\fBExample 1 \fRSetting Up \fBdomainname\fR and Enabling the \fBnis/domain\fR Service
.sp
.LP
The following example sets up \fBdomainname\fR and enables the \fBnis/domain\fR service:

.sp
.in +2
.nf
% svccfg -s nis/domain setprop config/domainname = \e
          hostname: nisdomain.example.com
% svccfg -s nis/domain:default refresh
% svcadm enable nis/domain
.fi
.in -2
.sp

.sp
.LP
The service is not enabled by default. The \fBnis/domain\fR service sets up all the shared NIS configuration, of which \fBdomainname\fR is the one mandatory configuration parameter.

.SH SEE ALSO
.sp
.LP
\fBuname\fR(1), \fBldapclient\fR(1M), \fBnetcfg\fR(1M), \fBypbind\fR(1M), \fBypinit\fR(1M), \fBresolv.conf\fR(4), \fBldap\fR(5)
.SH NOTES
.sp
.LP
The \fBdefaultdomain\fR file is created and modified by Oracle Solaris installation and configuration scripts. Only users knowledgeable of name service configuration should edit the file.
