Alhadis/Silos/Solaris-11.3/man4/locale_description.4
'\" te
.\" Copyright (c) 2008, 2014, Oracle and/or its affiliates. All rights reserved.
.TH locale_description 4 "28 Feb 2014" "SunOS 5.11" "File Formats"
.SH NAME
locale_description \- locale description file
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/locale/<\fIlocalename\fR>/locale_description\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBlocale_description\fR file is the source of extended attributes and their values associated with the locale. The lines in the file must have the following format:
.sp
.in +2
.nf
key: value
.fi
.in -2
.sp

.sp
.LP
Note that SPACE and/or TAB character(s), if any, at the start and end of value are ignored. Empty lines and lines starting with \fB#\fR are ignored.
.sp
.LP
The valid keys and corresponding values are:
.sp

.sp
.TS
tab();
cw(2.75i) cw(2.75i) 
lw(2.75i) lw(2.75i) 
.
KeyValue
\fBlanguage\fRT{
The two-letter language code from ISO 639.
T}
\fBlanguage-<\fIlanguage\fR>\fRT{
The language name in the native language represented by the \fB<\fIlanguage\fR>\fR, where \fB<\fIlanguage\fR>\fR is a two-letter language code from ISO 639.
T}
\fBlanguage-<\fIlanguage\fR>_<\fIterritory\fR>\fRT{
The language name in the native language represented by the <\fIlanguage\fR> and <\fIterritory\fR>, where \fB<\fIlanguage\fR>\fR is a two-letter language code from ISO 639 and <\fIterritory\fR> is an ISO 3166 two-letter territory code.
T}
\fBterritory\fRT{
The ISO 3166-1 territory code of the locale.
T}
\fBterritory-<\fIlanguage\fR>\fRT{
The territory name in the native language represented by the <\fIlanguage\fR>, where \fB<\fIlanguage\fR>\fR is a two-letter language code from ISO 639.
T}
\fBterritory-<\fIlanguage\fR>_<\fIterritory\fR>\fRT{
The territory name in the native language represented by the <\fIlanguage\fR> and <\fIterritory\fR>, where \fB<\fIlanguage\fR>\fR is a two-letter language code from ISO 639 and <\fIterritory\fR> is an ISO 3166 two-letter territory code.
T}
\fBcodeset\fRThe codeset of the locale.
\fBcodeset-<\fIlanguage\fR>\fRT{
The codeset name in the native language represented by the <\fIlanguage\fR> , where \fB<\fIlanguage\fR>\fR is a two-letter language code from ISO 639.
T}
\fBcodeset-<\fIlanguage\fR>_<\fIterritory\fR>\fRT{
The codeset name in the native language represented by the <\fIlanguage\fR> and <\fIterritory\fR>, where \fB<\fIlanguage\fR>\fR is a two-letter language code from ISO 639 and <\fIterritory\fR> is an ISO 3166 two-letter territory code.
T}
\fBmodifier\fRThe modifier name for the locale.
\fBmodifier-<\fIlanguage\fR>\fRT{
The modifier name in the native language represented by the <\fIlanguage\fR> where, \fB<\fIlanguage\fR>\fR is a two-letter language code from ISO 639.
T}
\fBmodifier-<\fIlanguage\fR>_<\fIterritory\fR>\fRT{
The modifier name in the native language represented by the <\fIlanguage\fR> and <\fIterritory\fR>, where \fB<\fIlanguage\fR>\fR is a two-letter language code from ISO 639 and <\fIterritory\fR> is an ISO 3166 two-letter territory code.
T}
\fBlocale-<\fIlanguage\fR>\fRT{
The locale name in the native language by the <\fIlanguage\fR> where, \fB<\fIlanguage\fR>\fR is a two-letter language code from ISO 639.
T}
\fBlocale-<\fIlanguage\fR>_<\fIterritory\fR>\fRT{
The locale name in the native language represented by the <\fIlanguage\fR> and <\fIterritory\fR>, where \fB<\fIlanguage\fR>\fR is a two-letter language code from ISO 639 and <\fIterritory\fR> is an ISO 3166 two-letter territory code.
T}
\fBtimezone\fRT{
The timezone valid for the locale. The key can be 	used multiple times, the value is then a list of all the individual values for each instance of the key.
T}
\fBlegacy\fRT{
The locale is legacy locale. The valid value is 'yes' or 'true'.
T}
\fBalias\fRT{
The locale name alias. Only locale name aliases defined in \fBlocale_alias\fR(5) are allowed. The key can be used multiple times, the value is then a list of all the individual values for each instance of the key.
T}
.TE

.sp
.LP
The interpretation of invalid keys or values is not defined. The \fBlocale_description\fR file and all the entries are optional. 
.sp
.LP
If the locale follows the suggested naming convention, the values of <\fIlanguage\fR>, <\fIterritory\fR> and others are determined from the locale name. If the locale does not follow the naming convention and the \fBlocale_description\fR file does not exist, the <\fIlanguage\fR>, <\fIterritory\fR> and other values are unknown for the given locale.
.sp
.LP
If the language-<\fIlanguage\fR> is not defined, but it is defined in other locale with the same language, the value from the locale is used. The locale with the same territory is preferred if multiple locales match. The same logic is applicable for territory-<\fIlanguage\fR>, codeset-<\fIlanguage\fR>, and modifier-<\fIlanguage\fR>.
.sp
.LP
If \fBtimezone\fR is not defined, but it is defined in other locale with the same language and territory, the value from the locale is used. If no definition is found, but timezone is defined in other locale with the same territory, the value is used.
.sp
.LP
The text file codeset is UTF-8.
.SH EXAMPLES
.LP
\fBExample 1 \fR\fBlocale_description\fR File for \fBen_GB.UTF-8\fR Locale
.sp
.in +2
.nf
#
# /usr/lib/locale/en_GB.UTF-8/locale_description 
#
language: en
territory: GB
codeset: UTF-8

alias: en_GB.utf8
alias: EN_GB

timezone: Europe/London

language-en: British English
language-fr: anglais britannique
# ...
	
territory-en: United Kingdom
territory-fr: Royaume-Uni
# ...
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBlocale_alias\fR(5), \fBlocaledef\fR(1)
