Alhadis/Silos/Solaris-11.3/man4/nss.4
'\" te
.\" Copyright (c) 2003, 2012, Oracle and/or its affiliates. All rights reserved.
.TH nss 4 "25 Jan 2012" "SunOS 5.11" "File Formats"
.SH NAME
nss \- configuration file for initgroups
.SH SYNOPSIS
.LP
.nf
\fB/etc/default/nss\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fB/etc/default/nss\fR configuration file provides methods for \fBinitgroups\fR(3C) lookup method. The file also provides a method to change address sorting by name lookup functions. The file controls the behavior of the name service switch routines outside of the source database mappings provided by the \fB/etc/nsswitch.conf\fR file.
.sp
.LP
\fB/etc/default/nss\fR supports the following options:
.sp
.ne 2
.mk
.na
\fB\fBNETID_AUTHORITATIVE\fR\fR
.ad
.RS 23n
.rt  
Changes the behavior of the name service lookups to use the \fBnetid\fR table in response to the \fBinitgroups()\fR call. By default, \fBinitgroups()\fR uses the \fBgroup\fR table. When \fBNETID_AUTHORITATIVE\fR is set to TRUE, \fBinitgroups()\fR uses \fBnetid\fR as the source for supplementary groups rather than the \fBgroup\fR table.
.sp
The name service administrator must ensure that the \fBnetid\fR table contains valid supplementary group information for users. Not all name services can automatically keep the members listed in the \fBgroup\fR table in sync with the \fBnetid\fR table.
.RE

.sp
.ne 2
.mk
.na
\fB\fBSORT_ADDRS\fR\fR
.ad
.RS 23n
.rt  
Changes the behavior of address sorting by host name lookup functions such as \fBgethostbyname\fR(3NSL), \fBgetaddrinfo\fR(3SOCKET), and \fBgetipnodebyname\fR(3SOCKET).
.sp
.ne 2
.mk
.na
\fB\fBSORT_ADDRS=TRUE\fR\fR
.ad
.RS 21n
.rt  
Causes addresses to be sorted and favour addresses that are considered local; those that are within the configured network space. By default, \fBSORT_ADDRS\fR is set to \fBTRUE\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBSORT_ADDRS=FALSE\fR\fR
.ad
.RS 21n
.rt  
Disables address sorting. Address list is returned in the order in which they were received.
.RE

.sp
.ne 2
.mk
.na
\fB\fBSORT_ADDRS=RANDOM\fR\fR
.ad
.RS 21n
.rt  
Addresses are returned in a random order.
.RE

.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBgetaddrinfo\fR(3SOCKET), \fBgethostbyname\fR(3NSL), \fBgetipnodebyname\fR(3SOCKET), \fBinitgroups\fR(3C), \fBnsswitch.conf\fR(4), \fBattributes\fR(5)
