Alhadis/Silos/Solaris-11.3/man4/png.4
'\" te
.TH png\&.4 4 "26 Mar 2004" "SunOS 5.11" "File Formats"
.SH "NAME"
png \- Portable Network
Graphics (PNG) format
.SH "DESCRIPTION"
.PP
PNG (Portable Network Graphics) is an extensible file format for the
lossless, portable, well-compressed storage of raster images\&. PNG provides
a patent-free replacement for GIF and can also replace many common uses of
TIFF\&. Indexed-color, grayscale, and truecolor images are supported, and an
optional alpha channel\&. Sample depths range from 1 to 16 bits\&.
.PP
PNG is designed to work well in online viewing applications, such as
the World Wide Web, and is fully streamable with a progressive display option\&.
PNG is robust, and provides both full file integrity checking, and fast simple
detection of common transmission errors\&. PNG can store gamma and chromaticity
data for improved color matching on heterogeneous platforms\&.
.SH "ATTRIBUTES"
.PP
See \fBattributes\fR(5)
for descriptions of the following attributes:
.sp
.TS
tab() allbox;
cw(2.750000i)| cw(2.750000i)
lw(2.750000i)| lw(2.750000i).
ATTRIBUTE TYPEATTRIBUTE VALUE
Availabilityimage/library/libpng
Interface stabilityVolatile
.TE
.sp
.SH "SEE ALSO"
.PP
\fBlibpng\fR(3), \fBzlib\fR(3)
.PP
PNG 1\&.2 specification, July 1999: \fBhttp://www\&.libpng\&.org/pub/png\fR
or \fBftp://ftp\&.uu\&.net/graphics/png/documents\fR
.PP
PNG 1\&.0 specification, October 1996: RFC 2083
\fBftp://ds\&.internic\&.net/rfc/rfc2083\&.txt\fR
or as a W3C Recommendation at
\fBhttp://www\&.w3\&.org/TR/REC-png\&.html\fR
.SH "NOTES"
.PP
This man page was originally written by Glenn Randers-Pehrson\&. Updated by Breda McColgan, Sun Microsystems Inc\&., 2004\&.
...\" created by instant / solbook-to-man, Thu 20 Mar 2014, 02:30
...\" LSARC 2003/085 libtiff, libjpeg, and libpng
