Alhadis/Silos/Solaris-11.3/man4/sel_config.4
'\" te
.\" Copyright (c) 2007, 2010, Oracle and/or its affiliates. All rights reserved.
.TH sel_config 4 "3 May 2010" "SunOS 5.11" "File Formats"
.SH NAME
sel_config \- selection rules for copy, cut, paste, drag and drop operations
.SH SYNOPSIS
.LP
.nf
\fB/usr/dt/config/sel_config\fR
.fi

.LP
.nf
\fB/usr/share/gnome/sel_config\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBsel_config\fR file specifies how a system that is configured with Trusted Extensions behaves when a user transfers data between windows that have different labels. Transfer operations include cut-and-paste, copy-and-paste, and drag-and-drop. There are two types of entries in this file: automatic confirmation and automatic reply.
.SS "Automatic Confirmation"
.sp
.LP
This type of entry specifies whether a confirmation window, the selection confirmer, displays. Each entry has the form:
.sp
.in +2
.nf
\fIrelationship\fR: \fIconfirmation\fR
.fi
.in -2
.sp

.sp
.LP
\fIrelationship\fR identifies the result of comparing the selected data's source and destination windows' labels. There are three allowed values:
.sp
.ne 2
.mk
.na
\fB\fBupgradesl\fR\fR
.ad
.RS 20n
.rt  
The source window's label is less than the destination window's label.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdowngradesl\fR\fR
.ad
.RS 20n
.rt  
The source window's label is higher than the destination window's label.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdisjointsl\fR\fR
.ad
.RS 20n
.rt  
The source and destination windows' labels are disjoint. Neither label dominates the other.
.RE

.sp
.LP
\fIconfirmation\fR specifies whether to perform automatic confirmation. Allowed values are:
.sp
.ne 2
.mk
.na
\fB\fBn\fR\fR
.ad
.RS 5n
.rt  
Use manual confirmation, that is, display the selection confirmer window. This is the default.
.RE

.sp
.ne 2
.mk
.na
\fB\fBy\fR\fR
.ad
.RS 5n
.rt  
Use automatic confirmation, that is, do not display the selection confirmer window.
.RE

.SS "Automatic Cancellation"
.sp
.LP
Some applications perform \fBhidden\fR paste operations to save data in the clipboard. These paste operations can target destinations that the user is not authorized to confirm. Therefore, the selection confirmer could appear to the user for data that the user can only press Cancel to dismiss.  Automatic cancellation dismisses these intermediate selection confirmers. 
.sp
.LP
There must be one entry of this form:   
.sp
.in +2
.nf
autocancel: \fIvalue\fR
.fi
.in -2
.sp

.sp
.LP
If value is \fBy\fR (for yes), then the intermediate selection confirmers do not display  to the user. If the value is \fBn\fR (for no), intermediate selection  confirmers appear, and the user must confirm each window for the initial transaction  to complete. The default is \fBy\fR. 
.SS "Automatic Reply"
.sp
.LP
A single user operation can involve several flows of information between the source and destination windows. The automatic reply set of entries provides a means to reduce the number of confirmations that are required of the user.
.sp
.LP
There must be one entry of this form:
.sp
.in +2
.nf
autoreply: \fIvalue\fR
.fi
.in -2
.sp

.sp
.LP
If \fIvalue\fR is \fBy\fR (for yes), then the remaining entries of the set are used as attributes for the selection data (rather than the actual contents) to complete the operation without confirmation. If \fIvalue\fR is \fBn\fR (for no), then the remaining entries are ignored.
.sp
.LP
Defaults can be specified for any \fItype\fR field that appears in the Confirmer window. Below are some sample entries for defaults.
.sp
.in +2
.nf
replytype: TARGETS
replytype: Pixel Sets
replytype: LENGTH
replytype: Type Of Monitor
.fi
.in -2
.sp

.sp
.LP
The \fBTARGETS\fR entry, when used, returns the list of target atoms that are supported by the source window. The \fBPixel Sets\fR and \fBType Of Monitor\fR entries are used for animation during a drag-and-drop operation. The \fBLENGTH\fR entry specifies the number of bytes in the selection.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/trusted
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5)
.sp
.LP
\fIRules When Changing the Level of Security for Data\fR in \fITrusted Extensions Configuration and Administration\fR
.SH NOTES
.sp
.LP
The functionality described on this manual page is available only if the system is configured with Trusted Extensions.
