Alhadis/Silos/Solaris 11.3/man5/brands.5
'\" te
.\" Copyright (c) 2009, 2015, Oracle and/or its affiliates. All rights reserved.
.TH brands 5 "1 Apr 2015" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
brands \- alternate operating environments for non-global zones
.SH DESCRIPTION
.sp
.LP
The branded zone (BrandZ) framework extends the Solaris Zones infrastructure described in \fBzones\fR(5) to include the creation of brands, which provide non-global zones that contain non-native operating environments or differ in other characteristics.
.sp
.LP
The term "brand" can refer to a wide range of operating environments. All brand management is performed as extensions to the current zones structure.
.sp
.LP
Every zone is configured with an associated brand. The brand type is used to determine behavior when a zone is installed and booted. In addition, a zone's brand is used to properly identify the correct application type at application launch time. The default brand is \fBsolaris\fR.
.sp
.LP
Once a zone has been assigned a brand, that brand cannot be changed or removed.
.sp
.LP
BrandZ extends the zones tools in the following ways:
.RS +4
.TP
.ie t \(bu
.el o
A brand is an attribute of a zone, set at zone create time.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The zonecfg tool (see \fBzonecfg\fR(1M)) is used to set a zone's brand type and configure the zone.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The zoneadm tool (see \fBzoneadm\fR(1M)) is used to report a zone's brand type and administer the zone.
.RE
.SS "Brands"
.sp
.LP
For Oracle Solaris 11, the available brands are:
.RS +4
.TP
.ie t \(bu
.el o
\fBsolaris\fR
.sp
See \fBsolaris\fR(5).
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBsolaris-kz\fR
.sp
See \fBsolaris-kz\fR(5).
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBsolaris10\fR
.sp
See \fBsolaris10\fR(5).
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBlabeled\fR
.sp
Implements trusted extensions, see \fBtxzonemgr\fR(1M).
.RE
.SS "Device Support"
.sp
.LP
The devices supported by each zone are documented in the man pages and other documentation for that brand. The zones infrastructure detects any attempt to add an unsupported device and issues a warning to the administrator. If the administrator chooses to add an unsupported device despite that warning, that device might or might not work as expected. The configuration will be untested and unsupported.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/zones
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBmdb\fR(1), \fBzlogin\fR(1), \fBzonename\fR(1), \fBdtrace\fR(1M), \fBin.rlogind\fR(1M), \fBsshd\fR(1M), \fBtxzonemgr\fR(1M), \fBzoneadm\fR(1M), \fBzonecfg\fR(1M), \fBkill\fR(2), \fBpriocntl\fR(2), \fBgetzoneid\fR(3C), \fBucred_get\fR(3C), \fBproc\fR(4), \fBattributes\fR(5), \fBsolaris\fR(5), \fBprivileges\fR(5), \fBsolaris10\fR(5), \fBzones\fR(5), \fBcrgetzoneid\fR(9F)
