Alhadis/Silos/Solaris 11.3/man5/pam_sample.5
'\" te
.\"  Copyright (c) 2010, 2012, Oracle and/or its affiliates. All rights reserved.
.TH pam_sample 5 "22 May 2012" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_sample \- a sample PAM module
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/security/pam_sample.so.1\fR 
.fi

.SH DESCRIPTION
.sp
.LP
The SAMPLE service module for \fBPAM\fR is divided into four components: authentication, account management, password management, and session management. The sample module is a shared object that is dynamically loaded to provide the necessary functionality.
.SH SAMPLE AUTHENTICATION COMPONENT
.sp
.LP
The SAMPLE authentication module provides functions to test the \fBPAM\fR framework functionality using the \fBpam_sm_authenticate\fR(3PAM) call. The SAMPLE module implementation of the \fBpam_sm_authenticate\fR(3PAM) function compares the user entered password with the password specified in the PAM configuration (see \fBpam.conf\fR(4)), or the string \fBtest\fR if a default test password has not been set. The following options can be passed in to the SAMPLE Authentication module:
.sp
.ne 2
.mk
.na
\fB\fBdebug\fR\fR
.ad
.RS 19n
.rt  
Syslog debugging information at the \fBLOG_DEBUG\fR level.
.RE

.sp
.ne 2
.mk
.na
\fB\fBpass=newone\fR\fR
.ad
.RS 19n
.rt  
Sets the password to be \fBnewone\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfirst_pass_good\fR\fR
.ad
.RS 19n
.rt  
The first password is always good when used with the use_first_pass or try_first_pass option.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfirst_pass_bad\fR\fR
.ad
.RS 19n
.rt  
The first password is always bad when used with the use_first_pass or try_first_pass option.
.RE

.sp
.ne 2
.mk
.na
\fB\fBalways_fail\fR\fR
.ad
.RS 19n
.rt  
Always returns \fBPAM_AUTH_ERR.\fR 
.RE

.sp
.ne 2
.mk
.na
\fB\fBalways_succeed\fR\fR
.ad
.RS 19n
.rt  
Always returns \fBPAM_SUCCESS.\fR 
.RE

.sp
.ne 2
.mk
.na
\fB\fBalways_ignore\fR\fR
.ad
.RS 19n
.rt  
Always returns \fBPAM_IGNORE.\fR 
.RE

.sp
.ne 2
.mk
.na
\fB\fBuse_first_pass\fR\fR
.ad
.RS 19n
.rt  
Use the user's initial password (entered when the user is authenticated to the first authentication module in the stack) to authenticate with the SAMPLE module. If the passwords do not match, or if this is the first authentication module in the stack, quit and do not prompt the user for a password. It is recommended that this option only be used if the SAMPLE authentication module is designated as \fIoptional\fR in the PAM configuration (see \fBpam.conf\fR(4)).
.RE

.sp
.ne 2
.mk
.na
\fB\fBtry_first_pass\fR\fR
.ad
.RS 19n
.rt  
Use the user's initial password (entered when the user is authenticated to the first authentication module in the stack) to authenticate with the SAMPLE module. If the passwords do not match, or if this is the first authentication module in the stack, prompt the user for a password. 
.sp
The SAMPLE module \fBpam_sm_setcred\fR(3PAM) function always returns \fBPAM_SUCCESS.\fR 
.RE

.SH SAMPLE ACCOUNT MANAGEMENT COMPONENT
.sp
.LP
The SAMPLE Account Management Component implements a simple access control scheme that limits machine access to a list of authorized users. The list of authorized users is supplied as option arguments to the entry for the SAMPLE account management \fBPAM\fR module in the  PAM configuration (see \fBpam.conf\fR(4)). Note that the module always permits access to the root super user.
.sp
.LP
The option field syntax to limit access is shown below: allow= \fIname[,name]\fR allow= \fIname\fR \fI[allow=name]\fR 
.sp
.LP
The example \fBpam.conf\fR show below permits only larry to \fBlogin\fR directly. \fBrlogin\fR is allowed only for don and larry. Once a user is logged in, the user can use \fBsu\fR if the user are sam or eric.
.sp

.sp
.TS
tab();
lw(0i) lw(0i) lw(0i) lw(0i) lw(5.5i) 
lw(0i) lw(0i) lw(0i) lw(0i) lw(5.5i) 
.
loginaccountrequirepam_sample.so.1allow=larry
gdmaccountrequirepam_sample.so.1allow=larry
rloginaccountrequirepam_sample.so.1allow=don allow=larry
suaccountrequirepam_sample.so.1allow=sam,eric
.TE

.sp
.LP
The debug and nowarn options are also supported.
.SH SAMPLE PASSWORD MANAGEMENT COMPONENT
.sp
.LP
The SAMPLE Password Management Component function ( \fBpam_sm_chauthtok\fR(3PAM)), always returns \fBPAM_SUCCESS.\fR 
.SH SAMPLE SESSION MANAGEMENT COMPONENT
.sp
.LP
The SAMPLE Session Management Component functions ( \fBpam_sm_open_session\fR(3PAM), \fBpam_sm_close_session\fR(3PAM)) always return \fBPAM_SUCCESS.\fR 
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) cw(2.75i) 
lw(2.75i) lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
MT LevelMT-Safe with exceptions
.TE

.SH SEE ALSO
.sp
.LP
\fBpam\fR(3PAM), \fBpam_sm_authenticate\fR(3PAM), \fBpam_sm_chauthtok\fR(3PAM), \fBpam_sm_close_session\fR(3PAM), \fBpam_sm_open_session\fR(3PAM), \fBpam_sm_setcred\fR(3PAM), \fBlibpam\fR(3LIB), \fBpam.conf\fR(4), \fBattributes\fR(5) 
.SH WARNINGS
.sp
.LP
This module should never be used outside of a closed debug environment. The examples of the \fBuse_first_pass\fR and \fBtry_first_pass\fR options are obsolete for all other Solaris delivered PAM service modules
.SH NOTES
.sp
.LP
The interfaces in \fBlibpam()\fR are MT-Safe only if each thread within the multi-threaded application uses its own \fBPAM\fR handle.
