Alhadis/Silos/Solaris 11.3/man5/proftpd.conf.5
'\" te
.TH proftpd.conf 5
.SH NAME
proftpd.conf \- ProFTPD server configuration file
.SH DESCRIPTION
.PP
The
.B proftpd(8)
daemon reads its configuration file, typically stored in one of the following
locations:
.LP
.I /etc/proftpd.conf
.br
.I /etc/proftpd/proftpd.conf
.br
.I /usr/local/etc/proftpd.conf
.TP
or passed to proftpd with the -c command-line option.
.PP
The
.B proftpd.conf
configuration file contains
.I directives
, one per line. Lines starting with # and empty lines are comments and are
ignored. Directives are case-insensitive, whereas values are case-sensitive.
Values may be enclosed in double-quotes (") if they contain spaces.
.PP
The possible directives and their descriptions are described online at
.BR http://www.proftpd.org/docs/directives/linked/by-name.html
.RE
.SH FILES
.PD 0
.B /usr/sbin/proftpd
.br
.B /etc/proftpd.conf
.PP
.PD
.SH AUTHORS
.PP
ProFTPD is written and maintained by a number of people, full credits
can be found on
.BR http://www.proftpd.org/credits.html
.PD

.\" Oracle has added the ARC stability level to this manual page
.SH ATTRIBUTES
See
.BR attributes (5)
for descriptions of the following attributes:
.sp
.TS
box;
cbp-1 | cbp-1
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE 
=
Availability	service/network/ftp
=
Stability	Uncommitted
.TE 
.PP
.SH "SEE ALSO"
.BR proftpd(8)
.PP
Full documentation on ProFTPD, including configuration and FAQs, is available at
.BR http://www.proftpd.org/
.PP 
For help/support, try the ProFTPD mailing lists, detailed on
.BR http://www.proftpd.org/lists.html
.PP
Report bugs at
.BR http://bugs.proftpd.org/


.SH NOTES

.\" Oracle has added source availability information to this manual page
This software was built from source available at https://java.net/projects/solaris-userland.  The original community source was downloaded from  ftp://ftp.proftpd.org/distrib/source/proftpd-1.3.5.tar.gz

Further information about this software can be found on the open source community website at http://www.proftpd.org/.
