Alhadis/Silos/Solaris 11.3/man5/sane-as6e.5
'\" te
.TH sane-as6e 5 "Dec 14th, 2003" "sane-backends 1.0.19" "SANE Scanner Access Now Easy"

.SH NAME
sane-as6e \- SANE backend for using the Artec AS6E parallel port interface scanner.

.SH DESCRIPTION
The
.B sane-as6e
library implements a SANE (Scanner Access Now Easy) backend
that provides access to Artec AS6E flatbed scanner.  
.B It requires the as6edriver program in order to operate. 
The as6edriver program is
.B not
included with the SANE package.  
It can be found at 
.BR http://as6edriver.sourceforge.net.
See the as6edriver documentation for technical information.
.PP
The
.I as6edriver 
program must be in the path for executables ($PATH). Especially if you run
.I saned
(the SANE network scanning daemon), take care to setup the path for 
.I inetd
or
.I xinetd
correctly or place the program in a directory that is in the path.

.PP

.SH FILES
.B as6edriver 
\- driver program that controls the scanner.


.\" Oracle has added the ARC stability level to this manual page
.SH ATTRIBUTES
See
.BR attributes (5)
for descriptions of the following attributes:
.sp
.TS
box;
cbp-1 | cbp-1
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE 
=
Availability	image/scanner/xsane/sane-backends
=
Stability	Uncommitted
.TE 
.PP
.SH SEE ALSO
.BR sane (7),
.BR as6edriver (5),
.BR saned (8),
.B http://as6edriver.sourceforge.net

.SH AUTHOR
Eugene S. Weiss

.SH EMAIL-CONTACT
yossarian@users.sourceforge.net


.SH NOTES

.\" Oracle has added source availability information to this manual page
This software was built from source available at https://java.net/projects/solaris-userland.  The original community source was downloaded from  ftp://ftp2.sane-project.org/pub/sane/old-versions/sane-backends-1.0.19/sane-backends-1.0.19.tar.gz

Further information about this software can be found on the open source community website at http://www.sane-project.org/.
