Alhadis/Silos/Solaris 11.3/man5/sane-hpljm1005.5
'\" te
.TH sane-hpljm1005 5 "15 Jan 2008" "sane-backends 1.0.19" "SANE Scanner Access Now Easy"
.IX sane-hpljm1005
.SH NAME
sane-hpljm1005 \- SANE backend for Hewlett-Packard LaserJet M1005 MFP Scanner
.SH DESCRIPTION
The
.B sane-hpljm1005
library implements a SANE (Scanner Access Now Easy) backend that provides
access to the following Hewlett-Packard scanner:
.PP
.RS
LaserJet M1005
.RE
.PP
If you own a scanner other than the ones listed above that works with this
backend, please let us know this by sending the scanner's exact model name and
the USB vendor and device ids (e.g. from
.IR /proc/bus/usb/devices ,
.I sane-find-scanner
or syslog) to us. Even if the scanner's name is only slightly different from
the models mentioned above, please let us know.
.SH CONFIGURATION
None required.
.SH FILES
.TP
.I /usr/lib/sane/libsane-hpljm1005.a
The static library implementing this backend.
.TP
.I /usr/lib/sane/libsane-hpljm1005.so
The shared library implementing this backend (present on systems that
support dynamic loading).

.\" Oracle has added the ARC stability level to this manual page
.SH ATTRIBUTES
See
.BR attributes (5)
for descriptions of the following attributes:
.sp
.TS
box;
cbp-1 | cbp-1
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE 
=
Availability	image/scanner/xsane/sane-backends
=
Stability	Uncommitted
.TE 
.PP
.SH "SEE ALSO"
.BR sane (7),
.BR sane-usb (5),

.SH AUTHOR
Philippe Rétornaz <couriousous@mandriva.org>


.SH NOTES

.\" Oracle has added source availability information to this manual page
This software was built from source available at https://java.net/projects/solaris-userland.  The original community source was downloaded from  ftp://ftp2.sane-project.org/pub/sane/old-versions/sane-backends-1.0.19/sane-backends-1.0.19.tar.gz

Further information about this software can be found on the open source community website at http://www.sane-project.org/.
