Alhadis/Silos/Solaris 11.3/man5/trusted_extensions.5
'\" te
.\" Copyright (c) 2007, 2013, Oracle and/or its affiliates. All rights reserved.
.TH trusted_extensions 5 "12 Nov 2007" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
trusted_extensions \- Solaris Trusted Extensions
.SH DESCRIPTION
.sp
.LP
The Trusted Extensions feature of Oracle Solaris provides labels for local objects and processes, for the desktop and windowing system, for zones and file systems, and for network communications. These labels are used to implement a Multilevel Security (MLS) policy that restricts the flow of information based on label relationships. In contrast to Discretionary Access Control (DAC) based on ownership, the MLS policy enforced by Trusted Extensions is an example of Mandatory Access Control (MAC).
.sp
.LP
By default, Trusted Extensions software is disabled. It is enabled and disabled (but not completely configured) by the \fBlabeladm\fR(1M) command, and is associated with \fBlabeld\fR(1M) services, identified by the FMRI pattern:
.sp
.in +2
.nf
svc:/system/labeld:*
.fi
.in -2
.sp

.sp
.LP
Refer to the Administrator's Guide listed below for the required configuration of Trusted Extensions software necessary before use.
.SH SEE ALSO
.sp
.LP
\fBlabeld\fR(1M), \fBlabel_encodings\fR(4), \fBlabels\fR(5)
.sp
.LP
\fITrusted Extensions Configuration and Administration\fR
.sp
.LP
\fITrusted Extensions User\&'s Guide\fR
