Alhadis/Silos/Solaris 11.3/man5/xferlog.5
'\" te
.TH XFERLOG 5
.SH NAME
xferlog \- ProFTPD server logfile
.SH DESCRIPTION
.LP
The
.B xferlog
file contains logging information from the FTP server daemon,
.BR proftpd (8).
This file usually is found in
.BR /var/log
but can be located anywhere by
using a
.BR proftpd (8)
configuration directive.
Each server entry is composed of a single line of the following form, 
with all fields being separated by spaces.
.IP
.I
current-time\ \  transfer-time\ \  remote-host\ \  file-size\ \  filename\ \  transfer-type\ \  special-action-flag\ \  direction\ \  access-mode\ \  username\ \  service-name\ \  authentication-method\ \  authenticated-user-id\ \ completion-status
.LP
.TP 20
.I current-time
is the current local time in the form "DDD MMM dd hh:mm:ss YYYY". Where DDD
is the day of the week, MMM is the month, dd is the day of the month,
hh is the hour, mm is the minutes, ss is the seconds, and YYYY is the year.
.TP 
.I transfer-time
is the total time in seconds for the transfer.
.TP
.I remote-host
is the remote host name.
.TP
.I file-size
is the size of the transferred file in bytes.
.TP
.I filename
is the name of the transferred file.  If the filename contains any spaces or
control characters, each such character is replaced by an underscore ('_')
character.
.TP
.I transfer-type
is a single character indicating the type of transfer. Can be one of:
.RS
.RS
.PD 0
.TP 10
.B a
for an ascii transfer
.TP
.B b
for a binary transfer
.PD
.RE
.RE
.TP
.I special-action-flag
is one or more single character flags indicating any special action taken. 
Can be one or more of: 
.RS
.RS
.PD 0
.TP 10
.B C
file was compressed
.TP
.B U
file was uncompressed
.TP
.B T
file was tar'ed
.TP
.B _
no action was taken
.PD
.RE
.RE
.TP
.I direction
is the direction of the transfer. Can be one of:
.RS
.RS
.PD 0
.TP 10
.B o
outgoing
.TP
.B i
incoming
.TP
.B d
deleted
.PD
.RE
.RE
.TP
.I access-mode
is the method by which the user is logged in. Can be one of:
.RS
.RS
.PD 0
.TP 10
.B a
(anonymous) is for an anonymous guest user. 
.TP
.B r
(real) is for a local authenticated user.
.PD
.RE
.RE
.TP
.I username
is the local username, or if guest, the ID string given. 
.TP
.I service-name
is the name of the service being invoked, usually FTP.
.TP
.I authentication-method
is the method of authentication used. Can be one of:
.RS
.RS
.PD 0
.TP 10
.B 0
none
.TP
.B 1
RFC931 Authentication
.PD
.RE
.RE
.TP
.I authenticated-user-id
is the user id returned by the authentication method. 
A * is used if an authenticated user id is not available.
.TP
.I completion-status
is a single character indicating the status of the transfer.  Can be one of:
.RS
.RS
.PD 0
.TP 10
.B c
complete transfer
.TP
.B i
incomplete transfer
.PD
.RE
.RE
.SH FILES
.PD 0
.TP 20
.B /var/log/xferlog
.PP
.PD
.SH AUTHORS
.PP
ProFTPD is written and maintained by a number of people, full credits
can be found on
.BR http://www.proftpd.org/credits.html
.PD

.\" Oracle has added the ARC stability level to this manual page
.SH ATTRIBUTES
See
.BR attributes (5)
for descriptions of the following attributes:
.sp
.TS
box;
cbp-1 | cbp-1
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE 
=
Availability	service/network/ftp
=
Stability	Uncommitted
.TE 
.PP
.SH "SEE ALSO"
.BR proftpd(8)
.PP
Full documentation on ProFTPD, including configuration and FAQs, is available at
.BR http://www.proftpd.org/
.PP 
For help/support, try the ProFTPD mailing lists, detailed on
.BR http://www.proftpd.org/lists.html
.PP
Report bugs at
.BR http://bugs.proftpd.org/


.SH NOTES

.\" Oracle has added source availability information to this manual page
This software was built from source available at https://java.net/projects/solaris-userland.  The original community source was downloaded from  ftp://ftp.proftpd.org/distrib/source/proftpd-1.3.5.tar.gz

Further information about this software can be found on the open source community website at http://www.proftpd.org/.
