Alhadis/Silos/Solaris 11.3/zh_CN.UTF-8/man1m/fmstat.1m
'\" te
.\" Copyright (c) 2005, 2011, Oracle and/or its affiliates.All rights reserved.
.TH fmstat 1M "2011 年 8 月 16 日" "SunOS 5.11" "系统管理命令"
.SH 名称
fmstat \- 报告故障管理模块统计信息
.SH 用法概要
.LP
.nf
\fBfmstat\fR [\fB-astTz\fR] [\fB-d\fR u | d ] [\fB-m\fR \fImodule\fR] [\fIinterval\fR [\fIcount\fR]]
.fi

.SH 描述
.sp
.LP
管理员和服务人员可以使用 \fBfmstat\fR 实用程序报告与 Solaris Fault Manager \fBfmd\fR(1M) 及其相关的模块集关联的统计信息。Fault Manager 在每个 Solaris 系统的后台运行。它接收与系统软件检测到的问题有关的遥测信息，诊断这些问题，启动主动式自我修复活动，如禁用故障组件等。
.sp
.LP
可使用 \fBfmstat\fR 查看当前参与故障管理的诊断引擎和代理的统计信息。\fBfmd\fR(1M)、\fBfmadm\fR(1M) 和 \fBfmdump\fR(1M) 的文档对用于观察故障管理活动的工具进行了详细的描述。 
.sp
.LP
如果存在 \fB-m\fR 选项或 \fB-t\fR 选项，\fBfmstat\fR 会报告指定故障管理模块保存的所有统计信息。可使用 \fBfmadm config\fR 获取模块列表。 
.sp
.LP
如果 \fB-m\fR 选项不存在，\fBfmstat\fR 会报告它的每个客户机模块的以下统计信息： 
.sp
.ne 2
.mk
.na
\fB\fBmodule\fR\fR
.ad
.RS 11n
.rt  
故障管理模块的名称，如 \fBfmadm config\fR 所报告。
.RE

.sp
.ne 2
.mk
.na
\fB\fBev_recv\fR\fR
.ad
.RS 11n
.rt  
模块接收的遥测事件数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBev_acpt\fR\fR
.ad
.RS 11n
.rt  
模块接受的与诊断相关的事件数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBwait\fR\fR
.ad
.RS 11n
.rt  
等待模块检查的遥测事件平均数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsvc_t\fR\fR
.ad
.RS 11n
.rt  
模块接收的遥测事件平均服务时间（以毫秒为单位）。
.RE

.sp
.ne 2
.mk
.na
\fB\fB%w\fR\fR
.ad
.RS 11n
.rt  
存在等待模块检查的遥测事件的时间的百分比。
.RE

.sp
.ne 2
.mk
.na
\fB\fB%b\fR\fR
.ad
.RS 11n
.rt  
模块忙于处理遥测事件的时间的百分比。
.RE

.sp
.ne 2
.mk
.na
\fB\fBopen\fR\fR
.ad
.RS 11n
.rt  
模块拥有的活动事例数（打开问题调查）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsolve\fR\fR
.ad
.RS 11n
.rt  
自从装入该模块后，它所解决的事例总数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmemsz\fR\fR
.ad
.RS 11n
.rt  
该模块当前所分配的动态内存量。
.RE

.sp
.ne 2
.mk
.na
\fB\fBbufsz\fR\fR
.ad
.RS 11n
.rt  
该模块当前所分配的持久性缓冲区空间大小。
.RE

.sp
.LP
\fBfmstat\fR 实用程序要求用户拥有 \fBSYS_ADMIN\fR 特权。有关如何配置 Solaris 特权的更多信息，请参阅\fI《Securing Systems and Attached Devices in Oracle Solaris 11.3》\fR。
.SH 选项
.sp
.LP
支持以下选项： 
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 13n
.rt  
列显模块的所有统计信息，包括那些由 \fBfmd\fR 代表其保存的统计信息。如果 \fB-a\fR 选项不存在，则只报告由模块保存的统计信息。如果 \fB-a\fR 选项没有与 \fB-m\fR \fImodule\fR 一起使用，将会显示一组与 \fBfmd\fR 关联的全局统计信息。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fBu\fR | \fBd\fR\fR
.ad
.RS 13n
.rt  
显示时间戳。
.sp
指定 \fBu\fR 表示时间的内部表示形式的印刷表示形式。请参见 \fBtime\fR(2)。指定 \fBd\fR 表示标准日期格式。请参见\fBdate\fR(1)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fImodule\fR\fR
.ad
.RS 13n
.rt  
列显与指定故障管理模块关联的统计信息报告，而不是缺省统计信息报告。模块可以发布任意一组统计信息以帮助 Oracle 自己维护故障管理软件。模块统计信息构成了一个 Private（专用）接口。请参见 \fBattributes\fR(5)，了解有关 Oracle Private（专用）接口规则的信息。不能根据故障管理模块统计信息的值来编写脚本，因为它们可能在不事先通知的情况下进行更改。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 13n
.rt  
列显与模块关联的 Soft Error Rate Discrimination (SERD) 引擎报告，而不是缺省模块统计信息报告。SERD 引擎是故障管理软件所使用的结构，用来确定是否超出了在特定时间测量为 \fIN\fR 个事件的统计信息阈值 \fIT\fR。\fB-s\fR 选项只能与 \fB-m\fR 选项结合使用。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.RS 13n
.rt  
列显与每个故障管理事件传输关联的统计信息报告。每个故障管理模块可以实现一个或多个事件传输。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR\fR
.ad
.RS 13n
.rt  
列显与每个故障管理事件传输关联的授权信息表。如果存在 \fB-m\fR 选项，则只会显示与指定模块关联的传输。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR\fR
.ad
.RS 13n
.rt  
在与指定故障管理模块关联的报告中，省略具有零值的统计信息。\fB-z\fR 选项只能与 \fB-m\fR 选项结合使用。 
.RE

.SH 操作数
.sp
.LP
支持下列操作数：
.sp
.ne 2
.mk
.na
\fB\fIcount\fR\fR
.ad
.RS 12n
.rt  
只列显计数报告，然后退出。
.RE

.sp
.ne 2
.mk
.na
\fB\fIinterval\fR\fR
.ad
.RS 12n
.rt  
每隔 \fIinterval\fR 秒列显一份新的报告。
.RE

.sp
.LP
如果未指定 \fIinterval\fR 和 \fIcount\fR，将会输出一份报告，然后 \fBfmstat\fR 退出。如果指定了 \fIinterval\fR 但未指定 \fIcount\fR，则 \fBfmstat\fR 会无限期地每隔 \fIinterval\fR 秒输出报告，直至命令中断。
.SH 退出状态
.sp
.LP
将返回以下退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
成功完成。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
发生了致命错误。致命错误可能是无法与 \fBfmd\fR(1M) 进行通信。也可能是没有足够的特权来执行请求的操作。
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 5n
.rt  
指定的命令行选项无效。
.RE

.SH 属性
.sp
.LP
有关下列属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/fault-management
_
接口稳定性请参见下文。
.TE

.sp
.LP
命令行选项为 Committed（已确定）。用户可读缺省报告为 Uncommitted（未确定）。用户可读模块报告为 Private（专用）。
.SH 另请参见
.sp
.LP
\fBfmadm\fR(1M)、\fBfmd\fR(1M)、\fBfmdump\fR(1M)、\fBattributes\fR(5)
.sp
.LP
\fI《Securing Systems and Attached Devices in Oracle Solaris 11.3》\fR
