Alhadis/Silos/Solaris 11.3/zh_CN.UTF-8/man1m/ilbd.1m
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.TH ilbd 1M "2009 年 11 月 9 日" "SunOS 5.11" "系统管理命令"
.SH 名称
ilbd \- ILB 守护进程
.SH 用法概要
.LP
.nf
\fB/usr/lib/inet/ilbd\fR
.fi

.SH 描述
.sp
.LP
集成负载平衡器 (Integrated Load Balancer, ILB) 守护进程 \fBilbd\fR 为 ILB 提供用户级服务。它是由服务管理工具启动的一个系统守护进程（请参见 \fBsmf\fR(5)）。其故障管理资源标识符 (fault management resource identifier, FMRI) 为：
.sp
.in +2
.nf
svc:/network/loadbalancer/ilb:default
.fi
.in -2
.sp

.sp
.LP
请注意，\fBilbd\fR 是一个 Consolidation Private（整合专用）接口。请参见 \fBattributes\fR(5)。
.sp
.LP
\fBilbd\fR 不提供管理接口。所有 ILB 管理都应通过 \fBilbadm\fR(1M) 或程序库 \fBlibilb\fR(3LIB) 进行。
.SH 选项
.sp
.LP
\fBilbd\fR 守护进程没有选项。
.SH 示例
.LP
\fB示例 1 \fR启用 ILB 服务
.sp
.LP
以下命令启用 ILB 服务：

.sp
.in +2
.nf
# \fBsvcadm enable svc:/network/loadbalancer/ilb:default\fR
.fi
.in -2
.sp

.LP
\fB示例 2 \fR禁用 ILB 服务
.sp
.LP
以下命令禁用 ILB 服务：

.sp
.in +2
.nf
# \fBsvcadm disable svc:/network/loadbalancer/ilb:default\fR
.fi
.in -2
.sp

.SH 错误
.sp
.LP
\fBilbd\fR 守护进程使用 \fBsyslog\fR(3C) 来报告状态和错误消息。所有的消息由 \fBLOG_DAEMON\fR 工具记录。错误消息是以 \fBLOG_ERR\fR 和 \fBLOG_NOTICE\fR 优先级记录的，信息性消息是以 \fBLOG_INFO\fR 优先级记录的。\fB/etc/syslog.conf\fR 文件中的缺省项是将所有 \fBilbd\fR 守护进程错误消息记录到 \fB/var/adm/messages\fR 日志中。
.SH 文件
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/inet/ilbd\fR\fR
.ad
.sp .6
.RS 4n
ILB 守护进程二进制文件
.RE

.SH 属性
.sp
.LP
有关下列属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性service/network/load-balancer/ilb
_
接口稳定性Project Private（项目专用）
.TE

.SH 另请参见
.sp
.LP
\fBsvcs\fR(1)、\fBilbadm\fR(1M)、\fBsvcadm\fR(1M)、\fBsyslog\fR(3C)、\fBlibilb\fR(3LIB)、\fBsyslog.conf\fR(4)、\fBattributes\fR(5)、\fBsmf\fR(5)
.SH 附注
.sp
.LP
\fBilbd\fR 服务是由服务管理工具 \fBsmf\fR(5) 管理的，其故障管理资源标识符 (fault management resource identifier, FMRI) 为：
.sp
.in +2
.nf
svc:/network/loadbalancer/ilb:default
.fi
.in -2
.sp

.sp
.LP
可以使用 \fBsvcadm\fR(1M) 来对此服务执行管理操作（如启用、禁用或请求重新启动）。可以使用 \fBsvcs\fR(1) 命令来查询服务的状态。要管理该服务，必须授予 \fBsolaris.smf.manage.ilb\fR 授权，或者授予权限配置文件 "ILB Management"（ILB 管理）。
.sp
.LP
必须启用 ILB 服务，\fBilbadm\fR(1M) 命令和任何其他 \fBlibilb\fR(3LIB) 客户机应用程序才能正常运行。
