Alhadis/Silos/Solaris 11.3/zh_CN.UTF-8/man1m/ipfstat.1m
'\" te
.\" To view license terms, attribution, and copyright for IP Filter, the default path is /usr/lib/ipf/IPFILTER.LICENCE.If the Solaris operating environment has been installed anywhere other than the default, modify the given path to access the file at the installed location.
.\" Portions Copyright (c) 2008, Sun Microsystems Inc. All Rights Reserved.
.TH ipfstat 1M "2008 年 4 月 3 日" "SunOS 5.11" "系统管理命令"
.SH 名称
ipfstat \- 报告包过滤器统计信息和过滤器列表
.SH 用法概要
.LP
.nf
\fBipfstat\fR [\fB-6aACdfghIilnoRstv\fR]
.fi

.LP
.nf
\fBipfstat\fR [\fB-C\fR] [\fB-D\fR \fIaddrport\fR] [\fB-P\fR \fIprotocol\fR] [\fB-S\fR \fIaddrport\fR] 
     [\fB-T\fR \fIrefreshtime\fR]
.fi

.SH 描述
.sp
.LP
\fBipfstat\fR 命令属于与 Solaris IP 过滤器功能关联的一套命令。请参见 \fBipfilter\fR(5)。
.sp
.LP
\fBipfstat\fR 命令使用 \fB_fr_flags\fR、\fB_frstats\fR、\fB_filterin\fR 和 \fB_filterout\fR 符号来检查 \fB/dev/kmem\fR。要运行和工作，它需要能够读取 \fB/dev/kmem\fR 和内核本身。
.sp
.LP
\fBipfstat\fR 的缺省行为是检索并显示自内核通过过滤器放置包以来随时间推移累积的统计信息。
.sp
.LP
\fBipfstat\fR 的职责是将当前收集的内核统计信息作为向流入和流出内核的包应用过滤器（如果存在）后的结果进行显示。当未提供命令行参数时，这是缺省操作。当提供了 \fB-i\fR 或 \fB-o\fR 时，\fBipfstat\fR 将检索并显示当前安装的及内核正使用的过滤器规则的相应列表。
.sp
.LP
\fBipfstat\fR 使用内核设备文件获取信息。这些文件的缺省权限要求 \fBipfstat\fR 以 root 身份运行才能执行所有操作。
.sp
.LP
\fBipfstat\fR 命令支持 \fBkstat\fR(3KSTAT) 内核工具。由于此项支持功能，可使用 \fBkstat\fR(1M) 作为 \fBipfstat\fR 的替代命令。例如：
.sp
.LP
# kstat -m ipf
.sp
.LP
使用 \fBipfstat\fR \fB-t\fR 选项可使 \fBipfstat\fR 进入状态排名模式。在此模式下，状态表的显示方式与 Unix \fBtop\fR 实用程序显示进程表类似。可以使用 \fB-C\fR、\fB-D\fR、\fB-P\fR、\fB-S\fR 和 \fB-T\fR 命令行选项限制要显示的状态项和指定显示更新的频率。
.sp
.LP
在状态排名模式下，可使用以下键影响显示的信息：
.sp
.ne 2
.mk
.na
\fB\fBd\fR\fR
.ad
.RS 5n
.rt  
选择要显示的信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fBl\fR\fR
.ad
.RS 5n
.rt  
重画屏幕。
.RE

.sp
.ne 2
.mk
.na
\fB\fBq\fR\fR
.ad
.RS 5n
.rt  
退出程序。
.RE

.sp
.ne 2
.mk
.na
\fB\fBs\fR\fR
.ad
.RS 5n
.rt  
在不同排序条件之间切换。
.RE

.sp
.ne 2
.mk
.na
\fB\fBr\fR\fR
.ad
.RS 5n
.rt  
颠倒排序条件。
.RE

.sp
.LP
可按协议编号、IP 包数、字节数、状态项的生存时间对状态进行排序。缺省行为是按字节数进行排序。状态按降序排序，但可以使用 \fBr\fR 键使它们按升序排序。
.sp
.LP
无法以交互方式更改源、目标和协议过滤器或刷新频率。这些操作必须通过命令行执行。
.sp
.LP
屏幕必须具有 80 个列才能正确显示。不过，\fBipfstat\fR 不会检查屏幕宽度。
.sp
.LP
只显示与排序和过滤条件匹配的前 \fIX\fR-5 个项（其中 \fIX\fR 是显示器上的行数）。无法查看更多的项。
.SH 选项
.sp
.LP
支持以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-6\fR\fR
.ad
.RS 18n
.rt  
显示过滤器列表和 IPv6 的状态（如果有）。此选项将来可能会更改。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 18n
.rt  
显示记帐过滤器列表并显示为每个规则统计的字节数。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-A\fR\fR
.ad
.RS 18n
.rt  
显示包验证统计信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR\fR
.ad
.RS 18n
.rt  
仅当与 \fB-t\fR 结合使用时有效。还会显示排名靠前的 closed 状态。通常情况下，如果 TCP 连接达到了 \fBCLOSE_WAIT\fR 协议状态，则不会显示该连接。如果启用了此选项，将会显示所有状态项。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 18n
.rt  
显示数据时生成调试输出。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR \fIaddrport\fR\fR
.ad
.RS 18n
.rt  
仅当与 \fB-t\fR 结合使用时有效。将状态排名显示限制为仅显示其目标 IP 地址和端口与 \fIaddrport\fR 参数相匹配的状态项。\fIaddrport\fR 是以 \fIipaddress \fR[,\fIport\fR] 格式指定的。\fIipaddress\fR 和 \fIport\fR 应该是数字或字符串 \fBany\fR（以该顺序指定任何 IP 地址和端口）。如果未指定 \fB-D\fR 选项，则缺省设置为 \fB-D\fR \fBany,any\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 18n
.rt  
如果存在任何片段状态信息（统计信息）和保留的状态信息（在内核中），将会显示它们。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR\fR
.ad
.RS 18n
.rt  
显示当前配置的组（包括活动的和非活动的）。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 18n
.rt  
显示每个规则被“命中”的次数。需与 \fB-i\fR 结合使用。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.RS 18n
.rt  
显示用于内核 IP 处理的输入端的过滤器列表。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-I\fR\fR
.ad
.RS 18n
.rt  
在检索 \fBinactive\fR/\fBactive\fR 过滤器列表详细信息之间切换。需与 \fB-i\fR 结合使用。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 18n
.rt  
当与 \fB-s\fR 一起使用时，会显示活动状态项的列表（没有统计信息）。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 18n
.rt  
显示每个规则在列显时的规则编号。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR\fR
.ad
.RS 18n
.rt  
显示用于内核 IP 处理的输出端的过滤器列表。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fIprotocol\fR\fR
.ad
.RS 18n
.rt  
仅当与 \fB-t\fR 结合使用时有效。将状态排名显示限制为仅显示与特定协议匹配的状态项。该参数可以是协议名称（如 \fB/etc/protocols\fR 中定义的）或协议编号。如果未指定此选项，则会指定任何协议的状态项。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.RS 18n
.rt  
同时禁用“IP 地址到主机名”解析和“端口号到服务名称”解析。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR \fIaddrport\fR\fR
.ad
.RS 18n
.rt  
仅当与 \fB-t\fR 结合使用时有效。将状态排名显示限制为仅显示其源 IP 地址和端口与 \fIaddrport\fR 参数相匹配的状态项。\fIaddrport\fR 是以 \fIipaddress \fR[,\fIport\fR] 格式指定的。\fIipaddress\fR 和 \fIport\fR 应该是数字或字符串 \fBany\fR（以该顺序指定任何 IP 地址和端口）。如果未指定 \fB-S\fR 选项，则缺省设置为 \fB-S\fR \fBany,any\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 18n
.rt  
显示包/流状态信息（仅限于统计信息）。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fIrefreshtime\fR\fR
.ad
.RS 18n
.rt  
仅当与 \fB-t\fR 结合使用时有效。指定状态\fB排名\fR显示应以何频率进行更新。刷新时间是两次更新之间的秒数。可以使用任何正整数。缺省值（最小更新时间）是 1。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.RS 18n
.rt  
以与 Unix 实用程序 \fBtop\fR 显示进程表类似的方式显示状态表。可采用多种不同种方式对状态进行排序。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 18n
.rt  
打开详细模式。显示更多调试信息。
.RE

.SH 文件
.RS +4
.TP
.ie t \(bu
.el o
\fB/dev/kmem\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB/dev/ksyms\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB/dev/ipl\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB/dev/ipstate\fR
.RE
.SH 属性
.sp
.LP
有关下列属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性network/ipfilter
_
接口稳定性Committed（已确定）
.TE

.SH 另请参见
.sp
.LP
\fBipf\fR(1M)、\fBkstat\fR(1M)、\fBkstat\fR(3KSTAT)、\fBattributes\fR(5)、\fBipfilter\fR(5)
.sp
.LP
\fI《Managing IP Quality of Service in Oracle Solaris 11.3》\fR
