Alhadis/Silos/Solaris 11.3/zh_CN.UTF-8/man1m/prtconf.1m
'\" te
.\" Copyright (c) 1989, 2012, Oracle and/or its affiliates.All rights reserved.
.\" Copyright 1989 AT&T
.TH prtconf 1M "2012 年 3 月 8 日" "SunOS 5.11" "系统管理命令"
.SH 名称
prtconf \- 打印系统配置
.SH 用法概要
.LP
.nf
\fB/usr/sbin/prtconf\fR [\fB-V\fR] | [\fB-F\fR] | [\fB-x\fR] | [\fB-bpv\fR] | [\fB-acdDlPuv\fR] 
     [\fIdev_path\fR]
.fi

.SH 描述
.sp
.LP
\fBprtconf\fR 命令可打印系统配置信息。输出中包括内存总量以及以设备树格式显示的系统外围设备的配置。
.sp
.LP
如果在命令行上为可以获取设备路径的命令选项指定了设备路径，\fBprtconf\fR 将仅显示该设备节点的信息。
.SH 选项
.sp
.LP
支持以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 6n
.rt  
显示命令行上指定设备直至设备树根节点的所有祖先设备节点。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-b\fR\fR
.ad
.RS 6n
.rt  
显示用于标识平台的固件设备树根属性。这些属性是 "name"、"compatible"、"banner-name" 和 "model"。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 6n
.rt  
显示以命令行上指定设备节点为根的设备子树，即，显示命令行上指定设备节点的所有子项。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 6n
.rt  
除了节点名称之外，还显示 PCI 和 PCI Express 设备的供应商 ID 和设备 ID。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR\fR
.ad
.RS 6n
.rt  
对于设备树中的每个系统外围设备，显示用于管理外围设备的设备驱动程序的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 6n
.rt  
显示与设备节点关联的 \fB/dev/chassis\fR 位置。如果使用 \fB-v\fR，则暗指 \fB-l\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR\fR
.ad
.RS 6n
.rt  
返回控制台帧缓存器的设备路径名称（如果存在）。如果没有帧缓存器，\fBprtconf\fR 将返回一个非零退出代码。此标志必须由其自己使用。它只返回控制台名称、帧缓存器设备或非零退出代码。例如，如果 SUNW,Ultra-30 上的控制台帧缓存器是 \fBffb\fR，该命令将返回：\fB/SUNW,ffb@1e,0:ffb0\fR。此选项可用于为 \fB/dev/fb\fR 创建一个指向实际控制台设备的符号链接。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.RS 6n
.rt  
显示由 SPARC 平台上的固件 (PROM) 或 x86 平台上的引导系统提供的设备树派生的信息。使用此选项显示的设备树信息是初始配置的快照，可能不会准确反映之后发生的重新配置事件。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR\fR
.ad
.RS 6n
.rt  
包含有关伪设备的信息。缺省情况下忽略有关伪设备的信息。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.RS 6n
.rt  
与 \fB-v\fR 一起，显示供应商和管理列表中的设备列表属性的信息（如果有）。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 6n
.rt  
指定详细模式。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR\fR
.ad
.RS 6n
.rt  
显示（SPARC 平台上）取决于平台的 \fBPROM\fR 或（x86 平台上）引导系统的版本信息。此标志必须由其自己使用。输出的内容是字符串。字符串的格式是任意的，并与平台相关。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.RS 6n
.rt  
报告此系统上的固件是否支持 64 位。某些现有平台可能需要进行固件升级以运行 64 位内核。如果操作不适用于此平台，或者固件支持 64 位，操作将以无提示方式退出，并返回代码零。如果操作适用于此平台，并且固件不支持 64 位，操作将在标准输出中显示一条描述性消息，同时退出并返回一个非零代码。硬件平台文档包含有关需要进行固件升级以运行 64 位内核的平台的更多信息。
.sp
此标志会覆盖所有其他标志，并且必须由其自己使用。
.RE

.SH 操作数
.sp
.LP
支持下列操作数：
.sp
.ne 2
.mk
.na
\fB\fIdev_path\fR\fR
.ad
.RS 12n
.rt  
指向目标设备次要节点、设备子树节点或为其显示设备节点配置信息的设备链接的路径。
.RE

.SH 退出状态
.sp
.LP
将返回以下退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 13n
.rt  
没有出现错误。
.RE

.sp
.ne 2
.mk
.na
\fB\fB非零值\fR\fR
.ad
.RS 13n
.rt  
对于 \fB-F\fR 选项（仅限 SPARC），返回的非零值表示输出设备不是帧缓存器。对于 \fB-x\fR 选项，返回的非零值表示固件不支持 64 位。对于所有其他情况，返回的非零值表示出现错误。
.RE

.SH 属性
.sp
.LP
有关下列属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
接口稳定性Uncommitted（未确定）
.TE

.SH 另请参见
.sp
.LP
\fBfuser\fR(1M)、\fBmodinfo\fR(1M)、\fBsysdef\fR(1M)、\fBdriver\fR(4)、\fBdriver.conf\fR(4)、\fBattributes\fR(5)
.sp
.LP
《\fISun 硬件平台指南\fR》
.SS "仅 SPARC"
.sp
.LP
\fBopenprom\fR(7D)
.SH 附注
.sp
.LP
\fBprtconf\fR 命令的输出与系统中安装的 \fBPROM\fR 的版本高度相关。在所有情况下，输出都有可能受到潜在影响。
.sp
.LP
\fBdriver not attached\fR（驱动程序未连接）消息表示当前没有驱动程序关联到设备的此实例。通常，会根据要求或在需要时装载和安装驱动程序（并关联到硬件实例），在不使用设备时卸载驱动程序。
.sp
.LP
在 x86 平台上，使用 \fBprtconf\fR \fB-vp\fR 将提供 \fBprtconf\fR \fB-v\fR 信息的子集。\fBprtconf\fR \fB-vp\fR 的整数属性值可能需要字节交换以进行正确解释。
