Alhadis/Silos/Solaris 11.3/zh_CN.UTF-8/man1/ar.1
'\" te
.\" Copyright (c) 2009, 2012, Oracle and/or its affiliates.All rights reserved.
.\" Copyright 1989 AT&T
.\" Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation.Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation.In the following statement, the phrase "this text" refers to portions of the system documentation.Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group.In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document.The original Standard can be obtained online at http://www.opengroup.org/unix/online.html.This notice shall appear on any product containing this material. 
.TH ar 1 "2012 年 2 月 23 日" "SunOS 5.11" "用户命令"
.SH 名称
ar \- 维护可移植的归档或库
.SH 用法概要
.LP
.nf
\fB/usr/bin/ar\fR \fB-d\fR [\fB-SVv\fR] \fIarchive\fR \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/ar\fR \fB-m\fR [\fB-abiSVv\fR] [\fIposname\fR] \fIarchive\fR \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/ar\fR \fB-p\fR [\fB-SsVv\fR] \fIarchive\fR [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/bin/ar\fR \fB-q\fR [\fB-cSVv\fR] \fIarchive\fR \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/ar\fR \fB-r\fR [\fB-abciuSVv\fR] [\fIposname\fR] \fIarchive\fR \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/ar\fR \fB-t\fR [\fB-SsVv\fR] \fIarchive\fR [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/bin/ar\fR \fB-x\fR [\fB-CSsTVv\fR] \fIarchive\fR [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/xpg4/bin/ar\fR \fB-d\fR [\fB-SVv\fR] \fIarchive\fR \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/ar\fR \fB-m\fR [\fB-abiSVv\fR] [\fIposname\fR] \fIarchive\fR \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/ar\fR \fB-p\fR [\fB-SsVv\fR] \fIarchive\fR [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/xpg4/bin/ar\fR \fB-q\fR [\fB-cSVv\fR] \fIarchive\fR \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/ar\fR \fB-r\fR [\fB-abciuSVv\fR] [\fIposname\fR] \fIarchive\fR \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/ar\fR \fB-t\fR [\fB-SsVv\fR] \fIarchive\fR [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/xpg4/bin/ar\fR \fB-x\fR [\fB-CSsTVv\fR] \fIarchive\fR [\fIfile\fR]...
.fi

.SH 描述
.sp
.LP
\fBar\fR 实用程序维护已组合成单个归档文件的文件组。它的主要用途是创建和更新库文件。但是，它可以用于任何类似的用途。\fBar\fR 使用的魔力字符串和文件头包含可列显的 \fBASCII\fR 字符。如果归档由可列显文件组成，则整个归档都可列显。
.sp
.LP
当 \fBar\fR 创建归档时，它使用可以跨所有计算机进行移植的格式来创建标头。可移植的归档格式和结构将在 \fBar.h\fR(3HEAD) 中详细介绍。该处介绍的归档符号表供链接编辑器 \fBld\fR(1) 使用，以便以高效的方式多次遍历目标文件库。仅在归档中至少存在一个目标文件时，\fBar\fR 才会创建和维护归档符号表。归档符号表位于一个专门指定的文件中，该文件总是归档中的第一个文件。该文件决不会向用户显示或供用户访问。每当使用 \fBar\fR 命令创建或更新此类归档的内容时，符号表即会重建。下面介绍的 \fB-s\fR 选项强制符号表重建。
.SH 选项
.sp
.LP
支持以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
将新的 \fIfile\fR 放置在 \fIarchive\fR 中，使其位于 \fIposname\fR 操作数指定的文件之后。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-b\fR\fR
.ad
.sp .6
.RS 4n
将新的 \fIfile\fR 放置在 \fIarchive\fR 中，使其位于 \fIposname\fR 操作数指定的文件之前。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.sp .6
.RS 4n
禁止显示创建 \fIarchive\fR 时缺省写入标准错误的诊断消息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR\fR
.ad
.sp .6
.RS 4n
阻止提取的文件替换文件系统中名称相同的文件。当同时使用 \fB-T\fR 选项阻止截断文件名替换具有相同前缀的文件时，该选项很有用。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
从 \fIarchive\fR 中删除一个或多个 \fIfile\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.sp .6
.RS 4n
将新的 \fIfile\fR 放置在 \fIarchive\fR 中，使其位于 \fIposname\fR 操作数指定的文件之前。该选项等效于 \fB-b\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.sp .6
.RS 4n
移动 \fIfile\fR。如果同时指定了 \fB-a\fR、\fB-b\fR 或 \fB-i\fR 与 \fIposname\fR 操作数，则 \fB-m\fR 选项将 \fIfile\fR 移到新的位置。否则，\fB-m\fR 将 \fIfile\fR 移到 \fIarchive\fR 的末尾。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
将 \fIarchive\fR 中 \fIfile\fR 的内容列显到标准输出中。如果未指定 \fIfile\fR，则会按照归档的顺序将 \fIarchive\fR 中所有文件的内容写入标准输出。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR\fR
.ad
.sp .6
.RS 4n
快速将 \fIfile\fR 附加到 \fIarchive\fR 的末尾。定位选项 \fB-a\fR、\fB-b\fR 和 \fB-i\fR 无效。该命令不检查添加的 \fIfile\fR 是否已存在于 \fIarchive\fR 中。此选项有助于在逐块创建大型归档时避免二次行为。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
在 \fIarchive\fR 中替换或添加 \fIfile\fR。如果 \fIarchive\fR 不存在，则会创建新的归档文件并将诊断消息写入标准错误，除非指定了 \fB-c\fR 选项。如果未指定 \fIfile\fR 并且 \fIarchive\fR 存在，则结果不确定。替换现有文件的文件不会改变归档的顺序。如果同时使用 \fB-u\fR 选项和 \fB-r\fR 选项，则仅替换那些修改日期晚于归档文件的文件。如果使用 \fB-a\fR、\fB-b\fR 或 \fB-i\fR 选项，则 \fIposname\fR 参数必须存在并指定新的文件是放在 \fIposname\fR 之后 (\fB-a\fR) 还是之前（\fB-b\fR 或 \fB-i\fR）。否则，新的文件将放在末尾。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.sp .6
.RS 4n
即使未通过将修改归档内容的选项调用 \fBar\fR，也强制重新生成归档符号表。在对归档使用 \fBstrip\fR(1) 命令之后恢复归档符号表时，此命令非常有用。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR\fR
.ad
.sp .6
.RS 4n
当构建归档符号表时，强制使用具备 64 位功能的符号表格式。缺省情况下，将 32 位格式用于所有小于 4GB 的归档，将较大的格式用于超过 32 位限制的较大归档。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.sp .6
.RS 4n
列显 \fIarchive\fR 的目录。\fIfile\fR 操作数指定的文件包括在写入列表中。如果未指定 \fIfile\fR 操作数，则会按照归档的顺序将 \fIarchive\fR 中的所有文件包括在内。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR\fR
.ad
.sp .6
.RS 4n
允许截断其归档名超过文件系统可支持长度的提取文件的文件名。缺省情况下，提取名称过长的文件会发生错误。在该情况下，会写入诊断消息并取消文件的提取。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.sp .6
.RS 4n
更新较早的文件。当使用 \fB-r\fR 选项时，\fIarchive\fR 中的文件仅在对应 \fIfile\fR 的修改时间晚于或等于 \fIarchive\fR 中文件的修改时间时才会替换。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
提供详细输出。当配合 \fB-d\fR、\fB-r\fR 或 \fB-x\fR 选项使用时，\fB-v\fR 选项逐个文件编写归档创建、成员 \fIfile\fR 和维护活动的详细说明。当配合 \fB-p\fR 使用时，\fB-v\fR 首先将文件名写入标准输出，然后再将文件本身写入标准输出。当配合 \fB-t\fR 使用时，\fB-v\fR 包括归档中文件的相关信息的较长列表。当配合 \fB-x\fR 使用时，\fB-v\fR 在每个提取之前列显文件名。当写入归档时，\fB-v\fR 将消息写入标准错误。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR\fR
.ad
.sp .6
.RS 4n
在标准错误上列显其版本编号。
.RE

.SS "\fB/usr/xpg4/bin/ar\fR"
.sp
.LP
\fB/usr/xpg4/bin/ar\fR 支持以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 6n
.rt  
与 \fB/usr/bin/ar\fR 版本一样，除了在写入归档时，不会将消息写入标准错误。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.RS 6n
.rt  
从 \fIarchive\fR 提取由 \fIfile\fR 操作数指定的文件。\fIarchive\fR 的内容不会发生更改。如果未指定 \fIfile\fR 操作数，则会提取 \fIarchive\fR 中的所有文件。如果从 \fIarchive\fR 提取的文件的文件名超过要将其提取到的目录中支持的长度，则结果不确定。每个提取的 \fIfile\fR 的修改时间设置为从 \fIarchive\fR 提取 \fIfile\fR 的时间。
.RE

.SH 操作数
.sp
.LP
支持下列操作数：
.sp
.ne 2
.mk
.na
\fB\fIarchive\fR\fR
.ad
.RS 11n
.rt  
归档文件的路径名。
.RE

.sp
.ne 2
.mk
.na
\fB\fIfile\fR\fR
.ad
.RS 11n
.rt  
路径名。当针对归档中的文件名进行比较时，仅使用最后一个组件。如果两个或多个 \fIfile\fR 操作数具有相同的最后路径名组件（请参见 \fBbasename\fR(1)），则结果不确定。实现的归档格式不会截断归档中添加或替换的文件的有效文件名。
.RE

.sp
.ne 2
.mk
.na
\fB\fIposname\fR\fR
.ad
.RS 11n
.rt  
归档文件中的文件名，用于相对定位。请参见选项 \fB-m\fR 和 \fB-r\fR。
.RE

.SH 环境变量
.sp
.LP
有关影响 \fBar\fR 执行的以下环境变量的说明，请参见 \fBenviron\fR(5)：\fBLANG\fR、\fBLC_ALL\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR、\fBLC_TIME\fR 和 \fBNLSPATH\fR。
.sp
.ne 2
.mk
.na
\fB\fBTMPDIR\fR\fR
.ad
.RS 10n
.rt  
确定覆盖临时文件缺省目录的路径名（如果有）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTZ\fR\fR
.ad
.RS 10n
.rt  
确定用于计算 \fBar\fR \fB-tv\fR 写入的日期和时间字符串的时区。如果 \fBTZ\fR 未设置或为空，则使用不确定的缺省时区。
.RE

.SH 退出状态
.sp
.LP
将返回以下退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
成功完成。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
出现错误。
.RE

.SH 属性
.sp
.LP
有关下列属性的说明，请参见 \fBattributes\fR(5)：
.SS "\fB/usr/bin/ar\fR"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/linker
_
接口稳定性Committed（已确定）
.TE

.SS "\fB/usr/xpg4/bin/ar\fR"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/xopen/xcu4
_
接口稳定性Committed（已确定）
_
标准请参见 \fBstandards\fR(5)。
.TE

.SH 另请参见
.sp
.LP
\fBbasename\fR(1)、\fBcpio\fR(1)、\fBelffile\fR(1)、\fBfile\fR(1)、\fBld\fR(1)、\fBlorder\fR(1)、\fBstrip\fR(1)、\fBtar\fR(1)、\fBar.h\fR(3HEAD)、\fBa.out\fR(4)、\fBattributes\fR(5)、\fBenviron\fR(5)、\fBstandards\fR(5)
.SH 附注
.sp
.LP
如果在参数列表中相同的文件指定了两次，则可以将其放入归档两次。
.sp
.LP
按照惯例，归档使用 "\fB\&.a\fR" 作为后缀。
.sp
.LP
当将 \fBELF\fR 目标文件插入归档文件时，\fBar\fR 可能会添加 \n 字符来填充这些目标文件，使其成为 8 字节边界。此类填充可以提高 \fBld\fR(1) 访问归档的效率。仅 \fBELF\fR 目标文件按照这种方式进行填充。其他归档成员不会发生更改。当从归档提取具有此类填充的目标文件时，填充不会包括在生成的输出中。
.sp
.LP
从头开始创建新的归档比通过单独调用 \fBar\fR 将各个文件插入现有归档要快。如果可以，建议的策略是删除现有归档，然后通过单次 \fBar\fR 调用重新创建归档。
.sp
.LP
归档的总大小允许超过 4GB。但是，归档中任何单个文件的大小由归档文件格式限制为 4GB。请参见 \fBar.h\fR(3HEAD)。
.sp
.LP
归档中单个文件的最大用户 ID 和组 ID 由归档文件格式限制为 6 个十进制数字。用户或组 ID 大于 999999 的任何文件都会自动设置为用户 ID “nobody” (60001) 或组 ID “nobody” (6001)。请参见 \fBar.h\fR(3HEAD)。
