Alhadis/Silos/Solaris 11.3/zh_CN.UTF-8/man1/chown.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2008, 2011, Oracle and/or its affiliates.All rights reserved.
.\" Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\" Portions Copyright (c) 1982-2007 AT&T Knowledge Ventures
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation.Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation.In the following statement, the phrase "this text" refers to portions of the system documentation.Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group.In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document.The original Standard can be obtained online at http://www.opengroup.org/unix/online.html.This notice shall appear on any product containing this material. 
.TH chown 1 "2011 年 7 月 25 日" "SunOS 5.11" "用户命令"
.SH 名称
chown \- 更改文件所有权
.SH 用法概要
.SS "/usr/bin/chown"
.LP
.nf
\fB/usr/bin/chown\fR [\fB-fhR\fR] \fIowner\fR[:\fIgroup\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/chown\fR \fB-s\fR [\fB-fhR\fR] \fIownersid\fR[:\fIgroupsid\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/chown\fR \fB-R\fR [\fB-f\fR] [\fB-H\fR | \fB-L\fR | \fB-P\fR] \fIowner\fR[:\fIgroup\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/chown\fR \fB-s\fR \fB-R\fR [\fB-f\fR] [\fB-H\fR | \fB-L\fR | \fB-P\fR] \fIownersid\fR[:\fIgroupsid\fR] \fIfile\fR...
.fi

.SS "/usr/xpg4/bin/chown"
.LP
.nf
\fB/usr/xpg4/bin/chown\fR [\fB-fhR\fR] \fIowner\fR[:\fIgroup\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/chown\fR \fB-s\fR [\fB-fhR\fR] \fIownersid\fR[:\fIgroupsid\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/chown\fR \fB-R\fR [\fB-f\fR] [\fB-H\fR | \fB-L\fR | \fB-P\fR] \fIowner\fR[:\fIgroup\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/chown\fR \fB-s\fR \fB-R\fR [\fB-f\fR] [\fB-H\fR | \fB-L\fR | \fB-P\fR] \fIownersid\fR[:\fIgroupsid\fR] \fIfile\fR...
.fi

.SH 描述
.SS "/usr/bin/chown 和 /usr/xpg4/bin/chown"
.sp
.LP
\fBchown\fR 实用程序可将由每个 \fBfile\fR 指定的文件的用户 \fBID\fR 设置为由 \fIowner\fR 指定的用户 \fBID\fR，也可选择将组 \fBID\fR 设置为由 \fIgroup\fR 指定的值。
.sp
.LP
如果调用 \fBchown\fR 的不是超级用户，则将清除 set-user-\fBID\fR 位。
.sp
.LP
只有某个文件的所有者（或者超级用户）可以更改该文件的所有者。
.sp
.LP
文件系统带有一个挂载点选项 \fBrstchown\fR，用于限制所有权更改。如果启用了该选项，将阻止文件的所有者更改文件的所有者 \fBID\fR。只有超级用户可以任意更改所有者 \fBID\fR，而不受是否启用该选项的限制。
.sp
.LP
\fBchown\fR 可以更改每个文件的所有权，使其归某个所有者所有。可将所有者指定为用户名或数字用户 ID。也可以通过在用户名后面附加 \fB:group\fR 更改每个文件的组所有权，使其归某个组所有。
.SH 选项
.SS "/usr/bin/chown 和 /usr/xpg4/bin/chown"
.sp
.LP
支持以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 6n
.rt  
强制。不报告错误。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 6n
.rt  
如果文件是符号链接，该选项将更改符号链接的所有者。如果不使用该选项，将更改符号链接引用的文件的所有者。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR\fR
.ad
.RS 6n
.rt  
如果在命令行中指定的文件是符号链接且符号链接引用的文件类型是目录，则该选项将更改符号链接引用的目录的所有者，以及文件分层结构中该目录下方所有文件的所有者。如果遍历文件分层结构时遇到符号链接，则将更改目标文件的所有者，但是不执行递归。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fR
.ad
.RS 6n
.rt  
如果文件是符号链接，该选项将更改符号链接引用的文件的所有者。如果在命令行中指定的文件或者遍历文件分层结构时遇到的文件是符号链接且符号链接引用的文件类型是目录，则该选项将更改符号链接引用的目录的所有者，以及文件分层结构中该目录下方所有文件的所有者。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR\fR
.ad
.RS 6n
.rt  
如果在命令行中指定的文件或者遍历文件分层结构时遇到的文件是符号链接，该选项将更改符号链接的所有者。该选项不会跟随符号链接转至文件分层结构的其他任何部分。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
.rt  
所有者和/或组参数为 Windows SID 字符串。该选项要求使用支持存储 SID 的文件系统，例如 ZFS。
.RE

.sp
.LP
指定多个互斥选项 \fB-H\fR、\fB-L\fR 或 \fB-P\fR 不会视为错误。指定的最后一个选项将决定 \fBchown\fR 的行为。
.SS "/usr/bin/chown"
.sp
.LP
支持以下选项： 
.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.RS 6n
.rt  
递归。\fBchown\fR 将在目录和所有子目录中向下延伸，在此过程中设置指定的所有权 \fBID\fR。如果遇到符号链接，除非指定 \fB-h\fR 或 \fB-P\fR 选项，否则将更改目标文件的所有者。但是，除非指定 \fB-H\fR 或 \fB-L\fR 选项，否则不执行递归。
.RE

.SS "/usr/xpg4/bin/chown"
.sp
.LP
支持以下选项： 
.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.RS 6n
.rt  
递归。\fBchown\fR 将在目录和所有子目录中向下延伸，在此过程中设置指定的所有权 \fBID\fR。如果遇到符号链接，除非指定 \fB-h\fR 或 \fB-P\fR 选项，否则将更改目标文件的所有者。除非指定 \fB-H\fR、\fB-L\fR 或 \fB-P\fR 选项，否则 \fB-L\fR 选项将用作缺省模式。
.RE

.SH 操作数
.sp
.LP
支持下列操作数：
.sp
.ne 2
.mk
.na
\fB\fIowner\fR[\fB:\fR\fIgroup\fR]\fR
.ad
.RS 17n
.rt  
要分配给 \fBfile\fR 的用户 \fBID\fR 和可选的组 \fBID\fR。该操作数的 \fIowner\fR 部分必须是用户数据库中的用户名或者数字用户 \fBID\fR。两者均可指定要提供给由 \fIfile\fR 指定的每个文件的用户 \fBID\fR。如果用户数据库中存在数字 \fIowner\fR 作为一个用户名，则与该用户名关联的用户 \fBID\fR 号将用作用户 \fBID\fR。同样，如果该操作数的 \fIgroup\fR 部分存在，它必须是组数据库中的组名称或者数字组 \fBID\fR。两者均可指定要提供给每个文件的组 \fBID\fR。如果组数据库中存在数字 group 操作数作为一个组名称，则与该组名称关联的组 \fBID\fR 号将用作组 \fBID\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fIfile\fR\fR
.ad
.RS 17n
.rt  
要修改其用户 \fBID\fR 的文件的路径名。
.RE

.SH 用法
.sp
.LP
有关 \fBchown\fR 遇到大于或等于 2 GB（2^31 字节）文件时行为的说明，请参见 \fBlargefile\fR(5)。
.SH 示例
.LP
\fB示例 1 \fR更改分层结构中所有文件的所有权
.sp
.LP
以下命令可以更改分层结构中所有文件（包括符号链接，但是不包括链接的目标）的所有权：

.sp
.in +2
.nf
example% \fBchown \(miR \(mih \fIowner\fR[:group] \fIfile\fR...\fR
.fi
.in -2
.sp

.SH 环境变量
.sp
.LP
有关影响 \fBchown\fR 执行的以下环境变量的说明，请参见 \fBenviron\fR(5)：\fBLANG\fR、\fBLC_ALL\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR 和 \fBNLSPATH\fR。
.SH 退出状态
.sp
.LP
将返回以下退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
实用程序成功执行，请求的所有更改都已执行。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
出现错误。
.RE

.SH 文件
.sp
.ne 2
.mk
.na
\fB\fB/etc/passwd\fR\fR
.ad
.RS 15n
.rt  
系统口令文件
.RE

.SH 属性
.sp
.LP
有关下列属性的说明，请参见 \fBattributes\fR(5)：
.SS "/usr/bin/chown"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
_
CSIT{
Enabled（已启用）。请参见“附注”部分。
T}
_
接口稳定性Committed（已确定）
_
标准请参见 \fBstandards\fR(5)。
.TE

.SS "/usr/xpg4/bin/chown"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/xopen/xcu4
_
CSIT{
Enabled（已启用）。请参见\fB\fR“附注”部分。
T}
_
接口稳定性Committed（已确定）
_
标准请参见 \fBstandards\fR(5)。
.TE

.SH 另请参见
.sp
.LP
\fBchgrp\fR(1)、\fBchmod\fR(1)、\fBchown\fR(2)、\fBfpathconf\fR(2)、\fBpasswd\fR(4)、\fBsystem\fR(4)、\fBattributes\fR(5)、\fBenviron\fR(5)、\fBlargefile\fR(5)、\fBstandards\fR(5)
.SH 附注
.sp
.LP
\fBchown\fR 已启用 \fBCSI\fR，但 \fIowner\fR 和 \fIgroup\fR 名称除外。
