Alhadis/Silos/Solaris 11.3/zh_CN.UTF-8/man1/cp.1
'\" te
.\" Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\" Copyright 1989 AT&T
.\" Portions Copyright (c) 2007, 2010, Oracle and/or its affiliates.All rights reserved.
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation.Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/. 
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation.In the following statement, the phrase "this text" refers to portions of the system documentation.Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group.In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document.The original Standard can be obtained online at http://www.opengroup.org/unix/online.html.This notice shall appear on any product containing this material. 
.TH cp 1 "2010 年 11 月 19 日" "SunOS 5.11" "用户命令"
.SH 名称
cp \- 复制文件
.SH 用法概要
.LP
.nf
\fB/usr/bin/cp\fR [\fB-fip@/\fR] \fIsource_file\fR \fItarget_file\fR
.fi

.LP
.nf
\fB/usr/bin/cp\fR [\fB-fip@/\fR] \fIsource_file\fR... \fItarget\fR
.fi

.LP
.nf
\fB/usr/bin/cp\fR \fB-r\fR | \fB-R\fR [\fB-H\fR | \fB-L\fR | \fB-P\fR] [\fB-fip@/\fR] \fIsource_dir\fR... \fItarget\fR
.fi

.LP
.nf
\fB/usr/bin/cp\fR \fB-R\fR | \fB-R\fR [\fB-H\fR | \fB-L\fR | \fB-P\fR] [\fB-fip@/\fR] \fIsource_dir\fR... \fItarget\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/cp\fR [\fB-fip@/\fR] \fIsource_file\fR \fItarget_file\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/cp\fR [\fB-fip@/\fR] \fIsource_file\fR... \fItarget\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/cp\fR \fB-r\fR | \fB-R\fR [\fB-H\fR | \fB-L\fR | \fB-P\fR] [\fB-fip@/\fR] \fIsource_dir\fR... \fItarget\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/cp\fR \fB-R\fR | \fB-R\fR [\fB-H\fR | \fB-L\fR | \fB-P\fR] [\fB-fip@/\fR] \fIsource_dir\fR... \fItarget\fR
.fi

.SH 描述
.sp
.LP
在第一种用法概要形式中，\fIsource_file\fR 和 \fItarget_file\fR 都不是目录文件，两者名称不能相同。\fBcp\fR 实用程序可将 \fIsource_file\fR 的内容复制到 \fItarget_file\fR 指定的目标路径。如果 \fItarget_file\fR 存在，\fBcp\fR 将覆盖其内容，但是与其关联的模式（和 \fBACL\fR，如果适用）、所有者和组不会改变。将 \fItarget_file\fR 的上次修改时间和 \fIsource_file\fR 的上次访问时间设置为执行复制的时间。如果 \fItarget_file\fR 不存在，\fBcp\fR 将创建一个名为 \fItarget_file\fR 的新文件，使其模式与 \fIsource_file\fR 相同，但除非用户是超级用户，否则不设置 sticky 位。在这种情况下，除非为包含新建文件的目录设置 setgid 位，否则 \fItarget_file\fR 的所有者和组即为用户的所有者和组。如果设置了目录的 setgid 位，则新建文件的组是包含该文件的目录的组而非创建该文件的用户的组。如果 \fItarget_file\fR 是指向另一个文件的链接，\fBcp\fR 将以 \fIsource_file\fR 的内容覆盖链接目标；\fItarget_file\fR 中的链接保持不变。
.sp
.LP
在第二种用法概要形式中，将一个或多个 \fIsource_file\fR 复制到 \fItarget\fR 指定的目录。如果 \fItarget\fR 不存在或不是目录，而某个 \fIsource_file\fR 的文件类型是目录，则会出现错误。
.sp
.LP
在第三种或第四种用法概要形式中，将 \fIsource_dir\fR 指定的一个或多个目录复制到 \fItarget\fR 指定的目录。必须指定 \fB-r\fR 或 \fB-R\fR。对于每个 \fIsource_dir\fR，\fBcp\fR 将复制所有文件和子目录。
.SH 选项
.sp
.LP
\fB/usr/bin/cp\fR 和 \fB/usr/xpg4/bin/cp\fR 均支持以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 6n
.rt  
解除链接。如果无法获取目标文件的文件描述符，该选项将尝试解除目标文件的链接并继续。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR\fR
.ad
.RS 6n
.rt  
根据指定为 \fIsource_file\fR 操作数的任何符号链接引用的文件的类型和内容执行操作。
.sp
如果 \fIsource_file\fR 操作数是符号链接，则 \fBcp\fR 将复制 \fIsource_file\fR 操作数的符号链接引用的文件。遍历文件分层结构期间遇到的其他所有符号链接都将保留。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.RS 6n
.rt  
交互。每当复制操作要覆盖现有目标时，\fBcp\fR 都会提示用户确认。无论是否从终端输入，都会执行该操作。如果提示确认失败，等效于用户答复否定。肯定性响应意味着应该继续复制。其他任何答复都会阻止 \fBcp\fR 覆盖 \fItarget\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fR
.ad
.RS 6n
.rt  
根据指定为 \fIsource_file\fR 操作数的任何符号链接或遍历文件分层结构期间遇到的任何符号链接引用的文件的类型和内容执行操作。
.sp
复制符号链接引用的文件。遍历文件分层结构期间遇到的符号链接不予保留。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.RS 6n
.rt  
保留。\fBcp\fR 实用程序不仅复制 \fIsource_file\fR 的内容，而且还尝试保留其 ACL、访问和修改时间、扩展属性、扩展系统属性、文件模式以及所有者和组 ID。 
.sp
如果 \fBcp\fR 无法保留访问和修改时间、扩展属性或文件模式，\fBcp\fR 不会视为操作失败。如果 \fBcp\fR 无法保留所有者和组 ID，复制操作不算失败，但 \fBcp\fR 会无提示地将 \fBS_ISUID\fR 和 \fBS_ISGID\fR 位从目标的文件模式中清除。如果 \fBcp\fR 无法清除这些位，则复制失败。如果 \fBcp\fR 无法保留 ACL 或扩展系统属性，则复制失败。如果复制失败，则会将诊断消息写入 \fBstderr\fR，然后（在其余所有操作数处理完成后）\fBcp\fR 以\fB非零\fR状态退出。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR\fR
.ad
.RS 6n
.rt  
针对指定为 \fIsource_file\fR 操作数的任何符号链接或遍历文件分层结构期间遇到的任何符号链接执行操作。
.sp
复制符号链接。遍历文件分层结构期间遇到的符号链接予以保留。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.RS 6n
.rt  
递归。\fBcp\fR 会将目录及其所有文件（包括所有子目录及其文件）复制到 \fItarget\fR。除非指定 \fB-H\fR、\fB-L\fR 或 \fB-P\fR 选项，否则 \fB-L\fR 选项将用作缺省模式。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.RS 6n
.rt  
与 \fB-r\fR 相同，但复制管道而不是从其读取。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-@\fR\fR
.ad
.RS 6n
.rt  
保留扩展属性。\fBcp\fR 将尝试将源文件的所有扩展属性连同文件数据复制到目标文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-/\fR\fR
.ad
.RS 6n
.rt  
保留扩展属性和扩展系统属性。\fBcp\fR 实用程序将尝试将每个源文件的扩展属性和扩展系统属性，以及与扩展属性关联的扩展系统属性连同文件数据复制到目标文件。如果 \fBcp\fR 无法复制扩展属性或扩展系统属性，则会将诊断消息写入 \fBstderr\fR，然后（在其余所有操作数处理完成后）以\fB非零\fR状态退出。 
.RE

.sp
.LP
指定多个互斥选项 \fB-H\fR、\fB-L\fR 和 \fB-P\fR 不会视为错误。指定的最后一个选项将决定实用程序的行为。
.SS "/usr/bin/cp"
.sp
.LP
如果在指定 \fB-p\fR 选项的同时也指定 \fB-@\fR 选项或 \fB-/\fR 选项，则 \fB/usr/bin/cp\fR 行为方式如下：
.RS +4
.TP
.ie t \(bu
.el o
\fB-p\fR 和 \fB-@\fR 都以任意顺序指定时，如果无法复制扩展属性，则复制失败。
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB-p\fR 和 \fB-/\fR 都以任意顺序指定时，如果无法复制扩展系统属性，则复制失败。
.RE
.SS "/usr/xpg4/bin/cp"
.sp
.LP
如果在指定 \fB-p\fR 选项的同时也指定 \fB-@\fR 选项或 \fB-/\fR 选项，则 /\fBusr/xpg4/bin/cp\fR 行为方式如下：
.RS +4
.TP
.ie t \(bu
.el o
同时指定 \fB-p\fR 和 \fB-@\fR 时，如果无法保留扩展属性，指定的最后一个选项将决定复制是否失败。
.RE
.RS +4
.TP
.ie t \(bu
.el o
同时指定 \fB-p\fR 和 \fB-/\fR 时，如果无法保留扩展系统属性，指定的最后一个选项将决定复制是否失败。
.RE
.SH 操作数
.sp
.LP
支持下列操作数：
.sp
.ne 2
.mk
.na
\fB\fIsource_file\fR\fR
.ad
.RS 15n
.rt  
要复制的正规文件的路径名。
.RE

.sp
.ne 2
.mk
.na
\fB\fIsource_dir\fR\fR
.ad
.RS 15n
.rt  
要复制的目录的路径名。
.RE

.sp
.ne 2
.mk
.na
\fB\fItarget_file\fR\fR
.ad
.RS 15n
.rt  
现有或不存在的文件的路径名，在复制单个文件时用于输出。
.RE

.sp
.ne 2
.mk
.na
\fB\fItarget\fR\fR
.ad
.RS 15n
.rt  
要包含复制的文件的目录的路径名。
.RE

.SH 用法
.sp
.LP
有关 \fBcp\fR 遇到大于或等于 2 GB（2^31 字节）文件时行为的说明，请参见 \fBlargefile\fR(5)。
.SH 示例
.LP
\fB示例 1 \fR复制文件
.sp
.LP
以下命令将复制文件： 

.sp
.in +2
.nf
example% cp goodies goodies.old

example% ls goodies*
goodies goodies.old
.fi
.in -2
.sp

.LP
\fB示例 2 \fR复制文件列表
.sp
.LP
以下命令会将文件列表复制到目标目录：

.sp
.in +2
.nf
example% cp ~/src/* /tmp
.fi
.in -2
.sp

.LP
\fB示例 3 \fR复制目录
.sp
.LP
以下命令首先将目录复制到新目标目录，然后将其复制到现有目标目录

.sp
.in +2
.nf
example% ls ~/bkup
/usr/example/fred/bkup not found

example% cp \fB-r\fR ~/src ~/bkup

example% ls \fB-R\fR ~/bkup
x.c y.c z.sh

example% cp \fB-r\fR ~/src ~/bkup

example% ls \fB-R\fR ~/bkup
src x.c y.c z.sh
src:
x.c y.c z.s
.fi
.in -2
.sp

.LP
\fB示例 4 \fR复制扩展文件系统属性
.sp
.LP
以下命令将复制扩展文件系统属性：

.sp
.in +2
.nf
$ ls -/ c file1
-rw-r--r--   1 foo   staff          0 Oct 29 20:04 file1
                {AH-----m--}

$ cp -/ file1 file2
$ ls -/c file2
-rw-r--r--   1 foo  staff          0 Oct 29 20:17 file2
                {AH-----m--}
.fi
.in -2
.sp

.LP
\fB示例 5 \fR无法复制扩展系统属性
.sp
.LP
以下命令将无法复制扩展系统属性：

.sp
.in +2
.nf
$ ls -/c file1
-rw-r--r--   1 foo    staff          0 Oct 29 20:04 file1
                {AH-----m--}

$ cp -/ file1 /tmp         
cp: Failed to copy extended system attributes from file1 to /tmp/file1


$ ls -/c /tmp/file1
-rw-r--r--   1 foo    staff          0 Oct 29 20:09 /tmp/file1
                {}
.fi
.in -2
.sp

.SH 环境变量
.sp
.LP
有关影响 \fBcp\fR 执行的以下环境变量的说明，请参见 \fBenviron\fR(5)：\fBLANG\fR、\fBLC_ALL\fR、\fBLC_COLLATE\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR 和 \fBNLSPATH\fR。
.sp
.LP
肯定的回答使用为用户语言环境中 \fBLC_MESSAGES\fR 类别的 \fByesexpr\fR 关键字定义的扩展正则表达式进行处理。\fBLC_COLLATE\fR 类别中指定的语言环境定义为 \fByesexpr\fR 定义的表达式中使用的范围、等效类和多字符整理元素的行为。\fBLC_CTYPE\fR 中指定的语言环境确定文本数据字符字节序列解释的语言环境，以及为 \fByesexpr\fR 定义的表达式中使用的字符类的行为。请参见 \fBlocale\fR(5)。
.SH 退出状态
.sp
.LP
将返回以下退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
所有文件都已成功复制。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
出现错误。
.RE

.SH 属性
.sp
.LP
有关下列属性的说明，请参见 \fBattributes\fR(5)：
.SS "/usr/bin/cp"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
_
CSIEnabled（已启用）
_
接口稳定性Committed（已确定）
.TE

.SS "/usr/xpg4/bin/cp"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/xopen/xcu4
_
CSIEnabled（已启用）
_
接口稳定性Committed（已确定）
.TE

.SH 另请参见
.sp
.LP
\fBchmod\fR(1)、\fBchown\fR(1)、\fBsetfacl\fR(1)、\fButime\fR(2)、\fBfgetattr\fR(3C)、\fBattributes\fR(5)、\fBenviron\fR(5)、\fBfsattr\fR(5)、\fBlargefile\fR(5)、\fBlocale\fR(5)、\fBstandards\fR(5)
.SH 附注
.sp
.LP
源文件的权限模式将在副本中保留。
.sp
.LP
用户可以使用 \fB--\fR 显式标记任何命令行选项的结束，以使 \fBcp\fR 能够识别以 \fB-\fR 开头的文件名参数。
