Alhadis/Silos/Solaris 11.3/zh_CN.UTF-8/man1/du.1
'\" te
.\" Copyright (c) 1992, X/Open Company Limited.All Rights Reserved.
.\" Portions Copyright (c)2007, Sun Microsystems, Inc. All Rights Reserved.
.\"  Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation.Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation.In the following statement, the phrase"this text" refers to portions of the system documentation.Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group.In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard,the original IEEE and The Open Group Standard is the referee document.The original Standard can be obtained online at http://www.opengroup.org/unix/online.html.This notice shall appear on any product containing this material. 
.TH du 1 "2007 年 2 月 6 日" "SunOS 5.11" "用户命令"
.SH 名称
du \- 汇总磁盘使用情况
.SH 用法概要
.LP
.nf
\fB/usr/bin/du\fR [\fB-dorx\fR] [\fB-a\fR | \fB-s\fR] [\fB-h\fR | \fB-k\fR | \fB-m\fR] [\fB-H\fR | \fB-L\fR] 
     [\fIfile\fR ...]
.fi

.LP
.nf
\fB/usr/xpg4/bin/du\fR [\fB-dorx\fR] [\fB-a\fR | \fB-s\fR] [\fB-h\fR | \fB-k\fR | \fB-m\fR] [\fB-H\fR | \fB-L\fR] 
     [\fIfile\fR ...]
.fi

.SH 描述
.sp
.LP
\fBdu\fR 实用程序向标准输出写入分配给以每个指定文件为根的文件分层结构及其每个子目录的文件空间大小。分配给目录类型的文件的文件空间大小定义为分配给以该目录为根的文件分层结构中所有文件的空间与分配给该目录本身的空间之和。此和将包括分配给所遇到的任何扩展属性的空间。
.sp
.LP
具有多个链接的文件只计为和写作一个条目。未指定在报告中选择的目录条目。缺省情况下，文件大小以 512 字节为单位写入，舍入到下一个 512 字节单位。
.SS "/usr/xpg4/bin/du"
.sp
.LP
当 \fBdu\fR 无法获取文件属性或读取目录时（请参见 \fBstat\fR(2)），它将报告错误情况并且最终退出状态将受影响。
.SH 选项
.sp
.LP
\fB/usr/bin/du\fR 和 \fB/usr/xpg4/bin/du\fR 支持以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 6n
.rt  
除了缺省输出之外，还将报告以指定文件为根的文件分层结构中每个非目录类型的文件的大小。无论是否指定了 \fB-a\fR 选项，都始终列出作为 \fIfile\fR 操作数指定的非目录。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 6n
.rt  
不跨越文件系统边界。例如，命令 \fBdu -d /\fR 仅报告根分区上的使用情况。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 6n
.rt  
所有大小将调整为用户可读的格式，例如 \fB14K\fR、\fB234M\fR、\fB2.7G\fR 或 \fB3.0T\fR。调整是通过反复除以 \fB1024\fR 完成的。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR\fR
.ad
.RS 6n
.rt  
如果在命令行上指定了目录的符号链接，则将使用符号链接引用的目录而非链接本身来处理符号链接。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR\fR
.ad
.RS 6n
.rt  
以 1024 字节为单位而非缺省的 512 字节单位写入文件大小。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fR
.ad
.RS 6n
.rt  
使用符号链接引用的文件或目录而非链接本身处理符号链接。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.RS 6n
.rt  
以 MB 为单位而非缺省的 512 字节单位写入文件大小。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR\fR
.ad
.RS 6n
.rt  
不将子目录的使用量加到父目录的总和中。未指定此选项时，为某个特定目录列出的使用量是该目录中的文件以及该目录下的所有目录中的文件占用的空间。如果使用了 \fB-s\fR，则此选项不起作用。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.RS 6n
.rt  
为无法获取其状态的不可读取的目录和文件生成诊断消息。如果出现这些情况并且未指定 \fB-r\fR，则 /usr/bin/du 以无提示模式运行。\fB/usr/xpg4/bin/du\fR 的行为将如同始终指定了 \fB-r\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
.rt  
仅报告每个指定文件的总和，而非生成缺省输出。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.RS 6n
.rt  
在计算文件大小时，仅计算与由 file 操作数指定的文件具有相同设备的那些文件。 
.RE

.sp
.LP
指定互斥对 \fB-H\fR 和 \fB-L\fR 中的多个选项不会被视为错误。指定的最后一个选项决定了输出格式。
.sp
.LP
指定选项互斥集 \fB-h\fR、\fB-k\fR 和 \fB-m\fR 中的多个选项不会被视为错误。指定的最后一个选项决定了输出格式。
.SH 操作数
.sp
.LP
支持下列操作数：
.sp
.ne 2
.mk
.na
\fB\fIfile\fR\fR
.ad
.RS 8n
.rt  
要写入其大小的文件的路径名。如果未指定 \fIfile\fR，则将使用当前目录。
.RE

.SH 输出
.sp
.LP
\fBdu\fR 的输出包括分配给文件和文件名的空间量。
.SH 用法
.sp
.LP
有关 \fBdu\fR 遇到大于或等于 2 GB（2^ 31 字节）文件时行为的说明，请参见 \fBlargefile\fR(5)。
.SH 环境变量
.sp
.LP
有关影响 \fBdu\fR 执行的以下环境变量的说明，请参见 \fBenviron\fR(5)：\fBLANG\fR、\fBLC_ALL\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR 和 \fBNLSPATH\fR。
.SH 退出状态
.sp
.LP
将返回以下退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
成功完成。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fI\fR\fR
.ad
.RS 6n
.rt  
出现错误。
.RE

.SH 属性
.sp
.LP
有关下列属性的说明，请参见 \fBattributes\fR(5)：
.SS "/usr/bin/du"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
_
CSIEnabled（已启用）
_
接口稳定性Committed（已确定）
.TE

.SS "/usr/xpg4/bin/du"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/xopen/xcu4
_
CSIEnabled（已启用）
_
接口稳定性Standard（标准）
.TE

.SH 另请参见
.sp
.LP
\fBls\fR(1)、\fBstat\fR(2)、\fBattributes\fR(5)、\fBenviron\fR(5)、\fBfsattr\fR(5)、\fBlargefile\fR(5)、\fBstandards\fR(5)
.sp
.LP
\fIIntroduction to Oracle Solaris 11.3                 Administration\fR
.SH 附注
.sp
.LP
具有两个或多个链接的文件只计入一次。不过，如果目录位于文件系统分层结构的不同分支中并且在这些不同的目录中存在文件间链接，则 \fBdu\fR 会多次计入额外的文件。
.sp
.LP
包含漏洞的文件将导致不正确的块计数。
