Alhadis/Silos/Solaris 11.3/zh_CN.UTF-8/man1/ls.1
'\" te
.\" Copyright 1989 AT&T
.\" Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\" Portions Copyright (c) 2009, 2013, Oracle and/or its affiliates.All rights reserved.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation.In the following statement, the phrase "this text" refers to portions of the system documentation.Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group.In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document.The original Standard can be obtained online at http://www.opengroup.org/unix/online.html.This notice shall appear on any product containing this material. 
.TH ls 1 "2013 年 11 月 20 日" "SunOS 5.11" "用户命令"
.SH 名称
ls \- 列出目录内容
.SH 用法概要
.LP
.nf
\fB/usr/bin/ls\fR [\fB-aAbcCdeEfFghHiklLmnopqrRsStuUwvVx1@\fR] 
     [\fB-/ c\fR | \fB-/v\fR] [\fB-% atime | crtime | ctime | mtime | all\fR]
     [--block-size size] [--color[=\fIwhen\fR]] [--file-type] 
     [--si] [--time-style \fIstyle\fR] [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/xpg4/bin/ls\fR [\fB-aAbcCdeEfFghHiklLmnopqrRsStuUwvVx1@\fR] 
     [\fB-/ c\fR | \fB-/v\fR] [\fB-% atime | crtime | ctime | mtime | all\fR]
     [--block-size size] [--color[=\fIwhen\fR]] [--file-type] 
     [--si] [--time-style \fIstyle\fR] [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/xpg6/bin/ls\fR [\fB-aAbcCdeEfFghHiklLmnopqrRsStuUwvVx1@\fR] 
     [\fB-/ c\fR | \fB-/v\fR] [\fB-% atime | crtime | ctime | mtime | all\fR]
     [--block-size size] [--color[=\fIwhen\fR]] [--file-type] 
     [--si] [--time-style \fIstyle\fR] [\fIfile\fR]...
.fi

.SH 描述
.sp
.LP
如果 \fIfile\fR 是一个目录，则 \fBls\fR 会列出该目录的内容。如果 \fIfile\fR 是一个普通文件，则 \fBls\fR 会复制其名称和所请求的所有其他信息。缺省情况下，输出按字母顺序排序。如果未给定任何参数，则会列出当前目录 (\fB\&.\fR)。如果给定了多个参数，则这些参数会先适当进行排序，但是文件参数会显示在目录及其内容之前。
.sp
.LP
有三种主要列表格式。对于定向到终端的输出，其缺省格式为多列条目，按列纵向排序。\fB-1\fR 选项允许单列输出，而 \fB-m\fR 支持流输出格式。为了确定 \fB-C\fR、\fB-x\fR 和 \fB-m\fR 选项的输出格式，\fBls\fR 会使用环境变量 \fBCOLUMNS\fR 确定单个输出行上可用字符位置的数量。如果未设置此变量，则会使用 \fBterminfo\fR(4) 数据库基于环境变量 \fBTERM\fR 来确定列数。如果无法获取此信息，则假定有 80 列。如果使用了 \fB-w\fR 选项，则该参数会覆盖所有其他列宽。
.sp
.LP
\fB-e\fR、\fB-E\fR、\fB-g\fR、\fB-l\fR、\fB-n\fR、\fB-o\fR、\fB-v\fR、\fB-V\fR 或 \fB-@\fR 选项有效时，输出模式包含十一个字符。第一个字符可以是以下字符之一：
.sp
.ne 2
.mk
.na
\fB\fBd\fR\fR
.ad
.sp .6
.RS 4n
该条目是一个目录。
.RE

.sp
.ne 2
.mk
.na
\fB\fBD\fR\fR
.ad
.sp .6
.RS 4n
该条目是一个门文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fBl\fR\fR
.ad
.sp .6
.RS 4n
该条目是一个符号链接。
.RE

.sp
.ne 2
.mk
.na
\fB\fBb\fR\fR
.ad
.sp .6
.RS 4n
该条目是一个块特殊文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fBc\fR\fR
.ad
.sp .6
.RS 4n
该条目是一个字符特殊文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fBp\fR\fR
.ad
.sp .6
.RS 4n
该条目是一个 \fBFIFO\fR（或“命名管道”）特殊文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fBP\fR\fR
.ad
.sp .6
.RS 4n
该条目是一个事件端口。
.RE

.sp
.ne 2
.mk
.na
\fB\fBs\fR\fR
.ad
.sp .6
.RS 4n
该条目是一个 \fBAF_UNIX\fR 地址族套接字。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-\fR\fR
.ad
.sp .6
.RS 4n
该条目是一个普通文件。
.RE

.sp
.LP
后面的 9 个字符解释为三组，每组三位字符。第一组指的是所有者的权限；下一组指的是文件的用户组中其他用户的权限；最后一组指的是所有其他用户。在每个组中，三个字符分别表示对文件进行读取、写入和作为程序来执行的权限。对于目录，\fBexecute\fR 权限解释为在目录中搜索所指定文件的权限。权限后面的字符为 ACL 或扩展属性指示符。如果有扩展属性与该文件关联并且 \fB-@\fR 选项有效，则此字符为 \fB@\fR。否则，如果有一个非普通 ACL 或空格字符与该文件关联，则此字符为加号 (\fB+\fR) 字符。
.sp
.LP
如果 \fB-/\fR 和/或 \fB-%\fR 有效，则在文件系统支持扩展系统属性时会输出扩展系统属性。显示内容如下所示： 
.sp
.in +2
.nf
$ls -/ c  file   
-rw-r--r--   1 root     root           0 May 10 14:17 file
                {AHRSadim-u}

$ls -/ v file
-rw-r--r--   1 root     root           0 May 10 14:17 file
                {archive,hidden,readonly,system,appendonly\e
                 nodump,immutable, av_modified,\e
                 noav_quarantined,nounlink}

$ls -l -% all file
-rw-r--r--   1 root     root           0 May 10 14:17 file
                timestamp: atime    Jun 25 12:56:44 2007
                timestamp: ctime    May 10 14:20:23 2007
                timestamp: mtime    May 10 14:17:56 2007
                timestamp: crtime   May 10 14:17:56 2007
.fi
.in -2
.sp

.sp
.LP
有关详细信息，请参见 \fB-/\fR 和 \fB-%\fR 选项的选项说明。 
.sp
.LP
对于 POSIX 语言环境，\fBls\fR \fB-l\fR（长列表）可列显其输出，如下所示：
.sp
.in +2
.nf
-rwxrwxrwx+ 1 smith dev   10876  May 16 9:42 part2
.fi
.in -2
.sp

.sp
.LP
如果从左向右进行读取，您会看到当前目录包含一个名为 \fBpart2\fR 的文件。并且，上次修改文件内容的时间为\fB5 月 16 日\fR的 \fB上午 9:42\fR。该文件包含 10,876 个字符或字节。该文件的所有者（或用户）属于组 \fBdev\fR（可能表示\fB开发\fR），并且该所有者的登录名为 \fBsmith\fR。数字（此例中为 \fB1\fR）表示指向文件 \fBpart2\fR 的链接数（请参见 \fBcp\fR(1)）。加号表示存在与文件关联的 \fBACL\fR。如果指定了 \fB-@\fR 选项，则扩展属性会取代 \fBACL\fR，并且加号会用 'at' 符号 (\fB@\fR) 替换。最后，短划线和字母说明用户、组和其他用户具有读取、写入和执行 \fBpart2\fR 的权限。
.sp
.LP
执行 (\fBx\fR) 符号占用三字符序列的第三个位置。如果第三个位置是 \fB-\fR，则表示拒绝执行权限。
.sp
.LP
各种权限如下所示：
.sp
.ne 2
.mk
.na
\fB\fBr\fR\fR
.ad
.RS 5n
.rt  
该文件是可读取的。
.RE

.sp
.ne 2
.mk
.na
\fB\fBw\fR\fR
.ad
.RS 5n
.rt  
该文件是可写入的。
.RE

.sp
.ne 2
.mk
.na
\fB\fBx\fR\fR
.ad
.RS 5n
.rt  
该文件是可执行的。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-\fR\fR
.ad
.RS 5n
.rt  
\fI未\fR授予所指示的权限。
.RE

.sp
.ne 2
.mk
.na
\fB\fBs\fR\fR
.ad
.RS 5n
.rt  
\fBs\fRet-user-ID 或 \fBs\fRet-group-ID 位已启用，对应的用户或组执行位也已启用。
.RE

.sp
.ne 2
.mk
.na
\fB\fBS\fR\fR
.ad
.RS 5n
.rt  
未定义位状态（set-user-ID 或 set-group-id 位已启用，而用户或组执行位已关闭）。对于组权限，这仅适用于非常规文件。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBt\fR\fR
.ad
.RS 5n
.rt  
1000（八进制）位（或 sticky 位）已启用（请参见 \fBchmod\fR(1)），执行也已启用。
.RE

.sp
.ne 2
.mk
.na
\fB\fBT\fR\fR
.ad
.RS 5n
.rt  
1000 位已启用，执行已关闭（未定义位状态）。
.RE

.SS "/usr/bin/ls"
.sp
.ne 2
.mk
.na
\fB\fBl\fR\fR
.ad
.RS 5n
.rt  
访问期间会发生强制锁定（在常规文件中，set-group-ID 位已启用而组执行位已关闭）。 
.RE

.SS "/usr/xpg4/bin/ls 和 /usr/xpg6/bin/ls"
.sp
.ne 2
.mk
.na
\fB\fBL\fR\fR
.ad
.RS 5n
.rt  
访问期间会发生强制锁定（在常规文件中，set-group-ID 位已启用而组执行位已关闭）。 
.RE

.sp
.LP
对于用户和组权限，第三个位置有时由某个字符（不是 \fBx\fR 或 \fB-\fR）占用。\fBs\fR 或 \fBS\fR 也可以占用此位置，表示 set-ID 位的状态（无论这是用户的 ID 还是组的 ID）。在登录过程中，会使用假定与执行时的用户具有相同 ID 的功能，例如，在您最开始以 root 用户身份执行操作，但需要假定登录用户身份的情况下。
.sp
.LP
如果使用组权限序列，则 \fBl\fR 可以占用第三个位置。\fBl\fR 指的是强制性文件和记录锁定。此权限指明了一个文件允许其他文件在访问期间锁定其读取或写入权限的功能。
.sp
.LP
对于其他权限，第三个位置可以由 \fBt\fR 或 \fBT\fR 占用。这些字符指的是 sticky 位和执行权限的状态。
.SH 选项
.sp
.LP
支持以下选项：
.SS "/usr/bin/ls、/usr/xpg4/bin/ls 和 /usr/xpg6/bin/ls"
.sp
.LP
所有三个版本均支持以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.br
.na
\fB\fB--all\fR\fR
.ad
.sp .6
.RS 4n
列出所有条目，包括通常不会列出的以点 (\fB\&.\fR) 开头的条目。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-A\fR\fR
.ad
.br
.na
\fB\fB--almost-all\fR\fR
.ad
.sp .6
.RS 4n
列出所有条目，包括以点 (\fB\&.\fR) 开头的条目，但工作目录 (\fB\&.\fR) 和父目录 (\fB\&..\fR) 除外。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-b\fR\fR
.ad
.br
.na
\fB\fB--escape\fR\fR
.ad
.sp .6
.RS 4n
强制在列显不可列显字符时使用八进制 \fB\\fR\fIddd\fR 表示法。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-B\fR\fR
.ad
.br
.na
\fB\fB--ignore-backups\fR\fR
.ad
.sp .6
.RS 4n
不显示任何以波浪号 (\fB~\fR) 结尾的文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.sp .6
.RS 4n
使用 i 节点（创建的文件、更改的模式等）上次修改的时间以进行排序 (\fB-t\fR) 或输出（\fB-l\fR 或 \fB-n\fR）。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR\fR
.ad
.sp .6
.RS 4n
多列输出，条目按列纵向排序。这是缺省输出格式。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
如果参数是一个目录，则仅会列出其名称（而不是其内容）。通常与 \fB-l\fR 配合使用以获取目录的状态。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.sp .6
.RS 4n
与 \fB-l\fR 相同，但时间可显示到秒，并且不论其存在时间长短，所有文件只有一个格式：\fImmm dd hh:mm:ss yyyy\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-E\fR\fR
.ad
.sp .6
.RS 4n
与 \fB-l\fR 相同，但时间可显示到纳秒，并且不论其存在时间长短，所有文件只有一个格式：\fIyyyy-mm-dd hh:mm:ss.nnnnnnnnn\fR（ISO 8601:2000 格式）。 
.sp
此外，此选项还可以按 ISO 8601:2000 标准格式（+\fIhhmm\fR 或 -\fIhhmm\fR）显示与 UTC 的时差，或者，如果时差不可确定，则不显示任何字符。时差反映当前时区下在文件所显示的日期和时间中有效的相应标准或备用时差。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
强制将每个参数解释为目录，并列出在每个插槽中找到的名称。此选项可关闭 \fB-l\fR、\fB-t\fR、\fB-s\fR、\fB-S\fR 和 \fB-r\fR，然后打开 \fB-a\fR。其顺序是条目在目录中出现的顺序。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR\fR
.ad
.br
.na
\fB\fB--classify\fR\fR
.ad
.sp .6
.RS 4n
在某些类型的文件后附加符号以指示文件类型。使用以下符号：
.sp
.ne 2
.mk
.na
\fB\fB/\fR\fR
.ad
.RS 5n
.rt  
目录
.RE

.sp
.ne 2
.mk
.na
\fB\fB>\fR\fR
.ad
.RS 5n
.rt  
门文件
.RE

.sp
.ne 2
.mk
.na
\fB\fB|\fR\fR
.ad
.RS 5n
.rt  
命名管道 (\fBFIFO\fR)
.RE

.sp
.ne 2
.mk
.na
\fB\fB@\fR\fR
.ad
.RS 5n
.rt  
符号链接
.RE

.sp
.ne 2
.mk
.na
\fB\fB=\fR\fR
.ad
.RS 5n
.rt  
套接字
.RE

.sp
.ne 2
.mk
.na
\fB\fB*\fR\fR
.ad
.RS 5n
.rt  
可执行文件
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR\fR
.ad
.sp .6
.RS 4n
与 \fB-l\fR 相同，但不输出所有者。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.br
.na
\fB\fB--human-readable\fR\fR
.ad
.sp .6
.RS 4n
所有大小将调整为用户可读的格式，例如 \fB14K\fR、\fB234M\fR、\fB2.7G\fR 或 \fB3.0T\fR。调整是通过反复除以 \fB1024\fR 完成的。最后一个 --si 或 -h 选项可确定所使用的除数。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR\fR
.ad
.br
.na
\fB\fB--dereference-command-line\fR\fR
.ad
.sp .6
.RS 4n
如果参数是一个引用了目录的符号链接，则此选项会计算该链接所引用目录的文件信息和文件类型，而不是链接本身的文件信息和类型。但是，会显示链接的名称，而不是显示引用的目录。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.br
.na
\fB\fB--inode\fR\fR
.ad
.sp .6
.RS 4n
对于每个文件，会在报告的第一列输出 i 节点数量。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR\fR
.ad
.sp .6
.RS 4n
所有大小均以 KB 为单位进行输出。等效于 --block-size=1024。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
以长格式列出每个文件的模式、\fBACL\fR 指示、链接数、所有者、组、大小（以字节为单位）和上次修改的时间（请参见上文）。如果文件是一个特殊文件，则大小字段将改为包含主设备号和从设备号。如果上次修改的时间早于六个月之前，则对于 POSIX 语言环境，该时间会显示为“月 日 年”格式。如果 \fBLC_TIME\fR 语言环境类别未设置为 POSIX 语言环境，则可使用其他格式的时间字段。对于在六个月内修改的文件，时间显示为“月 日期 时间”格式。如果文件是一个符号链接，则输出的文件名后跟 “\fB->\fR” 和所引用文件的路径名。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fR
.ad
.br
.na
\fB\fB--dereference\fR\fR
.ad
.sp .6
.RS 4n
如果参数是一个符号链接，则此选项会计算该链接所引用文件或目录的文件信息和文件类型，而不是链接本身的文件信息和类型。但是，会显示链接的名称，而不是显示引用的文件或目录。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.sp .6
.RS 4n
流输出格式。文件在整个页面上列出，用逗号分隔。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.br
.na
\fB\fB--numeric-uid-gid\fR\fR
.ad
.sp .6
.RS 4n
与 \fB-l\fR 相同，但是会输出所有者的 \fBUID\fR 和组的 \fBGID\fR 号，而不是关联的字符串。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR\fR
.ad
.br
.na
\fB\fB--no-group\fR\fR
.ad
.sp .6
.RS 4n
与 \fB-l\fR 相同，但不输出组。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
如果文件是一个目录，则在每个文件名后面添加一个斜杠 (\fB/\fR)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR\fR
.ad
.br
.na
\fB\fB--hide-control-chars\fR\fR
.ad
.sp .6
.RS 4n
强制将文件名中不可列显字符列显为问号字符 (\fB?\fR)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.br
.na
\fB\fB--reverse\fR\fR
.ad
.sp .6
.RS 4n
颠倒排序顺序，以根据需要实现按字母顺序反向排序、按时间先后排序或按文件大小从小到大排序。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.br
.na
\fB\fB--recursive\fR\fR
.ad
.sp .6
.RS 4n
递归列出遇到的子目录。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.br
.na
\fB\fB--size\fR\fR
.ad
.sp .6
.RS 4n
表示显示的每个文件所占用的文件系统块的总数量。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR\fR
.ad
.sp .6
.RS 4n
按文件大小排序（降序），大小相同的文件则按文件名排序（按字母顺序升序），而不是仅按名称排序。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.sp .6
.RS 4n
按时间戳（最近的时间在前）而不是按名称排序。缺省值为上次修改时间。请参见 \fB-c\fR、\fB-u\fR 和 \fB-%\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.sp .6
.RS 4n
使用上次访问的时间而不是上次修改的时间进行排序（通过 \fB-t\fR 选项）或输出（通过 \fB-l\fR 选项）。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-U\fR\fR
.ad
.sp .6
.RS 4n
输出不排序。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
与 \fB-l\fR 相同，但会显示详细的 ACL 信息以及 \fB-l\fR 输出。即使文件或目录没有 ACL 也会显示 ACL 信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR\fR
.ad
.sp .6
.RS 4n
与 \fB-l\fR 相同，但会在 \fB-l\fR 输出之后显示精简的 ACL 信息。 
.sp
\fB-V\fR 选项仅适用于支持 NFSv4 ACL 的文件系统，如 Solaris ZFS 文件系统。
.sp
所显示的 ACL 格式如下：
.sp
.in +2
.nf
\fIentry_type\fR : \fIpermissions\fR : \fIinheritance_flags\fR : \fIaccess_type\fR
.fi
.in -2
.sp

\fIentry_type\fR 显示为以下各项之一：
.sp
.ne 2
.mk
.na
\fBuser:\fIusername\fR\fR
.ad
.sp .6
.RS 4n
\fIusername\fR 的其他用户访问权。
.RE

.sp
.ne 2
.mk
.na
\fBgroup:\fIgroupname\fR\fR
.ad
.sp .6
.RS 4n
组 \fIgroupname\fR 的其他组访问权。
.RE

.sp
.ne 2
.mk
.na
\fBowner@\fR
.ad
.sp .6
.RS 4n
文件所有者。
.RE

.sp
.ne 2
.mk
.na
\fBgroup@\fR
.ad
.sp .6
.RS 4n
文件组所有者。
.RE

.sp
.ne 2
.mk
.na
\fBeveryone@\fR
.ad
.sp .6
.RS 4n
任何用户的访问权限，包括文件所有者和文件组所有者在内。这不等效于 POSIX 其他类。
.RE

由 NFSv4 ACL 模型所支持的以下权限可通过 \fB-v\fR 或 \fB-V\fR 选项进行显示：
.sp
.ne 2
.mk
.na
\fBread_data (\fBr\fR)\fR
.ad
.sp .6
.RS 4n
读取文件数据的权限。
.RE

.sp
.ne 2
.mk
.na
\fBlist_directory (\fBr\fR)\fR
.ad
.sp .6
.RS 4n
列出目录内容的权限。
.RE

.sp
.ne 2
.mk
.na
\fBwrite_data (\fBw\fR)\fR
.ad
.sp .6
.RS 4n
在文件的偏移范围内任意位置修改文件数据的权限。
.RE

.sp
.ne 2
.mk
.na
\fBadd_file (\fBw\fR)\fR
.ad
.sp .6
.RS 4n
向目录中添加新文件的权限。
.RE

.sp
.ne 2
.mk
.na
\fBappend_data (\fBp\fR)\fR
.ad
.sp .6
.RS 4n
修改文件数据的能力，但仅从 EOF 开始。
.RE

.sp
.ne 2
.mk
.na
\fBadd_subdirectory (\fBp\fR)\fR
.ad
.sp .6
.RS 4n
在目录中创建子目录的权限。
.RE

.sp
.ne 2
.mk
.na
\fBread_xattr (\fBR\fR)\fR
.ad
.sp .6
.RS 4n
读取文件扩展属性的能力。
.RE

.sp
.ne 2
.mk
.na
\fBwrite_xattr (\fBW\fR)\fR
.ad
.sp .6
.RS 4n
创建扩展属性或向扩展属性目录写入的能力。
.RE

.sp
.ne 2
.mk
.na
\fBexecute (\fBx\fR)\fR
.ad
.sp .6
.RS 4n
执行文件的权限。
.RE

.sp
.ne 2
.mk
.na
\fBread_attributes (\fBa\fR)\fR
.ad
.sp .6
.RS 4n
读取文件的基本属性（非 ACL）的能力。
.RE

.sp
.ne 2
.mk
.na
\fBwrite_attributes (\fBA\fR)\fR
.ad
.sp .6
.RS 4n
更改文件的基本属性（非 ACL）的权限。
.RE

.sp
.ne 2
.mk
.na
\fBdelete (\fBd\fR)\fR
.ad
.sp .6
.RS 4n
删除文件的权限。
.RE

.sp
.ne 2
.mk
.na
\fBdelete_child (\fBD\fR)\fR
.ad
.sp .6
.RS 4n
删除目录中的文件的权限。
.RE

.sp
.ne 2
.mk
.na
\fBread_acl (\fBc\fR)\fR
.ad
.sp .6
.RS 4n
读取文件 ACL 的权限。
.RE

.sp
.ne 2
.mk
.na
\fBwrite_acl (\fBC\fR)\fR
.ad
.sp .6
.RS 4n
写入文件 ACL 的权限。
.RE

.sp
.ne 2
.mk
.na
\fBwrite_owner (\fBo\fR)\fR
.ad
.sp .6
.RS 4n
更改文件所有者的权限。
.RE

.sp
.ne 2
.mk
.na
\fBsynchronize (\fBs\fR)\fR
.ad
.sp .6
.RS 4n
在支持同步读写的服务器上本地访问文件的权限。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-\fR\fR
.ad
.sp .6
.RS 4n
不授予权限
.RE

由 NFSv4 ACL 模型所支持的以下继承标志可通过 \fB-v\fR 或 \fB-V\fR 选项进行显示：
.sp
.ne 2
.mk
.na
\fBfile_inherit (\fBf\fR)\fR
.ad
.sp .6
.RS 4n
继承到所有新创建的文件。
.RE

.sp
.ne 2
.mk
.na
\fBdir_inherit (\fBd\fR)\fR
.ad
.sp .6
.RS 4n
继承到所有新创建的目录。
.RE

.sp
.ne 2
.mk
.na
\fBinherit_only (\fBi\fR)\fR
.ad
.sp .6
.RS 4n
如果放置到某个目录上，不应用于该目录，仅继承到新创建的文件和目录。该标志要求还要指定 \fBfile_inherit\fR 和/或 \fBdir_inherit\fR。
.RE

.sp
.ne 2
.mk
.na
\fBno_propagate (\fBn\fR)\fR
.ad
.sp .6
.RS 4n
表示 ACL 条目应该继承到目录中的对象，但是向下一个级别后继承应该停止。该标志要求还要指定 \fBfile_inherit\fR 和/或 \fBdir_inherit\fR。
.RE

.sp
.ne 2
.mk
.na
\fBsuccessful_access (\fBS\fR)\fR
.ad
.sp .6
.RS 4n
指示在访问成功时是否应该启动报警或审计记录。与审计/报警 ACE 类型一起使用。
.RE

.sp
.ne 2
.mk
.na
\fBfailed_access (\fBF\fR)\fR
.ad
.sp .6
.RS 4n
指示在访问失败时是否应该启动报警或审计记录。与审计/报警 ACE 类型一起使用。
.RE

.sp
.ne 2
.mk
.na
\fBinherited (\fBI\fR)\fR
.ad
.sp .6
.RS 4n
继承了 ACE。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-\fR\fR
.ad
.sp .6
.RS 4n
未授予权限。
.RE

\fIaccess_type\fR 显示为以下类型之一：
.sp
.ne 2
.mk
.na
\fBalarm（报警）\fR
.ad
.RS 21n
.rt  
权限字段，指定应触发报警的权限。
.RE

.sp
.ne 2
.mk
.na
\fBallow（允许）\fR
.ad
.RS 21n
.rt  
权限字段，指定允许权限。
.RE

.sp
.ne 2
.mk
.na
\fBaudit（审计）\fR
.ad
.RS 21n
.rt  
权限字段，指定应审计的权限。 
.RE

.sp
.ne 2
.mk
.na
\fBdeny（拒绝）\fR
.ad
.RS 21n
.rt  
权限字段，指定拒绝权限。
.RE

例如：
.sp
.in +2
.nf
$ ls -dV /sandbox/dir.1
  drwxr-xr-x+  2 root     root           2 Jan 17 15:09 dir.1
                  user:marks:r-------------:fd-----:allow
                      owner@:--------------:-------:deny
                      owner@:rwxp---A-W-Co-:-------:allow
                      group@:-w-p----------:-------:deny
                      group@:r-x-----------:-------:allow
                   everyone@:-w-p---A-W-Co-:-------:deny
                   everyone@:r-x---a-R-c--s:-------:allow
$ 
                           ||||||||||||||||:||||||+ inherited access
                             ||||||||||||||:||||||+ failed access
                             ||||||||||||||:|||||+--success access
                             ||||||||||||||:||||+-- no propagate
                             ||||||||||||||:|||+--- inherit only
                             ||||||||||||||:||+---- directory inherit
                             ||||||||||||||:|+----- file inherit
                             ||||||||||||||
                             ||||||||||||||+ sync
                             |||||||||||||+- change owner
                             ||||||||||||+-- write ACL
                             |||||||||||+--- read ACL
                             ||||||||||+---- write extended attributes
                             |||||||||+----- read extended attributes
                             ||||||||+------ write attributes
                             |||||||+------- read attributes
                             ||||||+-------- delete child
                             |||||+--------- delete
                             ||||+---------- append
                             |||+----------- execute
                             ||+------------ write data
                             |+------------- read data
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fB-w\fR \fIcols\fR\fR
.ad
.br
.na
\fB\fB--width\fR \fIcols\fR\fR
.ad
.sp .6
.RS 4n
多列输出，列宽强制为 \fIcols\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.sp .6
.RS 4n
多列输出，条目在页面上横向排序而不是纵向排序。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-1\fR\fR
.ad
.sp .6
.RS 4n
每行输出列显一个条目。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-@\fR\fR
.ad
.sp .6
.RS 4n
与 \fB-l\fR 相同，但扩展属性信息会覆盖 \fBACL\fR 信息。对于具有扩展属性的文件，其文件权限位之后会显示 \fB@\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-/\fR\fR
.ad
.sp .6
.RS 4n
\fB-/\fR 选项支持两个选项参数 \fBc\fR（精简模式）和 \fBv\fR（详细模式）。显示长列表，与 \fB-l\fR 相同。此外，在底层文件系统全面支持扩展系统属性时，会显示与文件关联的扩展系统属性。
.sp
.ne 2
.mk
.na
\fB\fBappendonly\fR\fR
.ad
.sp .6
.RS 4n
仅允许文件在偏移 \fBEOF\fR 处进行修改。尝试在 \fBEOF\fR 以外的位置修改文件会失败，并显示 \fBEPERM\fR。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBarchive\fR\fR
.ad
.sp .6
.RS 4n
指示文件上次备份后是否进行过修改。每当更改文件的修改时间 (\fBmtime\fR) 时，就会设置 \fBarchive\fR 属性。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBav_modified\fR\fR
.ad
.sp .6
.RS 4n
ZFS 在文件的内容或大小发生更改或在文件进行重命名时，都会设置防病毒属性。
.RE

.sp
.ne 2
.mk
.na
\fB\fBav_quarantined\fR\fR
.ad
.sp .6
.RS 4n
防病毒软件设置，可将文件标记为已隔离。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBcrtime\fR\fR
.ad
.sp .6
.RS 4n
创建文件的时间戳。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBhidden\fR\fR
.ad
.sp .6
.RS 4n
将文件标记为隐藏。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBimmutable\fR\fR
.ad
.sp .6
.RS 4n
防止修改文件内容。同时防止所有的元数据更改，但访问时间更新除外。在目录上设置时，可防止在目录中删除和创建文件。尝试修改标记为 \fBimmutable\fR 的文件或目录内容会失败，并显示 \fBEPERM\fR。尝试修改标记为 \fBimmutable\fR 的文件的任意属性（但修改访问时间以及以适当特权修改 \fBimmutable\fR 除外）会失败，并显示 \fBEPERM\fR。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBnodump\fR\fR
.ad
.sp .6
.RS 4n
Solaris 系统的此属性没有特殊的语义。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnounlink\fR\fR
.ad
.sp .6
.RS 4n
防止删除文件。在目录上设置时，该属性还可防止对目录内容进行任何更改。也就是说，目录中的任何文件都不能删除或重命名。尝试对标记为 \fBnounlink\fR 的文件或目录解除链接或进行重命名时，会返回 \fBerrno\fR \fBEPERM\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBreadonly\fR\fR
.ad
.sp .6
.RS 4n
将文件标记为 \fBreadonly\fR。文件标记为 \fBreadonly\fR 后，该文件的内容数据将无法修改。但仍可修改该文件的其他元数据。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBsparse\fR\fR
.ad
.sp .6
.RS 4n
此属性可供用户和应用程序使用，指示文件可解释为稀疏文件。它不指示该文件是否真正为稀疏文件，并且在 Solaris 操作系统上没有特殊的语义。如果文件截断为零长度，则会清除稀疏属性。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsystem\fR\fR
.ad
.sp .6
.RS 4n
Solaris 系统的此属性没有特殊的语义。 
.RE

.sp
.ne 2
.mk
.na
\fBsensitive\fR
.ad
.sp .6
.RS 4n
某些 Solaris 实用程序可能会根据此属性采取不同的操作。例如，不在管理日志中记录这类文件的内容。
.RE

.RE

.sp
.LP
精简模式 (\fB-/ c\fR) 使用以下所示的显示字符： 
.sp
.in +2
.nf
Attribute Name     Display
archive            A
hidden             H
readonly           R
system             S
appendonly         a
nodump             d
immutable          i
av_modified        m
av_quarantined     q
sparse             s
nounlink           u
sensitive          T
.fi
.in -2
.sp

.sp
.LP
详细模式 (/ v) 下的显示会使用已设置的完整属性名称，在未进行设置时会使用带有 'no' 前缀的名称。
.sp
.LP
属性名称 \fBcrtime\fR 和所有其他时间戳由选项 \fB-%\fR 通过相应的时间戳选项参数以及 \fBall\fR 选项参数进行处理。显示位置如下所示：详细模式 (\fB-/ v\fR) 下的显示在其进行设置时使用完整的属性名称，在其未进行设置时使用带有 \fBno\fR 前缀的名称。属性名称 \fBcrtime\fR 和所有其他时间戳由选项 \fB-%\fR 通过相应的时间戳选项参数以及 \fBall\fR 选项参数进行处理。
.sp
.LP
显示位置如下所示：
.sp
.in +2
.nf
{||||||||||}
 |||||||||||||+T (sensitive)
 |||||||||||+- s (sparse)
 ||||||||||+-- O (offline)
 |||||||||+--- u (nounlink)
 ||||||||+---- q (av_quarantined)
 |||||||+----- m (av_modified)
 ||||||+------ i (immutable)
 |||||+------- d (nodump)
 ||||+-------- a (appendonly)
 |||+--------- S (system)
 ||+---------- R (readonly)
 |+----------- H (hidden)
 +------------ A (archive)
.fi
.in -2
.sp

.sp
.in +2
.nf
-% atime | crtime | ctime | mtime | all 
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
\fB\fBatime\fR\fR
.ad
.sp .6
.RS 4n
等效于 \fB-u\fR。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBcrtime\fR\fR
.ad
.sp .6
.RS 4n
使用文件的创建时间进行排序或输出。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBctime\fR\fR
.ad
.sp .6
.RS 4n
等效于 \fB-c\fR。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBmtime\fR\fR
.ad
.sp .6
.RS 4n
使用文件内容的上次修改时间进行排序或输出。 
.RE

.sp
.LP
如果不支持扩展系统属性、用户对文件不具有\fB读取\fR权限，或未设置 \fBcrtime\fR 扩展属性，则会将 \fBcrtime\fR 视为与 \fBmtime\fR 同义。
.sp
.LP
如果指定了选项参数 \fB-all\fR，则会输出所有可用的时间戳，包括 \fB-atime\fR、\fB-ctime\fR、\fB-mtime\fR 以及支持扩展系统属性的文件系统上的 \fB-crtime\fR（创建时间）。选项 \fB-% all\fR 不影响哪个时间戳以长格式显示，也不影响排序。
.sp
.ne 2
.mk
.na
\fB\fB--block-size\fR \fIsize\fR\fR
.ad
.sp .6
.RS 4n
以单位大小的倍数显示大小。通过加上 \fBYyZzEePpTtGgMmKk\fR 之一的后缀可以调整大小的量级。此外，还可将 \fBB\fR 放置在结尾以表示 10（而不是 2）的幂次。例如，\fB10mB\fR 表示 \fB10000000\fR 字节的块，而 \fB10m\fR 表示 \fB10*2^20 -- 10485760 --\fR 字节的块。此选项与 \fB-h\fR 选项互斥。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--color\fR \fB[=\fR\fIwhen\fR\fB]\fR\fR
.ad
.br
.na
\fB\fB--colour\fR\fB[=\fR\fIwhen\fR\fB]\fR\fR
.ad
.sp .6
.RS 4n
在支持彩色的终端上使用彩色显示文件名。\fIwhen\fR 是可选参数，可确定何时显示彩色输出。 
.sp
可能的 \fIwhen\fR 值为：
.sp
.ne 2
.mk
.na
\fB\fBalways\fR\fR
.ad
.br
.na
\fB\fByes\fR\fR
.ad
.br
.na
\fB\fBforce\fR\fR
.ad
.sp .6
.RS 4n
始终使用彩色。
.RE

.sp
.ne 2
.mk
.na
\fB\fBauto\fR\fR
.ad
.br
.na
\fB\fBtty\fR\fR
.ad
.br
.na
\fB\fBif-tty\fR\fR
.ad
.sp .6
.RS 4n
如果存在终端，则使用彩色。
.RE

.sp
.ne 2
.mk
.na
\fB\fBno\fR\fR
.ad
.br
.na
\fB\fBnever\fR\fR
.ad
.br
.na
\fB\fBnone\fR\fR
.ad
.sp .6
.RS 4n
从不使用彩色。这是缺省值。
.RE

有关如何控制输出颜色的信息，请参见本手册页的 \fBColor Output\fR 部分。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--file-type\fR\fR
.ad
.sp .6
.RS 4n
根据文件的类型显示该文件的后缀，与 \fB-F\fR 选项类似，但不会将 \fB*\fR 附加到可执行文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--si\fR\fR
.ad
.sp .6
.RS 4n
显示调整数量级后的大小，与 \fB-h\fR 选项类似，但值会反复除以 1000 而不是 1024。最后一个选项 \fB--si\fR 或 \fB-h\fR 可确定所使用的除数。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--time-style\fR 样式\fR
.ad
.sp .6
.RS 4n
使用指定的样式显示时间。这不会影响为扩展属性 (\fB-%\fR) 显示的时间。 
.sp
可能的 \fIstyle\fR 值为：
.sp
.ne 2
.mk
.na
\fB\fBfull-iso\fR\fR
.ad
.sp .6
.RS 4n
等效于 \fB-E\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlong-iso\fR\fR
.ad
.sp .6
.RS 4n
所有文件以 \fIYYYY-MM-DD HH:MM\fR 样式显示。
.RE

.sp
.ne 2
.mk
.na
\fB\fBiso\fR\fR
.ad
.sp .6
.RS 4n
较旧文件使用 \fIYYYY-MM-DD\fR 显示，较新文件使用 \fIMM-DD HH:MM\fR 显示。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlocale\fR\fR
.ad
.sp .6
.RS 4n
对新旧文件均使用缺省语言环境格式。这是缺省值。
.RE

.sp
.ne 2
.mk
.na
\fB\fB+FORMAT\fR\fR
.ad
.sp .6
.RS 4n
使用定制格式。值与 \fBstrftime\fR(3C) 中所述相同。如果字符串中显示换行符，则第一行用于较旧文件，第二行用于较新文件。否则，给定的格式会用于所有文件。
.RE

.RE

.SS "/usr/bin/ls"
.sp
.ne 2
.mk
.na
\fB\fB-F\fR\fR
.ad
.sp .6
.RS 4n
使用结尾斜杠 (\fB/\fR) 标记目录，使用结尾大于号 (\fB>\fR) 标记门文件，使用结尾星号 (\fB*\fR) 标记可执行文件，使用结尾竖线 (\fB|\fR) 标记 \fBFIFO\fR，使用结尾 “at” 号 (\fB@\fR) 标记符号链接，以及使用结尾等号 (\fB=\fR) 标记 \fBAF_UNIX\fR 地址族套接字。后跟 \fBsymlinks\fR 作为操作数。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--file-type\fR\fR
.ad
.sp .6
.RS 4n
与 \fB-F\fR 一样标记条目，但可执行文件除外。不标记可执行文件。后跟符号链接作为操作数。
.RE

.sp
.LP
在以下互斥对中指定多个选项不会视为错误：\fB-C\fR 和 \fB-l\fR（字母 ell）、\fB-m\fR 和 \fB-l\fR（字母 ell）、\fB-x\fR 和 \fB-l\fR（字母 ell）、\fB-@\fR 和 \fB-l\fR（字母 ell）。\fB-l\fR 选项可覆盖每一对中指定的其他选项。
.sp
.LP
在以下互斥组中指定多个选项不会视为错误：\fB-C\fR 和 \fB-1\fR（数字 1）、\fB-H\fR 和 \fB-L\fR、\fB-c\fR 和 \fB-u\fR、\fB-e\fR 和 \fB-E\fR 以及 \fB-t\fR 和 \fB-S\fR。指定时间戳的最后一个选项（\fB-c\fR、\fB-u\fR、\fB-% atime\fR、\fB-% crtime\fR、\fB-% ctime\fR 和 \fB-% mtime\fR）可确定用于排序或长格式列表中的时间戳。最后一个选项 \fB-t\fR、\fB-S\fR 或 \fB-U\fR 可确定排序方式。
.SS "/usr/xpg4/bin/ls"
.sp
.ne 2
.mk
.na
\fB\fB-F\fR\fR
.ad
.sp .6
.RS 4n
使用结尾斜杠 (\fB/\fR) 标记目录，使用结尾大于号 (\fB>\fR) 标记门文件，使用结尾星号 (\fB*\fR) 标记可执行文件，使用结尾竖线 (\fB|\fR) 标记 \fBFIFO\fR，使用结尾 “at” 号 (\fB@\fR) 标记符号链接，以及使用结尾等号 (\fB=\fR) 标记 \fBAF_UNIX\fR 地址族套接字。后跟符号链接作为操作数。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--file-type\fR\fR
.ad
.sp .6
.RS 4n
与 \fB-F\fR 一样标记条目，但可执行文件除外。不标记可执行文件。后跟符号链接作为操作数。
.RE

.sp
.LP
在以下互斥选项组中指定多个选项不会视为错误：\fB-C\fR 和 \fB-l\fR（字母 ell）、\fB-m\fR 和 \fB-l\fR（字母 ell）、\fB-x\fR 和 \fB-l\fR（字母 ell）、\fB-@\fR 和 \fB- l\fR（字母 ell）、\fB-C\fR 和 \fB-1\fR（数字 1）、\fB-H\fR 和 \fB-L\fR、\fB-c\fR 和 \fB-u\fR、\fB-e\fR 和 \fB-E\fR、\fB-t\fR 和 \fB-S\fR 和 \fB-U\fR。指定时间戳的最后一个选项（\fB-c\fR、\fB-u\fR、\fB-% atime\fR、\fB-% crtime\fR、\fB-% ctime\fR 和 \fB-% mtime\fR）可确定用于排序或长格式列表中的时间戳。最后一个选项 \fB-t\fR、\fB-S\fR 或 \fB-U\fR 选项可确定排序方式。
.SS "/usr/xpg6/bin/ls"
.sp
.ne 2
.mk
.na
\fB\fB-F\fR\fR
.ad
.sp .6
.RS 4n
使用结尾斜杠 (\fB/\fR) 标记目录，使用结尾大于号 (\fB>\fR) 标记门文件，使用结尾星号 (\fB*\fR) 标记可执行文件，使用结尾竖线 (\fB|\fR) 标记 \fBFIFO\fR，使用结尾 “at” 号 (\fB@\fR) 标记符号链接，以及使用结尾等号 (\fB=\fR) 标记 \fBAF_UNIX\fR 地址族套接字。后面不跟作为操作数的符号链接，除非指定了 \fB-H\fR 或 \fB-L\fR 选项。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--file-type\fR\fR
.ad
.sp .6
.RS 4n
与 \fB-F\fR 一样标记条目，但可执行文件除外。不标记可执行文件。后面不跟作为操作数的符号链接，除非指定了 \fB-H\fR 或 \fB-L\fR 选项。
.RE

.sp
.LP
在以下互斥对中指定多个选项不会视为错误：\fB-C\fR 和 \fB-l\fR（字母 ell）、m 和 \fB-l\fR（字母 ell）、\fB-x\fR 和 \fB-l\fR（字母 ell）、\fB-@\fR 和 \fB-l\fR（字母 ell）、\fB- C\fR 和 \fB-1\fR（数字 1）、\fB-H\fR 和 -\fB-L\fR、\fB-c\fR 和 \fB-u\fR、\fB-e\fR 和 \fB-E\fR、\fB-t\fR 和 \fB-S\fR 和 \fB-U\fR。指定时间戳的最后一个选项（\fB-c\fR、\fB-u\fR、\fB-% atime\fR、\fB-% crtime\fR、\fB-% ctime\fR 和 \fB-% mtime\fR）可确定用于排序或长格式列表中的时间戳。最后一个选项 \fB-t\fR、\fB-S\fR 或 \fB-U\fR 选项可确定排序方式。
.SH 操作数
.sp
.LP
支持下列操作数：
.sp
.ne 2
.mk
.na
\fB\fIfile\fR\fR
.ad
.sp .6
.RS 4n
要写入的文件的路径名。如果未找到指定的文件，则诊断消息在标准错误中输出。
.RE

.SH 彩色输出
.sp
.LP
如果启用了彩色输出，则会选中环境变量 \fBLS_COLORS\fR。如果该变量存在，则其内容会用于控制显示文件名所用的颜色。如果未进行设置，则会使用缺省颜色列表。\fBLS_COLORS\fR 的格式是冒号分隔的属性规范列表。每个属性规范都采用以下格式
.sp
.in +2
.nf
\fIfilespec\fR=\fIattr\fR[;\fIattr\fR..]
.fi
.in -2
.sp

.sp
.LP
\fIfilespec\fR 可能采用 \fI*.SUFFIX\fR 格式（例如 \fB*.jar\fR 或 \fB*.Z\fR），或者为以下文件类型之一：
.sp
.ne 2
.mk
.na
\fB\fBno\fR\fR
.ad
.RS 28n
.rt  
普通文件
.RE

.sp
.ne 2
.mk
.na
\fB\fBfi\fR\fR
.ad
.RS 28n
.rt  
常规文件
.RE

.sp
.ne 2
.mk
.na
\fB\fBdi\fR\fR
.ad
.RS 28n
.rt  
目录
.RE

.sp
.ne 2
.mk
.na
\fB\fBln\fR\fR
.ad
.RS 28n
.rt  
符号链接
.RE

.sp
.ne 2
.mk
.na
\fB\fBpi\fR\fR
.ad
.RS 28n
.rt  
FIFO 或命名管道
.RE

.sp
.ne 2
.mk
.na
\fB\fBso\fR\fR
.ad
.RS 28n
.rt  
套接字
.RE

.sp
.ne 2
.mk
.na
\fB\fBdo\fR\fR
.ad
.RS 28n
.rt  
门文件
.RE

.sp
.ne 2
.mk
.na
\fB\fBbd\fR\fR
.ad
.RS 28n
.rt  
块设备
.RE

.sp
.ne 2
.mk
.na
\fB\fBcd\fR\fR
.ad
.RS 28n
.rt  
字符设备
.RE

.sp
.ne 2
.mk
.na
\fB\fBex\fR\fR
.ad
.RS 28n
.rt  
执行位（\fBuser\fR、\fBgroup\fR 或 \fBother\fR）设置
.RE

.sp
.ne 2
.mk
.na
\fB\fBpo\fR\fR
.ad
.RS 28n
.rt  
事件端口
.RE

.sp
.ne 2
.mk
.na
\fB\fBst\fR\fR
.ad
.RS 28n
.rt  
Sticky 位设置
.RE

.sp
.ne 2
.mk
.na
\fB\fBor\fR\fR
.ad
.RS 28n
.rt  
孤立符号链接
.RE

.sp
.ne 2
.mk
.na
\fB\fBsg\fR\fR
.ad
.RS 28n
.rt  
\fBsetgid\fR 二进制文件
.RE

.sp
.ne 2
.mk
.na
\fB\fBsu\fR\fR
.ad
.RS 28n
.rt  
\fBsetuid\fR 二进制文件
.RE

.sp
.ne 2
.mk
.na
\fB\fBow\fR\fR
.ad
.RS 28n
.rt  
\fBworld\fR 可写入文件
.RE

.sp
.ne 2
.mk
.na
\fB\fBtw\fR\fR
.ad
.RS 28n
.rt  
Sticky 位和 \fBworld\fR 可写入文件
.RE

.sp
.LP
\fIattr\fR 是一个分号分隔的颜色和显示属性列表，可组合起来确定最终输出颜色。可指定 \fIattr\fR 值的任意组合。可能的 \fIattr\fR 值为：
.sp
.ne 2
.mk
.na
\fB\fB00\fR\fR
.ad
.RS 28n
.rt  
所有属性关闭（缺省终端颜色）
.RE

.sp
.ne 2
.mk
.na
\fB\fB01\fR\fR
.ad
.RS 28n
.rt  
显示粗体文本
.RE

.sp
.ne 2
.mk
.na
\fB\fB04\fR\fR
.ad
.RS 28n
.rt  
显示带下划线的文本
.RE

.sp
.ne 2
.mk
.na
\fB\fB05\fR\fR
.ad
.RS 28n
.rt  
显示粗体文本
.RE

.sp
.ne 2
.mk
.na
\fB\fB07\fR\fR
.ad
.RS 28n
.rt  
显示前景色和背景色颠倒的文本
.RE

.sp
.ne 2
.mk
.na
\fB\fB08\fR\fR
.ad
.RS 28n
.rt  
使用隐藏文本显示。
.RE

.sp
.LP
可选择以下值之一。如果指定了多个值，则会使用最后一个指定的值。
.sp
.ne 2
.mk
.na
\fB\fB30\fR\fR
.ad
.RS 28n
.rt  
将前景色设置为 \fBblack\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB31\fR\fR
.ad
.RS 28n
.rt  
将前景色设置为 \fBred\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB32\fR\fR
.ad
.RS 28n
.rt  
将前景色设置为 \fBgreen\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB33\fR\fR
.ad
.RS 28n
.rt  
将前景色设置为 \fByellow\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB34\fR\fR
.ad
.RS 28n
.rt  
将前景色设置为 \fBblue\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB35\fR\fR
.ad
.RS 28n
.rt  
将前景色设置为 \fBmagenta\fR (\fBpurple\fR)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB36\fR\fR
.ad
.RS 28n
.rt  
将前景色设置为 \fBcyan\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB37\fR\fR
.ad
.RS 28n
.rt  
将前景色设置为 \fBwhite\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB39\fR\fR
.ad
.RS 28n
.rt  
将前景色设置为缺省终端颜色。
.RE

.sp
.LP
可指定以下值之一。如果指定了多个值，则会使用最后一个指定的值。
.sp
.ne 2
.mk
.na
\fB\fB40\fR\fR
.ad
.RS 28n
.rt  
将前景色设置为 \fBblack\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB41\fR\fR
.ad
.RS 28n
.rt  
将前景色设置为 \fBred\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB42\fR\fR
.ad
.RS 28n
.rt  
将前景色设置为 \fBgreen\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB43\fR\fR
.ad
.RS 28n
.rt  
将前景色设置为 \fByellow\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB44\fR\fR
.ad
.RS 28n
.rt  
将前景色设置为 \fBblue\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB45\fR\fR
.ad
.RS 28n
.rt  
将前景色设置为 \fBmagenta\fR (\fBpurple\fR)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB46\fR\fR
.ad
.RS 28n
.rt  
将前景色设置为 \fBcyan\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB47\fR\fR
.ad
.RS 28n
.rt  
将前景色设置为 \fBwhite\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB49\fR\fR
.ad
.RS 28n
.rt  
将前景色设置为缺省终端颜色。
.RE

.sp
.LP
在某些终端上，设置粗体属性会导致前景色亮度更高。在此类情况下，亮度较低的黄色通常显示为棕色或橙色。
.sp
.LP
对于文件规范，必须至少列出一个属性。
.sp
.LP
通过选择最精确的匹配（先匹配文件后缀，然后匹配文件类型，直到找到匹配项），可选择适当的颜色代码。\fBno\fR（普通文件）类型可匹配所有文件。
.SH 用法
.sp
.LP
有关 \fBls\fR 遇到大于或等于 2 GB（2^31 字节）文件时行为的说明，请参见 \fBlargefile\fR(5)。
.SH 示例
.LP
\fB示例 1 \fR查看文件权限
.sp
.LP
以下示例说明如何显示有关文件的详细信息。

.sp
.in +2
.nf
% ls -l file.1
-rw-r--r--   1 gozer    staff     206663 Mar 14 10:15 file.1 
.fi
.in -2
.sp

.sp
.LP
上面的权限字符串 (\fB-rw-r--r--\fR) 表明文件所有者具有读写权限，所属组具有读取权限，而其他用户具有读取权限。 

.sp
.LP
以下示例说明如何显示有关目录的详细信息。 

.sp
.in +2
.nf
% ls -ld test.dir
drwxr-xr-x   2 gozer    staff          2 Mar 14 10:17 test.dir    
.fi
.in -2
.sp

.sp
.LP
上面的权限字符串 (\fBdrwxr-xr-x\fR) 表明目录所有者具有读写和搜索权限，所属组具有读取和搜索权限，而其他用户具有读取和搜索权限。

.sp
.LP
以下是列出文件权限的另一个示例： 

.sp
.in +2
.nf
% ls -l file.2
-rw-rwl---   1 gozer    staff     206663 Mar 14 10:47 file.2
.fi
.in -2
.sp

.sp
.LP
上面的权限字符串 (\fB-rw-rwl---\fR) 表明文件所有者具有读写权限，所属组具有读写权限，且访问期间可锁定文件。

.LP
\fB示例 2 \fR显示文件和目录的 ACL 信息
.sp
.LP
以下示例说明如何显示 ZFS 文件的详细 ACL 信息。

.sp
.in +2
.nf
% ls -v file.1
-rw-r--r--   1 marks    staff     206663 Mar 14 10:15 file.1
     0:owner@:execute:deny
     1:owner@:read_data/write_data/append_data/write_xattr/write_attributes
          /write_acl/write_owner:allow
     2:group@:write_data/append_data/execute:deny
     3:group@:read_data:allow
     4:everyone@:write_data/append_data/write_xattr/execute/write_attributes
          /write_acl/write_owner:deny
     5:everyone@:read_data/read_xattr/read_attributes/read_acl/synchronize
          :allow
.fi
.in -2
.sp

.sp
.LP
以下示例说明如何显示 ZFS 目录的精简 ACL 信息。

.sp
.in +2
.nf
% ls -dV test.dir
drwxr-xr-x   2 marks    staff          2 Mar 14 10:17 test.dir
            owner@:--------------:------:deny
            owner@:rwxp---A-W-Co-:------:allow
            group@:-w-p----------:------:deny
            group@:r-x-----------:------:allow
            everyone@:-w-p---A-W-Co-:------:deny
            everyone@:r-x---a-R-c--s:------:allow
.fi
.in -2
.sp

.sp
.LP
以下示例说明了在列出 UFS 文件的 ACL 信息时 \fBls\fR \fB-v\fR 的行为。

.sp
.in +2
.nf
$ ls -v file.3
-rw-r--r--   1 root     root        2703 Mar 14 10:59 file.3
     0:user::rw-
     1:group::r--               #effective:r--
     2:mask:r--
     3:other:r--
.fi
.in -2
.sp

.LP
\fB示例 3 \fR列显所有文件的名称
.sp
.LP
以下示例输出了当前目录中所有文件的名称，包括通常不会输出的以点 (\fB\&.\fR) 开头的名称：

.sp
.in +2
.nf
example% \fBls -a\fR
.fi
.in -2
.sp

.LP
\fB示例 4 \fR提供文件信息
.sp
.LP
以下示例可提供文件信息：

.sp
.in +2
.nf
example% ls -aisn
.fi
.in -2
.sp

.sp
.LP
此命令提供有关\fB所有\fR文件的信息，包括以点开头的文件 (\fBa\fR)；提供 \fBi\fR 编号，即与文件关联的 i 节点的内存地址，在左侧列中列显 (\fBi\fR)；提供文件\fB大小\fR（以块为单位），在 i 编号右侧的列中列显 (\fBs\fR)；最后，报告的显示格式为数字版本的长列表 (\fBn\fR)，会列显与文件关联的 \fBUID\fR（而不是用户名）和 \fBGID\fR（而不是组名）编号。

.sp
.LP
列出目录中文件的大小时，会列显块总数，包括间接块。

.LP
\fB示例 5 \fR提供扩展系统属性信息
.sp
.in +2
.nf
example% ls -/ c file    (extended system attribute in compact mode)
-rw-r--r--   1 root     root           0 May 10 14:17 file    
                         {AHRSadim-u}
.fi
.in -2
.sp

.sp
.LP
在此示例中，未设置 \fBav_quarantined\fR。 
.sp
.in +2
.nf
example% ls -/ v file (extended system attribute in verbose mode)
-rw-r--r--   1 root     root           0 May 10 14:17 file
                {archive,hidden,readonly,system,appendonly\e
                 nodump,immutable,av_modified,\e
                 noav_quarantined,nounlink}

example% ls -/ v file     (no extended system attribute)
-rw-r--r--  1 root    staff        0 May 16 14:48 file
               {}

example% ls -/ c file        (extended system attribute 
                              supported file system)

-rw-r--r--  1 root staff        3 Jun  4 22:04 file
               {A------m--}
.fi
.in -2
.sp

.sp
.LP
缺省情况下，支持扩展系统属性的文件上已设置 \fBarchive\fR 和 \fBav_modified\fR 属性。
.sp
.in +2
.nf
example% ls -/ c  -%crtime file

-rw-r--r--    root     root          0 May 10 14:17 file
               {AHRSadim-u}
.fi
.in -2
.sp

.sp
.LP
此示例将时间戳显示为创建时间：
.sp
.in +2
.nf
example% ls -l -%all file
-rw-r--r--   1 root     root           0 May 10 14:17    file
                timestamp: atime    Jun 14 08:47:37 2007
                timestamp: ctime    May 10 14:20:23 2007
                timestamp: mtime    May 10 14:17:56 2007
                timestamp: crtime   May 10 14:17:56 2007

example% ls -%crtime -tl file*

-rw-r--r--   1 foo      staff          3 Jun  4 22:04 file1
-rw-r--r--   1 root     root           0 May 10 14:17 file
-rw-r--r--   1 foo      staff          0 May  9 13:49 file.1
.fi
.in -2
.sp

.sp
.LP
此示例中，文件按创建时间排序。 
.SH 环境变量
.sp
.LP
有关影响 \fBls\fR 执行的以下环境变量的说明，请参见 \fBenviron\fR(5)：\fBLANG\fR、\fBLC_ALL\fR、\fBLC_COLLATE\fR、\fBLC_CTYPE\fR、\fBLC_TIME\fR、\fBLC_MESSAGES\fR、\fBNLSPATH\fR 和 \fBTZ\fR。
.sp
.ne 2
.mk
.na
\fB\fBCOLUMNS\fR\fR
.ad
.RS 28n
.rt  
确定用户首选的列位置宽度，用于写入多个文本列输出。如果此变量包含一个表示十进制整数的字符串，则 \fBls\fR 实用程序会基于所提供的宽度计算要写入的路径名文本列数（请参见 \fB-C\fR）。如果 \fBCOLUMNS\fR 未进行设置或无效，则会使用 80。任何给定目录中选定用于写入文件名的列宽是固定的。文件名不会截断以适合多个文本列输出。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLS_COLORS\fR\fR
.ad
.RS 28n
.rt  
确定显示彩色输出时使用的颜色方案。如果未设置且未指定彩色输出，则会使用缺省方案。如果未设置 TERM，则不会使用彩色输出。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTERM\fR\fR
.ad
.RS 28n
.rt  
确定终端类型。如果此变量未进行设置或为 NULL，则无论 --color 选项的值为何，都不会生成任何彩色输出。
.RE

.SH 退出状态
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
所有信息已成功写入。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
出现错误。
.RE

.SH 文件
.sp
.ne 2
.mk
.na
\fB\fB/etc/group\fR\fR
.ad
.sp .6
.RS 4n
\fBls\fR \fB-l\fR 和 \fBls\fR \fB-g\fR 的组 ID
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/passwd\fR\fR
.ad
.sp .6
.RS 4n
\fBls\fR \fB-l\fR 和 \fBls\fR \fB-o\fR 的用户 ID
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/share/lib/terminfo/?/*\fR\fR
.ad
.sp .6
.RS 4n
终端信息数据库
.RE

.SH 属性
.sp
.LP
有关下列属性的说明，请参见 \fBattributes\fR(5)：
.SS "/usr/bin/ls"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
_
CSIEnabled（已启用）
_
接口稳定性Committed（已确定）
_
标准请参见下文。
.TE

.sp
.LP
有关所有选项（\fB-A\fR、\fB-b\fR、\fB-e\fR、\fB-E、\fR\fB-h\fR、\fB-S\fR、U \fB-v\fR、\fB-V\fR、\fB-@\fR、\fB-/\fR、\fB-%\fR、\fB--all\fR、\fB--almost-all\fR、\fB--block-size\fR、\fB--classify\fR、\fB--color\fR、\fB--colour\fR、\fB--dereference\fR、\fB--dereference-command-line\fR、\fB--escape\fR、\fB--file-type\fR、\fB--full-time\fR、\fB--human-readable\fR、\fB--ignore-backups\fR、\fB--inode\fR、\fB--no-group\fR、\fB--numeric-uid-gid\fR、\fB--reverse\fR、\fB--recursive\fR、\fB--si\fR、\fB--size\fR 和 \fB--time-style\fR 除外），请参见 \fBstandards\fR(5)。
.SS "/usr/xpg4/bin/ls"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/xopen/xcu4
_
CSIEnabled（已启用）
_
接口稳定性Committed（已确定）
_
标准请参见下文。
.TE

.sp
.LP
有关所有选项（\fB-A\fR、\fB-b\fR、\fB-e\fR、\fB-E、\fR\fB-h\fR、\fB-S\fR、U \fB-v\fR、\fB-V\fR、\fB-@\fR、\fB-/\fR、\fB-%\fR、\fB--all\fR、\fB--almost-all\fR、\fB--block-size\fR、\fB--classify\fR、\fB--color\fR、\fB--colour\fR、\fB--dereference\fR、\fB--dereference-command-line\fR、\fB--escape\fR、\fB--file-type\fR、\fB--full-time\fR、\fB--human-readable\fR、\fB--ignore-backups\fR、\fB--inode\fR、\fB--no-group\fR、\fB--numeric-uid-gid\fR、\fB--reverse\fR、\fB--recursive\fR、\fB--si\fR、\fB--size\fR 和 \fB--time-style\fR 除外），请参见 \fBstandards\fR(5)。
.SS "/usr/xpg6/bin/ls"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/xopen/xcu6
_
CSIEnabled（已启用）
_
接口稳定性Committed（已确定）
_
标准请参见下文。
.TE

.sp
.LP
有关所有选项（\fB-A\fR、\fB-b\fR、\fB-e\fR、\fB-E、\fR\fB-h\fR、\fB-S\fR、U \fB-v\fR、\fB-V\fR、\fB-@\fR、\fB-/\fR、\fB-%\fR、\fB--all\fR、\fB--almost-all\fR、\fB--block-size\fR、\fB--classify\fR、\fB--color\fR、\fB--colour\fR、\fB--dereference\fR、\fB--dereference-command-line\fR、\fB--escape\fR、\fB--file-type\fR、\fB--full-time\fR、\fB--human-readable\fR、\fB--ignore-backups\fR、\fB--inode\fR、\fB--no-group\fR、\fB--numeric-uid-gid\fR、\fB--reverse\fR、\fB--recursive\fR、\fB--si\fR、\fB--size\fR 和 \fB--time-style\fR 除外），请参见 \fBstandards\fR(5)。
.SH 另请参见
.sp
.LP
\fBchmod\fR(1)、\fBcp\fR(1)、\fBsetfacl\fR(1)、\fBfgetattr\fR(3C)、\fBstrftime\fR(3C)、\fBterminfo\fR(4)、\fBacl\fR(5)、\fBattributes\fR(5)、\fBenviron\fR(5)、\fBfsattr\fR(5)、\fBlargefile\fR(5)、\fBstandards\fR(5)
.SH 附注
.sp
.LP
文件名中不可打印的字符可能会使分列输出选项出现混乱。
.sp
.LP
如果文件中存在硬链接，则总块数不正确。
.sp
.LP
\fBls\fR 输出的排序顺序受语言环境影响，并可用 \fBLC_COLLATE\fR 环境变量覆盖。例如，如果 \fBLC_COLLATE\fR 等于 \fBC\fR，则会首先显示点文件，后跟以大写字母开头的名称，然后是以小写字母开头的名称。但如果 \fBLC_COLLATE\fR 等于 \fBen_US.ISO8859-1\fR，则确定排序顺序时会忽略前导点字符以及大小写。
