Alhadis/Silos/Solaris 11.3/zh_CN.UTF-8/man1/more.1
'\" te
.\"  Copyright 1989 AT&T Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\"  Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation.Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation.In the following statement, the phrase "this text" refers to portions of the system documentation.Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group.In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document.The original Standard can be obtained online at http://www.opengroup.org/unix/online.html.This notice shall appear on any product containing this material. 
.TH more 1 "2005 年 11 月 4 日" "SunOS 5.11" "用户命令"
.SH 名称
more, page \- 在文本文件中浏览或翻页
.SH 用法概要
.LP
.nf
\fB/usr/bin/more\fR [\fB-cdflrsuw\fR] [\fB-lines\fR] [+ \fIlinenumber\fR] 
     [+/ \fIpattern\fR] [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/bin/page\fR [\fB-cdflrsuw\fR] [\fB-lines\fR] [+ \fIlinenumber\fR] 
     [+/ \fIpattern\fR] [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/xpg4/bin/more\fR [\fB-cdeisu\fR] [\fB-n\fR \fInumber\fR] [\fB-p\fR \fIcommand\fR] 
     [\fB-t\fR \fItagstring\fR] [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/xpg4/bin/more\fR [\fB-cdeisu\fR] [\fB-n\fR \fInumber\fR] [+ \fIcommand\fR] 
     [\fB-t\fR \fItagstring\fR] [\fIfile\fR]...
.fi

.SH 描述
.sp
.LP
\fBmore\fR 实用程序是一个过滤器，在终端上显示文本文件的内容，一次一满屏。正常情况下，它会在每次满屏后暂停。\fB/usr/bin/more\fR 随后会列显 \fB--More--\fR，\fB/usr/xpg4/bin/more\fR 随后会在屏幕底部列显 \fIfile\fR。如果 \fBmore\fR 从文件而不是从管道读取，则还会显示到当前为止显示的字符数百分比。
.sp
.LP
\fBmore\fR 实用程序会向上滚动再显示一行来响应 \fBRETURN\fR 字符。\fBmore\fR 会再显示一个满屏来响应 \fBSPACE\fR 字符。下面列出了其他命令。
.sp
.LP
\fBpage\fR 实用程序会在显示下一个满屏文本前清除屏幕。\fBpage\fR 仅在屏幕之间提供一行重叠。
.sp
.LP
\fBmore\fR 实用程序将终端设置为 \fBNOECHO\fR 模式，从而使输出具有连续性。正常情况下，除了 \fB/\fR 和 \fB!\fR 命令以外，键入的命令不会在终端上显示。
.sp
.LP
\fB/usr/bin/more\fR 实用程序会在显示了最后指定的文件后退出。\fB/usr/xpg4/bin/more\fR 会在最后指定文件的最后一行处提示输入命令。
.sp
.LP
如果标准输出不是终端，则 \fBmore\fR 的作用就像 \fBcat\fR(1) 一样，但会在系列中每个文件之前列显一个文件头。
.SH 选项
.sp
.LP
\fB/usr/bin/more\fR 和 \fB/usr/xpg4/bin/more\fR 支持以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 7n
.rt  
在显示之前清除。重画屏幕（而不是滚动）以加快显示速度。如果终端不能清除到行末，则忽略此选项。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 7n
.rt  
如果使用了无法识别的命令，则显示错误消息，而不是在终端上响铃。这对没有经验的用户很有用。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fR
.ad
.RS 7n
.rt  
压缩。将多个空白行替换为一个空白行。这在查看屏幕上的 \fBnroff\fR(1) 输出时很有用。
.RE

.SS "/usr/bin/more"
.sp
.LP
\fB/usr/bin/more\fR 仅支持以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 15n
.rt  
不折叠长行。这在行包含非列显字符或转义序列时很有用，例如当 \fBnroff\fR(1) 输出通过 \fBul\fR(1) 传输时生成的字符。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 15n
.rt  
不将\fB换页\fR符 (Ctrl-l) 视为换页符。如果未使用 \fB-l\fR，则 \fBmore\fR 将在包含 \fB^L\fR 字符 (Ctrl-l) 的任何行之后暂停以接受命令。此外，如果文件以\fB换页符\fR开头，则将清除屏幕后再列显文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR \fR
.ad
.RS 15n
.rt  
正常情况下，\fBmore\fR 会忽略不以某种方式解释的控制字符。\fB-r\fR 选项会导致将这些字符显示为 \fB^\fR\fIC\fR，其中 \fIC\fR 代表任何此类控制字符。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR \fR
.ad
.RS 15n
.rt  
禁止生成下划线转义序列。正常情况下，\fBmore\fR 采用适合终端的方式处理下划线，例如 \fBnroff\fR(1) 生成的下划线。如果终端可以执行下划线，或者具有突出模式，则 \fBmore\fR 在需要时会在文本文件中提供相应的转义序列。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-w\fR\fR
.ad
.RS 15n
.rt  
正常情况下，\fBmore\fR 会在到达其输入的末尾时退出。但是，使用 \fB-w\fR 时，\fBmore\fR 将提示，并等待按任意键后退出。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-\fR\fIlines\fR\fR
.ad
.RS 15n
.rt  
在每个满屏中显示指示的\fI行数\fR，而不是显示缺省行数（比终端屏幕行数少两行）。
.RE

.sp
.ne 2
.mk
.na
\fB\fB+\fR\fIlinenumber\fR\fR
.ad
.RS 15n
.rt  
在\fI行号\fR处开始。
.RE

.sp
.ne 2
.mk
.na
\fB\fB+/\fR\fIpattern\fR\fR
.ad
.RS 15n
.rt  
在包含正则表达式\fI模式\fR的行上方两行处开始。\fB注意：\fR与编辑器不同，此结构\fI不应\fR以 `\fB/\fR' 结尾。否则，会将结尾斜杠视为搜索模式中的一个字符。
.RE

.SS "/usr/xpg4/bin/more"
.sp
.LP
\fB/usr/xpg4/bin/more\fR 仅支持以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-e\fR \fR
.ad
.RS 17n
.rt  
在写入参数列表中最后一个文件的最后一行之后立即退出。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fR
.ad
.RS 17n
.rt  
在搜索中执行模式匹配时不考虑大小写。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR \fInumber\fR \fR
.ad
.RS 17n
.rt  
指定每个满屏的行数。\fInumber\fR 参数是一个十进制正整数。\fB-n\fR 选项将覆盖从环境获取的任何值。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIcommand\fR \fR
.ad
.br
.na
\fB\fB+\fR\fIcommand\fR \fR
.ad
.RS 17n
.rt  
对于每个检查的文件，最初都会执行 \fIcommand\fR 参数中的 \fBmore\fR 命令。如果是定位命令（例如行号或正则表达式搜索），则设置当前位置以代表命令的最终结果，而不写入任何中间文件行。例如以下两个命令：
.sp
.in +2
.nf
\fBmore -p 1000j file  
more -p 1000G file\fR
.fi
.in -2
.sp

是等效的，在行 1000 的当前位置开始显示，跳过 \fBj\fR 将写入的行，并通过滚动离开已在文件检查期间显示的屏幕。如果定位命令未成功，则文件中的第一行将成为当前位置。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fItagstring\fR \fR
.ad
.RS 17n
.rt  
写入满屏的文件，其中包含 \fItagstring\fR 参数指定的标记。请参见 \fBctags\fR(1) 实用程序。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.RS 17n
.rt  
将退格符视为可列显控制字符，显示为 ^H (Ctrl-h)，禁止退格以及会在某些终端类型上产生带下划线文本或 standout 模式文本的特殊处理。此外，不忽略行末的回车字符。
.RE

.sp
.LP
如果指定了 \fB-t\fR\fI tagstring\fR 和 \fB-p\fR\fI command\fR（或者废弃的 \fI+command\fR）选项，则先处理 \fB-t\fR\fI tagstring\fR。
.SH 用法
.SS "环境"
.sp
.LP
\fBmore\fR 使用终端的 \fBterminfo\fR(4) 输入来确定其显示特征。
.sp
.LP
\fBmore\fR 在环境变量 \fBMORE\fR 中查找任何预设选项。例如，要使用缺省的 \fB-c\fR 模式在文件中翻页，可将此变量的值设置为 \fB-c\fR。（正常情况下，用于设置此环境变量的命令序列放在 \fB\&.login\fR 或 \fB\&.profile\fR 文件中。）
.SS "命令"
.sp
.LP
命令立即生效。除非命令需要 \fIfile\fR、\fIcommand\fR、\fItagstring\fR 或 \fIpattern\fR，否则不必键入回车。到指定命令字符本身时为止，用户可以键入行中止字符以取消正在形成的数值参数。此外，用户还可以键入擦除字符以重新显示 `\fB--More--(\fR\fIxx\fR%)' 或 \fIfile\fR 消息。
.sp
.LP
在以下命令中，\fIi\fR 是一个数值参数（缺省值为 \fB1\fR）。
.sp
.ne 2
.mk
.na
\fB\fIi\fRSPACE \fR
.ad
.RS 13n
.rt  
再显示一个满屏，或者，如果指定了 \fIi\fR，则再显示 \fIi\fR 行。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fRRETURN \fR
.ad
.RS 13n
.rt  
再显示一行，或者再显示指定的 \fIi\fR 行。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fBb\fR\fR
.ad
.br
.na
\fB\fIi\fR\fB^B\fR\fR
.ad
.RS 13n
.rt  
(Ctrl-b) 回跳 \fIi\fR 个满屏，然后列显一个满屏。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fBd\fR\fR
.ad
.br
.na
\fB\fIi\fR\fB^D\fR\fR
.ad
.RS 13n
.rt  
(Ctrl-d) 向前滚动半个满屏或 \fIi\fR 行。如果指定了 \fIi\fR，则该计数将成为后续 \fBd\fR 和 \fBu\fR 命令的缺省值。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fBf\fR\fR
.ad
.RS 13n
.rt  
跳过 \fIi\fR 个满屏，然后列显一个满屏。
.RE

.sp
.ne 2
.mk
.na
\fB\fBh\fR\fR
.ad
.RS 13n
.rt  
帮助。提供对所有 \fBmore\fR 命令的说明。
.RE

.sp
.ne 2
.mk
.na
\fB\fB^L\fR \fR
.ad
.RS 13n
.rt  
(Ctrl-l) 刷新。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fBn\fR\fR
.ad
.RS 13n
.rt  
搜索出现的第 \fIi \fR 个最后输入的 \fIpattern\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBq\fR \fR
.ad
.br
.na
\fB\fBQ\fR \fR
.ad
.RS 13n
.rt  
从 \fBmore\fR 退出。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fBs\fR\fR
.ad
.RS 13n
.rt  
跳过 \fIi\fR 行，然后列显一个满屏。
.RE

.sp
.ne 2
.mk
.na
\fB\fBv\fR\fR
.ad
.RS 13n
.rt  
进入 \fBvi\fR 编辑器，并定位到当前文件的当前行。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fBz\fR\fR
.ad
.RS 13n
.rt  
与 SPACE 相同，但 \fIi\fR（如果有）将成为每个满屏的新缺省行数。
.RE

.sp
.ne 2
.mk
.na
\fB\fB=\fR \fR
.ad
.RS 13n
.rt  
显示当前行号。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fB/\fR\fIpattern\fR\fR
.ad
.RS 13n
.rt  
向前搜索第 \fIi \fR 个正则表达式 \fIpattern\fR。显示满屏，起始行为包含第 \fIi \fR 个正则表达式 \fIpattern\fR 匹配项的行之前两行或管道末尾（以先出现的为准）。如果 \fBmore\fR 是显示一个文件，但没有匹配项，则其在文件中的位置保持不变。可以使用擦除或中止字符编辑正则表达式。向后擦除超过第一列将取消搜索命令。
.RE

.sp
.ne 2
.mk
.na
\fB\fB!\fR\fIcommand\fR\fR
.ad
.RS 13n
.rt  
调用 shell 以执行 \fIcommand \fR。字符 \fB%\fR 和 \fB!\fR 在 \fIcommand\fR 内使用时将被分别替换为当前文件名和上一个 shell 命令。如果没有当前文件名，则不扩展 \fB%\fR。在这些字符前附加一个反斜杠可进行转义扩展。
.RE

.sp
.ne 2
.mk
.na
\fB\fB:f\fR\fR
.ad
.RS 13n
.rt  
显示当前文件名和行号。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fB:n\fR\fR
.ad
.RS 13n
.rt  
跳到命令行中接下来的第 \fIi \fR 个文件名，或者跳到列表中的最后一个文件名（当 \fIi\fR 超出范围时）。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fB:p\fR\fR
.ad
.RS 13n
.rt  
跳到命令行中前面的第 \fIi \fR 个文件名，或者跳到列表中的第一个文件名（当 \fIi\fR 超出范围时）。如果在 \fBmore\fR 在文件中定位时指定，则转到文件开头。如果 \fBmore\fR 正在从管道读取，则 \fBmore\fR 仅在终端上响铃。
.RE

.sp
.ne 2
.mk
.na
\fB\fB:q\fR\fR
.ad
.br
.na
\fB\fB:Q\fR\fR
.ad
.RS 13n
.rt  
从 \fBmore\fR 退出（与 \fBq\fR 或 \fBQ\fR 相同）。
.RE

.SS "/usr/bin/more"
.sp
.LP
以下命令仅在 \fB/usr/bin/more\fR 中可用：
.sp
.ne 2
.mk
.na
\fB\fB\&'\fR\fR
.ad
.RS 7n
.rt  
单引号。转到上次搜索的开始点。如果尚未在当前文件中执行任何搜索，则转到文件开头。
.RE

.sp
.ne 2
.mk
.na
\fB\fB\&.\fR\fR
.ad
.RS 7n
.rt  
点。重复上一个命令。
.RE

.sp
.ne 2
.mk
.na
\fB\fB^ \\fR\fR
.ad
.RS 7n
.rt  
暂停部分显示的文本。\fBmore\fR 停止发送输出，并显示通常的 \fB--More--\fR 提示。有些输出会因此丢失。
.RE

.SS "/usr/xpg4/bin/more"
.sp
.LP
以下命令仅在 \fB/usr/xpg4/bin/more\fR 中可用：
.sp
.ne 2
.mk
.na
\fB\fIi\fR\fB^F\fR\fR
.ad
.RS 17n
.rt  
(Ctrl-f) 跳过 \fIi\fR 个满屏，然后列显一个满屏。（与 \fIi\fR\fBf\fR 相同。）
.RE

.sp
.ne 2
.mk
.na
\fB\fB^G\fR\fR
.ad
.RS 17n
.rt  
(Ctrl-g) 显示当前行号（与 \fB=\fR 相同。）
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fBg\fR\fR
.ad
.RS 17n
.rt  
转到行号 \fIi\fR，采用缺省的文件第一行。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fBG\fR\fR
.ad
.RS 17n
.rt  
转到行号 \fIi\fR，采用缺省的文件最后一行。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fBj\fR\fR
.ad
.RS 17n
.rt  
再显示一行，或者再显示指定的 \fIi\fR 行。（与 \fIi\fRRETURN 相同。）
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fBk\fR\fR
.ad
.RS 17n
.rt  
回滚一行或者指定的 \fIi\fR 行。
.RE

.sp
.ne 2
.mk
.na
\fB\fBm\fR\fIletter\fR \fR
.ad
.RS 17n
.rt  
用名称 \fIletter\fR 标记当前位置。
.RE

.sp
.ne 2
.mk
.na
\fB\fBN\fR \fR
.ad
.RS 17n
.rt  
反转搜索方向。
.RE

.sp
.ne 2
.mk
.na
\fB\fBr\fR \fR
.ad
.RS 17n
.rt  
刷新屏幕。
.RE

.sp
.ne 2
.mk
.na
\fB\fBR\fR \fR
.ad
.RS 17n
.rt  
刷新屏幕，放弃任何缓冲的输入。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fBu\fR\fR
.ad
.br
.na
\fB\fIi\fR\fB^U\fR\fR
.ad
.RS 17n
.rt  
(Ctrl-u) 回滚半屏或者指定的 \fIi\fR 行。如果指定了 \fIi\fR，则该计数将成为后续 \fBd\fR 和 \fBu\fR 命令的新缺省值。
.RE

.sp
.ne 2
.mk
.na
\fB\fBZZ\fR \fR
.ad
.RS 17n
.rt  
从 \fBmore\fR 退出（与 \fBq\fR 相同）。
.RE

.sp
.ne 2
.mk
.na
\fB\fB:e\fR \fIfile\fR \fR
.ad
.RS 17n
.rt  
检查（显示）新文件。如果未指定 \fIfile\fR，则重新显示当前文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fB:t\fR \fItagstring\fR \fR
.ad
.RS 17n
.rt  
转到 \fItagstring\fR 参数指定的标记，然后用标记的行在当前位置滚动/重写屏幕。请参见 \fBctags\fR 实用程序。
.RE

.sp
.ne 2
.mk
.na
\fB\fB\&'\fR\fIletter\fR \fR
.ad
.RS 17n
.rt  
返回到之前用名称 \fIletter\fR 标记的位置。
.RE

.sp
.ne 2
.mk
.na
\fB\fB\&''\fR \fR
.ad
.RS 17n
.rt  
返回到上一次开始移动多个满屏的位置。缺省设置为文件开头。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fB?\fR[\fI!\fR]\fIpattern\fR\fR
.ad
.RS 17n
.rt  
在文件中向后搜索包含 \fIpattern\fR 的第 \fIi\fR 行。\fI!\fR 指定向后搜索不包含 \fIpattern\fR 的第 \fIi\fR 行。
.RE

.sp
.ne 2
.mk
.na
\fB\fIi\fR\fB/\fR\fB!\fR\fIpattern\fR\fR
.ad
.RS 17n
.rt  
在文件中向前搜索不包含 pattern 的第 \fIi\fR 行。
.RE

.sp
.ne 2
.mk
.na
\fB\fB!\fR[\fIcommand\fR]\fR
.ad
.RS 17n
.rt  
调用 shell 或指定的命令。
.RE

.SS "大型文件行为"
.sp
.LP
有关 \fBmore\fR 和 \fBpage\fR 遇到大于或等于 2 GB（2^31 字节）文件时行为的说明，请参见 \fBlargefile\fR(5)。
.SH 环境变量
.sp
.LP
有关以下环境变量的说明，请参见 \fBenviron\fR(5)；这些变量会影响 \fBmore\fR 的执行：\fBLANG\fR、\fBLC_ALL\fR、\fBLC_COLLATE\fR（仅限 \fB/usr/xpg4/bin/more\fR）、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR、\fBNLSPATH\fR 和 \fBTERM\fR。
.SS "/usr/xpg4/bin/more"
.sp
.LP
以下环境变量也会影响 \fB/usr/xpg4/bin/more\fR 的执行：
.sp
.ne 2
.mk
.na
\fB\fBCOLUMNS\fR \fR
.ad
.RS 12n
.rt  
覆盖系统选择的横向屏幕大小。
.RE

.sp
.ne 2
.mk
.na
\fB\fBEDITOR\fR \fR
.ad
.RS 12n
.rt  
由 \fBv\fR 命令用于选择编辑器。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLINES\fR \fR
.ad
.RS 12n
.rt  
覆盖系统选择的纵向屏幕大小。在确定屏幕中的行数时，\fB-n\fR 选项优先于 \fBLINES\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMORE\fR \fR
.ad
.RS 12n
.rt  
指定上文中“选项”部分描述的选项的字符串。跟在命令行中一样，选项必须用空白字符分隔，每个选项规范必须以 - 开头。所有命令行选项都在 \fBMORE\fR 中指定的选项之后处理，等效于以下命令行：\fBmore $MORE\fR \fIoptions operands\fR
.RE

.SH 退出状态
.sp
.LP
将返回以下退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 7n
.rt  
成功完成。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR \fR
.ad
.RS 7n
.rt  
出现错误。
.RE

.SH 文件
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/more.help\fR\fR
.ad
.RS 22n
.rt  
仅适用于 \fB/usr/bin/more\fR 和 \fB/usr/bin/page\fR 的帮助文件。
.RE

.SH 属性
.sp
.LP
有关下列属性的说明，请参见 \fBattributes\fR(5)：
.SS "/usr/bin/more /usr/bin/page"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
_
CSINot enabled（未启用）
.TE

.SS "/usr/xpg4/bin/more"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/xopen/xcu4
_
CSIEnabled（已启用）
_
接口稳定性Committed（已确定）
_
标准请参见 \fBstandards\fR(5)。
.TE

.SH 另请参见
.sp
.LP
\fBcat\fR(1)、\fBcsh\fR(1)、\fBctags\fR(1)、\fBman\fR(1)、\fBnroff\fR(1)、\fBscript\fR(1)、\fBsh\fR(1)、\fBul\fR(1)、\fBterminfo\fR(4)、\fBattributes\fR(5)、\fBenviron\fR(5)、\fBlargefile\fR(5)、\fBstandards\fR(5)
.SS "/usr/bin/more /usr/bin/page"
.sp
.LP
\fBregcomp\fR(3C)
.SS "/usr/xpg4/bin/more"
.sp
.LP
\fBregex\fR(5)
.SH 附注
.SS "/usr/bin/more"
.sp
.LP
对大型文件执行向后跳过的速度太慢。
.SS "/usr/xpg4/bin/more"
.sp
.LP
如果终端设置不当，此实用程序的行为将不正确。
