Alhadis/Silos/Solaris 11.3/zh_CN.UTF-8/man1/nm.1
'\" te
.\" Copyright 1989 AT&T 
.\" Copyright (c) 2007, 2013, Oracle and/or its affiliates.All rights reserved
.\" Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation.Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation.In the following statement, the phrase "this text" refers to portions of the system documentation.Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group.In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document.The original Standard can be obtained online at http://www.opengroup.org/unix/online.html.This notice shall appear on any product containing this material. 
.TH nm 1 "2013 年 9 月 10 日" "SunOS 5.11" "用户命令"
.SH 名称
nm \- 输出目标文件的名称列表
.SH 用法概要
.LP
.nf
\fB/usr/bin/nm\fR [\fB-ACDhLlnPpRrsTVv\fR] [\fB-efox\fR] [\fB-g\fR | \fB-u\fR] 
     [\fB-t\fR \fIformat\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/nm\fR [\fB-ACDhLlnPpRrsTVv\fR] [\fB-efox\fR] [\fB-g\fR | \fB-u\fR] 
     [\fB-t\fR \fIformat\fR] \fIfile\fR...
.fi

.SH 描述
.sp
.LP
\fBnm\fR 实用程序显示由 \fIfile\fR 指定的每个 \fBELF\fR 目标文件的符号表。
.sp
.LP
如果某个有效的输入文件没有可用的符号信息，\fBnm\fR 实用程序将报告该情况，但不将其视为出错。
.SH 选项
.sp
.LP
可以使用以下选项控制 \fBnm\fR 的输出：
.sp
.ne 2
.mk
.na
\fB\fB-A\fR\fR
.ad
.RS 13n
.rt  
输出目标文件的全路径名或库名称，每个目标文件一行。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR\fR
.ad
.RS 13n
.rt  
取消改编 C++ 符号名称后再将其输出出来。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR\fR
.ad
.RS 13n
.rt  
显示 \fBSHT_DYNSYM\fR 符号信息。这是 \fBld.so.1\fR 所使用的符号表，即使在剥离的动态可执行文件中也存在。如果未指定 \fB-D\fR，则缺省行为是显示 \fBSHT_SYMTAB\fR 符号信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.RS 13n
.rt  
请参见下文的“附注”部分。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 13n
.rt  
请参见下文的“附注”部分。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR\fR
.ad
.RS 13n
.rt  
仅写入外部（全局）符号信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 13n
.rt  
不显示输出标题数据。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fR
.ad
.RS 13n
.rt  
显示 \fBSHT_SUNW_LDYNSYM\fR 符号信息。此符号表包含局部函数符号。即使在剥离的动态可执行文件中也存在 \fBSHT_SUNW_LDYNSM\fR 符号表。这些符号扩充了 \fBSHT_DYNSYM\fR 符号表中的全局符号。如果未指定 \fB-L\fR，则缺省行为是显示 \fBSHT_SYMTAB\fR 符号信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 13n
.rt  
当与 \fB-p\fR 或 \fB-P\fR 选项一起使用时，通过在 \fBWEAK\fR 符号的键字母后附加 * 来区分 \fBWEAK\fR 和 \fBGLOBAL\fR 符号。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 13n
.rt  
在输出外部符号之前，按名称对其进行排序。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR\fR
.ad
.RS 13n
.rt  
列显符号的八进制（而不是十进制）值和大小（等效于 \fB-t\fR \fBo\fR）。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.RS 13n
.rt  
生成易于解析的扼要输出。每个符号名称前面是其值（未定义时为空格）及以下字母之一：
.sp
.ne 2
.mk
.na
\fB\fBA\fR\fR
.ad
.RS 5n
.rt  
绝对符号。
.RE

.sp
.ne 2
.mk
.na
\fB\fBB\fR\fR
.ad
.RS 5n
.rt  
bss（未初始化的数据空间）符号。
.RE

.sp
.ne 2
.mk
.na
\fB\fBC\fR\fR
.ad
.RS 5n
.rt  
COMMON 符号。
.RE

.sp
.ne 2
.mk
.na
\fB\fBD\fR\fR
.ad
.RS 5n
.rt  
数据对象符号。
.RE

.sp
.ne 2
.mk
.na
\fB\fBF\fR\fR
.ad
.RS 5n
.rt  
文件符号。
.RE

.sp
.ne 2
.mk
.na
\fB\fBN\fR\fR
.ad
.RS 5n
.rt  
符号没有类型。
.RE

.sp
.ne 2
.mk
.na
\fB\fBL\fR\fR
.ad
.RS 5n
.rt  
线程局部存储符号。
.RE

.sp
.ne 2
.mk
.na
\fB\fBR\fR\fR
.ad
.RS 5n
.rt  
寄存器符号。
.RE

.sp
.ne 2
.mk
.na
\fB\fBS\fR\fR
.ad
.RS 5n
.rt  
节符号。
.RE

.sp
.ne 2
.mk
.na
\fB\fBT\fR\fR
.ad
.RS 5n
.rt  
文本符号。
.RE

.sp
.ne 2
.mk
.na
\fB\fBU\fR\fR
.ad
.RS 5n
.rt  
未定义。
.RE

如果符号的绑定属性是：
.sp
.ne 2
.mk
.na
\fB\fBLOCAL\fR\fR
.ad
.RS 10n
.rt  
键字母小写。
.RE

.sp
.ne 2
.mk
.na
\fB\fBWEAK\fR\fR
.ad
.RS 10n
.rt  
键字母大写。如果指定了 \fB-l\fR 修饰符，则大写键字母后跟一个 \fB*\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fBGLOBAL\fR\fR
.ad
.RS 10n
.rt  
键字母大写。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR\fR
.ad
.RS 13n
.rt  
以可移植输出格式（如\fB\fR“标准输出”部分中所述）写入信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.RS 13n
.rt  
将目标文件或归档成员的名称附加到每个符号名称之前，格式为 \fIobject\fR\fB:\fR\fIsymbol\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.RS 13n
.rt  
处理归档时，将归档名称和归档成员名称附加到每个符号名称之前，格式为 \fIarchive\fR\fB:\fR\fImember\fR\fB:\fR\fIsymbol\fR。处理非归档文件时，\fB-R\fR 选项等效于 \fB-r\fR。如果还指定了 \fB-r\fR 选项，将忽略此选项。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 13n
.rt  
列显节名称而不是节索引。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fIformat\fR\fR
.ad
.RS 13n
.rt  
以指定格式写入每个数值。具体格式取决于用作 \fIformat\fR 选项参数的单个字符：
.sp
.ne 2
.mk
.na
\fB\fBd\fR\fR
.ad
.RS 5n
.rt  
以十进制写入偏移（缺省设置）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBo\fR\fR
.ad
.RS 5n
.rt  
以八进制写入偏移。
.RE

.sp
.ne 2
.mk
.na
\fB\fBx\fR\fR
.ad
.RS 5n
.rt  
以十六进制写入偏移。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR\fR
.ad
.RS 13n
.rt  
请参见\fB\fR“附注”部分。
.RE

.SS "/usr/bin/nm"
.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.RS 6n
.rt  
仅列显未定义的符号。如果指定了此选项，则会忽略 \fB-p\fR 和 \fB-P\fR 选项。
.RE

.SS "/usr/xpg4/bin/nm"
.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.RS 6n
.rt  
列显每个未定义符号的长列表。请参见下文的\fB\fR“输出”部分。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 6n
.rt  
在输出外部符号之前，按值对其进行排序。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR\fR
.ad
.RS 6n
.rt  
在标准错误输出中列显所执行 \fBnm\fR 命令的版本。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.RS 6n
.rt  
列显符号的十六进制（而不是十进制）值和大小（等效于 \fB-t\fR \fBx\fR）。
.RE

.sp
.LP
这些选项可以以任何顺序、单独或组合使用。如果指定了冲突的选项（例如 \fB-v\fR 和 \fB-n\fR，或者 \fB-o\fR 和 \fB-x\fR），则将采用第一个选项而忽略第二个选项，并向用户显示警告消息。有关例外，请参见 \fB-R\fR 和 \fB-u\fR 的 \fB/usr/bin/nm\fR 形式。
.SH 操作数
.sp
.LP
支持下列操作数：
.sp
.ne 2
.mk
.na
\fB\fIfile\fR\fR
.ad
.RS 8n
.rt  
目标文件、可执行文件或目标文件库的路径名称。
.RE

.SH 输出
.sp
.LP
本部分介绍 \fBnm\fR 实用程序的输出选项。
.SS "标准输出"
.sp
.LP
对于每个符号，将输出下列信息：
.sp
.ne 2
.mk
.na
\fB\fBIndex\fR\fR
.ad
.RS 15n
.rt  
符号的索引。（索引显示在方括号中。）
.RE

.sp
.ne 2
.mk
.na
\fB\fBValue\fR\fR
.ad
.RS 15n
.rt  
符号的值为以下值之一：
.RS +4
.TP
.ie t \(bu
.el o
可重定位文件中已定义符号的节偏移。
.RE
.RS +4
.TP
.ie t \(bu
.el o
节索引为 \fBSHN_COMMON\fR 的符号的对齐约束。
.RE
.RS +4
.TP
.ie t \(bu
.el o
可执行文件和动态库文件中的虚拟地址。
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fBSize\fR\fR
.ad
.RS 15n
.rt  
关联的目标文件的大小（以字节为单位）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBType\fR\fR
.ad
.RS 15n
.rt  
符号属于以下类型之一：
.sp
.ne 2
.mk
.na
\fB\fBNOTYPE\fR\fR
.ad
.RS 11n
.rt  
未指定类型。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOBJECT\fR\fR
.ad
.RS 11n
.rt  
数据对象，如数组或变量。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFUNC\fR\fR
.ad
.RS 11n
.rt  
函数或其他可执行代码。
.RE

.sp
.ne 2
.mk
.na
\fB\fBREGI\fR\fR
.ad
.RS 11n
.rt  
寄存器符号（仅限 \fBSPARC\fR）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSECTION\fR\fR
.ad
.RS 11n
.rt  
节符号。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFILE\fR\fR
.ad
.RS 11n
.rt  
源文件的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCOMMON\fR\fR
.ad
.RS 11n
.rt  
未初始化的通用块。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTLS\fR\fR
.ad
.RS 11n
.rt  
与线程局部存储关联的变量。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBBind\fR\fR
.ad
.RS 15n
.rt  
符号的绑定属性。
.sp
.ne 2
.mk
.na
\fB\fBLOCAL symbols\fR\fR
.ad
.RS 18n
.rt  
作用域仅限于包含其定义的目标文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fBGLOBAL symbols\fR\fR
.ad
.RS 18n
.rt  
对要组合的所有目标文件可见。
.RE

.sp
.ne 2
.mk
.na
\fB\fBWEAK symbols\fR\fR
.ad
.RS 18n
.rt  
实际上是优先级低于 \fBGLOBAL\fR 的全局符号。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBOther\fR\fR
.ad
.RS 15n
.rt  
一个整数，对应于在 \fB<sys/elf.h>\fR 中定义的 \fBSTV_\fR 符号可见性值之一。
.RE

.sp
.ne 2
.mk
.na
\fB\fBShndx\fR\fR
.ad
.RS 15n
.rt  
除了三个特殊值以外，这是与符号定义相关的节头表索引。存在以下特殊值：
.sp
.ne 2
.mk
.na
\fB\fBABS\fR\fR
.ad
.RS 10n
.rt  
指示符号的值不因重定位而更改。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCOMMON\fR\fR
.ad
.RS 10n
.rt  
指示未分配的块和值提供对齐约束。
.RE

.sp
.ne 2
.mk
.na
\fB\fBUNDEF\fR\fR
.ad
.RS 10n
.rt  
指示符号未定义。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBName\fR\fR
.ad
.RS 15n
.rt  
符号的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBObject Name\fR\fR
.ad
.RS 15n
.rt  
指定 \fB-A\fR 时目标文件或库的名称。
.RE

.sp
.LP
如果指定了 \fB-P\fR 选项，将使用以下可移植格式显示以前的信息。三个版本的差异取决于是否分别指定了 \fB-t\fR \fBd\fR、\fB-t\fR \fBo\fR 还是 \fB-t\fR \fBx\fR：
.sp
.in +2
.nf
\fB"%s%s %s %d %d\en",\fR \fIlibrary/object name\fR, \fIname\fR, \fItype\fR, \fIvalue\fR, \fIsize\fR
.fi
.in -2
.sp

.sp
.in +2
.nf
\fB"%s%s %s %o %o\en",\fR \fIlibrary/object name\fR, \fIname\fR, \fItype\fR, \fIvalue\fR, \fIsize\fR
.fi
.in -2
.sp

.sp
.in +2
.nf
\fB"%s%s %s %x %x\en",\fR \fIlibrary/object name\fR, \fIname\fR, \fItype\fR, \fIvalue\fR, \fIsize\fR
.fi
.in -2
.sp

.sp
.LP
其中，\fItype\fR 的格式设置方式与 \fB-p\fR 选项相同，\fIlibrary/object name\fR 的格式设置方式如下：
.RS +4
.TP
.ie t \(bu
.el o
如果未指定 \fB-A\fR，则 \fIlibrary/object name\fR 为空字符串。
.RE
.RS +4
.TP
.ie t \(bu
.el o
如果指定了 \fB-A\fR，并且对应的 \fIfile\fR 操作数未指定库：
.sp
.in +2
.nf
\fB"%s: ", \fIfile\fR\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
.ie t \(bu
.el o
如果指定了 \fB-A\fR，并且对应的 \fIfile\fR 操作数指定了库。在这种情况下，\fIobject file\fR 指定库中包含要描述的符号的目标文件：
.sp
.in +2
.nf
\fB"%s[%s]: ", \fIfile\fR, \fIobject file\fR\fR
.fi
.in -2
.sp

.RE
.sp
.LP
如果未指定 \fB-A\fR，并且指定了多个 \fIfile\fR 操作数，或者仅指定了一个 \fIfile\fR 操作数但该操作数指定了库，则 \fBnm\fR 将在包含这些符号的行之前使用以下格式写入一行，以标识包含以下符号的目标文件：
.RS +4
.TP
.ie t \(bu
.el o
如果对应的 \fIfile\fR 操作数未指定库：
.sp
.in +2
.nf
\fB"%s:\en", \fIfile\fR\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
.ie t \(bu
.el o
如果对应的 \fIfile\fR 操作数指定了库；在这种情况下，\fIobject file\fR 是库中包含以下符号的文件的文件名：
.sp
.in +2
.nf
\fB"%s[%s]:\en", \fIfile\fR, \fIobject file\fR\fR
.fi
.in -2
.sp

.RE
.sp
.LP
如果指定了 \fB-P\fR，但未指定 \fB-t\fR，则格式与指定 \fB-t\fR \fBx\fR 时的格式相同。
.SH 环境变量
.sp
.LP
有关影响 \fBnm\fR 执行的以下环境变量的说明，请参见 \fBenviron\fR(5)：\fBLANG\fR、\fBLC_ALL\fR、\fBLC_COLLATE\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR 和 \fBNLSPATH\fR。
.SH 退出状态
.sp
.LP
将返回以下退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
成功完成。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
出现错误。
.RE

.SH 属性
.sp
.LP
有关下列属性的说明，请参见 \fBattributes\fR(5)：
.SS "/usr/bin/nm"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性developer/base-developer-utilities
.TE

.SS "/usr/xpg4/bin/nm"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/xopen/xcu4
_
接口稳定性Committed（已确定）
.TE

.SH 另请参见
.sp
.LP
\fBar\fR(1)、\fBas\fR(1)、\fBdump\fR(1)、\fBld\fR(1)、\fBld.so.1\fR(1)、\fBar.h\fR(3HEAD)、\fBa.out\fR(4)、\fBattributes\fR(5)、\fBenviron\fR(5)、\fBstandards\fR(5)
.SH 附注
.sp
.LP
由于目标文件格式发生了变化，以下选项已过时，可能会在将来的版本中删除。
.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.RS 6n
.rt  
仅列显外部符号和静态符号。符号表中现在仅包含静态符号和外部符号。自动符号不再出现在符号表中。它们出现在通过 \fBcc\fR \fB-g\fR 所生成的调试信息中，可以使用 \fBdump\fR(1) 对其进行检查。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 6n
.rt  
生成完整输出。由于以前的冗余符号（如 \fB\&.text\fR、\fB\&.data\fR 等）不再存在，所以生成完整输出与缺省输出完全相同。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR\fR
.ad
.RS 6n
.rt  
缺省情况下，\fBnm\fR 输出所列符号的整个名称。因为已将符号名称移到最后一行，因此消除了溢出问题，不再需要截断符号名称。
.RE

