Alhadis/Silos/Solaris 11.3/zh_CN.UTF-8/man1/pkginfo.1
'\" te
.\" Copyright (c) 2007, 2012, Oracle and/or its affiliates. All rights reserved.
.\"  Copyright 1989 AT&T
.TH pkginfo 1 "2012 年 1 月 5 日" "SunOS 5.11" "用户命令"
.SH 名称
pkginfo \- 显示软件包信息
.SH 用法概要
.LP
.nf
\fBpkginfo\fR [\fB-q\fR | \fB-x\fR | \fB-l\fR] [\fB-p\fR | \fB-i\fR] [\fB-r\fR] [\fB-a\fR \fIarch\fR] 
     [\fB-v\fR \fIversion\fR] [\fB-c\fR \fIcategory\fR]... [\fIpkginst\fR]...
.fi

.LP
.nf
\fBpkginfo\fR \fB-d\fR \fIdevice\fR [\fB-R\fR \fIroot_path\fR] [\fB-q\fR | \fB-x\fR | \fB-l\fR] [\fB-a\fR \fIarch\fR] 
     [\fB-v\fR \fIversion\fR] [\fB-c\fR \fIcategory\fR]... [\fIpkginst\fR]...
.fi

.SH 描述
.sp
.LP
\fBpkginfo\fR 显示安装在系统中的软件包信息（首先说明），或位于特定设备或目录中的软件包信息（其次说明）。
.sp
.LP
没有选项时，\fBpkginfo\fR 列出主要类别、软件包实例和所有完全安装及部分安装的软件包的名称。针对每个选择的软件包显示一行。
.SH 选项
.sp
.LP
\fB-p\fR 和 \fB-i\fR 选项与 \fB-d\fR 选项结合使用时无意义。
.sp
.LP
选项 \fB-q\fR、\fB-x\fR 和 \fB-l\fR 是互斥的。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fIarch\fR\fR
.ad
.sp .6
.RS 4n
将软件包体系结构指定为 \fBarch\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIcategory\fR\fR
.ad
.sp .6
.RS 4n
显示匹配 \fIcategory\fR 的软件包。类别在 \fBpkginfo\fR(4) 文件中以 \fBCATEGORY\fR 参数定义。如果提供了多个类别，软件包只需匹配列表中的一个类别。匹配并非特定于案例的。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIdevice\fR\fR
.ad
.sp .6
.RS 4n
定义软件包所在的设备 \fIdevice\fR。\fIdevice\fR 可以是磁带、可移除磁盘等的绝对目录路径名或标识符。特殊令牌 \fBspool\fR 可用来表示缺省的安装假脱机目录 (\fB/var/spool/pkg\fR)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.sp .6
.RS 4n
仅显示完全安装的软件包的信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
指定长格式，其包含指定软件包的所有可用信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
仅显示部分安装的软件包的信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR\fR
.ad
.sp .6
.RS 4n
不列出任何信息。通过程序使用，检查是否已安装某个软件包。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
列出可重定位的软件包的安装库。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot_path\fR\fR
.ad
.sp .6
.RS 4n
定义要用作 \fI根路径\fR 的目录的全路径名。所有文件，包括软件包系统信息文件，都重定位到指定的 \fIroot_path\fR 下开始的目录树。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR \fIversion\fR\fR
.ad
.sp .6
.RS 4n
指定软件包版本为 \fIversion\fR。版本在 \fBpkginfo\fR(4) 文件中以 \fBVERSION\fR 参数定义。可通过在版本名前加波浪号 (\fB≃\fR) 请求所有兼容版本。在版本比较时多个空格将替换为一个空格。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.sp .6
.RS 4n
指定软件包的提取列表。列表包括软件包缩写、软件包名称、软件包体系结构（如果有）和软件包版本（如果有）。
.RE

.SH 操作数
.sp
.ne 2
.mk
.na
\fB\fIpkginst\fR\fR
.ad
.sp .6
.RS 4n
按软件包实例指定软件包。实例可以是软件包缩写或特定的实例（例如，\fBinst.1\fR 或 \fBinst.2\fR）。可以通过 \fBinst.*\fR 请求软件包的所有实例。星号字符(\fB*\fR) 对于某些 shell 来说是特殊字符，可能需要转义。在 C-Shell 中，"\fB*\fR" 必须由单引号 (\fB\&'\fR) 括起来或者在前面加反斜杠 (\)。
.RE

.SH 退出状态
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
成功完成。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.sp .6
.RS 4n
出现错误。
.RE

.SH 文件
.sp
.ne 2
.mk
.na
\fB\fB/var/spool/pkg\fR\fR
.ad
.sp .6
.RS 4n
缺省的安装假脱机目录
.RE

.SH 属性
.sp
.LP
有关下列属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
.TE

.SH 另请参见
.sp
.LP
\fBpkgtrans\fR(1)、\fBpkgadd\fR(1M)、\fBpkgask\fR(1M)、\fBpkgchk\fR(1M)、\fBpkgrm\fR(1M)、\fBpkginfo\fR(4)、\fBattributes\fR(5)、\fBlargefile\fR(5)
.sp
.LP
\fI《Packaging and Delivering Software With the Image Packaging System in Oracle Solaris 11.3》\fR
.SH 附注
.sp
.LP
软件包命令可识别 \fBlargefile\fR(5)。它们处理大于 2 GB 的文件的方法与处理较小文件的方法相同。在当前的执行中，\fBpkgadd\fR(1M)、\fBpkgtrans\fR(1) 和其他软件包命令可以处理最大 4 GB 的数据流。
