Alhadis/Silos/Solaris 11.3/zh_CN.UTF-8/man1/ps.1
'\" te
.\" Copyright 1989 AT&T
.\" Portions Copyright (c) 2009, 2014, Oracle and/or its affiliates.All rights reserved.
.\" Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation.In the following statement, the phrase "this text" refers to portions of the system documentation.Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group.In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document.The original Standard can be obtained online at http://www.opengroup.org/unix/online.html.This notice shall appear on any product containing this material. 
.TH ps 1 "2014 年 1 月 29 日" "SunOS 5.11" "用户命令"
.SH 名称
ps \- 报告进程状态
.SH 用法概要
.LP
.nf
\fBps\fR [\fB-aAcdefjHlLPyZ\fR] [\fB-g\fR \fIgrplist\fR] [\fB-h\fR \fIlgrplist\fR] 
     [\fB-n\fR \fInamelist\fR] [\fB-o\fR \fIformat\fR]... [\fB-p\fR \fIproclist\fR] 
     [\fB-s\fR \fIsidlist\fR] [\fB-t\fR \fIterm\fR] [\fB-u\fR \fIuidlist\fR] [\fB-U\fR \fIuidlist\fR] 
     [\fB-G\fR \fIgidlist\fR] [\fB-z\fR \fIzonelist\fR]
.fi

.SH 描述
.sp
.LP
\fBps\fR 命令会输出活动进程的相关信息。如果不使用任何选项，\fBps\fR 会输出与调用程序具有相同有效用户 \fBID\fR 和相同控制终端的进程的相关信息。输出仅包含进程 \fBID\fR、终端标识符、累计执行时间和命令名称。否则，显示的信息将由选项控制。
.sp
.LP
有些选项可以接受列表作为参数。列表中的项目可以用逗号分隔，也可以括在引号内并以逗号或空格分隔。\fIproclist\fR 和 \fIgrplist\fR 的值必须为数字。
.sp
.LP
\fBps\fR 命令会尝试确定其是在本地调用，还是使用 \fBps\fR(1B) 期望的命令语法来调用。在后一种情况下，\fBps\fR 命令行为与 \fBps\fR(1B) 中所述完全相同。 
.SH 选项
.sp
.LP
支持以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
列出收到请求最频繁的\fB所有\fR进程的相关信息，但会话引导者以及未与终端关联的进程除外。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-A\fR\fR
.ad
.sp .6
.RS 4n
列出所有进程的信息。与下文的 \fB-e\fR 相同。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.sp .6
.RS 4n
以体现调度程序属性的格式列显信息，如 \fBpriocntl\fR(1) 中所述。\fB-c\fR 选项会影响 \fB-f\fR 和 \fB-l\fR 选项的输出，如下文所述。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
列出除会话引导者以外的所有进程的相关信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.sp .6
.RS 4n
列出正在运行的\fB每个\fR进程的相关信息。
.sp
指定了 \fB-e\fR 选项时，\fB-z\fR、\fB-t\fR、\fB-u\fR、\fB-U\fR、\fB-g\fR、\fB-G\fR、\fB-p\fR、\fB-g\fR、\fB-s\fR 和 \fB-a\fR 选项不起作用。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
生成一份\fB完整\fR列表。（请参见下文了解完整列表中各列的含义。）
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR \fIgrplist\fR\fR
.ad
.sp .6
.RS 4n
仅列出其进程组引导者的 \fBID\fR 编号出现在 \fIgrplist\fR 中的进程数据。（进程组引导者是一个进程，其进程 \fBID\fR 编号与其进程组 \fBID\fR 编号相同。）
.RE

.sp
.ne 2
.mk
.na
\fB\fB-G\fR \fIgidlist\fR\fR
.ad
.sp .6
.RS 4n
列出其实际组 ID 编号出现在 \fIgidlist\fR 中的进程的信息。\fIgidlist\fR 必须是一个采用空格或逗号分隔列表格式的单一参数。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR \fIlgrplist\fR\fR
.ad
.sp .6
.RS 4n
仅列出驻留在指定 \fIlgrplist\fR 上的进程。不列出 \fIlgrplist\fR 中指定的任何无效组的信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR\fR
.ad
.sp .6
.RS 4n
在附加列标题 (LGRP) 下列显进程的主 lgroup。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-j\fR\fR
.ad
.sp .6
.RS 4n
列显会话 \fBID\fR 和进程组 \fBID\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
生成一份\fB长\fR列表。（请参见下文。）
.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fR
.ad
.sp .6
.RS 4n
列显各个所选进程中各个轻量级进程 (\fIlwp\fR) 的相关信息。（请参见下文。）
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR \fInamelist\fR\fR
.ad
.sp .6
.RS 4n
指定替代缺省设置的备用系统 \fInamelist\fR 文件的名称。此选项仅用于兼容目的，将被忽略。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIformat\fR\fR
.ad
.sp .6
.RS 4n
按 \fIformat\fR 给定的格式规范列显信息。\fB\fR“显示格式”部分中对此有全面介绍。可以指定多个 \fB-o\fR 选项；格式规范会解释为以空格字符分隔的所有 \fIformat\fR 选项参数的串联。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIproclist\fR\fR
.ad
.sp .6
.RS 4n
仅列出其进程 \fBID\fR 编号出现在 \fIproclist\fR 中的进程数据。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR\fR
.ad
.sp .6
.RS 4n
在附加列标题 \fBPSR\fR 下，列显进程或 lwp 所绑定的处理器的数量（如果有）。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIsidlist\fR\fR
.ad
.sp .6
.RS 4n
列出其 \fBID\fR 出现在 \fIsidlist\fR 中的所有会话引导者的相关信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fIterm\fR\fR
.ad
.sp .6
.RS 4n
仅列出与 \fIterm\fR 关联的进程数据。将终端标识符指定为设备文件名和标识符。例如，\fBterm/a\fR 或 \fBpts/0\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR \fIuidlist\fR\fR
.ad
.sp .6
.RS 4n
仅列出其有效用户 \fBID\fR 编号或登录名出现在 \fIuidlist\fR 中的进程数据。在列表中输出数字用户 \fBID\fR，除非指定了 \fB-f\fR 选项（将输出登录名）。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-U\fR \fIuidlist\fR\fR
.ad
.sp .6
.RS 4n
列出其实际用户 \fBID\fR 编号或登录名出现在 \fIuidlist\fR 中的进程的相关信息。\fIuidlist\fR 必须是一个采用空格或逗号分隔列表格式的单一参数。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-y\fR\fR
.ad
.sp .6
.RS 4n
在长列表 (\fB-l\fR) 下，将忽略已过时的 \fBF\fR 和 \fBADDR\fR 列，加入一个 \fBRSS\fR 列，以报告进程的驻留集大小。而在 \fB-y\fR 选项下，将以千字节（而非页数）为单位报告 \fBRSS\fR 和 \fBSZ\fR（请参见下文）。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzonelist\fR\fR
.ad
.sp .6
.RS 4n
仅列出指定区域中的进程。区域可以通过名称或 ID 指定。此选项仅在全局区域中执行时有效。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
在附加列标题 \fBZONE\fR 下，列显与进程关联的区域名称。\fBZONE\fR 列宽度限制为 8 个字符。使用 \fBps\fR \fB-eZ\fR 可快速查看正在运行的每个进程的相关信息以及关联的区域名称。使用 
.sp
.in +2
.nf
ps -eo zone,uid,pid,ppid,time,comm,...
.fi
.in -2
.sp

可以查看宽度大于 8 个字符的区域名称。
.RE

.sp
.LP
以下选项由 \fB/usr/ucb/ps\fR 命令使用（请参见 \fBps\fR(1B)）。\fB/usr/bin/ps\fR 支持这些选项，并能够使用它们模拟 UCB 行为。UCB 选项不使用连字符。您不能将这些选项与上述选项混合使用。
.sp
.ne 2
.mk
.na
\fB\fBr\fR\fR
.ad
.sp .6
.RS 4n
仅输出正在运行和可运行的进程。
.RE

.sp
.ne 2
.mk
.na
\fB\fBS\fR\fR
.ad
.sp .6
.RS 4n
显示此进程及其收割的所有子进程所累积使用的 \fBCPU\fR 时间。
.RE

.sp
.ne 2
.mk
.na
\fB\fBv\fR\fR
.ad
.sp .6
.RS 4n
显示包含虚拟内存的输出版本。这包括字段 \fBSIZE\fR、\fB%CPU\fR、\fB%MEM\fR 和 \fBRSS\fR，具体如下文所述。
.RE

.sp
.ne 2
.mk
.na
\fB\fBw\fR\fR
.ad
.sp .6
.RS 4n
使用宽输出格式，即使用 132 列而非 80 列。如果重复选项字母（即使用 \fB-ww\fR），此选项将使用任意宽输出。此信息用于决定需要输出多少长命令。\fB注意：\fR宽输出选项只能由超级用户或拥有进程的用户查看。
.RE

.sp
.ne 2
.mk
.na
\fB\fBx\fR\fR
.ad
.sp .6
.RS 4n
包含无控制终端的进程。
.RE

.sp
.ne 2
.mk
.na
\fB\fInum\fR\fR
.ad
.sp .6
.RS 4n
可以提供进程编号，如果提供，则仅输出该进程。此选项只能在最后提供。
.RE

.sp
.LP
以上显示的许多选项用于选择要列出的进程。如果指定了任何选项，缺省列表将被忽略，而 \fBps\fR 会选择对全部选择条件选项执行同或运算所表示的进程。
.SH 显示格式
.sp
.LP
在 \fB-f\fR 选项下，\fBps\fR 将尝试通过检查用户块来确定创建进程时所提供的命令名称和参数。如果失败，则会按照未使用 \fB-f\fR 选项时的显示方式将命令名称列显在方括号内。
.sp
.LP
下文给出了 \fBps\fR 列表中的列标题及其含义；字母 \fBf\fR 和 \fBl\fR（分别代表\fB完整\fR列表和\fB长\fR列表）表示导致显示对应标题的选项；\fB全部\fR则表示标题始终显示。\fB注意：\fR这两个选项只决定提供进程的哪些信息；它们不决定列出哪些进程。
.sp
.ne 2
.mk
.na
\fB\fBF\fR(l)\fR
.ad
.sp .6
.RS 4n
与进程关联的标志（十六进制且可以累加）。这些标志用于历史目的；目前不应赋予它们任何含义。
.RE

.sp
.ne 2
.mk
.na
\fB\fBS\fR (l)\fR
.ad
.sp .6
.RS 4n
进程的状态：
.sp
.ne 2
.mk
.na
\fBO\fR
.ad
.sp .6
.RS 4n
进程正在处理器上运行。
.RE

.sp
.ne 2
.mk
.na
\fBS\fR
.ad
.sp .6
.RS 4n
睡眠：进程正在等待某个事件完成。
.RE

.sp
.ne 2
.mk
.na
\fBR\fR
.ad
.sp .6
.RS 4n
可运行：进程在运行队列中。
.RE

.sp
.ne 2
.mk
.na
\fBT\fR
.ad
.sp .6
.RS 4n
进程因为作业控制信号或对其进行跟踪而停止。
.RE

.sp
.ne 2
.mk
.na
\fBW\fR
.ad
.sp .6
.RS 4n
正在等待：进程正在等待 CPU 使用量降低到由 CPU 上限实施的限制。
.RE

.sp
.ne 2
.mk
.na
\fBZ\fR
.ad
.sp .6
.RS 4n
僵尸状态：进程已终止并且父进程未在等待。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBUID\fR（f、l）\fR
.ad
.sp .6
.RS 4n
进程的有效用户 \fBID\fR 编号（在 \fB-f\fR 选项下输出登录名）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPID\fR（全部）\fR
.ad
.sp .6
.RS 4n
进程的进程 \fBID\fR（中止进程时需要使用此数据）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPPID\fR（f、l）\fR
.ad
.sp .6
.RS 4n
父进程的进程 \fBID\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBC\fR（f、l）\fR
.ad
.sp .6
.RS 4n
用于调度的处理器利用率（已过时）。使用 \fB-c\fR 选项时不输出内容。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCLS\fR（f、l）\fR
.ad
.sp .6
.RS 4n
调度类。仅在使用 \fB-c\fR 选项时列显。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPRI\fR(l)\fR
.ad
.sp .6
.RS 4n
进程的优先级。如果没有 \fB-c\fR 选项，数字越大表示优先级越低。如果有 \fB-c\fR 选项，数字越大表示优先级越高。
.RE

.sp
.ne 2
.mk
.na
\fB\fBNI\fR(l)\fR
.ad
.sp .6
.RS 4n
nice 值，用于计算优先级。使用 \fB-c\fR 选项时不输出内容。只有某些调度类中的进程有 nice 值。
.RE

.sp
.ne 2
.mk
.na
\fB\fBADDR\fR(l)\fR
.ad
.sp .6
.RS 4n
进程的内存地址；值为 \fB0\fR（除非在启用所有特权的情况下运行）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSZ\fR(l)\fR
.ad
.sp .6
.RS 4n
进程在虚拟内存中所占的总大小（以页为单位），包括所有映射的文件和设备。请参见 \fBpagesize\fR(1)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBWCHAN\fR(l)\fR
.ad
.sp .6
.RS 4n
导致进程休眠的事件的地址。仅在启用所有特权的情况下运行时可见，否则为 \fB0\fR。要确定进程是否休眠，请检查 \fBS\fR 列。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTIME\fR(f)\fR
.ad
.sp .6
.RS 4n
以小时、分钟和秒数表示的进程开始时间。（进程的开始时间比 \fBps\fR 查询的执行时间早 24 小时以上时，以月数和天数表示。）
.RE

.sp
.ne 2
.mk
.na
\fB\fBTTY\fR（全部）\fR
.ad
.sp .6
.RS 4n
进程的控制终端（没有控制终端时输出 \fB?\fR 消息）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTIME\fR（全部）\fR
.ad
.sp .6
.RS 4n
进程的累积执行时间。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLTIME\fR（全部）\fR
.ad
.sp .6
.RS 4n
正在报告的 lwp 的执行时间。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCMD\fR（全部）\fR
.ad
.sp .6
.RS 4n
命令名称（在 \fB-f\fR 选项下输出完整的命令名称及其参数，最多不超过 80 个字符）。
.RE

.sp
.LP
指定 \fB-j\fR 选项时，将输出以下两个附加列：
.sp
.ne 2
.mk
.na
\fB\fBPGID\fR\fR
.ad
.sp .6
.RS 4n
进程组引导者的进程 ID。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSID\fR\fR
.ad
.sp .6
.RS 4n
会话引导者的进程 ID。
.RE

.sp
.LP
指定 \fB-L\fR 选项时，将输出以下两个附加列：
.sp
.ne 2
.mk
.na
\fB\fBLWP\fR\fR
.ad
.sp .6
.RS 4n
正在报告的 lwp 的 lwp ID。
.RE

.sp
.ne 2
.mk
.na
\fB\fBNLWP\fR\fR
.ad
.sp .6
.RS 4n
进程中的 lwp 数量（如果同时指定了 \fB-f\fR）。
.RE

.sp
.LP
在 \fB-L\fR 选项下，分别为进程中的每个 lwp 列显一行，而且时间报告字段 \fBSTIME\fR 和 \fBLTIME\fR 会显示 lwp 而非进程的值。传统的单线程进程仅包含 1 个 lwp。
.sp
.LP
已经退出并且有父进程但不是父进程所等待的进程会标记为 \fB<defunct>\fR。
.SS "\fB-o\fR 格式"
.sp
.LP
\fB-o\fR 选项允许用户自行指定输出格式。
.sp
.LP
格式规范必须是一个名称列表，以由空格或逗号分隔的单个参数的形式表示。每个变量都有一个缺省标题。通过附加等号和新的标题文本可以覆盖缺省标题。参数中的其余字符用作标题文本。指定的字段按在命令行中指定的顺序写入，并且应当在输出中排成列。字段宽度由系统选择，并且至少与标题文本（缺省值或覆盖值）等宽。如果标题文本为空，例如 \fB-o\fR \fIuser=\fR，则字段至少应与缺省标题文本等宽。如果所有标题文本字段均为空，则不写入标题行。
.sp
.LP
以下名称可被 POSIX 语言环境识别：
.sp
.ne 2
.mk
.na
\fB\fBuser\fR\fR
.ad
.sp .6
.RS 4n
进程的有效用户 \fBID\fR。这是文本形式的用户 \fBID\fR，前提是能够获取它并且字段宽度允许，否则使用十进制表示。
.RE

.sp
.ne 2
.mk
.na
\fB\fBruser\fR\fR
.ad
.sp .6
.RS 4n
进程的实际用户 \fBID\fR。这是文本形式的用户 \fBID\fR，前提是能够获取它并且字段宽度允许，否则使用十进制表示。
.RE

.sp
.ne 2
.mk
.na
\fB\fBgroup\fR\fR
.ad
.sp .6
.RS 4n
进程的有效组 \fBID\fR。这是文本形式的组 \fBID\fR，前提是能够获取它并且字段宽度允许，否则使用十进制表示。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrgroup\fR\fR
.ad
.sp .6
.RS 4n
进程的实际组 \fBID\fR。这是文本形式的组 \fBID\fR，前提是能够获取它并且字段宽度允许，否则使用十进制表示。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpid\fR\fR
.ad
.sp .6
.RS 4n
进程 \fBID\fR 的十进制值。
.RE

.sp
.ne 2
.mk
.na
\fB\fBppid\fR\fR
.ad
.sp .6
.RS 4n
父进程 \fBID\fR 的十进制值。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpgid\fR\fR
.ad
.sp .6
.RS 4n
进程组 \fBID\fR 的十进制值。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpcpu\fR\fR
.ad
.sp .6
.RS 4n
最近使用的 CPU 时间与同一时段内的可用 CPU 时间之比，以百分比表示。未指定此上下文中“最近”的含义。可用的 CPU 时间以未指定的方式确定。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvsz\fR\fR
.ad
.sp .6
.RS 4n
进程所占虚拟内存的总大小，以千字节为单位。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnice\fR\fR
.ad
.sp .6
.RS 4n
进程的系统调度优先级，以十进制值表示。请参见 \fBnice\fR(1)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBetime\fR\fR
.ad
.sp .6
.RS 4n
自启动进程后所经过的时间。在 POSIX 语言环境中的格式如下：
.sp
\fB[[\fR\fIdd\fR-\fB]\fR\fIhh\fR:\fB]\fR\fImm\fR:\fIss\fR 
.sp
其中
.sp
.ne 2
.mk
.na
\fB\fIdd\fR\fR
.ad
.sp .6
.RS 4n
为天数 
.RE

.sp
.ne 2
.mk
.na
\fB\fIhh\fR\fR
.ad
.sp .6
.RS 4n
为小时数 
.RE

.sp
.ne 2
.mk
.na
\fB\fImm\fR\fR
.ad
.sp .6
.RS 4n
为分钟数 
.RE

.sp
.ne 2
.mk
.na
\fB\fIss\fR\fR
.ad
.sp .6
.RS 4n
为秒数
.RE

\fIdd\fR 字段为十进制整数。\fIhh\fR、\fImm\fR 和 \fIss\fR 字段为两位数的十进制整数，且左侧使用 0 填充。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtime\fR\fR
.ad
.sp .6
.RS 4n
进程的累计 CPU 时间。在 POSIX 语言环境中的格式如下：
.sp
\fB[\fR\fIdd\fR-\fB]\fR\fIhh\fR:\fImm\fR:\fIss\fR
.sp
\fIdd\fR、\fIhh\fR、\fImm\fR 和 \fIss\fR 字段如 \fBetime\fR 说明符中所述。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtty\fR\fR
.ad
.sp .6
.RS 4n
进程控制终端的名称（如果有），使用与 \fBwho\fR(1) 命令相同的格式。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcomm\fR\fR
.ad
.sp .6
.RS 4n
要执行的命令的名称（\fBargv[0]\fR 值），以字符串形式表示。
.RE

.sp
.ne 2
.mk
.na
\fB\fBargs\fR\fR
.ad
.sp .6
.RS 4n
命令及其所有参数，以字符串形式表示。具体实现可能会根据字段宽度截断此值；是否进行进一步截断取决于具体的实现。并未指定所表示的字符串是在命令启动时传递给命令的参数列表版本，还是可能已经由应用程序修改过的参数版本。应用程序无法确定能否对其参数列表进行修改并在 \fBps\fR 输出中体现所进行的修改。Solaris 实现将字符串限制在 80 个字节；字符串为命令启动时传递给命令的参数列表。
.RE

.sp
.LP
以下名称可被 Solaris 实现所识别：
.sp
.ne 2
.mk
.na
\fB\fBf\fR\fR
.ad
.sp .6
.RS 4n
与进程关联的标志（十六进制且可以累加）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBs\fR\fR
.ad
.sp .6
.RS 4n
进程状态。
.RE

.sp
.ne 2
.mk
.na
\fB\fBc\fR\fR
.ad
.sp .6
.RS 4n
用于调度的处理器利用率（已过时）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBuid\fR\fR
.ad
.sp .6
.RS 4n
进程的有效用户 \fBID\fR 编号，以十进制整数表示。
.RE

.sp
.ne 2
.mk
.na
\fB\fBruid\fR\fR
.ad
.sp .6
.RS 4n
进程的实际用户 \fBID\fR 编号，以十进制整数表示。
.RE

.sp
.ne 2
.mk
.na
\fB\fBgid\fR\fR
.ad
.sp .6
.RS 4n
进程的有效组 \fBID\fR 编号，以十进制整数表示。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrgid\fR\fR
.ad
.sp .6
.RS 4n
进程的实际组 \fBID\fR 编号，以十进制整数表示。
.RE

.sp
.ne 2
.mk
.na
\fB\fBprojid\fR\fR
.ad
.sp .6
.RS 4n
进程的项目 \fBID\fR 编号，以十进制整数表示。
.RE

.sp
.ne 2
.mk
.na
\fB\fBproject\fR\fR
.ad
.sp .6
.RS 4n
以文本值表示的进程的项目 \fBID\fR，前提是能够获得此值；否则以十进制整数表示。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzoneid\fR\fR
.ad
.sp .6
.RS 4n
进程的区域 \fBID\fR 编号，以十进制整数表示。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzone\fR\fR
.ad
.sp .6
.RS 4n
以文本值表示的进程的区域 \fBID\fR，前提是能够获得此值；否则以十进制整数表示。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsid\fR\fR
.ad
.sp .6
.RS 4n
会话引导者的进程 ID。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtaskid\fR\fR
.ad
.sp .6
.RS 4n
进程的任务 \fBID\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBclass\fR\fR
.ad
.sp .6
.RS 4n
进程的调度类。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpri\fR\fR
.ad
.sp .6
.RS 4n
进程的优先级。数字越大表示优先级越高。
.RE

.sp
.ne 2
.mk
.na
\fB\fBopri\fR\fR
.ad
.sp .6
.RS 4n
进程优先级（已过时）。数字越小表示优先级越高。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlwp\fR\fR
.ad
.sp .6
.RS 4n
lwp \fBID\fR 的十进制值。请求此格式选项时，系统会为进程中的每个 lwp 输出一行。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnlwp\fR\fR
.ad
.sp .6
.RS 4n
进程中 lwp 的数量。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpsr\fR\fR
.ad
.sp .6
.RS 4n
进程或 lwp 所绑定的处理器数量。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpset\fR\fR
.ad
.sp .6
.RS 4n
进程或 lwp 所绑定的处理器集的 \fBID\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBaddr\fR\fR
.ad
.sp .6
.RS 4n
进程的内存地址。
.RE

.sp
.ne 2
.mk
.na
\fB\fBosz\fR\fR
.ad
.sp .6
.RS 4n
进程所占虚拟内存的总大小，以页为单位。
.RE

.sp
.ne 2
.mk
.na
\fB\fBwchan\fR\fR
.ad
.sp .6
.RS 4n
导致进程休眠的事件的地址（如果为 -，则表示进程正在运行）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstime\fR\fR
.ad
.sp .6
.RS 4n
进程的开始时间或日期，输出时不留空格。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrss\fR\fR
.ad
.sp .6
.RS 4n
进程的驻留集大小，以千字节为单位。\fBps\fR 所报告的 \fBrss\fR 值为 \fBproc\fR(4) 提供的估计值，该值可能小于实际驻留集大小。如果用户希望获得更精确的使用信息以进行容量规划，应使用 \fBpmap\fR(1) \fB-x\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpmem\fR\fR
.ad
.sp .6
.RS 4n
进程的驻留集大小与计算机上的物理内存之比，以百分比表示。
.RE

.sp
.ne 2
.mk
.na
\fB\fBfname\fR\fR
.ad
.sp .6
.RS 4n
进程可执行文件的基名的前 8 个字节。
.RE

.sp
.ne 2
.mk
.na
\fB\fBctid\fR\fR
.ad
.sp .6
.RS 4n
进程所属的进程合同的合同 ID，以十进制整数表示。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlgrp\fR\fR
.ad
.sp .6
.RS 4n
进程的主 lgroup。
.RE

.sp
.LP
只有 \fBcomm\fR 和 \fBargs\fR 可以包含空格字符；其他所有变量（包括 Solaris 实现变量）都不能包含空格字符。
.sp
.LP
下表指定 POSIX 语言环境中所使用的缺省标题（对应于各个格式说明符）。
.sp

.sp
.TS
tab() box;
cw(1.38i) cw(1.38i) cw(1.38i) cw(1.38i) 
cw(1.38i) cw(1.38i) cw(1.38i) cw(1.38i) 
.
格式缺省格式缺省
说明符标题说明符标题
_
argsCOMMANDppidPPID
commCOMMANDrgroupRGROUP
etimeELAPSEDruserRUSER
groupGROUPtimeTIME
niceNIttyTT
pcpu%CPU用户USER
pgidPGIDvszVSZ
pidPID
.TE

.sp
.LP
下表列出了 Solaris 实现的格式说明符以及与各个说明符一起使用的缺省标题。
.sp

.sp
.TS
tab() box;
cw(1.38i) cw(1.38i) cw(1.38i) cw(1.38i) 
cw(1.38i) cw(1.38i) cw(1.38i) cw(1.38i) 
.
格式缺省格式缺省
说明符标题说明符标题
_
addrADDRprojidPROJID
cCprojectPROJECT
classCLSpsrPSR
fFrgidRGID
fnameCOMMANDrssRSS
gidGIDruidRUID
lgrpLGRPsS
lwpLWPsidSID
nlwpNLWPstimeSTIME
opriPRItaskidTASKID
oszSZuidUID
pmem%MEMwchanWCHAN
priPRIzoneZONE
ctidCTIDzoneidZONEID
.TE

.SH 示例
.LP
\fB示例 1 \fR使用 \fBps\fR 命令
.sp
.LP
此命令：

.sp
.in +2
.nf
example% \fBps -o user,pid,ppid=MOM -o args\fR
.fi
.in -2
.sp

.sp
.LP
将在 POSIX 语言环境中写入以下内容：

.sp
.in +2
.nf
 USER  PID   MOM   COMMAND
helene  34    12   ps -o uid,pid,ppid=MOM -o args
.fi
.in -2
.sp

.sp
.LP
由于可能出现截断，\fBCOMMAND\fR 字段的内容可能不一定相同。

.SH 环境变量
.sp
.LP
有关以下影响 \fBps\fR 执行的环境变量的说明，请参见 \fBenviron\fR(5)：\fBLANG\fR、\fBLC_ALL\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR、\fBLC_TIME\fR 和 \fBNLSPATH\fR。
.sp
.ne 2
.mk
.na
\fB\fBCOLUMNS\fR\fR
.ad
.sp .6
.RS 4n
覆盖系统所选的水平屏幕大小，用于确定要显示的文本列数量。
.RE

.SH 退出状态
.sp
.LP
将返回以下退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
成功完成。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.sp .6
.RS 4n
出现错误。
.RE

.SH 文件
.sp
.ne 2
.mk
.na
\fB\fB/dev/pts/*\fR\fR
.ad
.sp .6
.RS 4n

.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/term/*\fR\fR
.ad
.sp .6
.RS 4n
终端 (``tty'') 名称搜索程序文件
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/passwd\fR\fR
.ad
.sp .6
.RS 4n
\fBUID\fR 信息提供程序
.RE

.sp
.ne 2
.mk
.na
\fB\fB/proc/*\fR\fR
.ad
.sp .6
.RS 4n
进程控制文件
.RE

.SH 属性
.sp
.LP
有关下列属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
_
CSIT{
Enabled（已启用）（请参见“用法”）
T}
_
接口稳定性Committed（已确定）
_
标准请参见 \fBstandards\fR(5)。
.TE

.SH 另请参见
.sp
.LP
\fBkill\fR(1)、\fBlgrpinfo\fR(1)、\fBnice\fR(1)、\fBpagesize\fR(1)、\fBpmap\fR(1)、\fBpriocntl\fR(1)、\fBwho\fR(1)、\fBps\fR(1B)、\fBgetty\fR(1M)、\fBproc\fR(4)、\fBttysrch\fR(4)、\fBattributes\fR(5)、\fBenviron\fR(5)、\fBresource-controls \fR(5)、\fBstandards\fR(5)、\fBzones\fR(5)
.SH 附注
.sp
.LP
\fBps\fR 运行期间情况可能会发生变化。它提供的快照仅在瞬间有效，当您看到它时，它可能已经不准确。僵尸进程可能会输出某些不相关的数据。
.sp
.LP
如果未指定用于选择进程的选项，则 \fBps\fR 会报告与控制终端关联的所有进程。如果没有控制终端，则除标题外不报告任何内容。
.sp
.LP
\fBps\fR \fB-ef\fR 或 \fBps\fR \fB-o\fR \fBstime\fR 报告的可能不是 tty 登录会话的实际开始时间，而是更早的时间，即上一次在 \fBtty\fR 行上重新产生\fBgetty\fR 时。
.sp
.LP
在以前的版本中，\fBADDR\fR 和 \fBWCHAN\fR 字段可能包含进程和/或进程正在等待的事件的内核内存地址。现在，这些字段将始终为 \fB0\fR，除非由一个在启用所有特权的情况下运行的进程发出请求。通过在 \fBmdb\fR 中使用 \fB::ps and ::thread dcmds\fR 依然可以获得这些值。
.sp
.LP
\fBps\fR 支持 \fBCSI\fR，但登录名（用户名）除外。
