Alhadis/Silos/Solaris 11.3/zh_CN.UTF-8/man1/stty.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2009, 2013, Oracle and/or its affiliates.All rights reserved.
.\" Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation.Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/. 
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation.In the following statement, the phrase "this text" refers to portions of the system documentation.Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group.In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document.The original Standard can be obtained online at http://www.opengroup.org/unix/online.html.This notice shall appear on any product containing this material. 
.TH stty 1 "2009 年 5 月 20 日" "SunOS 5.11" "用户命令"
.SH 名称
stty \- 设置终端的选项
.SH 用法概要
.LP
.nf
\fB/usr/bin/stty\fR [\fB-a\fR] [\fB-g\fR]
.fi

.LP
.nf
\fB/usr/bin/stty\fR [\fImodes\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/stty\fR [\fB-a\fR | \fB-g\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/stty\fR [\fImodes\fR]
.fi

.LP
.nf
\fB/usr/xpg6/bin/stty\fR [\fB-a\fR | \fB-g\fR]
.fi

.LP
.nf
\fB/usr/xpg6/bin/stty\fR [\fImodes\fR]
.fi

.SH 描述
.sp
.LP
\fBstty\fR 实用程序用于设置作为当前标准输入的设备的某些终端 I/O 选项。不带参数时，\fBstty\fR 将报告某些选项的设置。
.sp
.LP
在此报告中，如果某个字符前面带有一个插入记号 (\fB^\fR)，则该选项的值是相对应的控制字符（例如，\fB^h\fR 就是 CTRL-h）。在这种情况下，请记住 CTRL-h 与退格键相同）。序列 \fB^@\fR 表示选项具有空值。
.sp
.LP
有关从\fB\fR\fB\fR“控制模式”到\fB\fR“本地模式”列出的各种模式的详细信息，请参见 \fBtermio\fR(7I)。有关在\fB\fR\fB\fR\fB\fR\fB\fR“硬件流控制模式”和\fB\fR“时钟模式”下列出的模式的详细信息，请参见 \fBtermiox\fR(7I)。
.sp
.LP
\fB\fR"组合模式"部分中介绍的操作数是使用前面部分中的选项实现的。请注意，许多选项组合没有意义，不会执行合理性检查。可能并不是所有硬件接口都支持硬件流控制和时钟模式选项。
.SH 选项
.sp
.LP
支持以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 6n
.rt  
将该终端的所有选项设置写入到标准输出。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR\fR
.ad
.RS 6n
.rt  
以一种可用作其他 \fBstty\fR 命令的参数的格式报告当前设置。如果底层驱动程序支持 termios 类型输出，则发出该输出。否则，它会发出 termio 类型输出。
.RE

.SH 操作数
.sp
.LP
支持以下\fI模式\fR操作数：
.SS "控制模式"
.sp
.ne 2
.mk
.na
\fB\fBparenb\fR(\fB-parenb\fR)\fR
.ad
.RS 24n
.rt  
启用（禁用）奇偶校验生成和检测。
.RE

.sp
.ne 2
.mk
.na
\fB\fBparext\fR(\fB-parext\fR)\fR
.ad
.RS 24n
.rt  
启用（禁用）支持 mark 和 space 校验的扩展奇偶校验生成和检测。
.RE

.sp
.ne 2
.mk
.na
\fB\fBparodd\fR(\fB-parodd\fR)\fR
.ad
.RS 24n
.rt  
如果已启用 \fBparext\fR，则选择奇（偶）校验或 mark (space) 校验。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcs5\fR \fBcs6\fR \fBcs7\fR \fB cs8\fR\fR
.ad
.RS 24n
.rt  
选择字符大小（请参见 \fBtermio\fR(7I)）。
.RE

.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 24n
.rt  
立即挂起线路。
.RE

.sp
.ne 2
.mk
.na
\fB\fBhupcl\fR (\fB-hupcl\fR)\fR
.ad
.RS 24n
.rt  
最后关闭时挂起（不挂起）连接。
.RE

.sp
.ne 2
.mk
.na
\fB\fBhup\fR (\fB-hup\fR)\fR
.ad
.RS 24n
.rt  
与 \fBhupcl\fR(\fB-hupcl\fR) 相同。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcstopb\fR (\fB-cstopb\fR)\fR
.ad
.RS 24n
.rt  
每个字符使用两个（一个）停止位。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcread\fR (\fB-cread\fR)\fR
.ad
.RS 24n
.rt  
启用（禁用）接收器。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcrtscts\fR (\fB-crtscts\fR)\fR
.ad
.RS 24n
.rt  
启用输出硬件流控制。建立 \fBRTS\fR（请求发送）调制解调器控制线路。暂停输出，直至建立 CTS（清除发送）线路。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcrtsxoff\fR (\fB-crtsxoff\fR)\fR
.ad
.RS 24n
.rt  
启用输入硬件流控制。建立 \fBRTS\fR（请求发送）调制解调器控制线路以接收数据。RTS 为低时暂停输入。
.RE

.sp
.ne 2
.mk
.na
\fB\fBclocal\fR (\fB-clocal\fR)\fR
.ad
.RS 24n
.rt  
假定一条不带（带）调制解调器控制的线路。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdefeucw\fR\fR
.ad
.RS 24n
.rt  
将多字节字符的宽度设置为在由 \fBLC_CTYPE\fR 指定的当前语言环境中定义的值。在内部，宽度按照每个字符的字节数以及每个字符的屏幕或显示列数来表示。
.RE

.sp
.ne 2
.mk
.na
\fB110 300 600 1200 1800\fR
.ad
.br
.na
\fB2400 4800 9600 19200\fR
.ad
.br
.na
\fB38400 357600 76800 115200\fR
.ad
.br
.na
\fB153600 230400 307200 460800\fR
.ad
.sp .6
.RS 4n
如有可能，将终端波特率设置为给定数值。（并不是所有硬件接口都支持所有速度。）
.RE

.sp
.ne 2
.mk
.na
\fBispeed 0 110 300 600 1200\fR
.ad
.br
.na
\fB1800 2400 4800 9600 19200\fR
.ad
.br
.na
\fB38400 57600 76800 115200\fR
.ad
.br
.na
\fB153600 230400 307200 460800\fR
.ad
.sp .6
.RS 4n
如有可能，将终端输入波特率设置为给定数值。（并不是所有硬件都支持分离波特率。）如果将输入波特率设置为 \fB0\fR，则输入波特率将由输出波特率的值指定。
.RE

.sp
.ne 2
.mk
.na
\fBospeed 0 110 300 600 1200\fR
.ad
.br
.na
\fB1800 2400 4800 9600 19200\fR
.ad
.br
.na
\fB38400 57600 76800 115200\fR
.ad
.br
.na
\fB153600 230400 307200 460800\fR
.ad
.sp .6
.RS 4n
如有可能，将终端输出波特率设置为给定数值。（并不是所有硬件都支持分离波特率。）如果将输出波特率设置为 \fB0\fR，则会立即将线路挂起。
.RE

.SS "输入模式"
.sp
.ne 2
.mk
.na
\fB\fBignbrk\fR (\fB-ignbrk\fR)\fR
.ad
.RS 22n
.rt  
输入时忽略（不忽略）断开。
.RE

.sp
.ne 2
.mk
.na
\fB\fBbrkint\fR (\fB-brkint\fR)\fR
.ad
.RS 22n
.rt  
断开时发送（不发送）INTR 信号。
.RE

.sp
.ne 2
.mk
.na
\fB\fBignpar\fR (\fB-ignpar\fR)\fR
.ad
.RS 22n
.rt  
忽略（不忽略）奇偶校验错误。
.RE

.sp
.ne 2
.mk
.na
\fB\fBparmrk\fR (\fB-parmrk\fR)\fR
.ad
.RS 22n
.rt  
标记（不标记）奇偶校验错误（请参见 \fBtermio\fR(7I)）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBinpck\fR (\fB-inpck\fR)\fR
.ad
.RS 22n
.rt  
启用（禁用）输入奇偶校验检查。
.RE

.sp
.ne 2
.mk
.na
\fB\fBistrip\fR (\fB-istrip\fR)\fR
.ad
.RS 22n
.rt  
将输入字符分离（不分离）为七位。
.RE

.sp
.ne 2
.mk
.na
\fB\fBinlcr\fR (\fB-inlcr\fR)\fR
.ad
.RS 22n
.rt  
将 NL 映射（不映射）为输入中的 CR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBigncr\fR (\fB-igncr\fR)\fR
.ad
.RS 22n
.rt  
忽略（不忽略）输入中的 CR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBicrnl\fR (\fB-icrnl\fR)\fR
.ad
.RS 22n
.rt  
将 CR 映射（不映射）为输入中的 NL。
.RE

.sp
.ne 2
.mk
.na
\fB\fBiuclc\fR (\fB-iuclc\fR)\fR
.ad
.RS 22n
.rt  
将大写字符映射（不映射）为输入中的小写字母。
.RE

.sp
.ne 2
.mk
.na
\fB\fBixon\fR (\fB-ixon\fR)\fR
.ad
.RS 22n
.rt  
启用（禁用）START/STOP 输出控制。通过发送 STOP 控制字符停止输出，并通过发送 START 控制字符启动输出。
.RE

.sp
.ne 2
.mk
.na
\fB\fBixany\fR (\fB-ixany\fR)\fR
.ad
.RS 22n
.rt  
允许任何字符（仅限 DC1）重新启动输出。
.RE

.sp
.ne 2
.mk
.na
\fB\fBixoff\fR (\fB-ixoff\fR)\fR
.ad
.RS 22n
.rt  
请求系统在输入队列几乎为空/满时发送（不发送）START/STOP 字符。
.RE

.sp
.ne 2
.mk
.na
\fB\fBimaxbel\fR (\fB-imaxbel\fR)\fR
.ad
.RS 22n
.rt  
输入行过长时回显（不回显）\fBBEL\fR。如果设置了 \fBimaxbel\fR，则在输入流溢出时回显 \fBASCII BEL\fR 字符（\fB十六进制 07\fR）。不存储其他输入，但不会打乱已存在的任何输入。如果未设置 \fB-imaxbel\fR，则不回显 \fBBEL\fR 字符，并且在输入流溢出的情况下，将会丢弃输入队列中存在的所有未读输入。 
.RE

.SS "输出模式"
.sp
.ne 2
.mk
.na
\fB\fBopost\fR (\fB-opost\fR)\fR
.ad
.RS 23n
.rt  
后处理输出（不后处理输出；忽略所有其他输出模式）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBolcuc\fR (\fB-olcuc\fR)\fR
.ad
.RS 23n
.rt  
将小写字母映射（不映射）为输出中的大写字母。
.RE

.sp
.ne 2
.mk
.na
\fB\fBonlcr\fR (\fB-onlcr\fR)\fR
.ad
.RS 23n
.rt  
将 NL 映射（不映射）为输出中的 CR-NL。
.RE

.sp
.ne 2
.mk
.na
\fB\fBocrnl\fR (\fB-ocrnl\fR)\fR
.ad
.RS 23n
.rt  
将 CR 映射（不映射）为输出中的 NL。
.RE

.sp
.ne 2
.mk
.na
\fB\fBonocr\fR (\fB-onocr\fR)\fR
.ad
.RS 23n
.rt  
在第 0 列上不输出（输出）CR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBonlret\fR (\fB-onlret\fR)\fR
.ad
.RS 23n
.rt  
在终端上 NL 执行（不执行）CR 函数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBofill\fR (\fB-ofill\fR)\fR
.ad
.RS 23n
.rt  
针对延迟使用填充字符（使用计时）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBofdel\fR (\fB-ofdel\fR)\fR
.ad
.RS 23n
.rt  
填充字符为 DEL (NUL)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcr0 cr1 cr2 cr3\fR\fR
.ad
.RS 23n
.rt  
选择回车的延迟样式（请参见 \fBtermio\fR(7I)）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnl0 nl1\fR\fR
.ad
.RS 23n
.rt  
选择换行符的延迟样式（请参见 \fBtermio\fR(7I)）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtab0 tab1 tab2 tab3\fR\fR
.ad
.RS 23n
.rt  
选择水平制表符的延迟样式（请参见 \fBtermio\fR(7I)）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBbs0 bs1\fR\fR
.ad
.RS 23n
.rt  
选择退格的延迟样式（请参见 \fBtermio\fR(7I)）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBff0 ff1\fR\fR
.ad
.RS 23n
.rt  
选择换页符的延迟样式（请参见 \fBtermio\fR(7I)）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvt0 vt1\fR\fR
.ad
.RS 23n
.rt  
选择垂直制表符的延迟样式（请参见 \fBtermio\fR(7I)）。
.RE

.SS "本地模式"
.sp
.ne 2
.mk
.na
\fB\fBisig\fR(\fB-isig\fR)\fR
.ad
.RS 23n
.rt  
启用（禁用）按照特殊控制字符 INTR、QUIT、SWTCH 和 SUSP 来检查字符。有关 \fBSWTCH\fR 的信息，请参见\fB\fR“附注”部分。
.RE

.sp
.ne 2
.mk
.na
\fB\fBicanon\fR (\fB-icanon\fR)\fR
.ad
.RS 23n
.rt  
启用（禁用）规范输入（ERASE 和 KILL 处理）。请不要设置 \fBMIN\fR 或 \fBTIME\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBxcase\fR (\fB-xcase\fR)\fR
.ad
.RS 23n
.rt  
规范（未处理的）大写/小写显示。
.RE

.sp
.ne 2
.mk
.na
\fB\fBecho\fR (\fB-echo\fR)\fR
.ad
.RS 23n
.rt  
回显（不回显）每个键入的字符。
.RE

.sp
.ne 2
.mk
.na
\fB\fBechoe\fR (\fB-echoe\fR)\fR
.ad
.RS 23n
.rt  
将擦除字符回显（不回显）为退格-空格-退格字符串。这种模式会擦除许多 CRT 终端上的已擦除字符；不过，它不会跟踪列位置，对于转义的字符、制表符和退格来说，可能会造成混乱。
.RE

.sp
.ne 2
.mk
.na
\fB\fBechok\fR(\fB-echok\fR)\fR
.ad
.RS 23n
.rt  
在 KILL 字符后面回显（不回显）NL。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlfkc\fR (\fB-lfkc\fR)\fR
.ad
.RS 23n
.rt  
与 \fBechok\fR(\fB-echok\fR) 相同；已过时。
.RE

.sp
.ne 2
.mk
.na
\fB\fBechonl\fR (\fB-echonl\fR)\fR
.ad
.RS 23n
.rt  
回显（不回显）NL。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnoflsh\fR (\fB-noflsh\fR)\fR
.ad
.RS 23n
.rt  
在 INTR、QUIT 或 SUSP 之后禁用（启用）刷新。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstwrap\fR (\fB-stwrap\fR)\fR
.ad
.RS 23n
.rt  
禁用（启用）将同步行上长于 \fB79\fR 个字符的行截断。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtostop\fR (\fB-tostop\fR)\fR
.ad
.RS 23n
.rt  
当后台进程写入到终端时发送（不发送）\fBSIGTTOU\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBechoctl\fR \fB(\fR\fB-echoctl \fR\fB)\fR\fR
.ad
.RS 23n
.rt  
将控制字符回显（不回显）为 \fB^\fR\fIchar\fR，将 DEL 回显（不回显）为 \fB^?\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBechoprt\fR \fB(\fR\fB-echoprt \fR\fB)\fR\fR
.ad
.RS 23n
.rt  
将删除字符回显（不回显）为字符 "erased"（已删除）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBechoke\fR \fB(\fR\fB-echoke\fR\fB )\fR\fR
.ad
.RS 23n
.rt  
在终止行时，BS-SP-BS 删除（不 BS-SP-BS 删除）整行。
.RE

.sp
.ne 2
.mk
.na
\fB\fBflusho\fR \fB(\fR\fB-flusho\fR\fB )\fR\fR
.ad
.RS 23n
.rt  
正在刷新（未正在刷新）输出。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpendin\fR \fB(\fR\fB-pendin\fR\fB )\fR\fR
.ad
.RS 23n
.rt  
在下一个读取或输入字符处重新键入（不重新键入）暂挂输入。
.RE

.sp
.ne 2
.mk
.na
\fB\fBiexten\fR \fB(\fR\fB-iexten\fR\fB )\fR\fR
.ad
.RS 23n
.rt  
启用（禁用）当前未由 \fBicanon\fR、\fBisig\fR、\fBixon\fR 或 \fBixoff\fR 控制的特殊控制字符：\fBVEOL\fR、\fBVSWTCH\fR、\fBVREPRINT\fR、\fBVDISCARD\fR、\fBVDSUSP\fR、\fBVWERASE\fR 和 \fB\fR\fBVLNEXT\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstflush\fR \fB(\fR\fB-stflush \fR)\fR
.ad
.RS 23n
.rt  
在每个 \fBwrite\fR(2) 之后的同步行上启用（禁用）刷新。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstappl\fR \fB(\fR\fB-stappl\fR) \fR
.ad
.RS 23n
.rt  
在同步行上使用应用程序模式（使用行模式）。
.RE

.SS "硬件流控制模式"
.sp
.ne 2
.mk
.na
\fB\fBrtsxoff\fR (\fB-rtsxoff\fR)\fR
.ad
.RS 22n
.rt  
在输入中启用（禁用） RTS 硬件流控制。
.RE

.sp
.ne 2
.mk
.na
\fB\fBctsxon\fR (\fB-ctsxon\fR)\fR
.ad
.RS 22n
.rt  
在输出中启用（禁用） CTS 硬件流控制。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdtrxoff\fR (\fB-dtrxoff\fR)\fR
.ad
.RS 22n
.rt  
在输入中启用（禁用） DTR 硬件流控制。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcdxon\fR (\fB-cdxon\fR)\fR
.ad
.RS 22n
.rt  
在输出中启用（禁用） CD 硬件流控制。
.RE

.sp
.ne 2
.mk
.na
\fB\fBisxoff\fR (\fB-isxoff\fR)\fR
.ad
.RS 22n
.rt  
在输入中启用（禁用）等时硬件流控制。
.RE

.SS "时钟模式"
.sp
.ne 2
.mk
.na
\fB\fBxcibrg\fR\fR
.ad
.RS 13n
.rt  
从内部波特率发生器获取发送时钟。
.RE

.sp
.ne 2
.mk
.na
\fB\fBxctset\fR\fR
.ad
.RS 13n
.rt  
从发送器信号元件计时（DCE 源）线、CCITT V.24 线路 114、EIA-232-D 针 15 获取发送时钟。
.RE

.sp
.ne 2
.mk
.na
\fB\fBxcrset\fR\fR
.ad
.RS 13n
.rt  
从接收器信号元件计时（DCE 源）线、CCITT V.24 线路 115、EIA-232-D 针 17 获取发送时钟。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrcibrg\fR\fR
.ad
.RS 13n
.rt  
从内部波特率发生器获取接收时钟。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrctset\fR\fR
.ad
.RS 13n
.rt  
从发送器信号元件计时（DCE 源）线、CCITT V.24 线路 114、EIA-232-D 针 15 获取接收时钟。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrcrset\fR\fR
.ad
.RS 13n
.rt  
从接收器信号元件计时（DCE 源）线、CCITT V.24 线路 115、EIA-232-D 针 17 获取接收时钟。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtsetcoff\fR\fR
.ad
.RS 13n
.rt  
未提供发送器信号元件计时时钟。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtsetcrbrg\fR\fR
.ad
.RS 13n
.rt  
在发送器信号元件计时（DTE 源）线、CCITT V.24 线路 113、EIA-232-D 针 24 上输出接收波特率发生器。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtsetctbrg\fR\fR
.ad
.RS 13n
.rt  
在发送器信号元件计时（DTE 源）线、CCITT V.24 线路 113、EIA-232-D 针 24 上输出发送波特率发生器。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtsetctset\fR\fR
.ad
.RS 13n
.rt  
在发送器信号元件计时（DTE 源）线、CCITT V.24 线路 113、EIA-232-D 针 24 上输出发送器信号元件计时（DCE 源）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtsetcrset\fR\fR
.ad
.RS 13n
.rt  
在发送器信号元件计时（DTE 源）线、CCITT V.24 线路 113、EIA-232-D 针 24 上输出接收器信号元件计时（DCE 源）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrsetcoff\fR\fR
.ad
.RS 13n
.rt  
未提供接收器信号元件计时时钟。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrsetcrbrg\fR\fR
.ad
.RS 13n
.rt  
在接收器信号元件计时（DTE 源）线、CCITT V.24 线路 128 、无 EIA-232-D 针输出接收波特率发生器。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrsetctbrg\fR\fR
.ad
.RS 13n
.rt  
在接收器信号元件计时（DTE 源）线、CCITT V.24 线路 128 、无 EIA-232-D 针输出发送波特率发生器。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrsetctset\fR\fR
.ad
.RS 13n
.rt  
在接收器信号元件计时（DTE 源）线、CCITT V.24 线路 128、无 EIA-232-D 针输出发送器信号元件计时（DCE 源）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrsetcrset\fR\fR
.ad
.RS 13n
.rt  
在接收器信号元件计时（DTE 源）线、CCITT V.24 线路 128、无 EIA-232-D 针、输出接收器信号元件计时（DCE 源）。
.RE

.SS "控制赋值"
.sp
.ne 2
.mk
.na
\fB\fIcontrol-character\fR \fIc\fR\fR
.ad
.sp .6
.RS 4n
将 \fIcontrol-character\fR 设置为 \fIc\fR，其中： 
.sp
.ne 2
.mk
.na
\fB\fIcontrol-character\fR\fR
.ad
.RS 21n
.rt  
是 \fBctab\fR、\fBdiscard\fR、\fBdsusp\fR、\fBeof\fR、\fBeol\fR、\fBeol2\fR、\fBerase\fR、\fBintr\fR、\fBkill\fR、\fBlnext\fR、\fBquit\fR、\fBreprint\fR、\fBstart\fR、\fBstop\fR、\fBsusp\fR、\fBswtch\fR 或 \fBwerase\fR（\fBctab\fR 用于 \fB-stappl\fR，请参见 \fBtermio\fR(7I)）。有关 \fBswtch\fR 的信息，请参见“附注”部分。 
.RE

.sp
.ne 2
.mk
.na
\fB\fIc\fR\fR
.ad
.RS 21n
.rt  
如果 \fIc\fR 是单个字符，则控制字符设置为该字符。
.sp
在 POSIX 语言环境中，如果 \fIc\fR 前面有一个表示从 shell 转义的插入记号 (\fB^\fR)，并且是下表的 \fI^c\fR 列中列出的项之一，则它所使用的值（在 Value 列中）是相应的控制字符（例如，"\fB^d\fR" 是 CTRL-d）。``"\fB^?\fR" 被解释为 DEL，而 "\fB^-\fR" 被解释为未定义。
.RE

.RE

.sp

.sp
.TS
tab() box;
cw(.92i) cw(.92i) cw(.92i) cw(.92i) cw(.92i) cw(.92i) 
lw(.92i) lw(.92i) lw(.92i) lw(.92i) lw(.92i) lw(.92i) 
.
\fB^\fR\fIc\fR\fB值\fR\fB^\fR\fIc\fR\fB值\fR\fB^\fR\fIc\fR\fB值\fR
\fBa\fR, A<SOH>\fBl\fR, L<FF>\fBw\fR, W<ETB>
\fBb\fR, B<STX>\fBm\fR, M<CR>\fBx\fR, X<CAN>
\fBc\fR, C<ETX>\fBn\fR, N<SO>\fBy\fR, Y<EM>
\fBd\fR, D<EOT>\fBo\fR, O<SI>\fBz\fR, Z<SUB>
\fBe\fR, E<ENQ>\fBp\fR, P<DLE>\fB[\fR<ESC>
\fBf\fR, F<ACK>\fBq\fR, Q<DC1>\fB\\fR<FS>
\fBg\fR, G<BEL>\fBr\fR, R<DC2>\fB]\fR<GS>
\fBh\fR, H<BS>\fBs\fR, S<DC3>\fB^\fR<RS>
\fBi\fR, I<HT>\fBt\fR, T<DC4>\fB_\fR<US>
\fBj\fR, J<LF>\fBu\fR, U<NAK>\fB?\fR<DEL>
\fBk\fR, K<VT>\fBv\fR, V<SYN>
.TE

.sp
.ne 2
.mk
.na
\fB\fBmin\fR \fInumber\fR\fR
.ad
.br
.na
\fB\fBtime\fR \fInumber\fR\fR
.ad
.RS 15n
.rt  
将 \fBmin\fR 或 \fBtime\fR 的值设置为 \fInumber\fR。\fBMIN\fR 和 \fBTIME\fR 在非规范模式输入处理 (\fB-icanon\fR) 中使用。
.RE

.sp
.ne 2
.mk
.na
\fB\fBline\fR \fIi\fR\fR
.ad
.RS 15n
.rt  
将线路规程设置为 \fIi\fR (\fB0\fR< \fIi\fR <\fB127\fR)。
.RE

.SS "组合模式"
.sp
.ne 2
.mk
.na
\fB\fIsaved\fR \fIsettings\fR\fR
.ad
.RS 28n
.rt  
将当前终端特性设置为由 \fB-g\fR 选项生成的已保存设置。
.RE

.sp
.ne 2
.mk
.na
\fB\fBevenp\fR 或 \fBparity\fR\fR
.ad
.RS 28n
.rt  
启用 \fBparenb\fR 和 \fBcs7\fR，或禁用 \fBparodd\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBoddp\fR\fR
.ad
.RS 28n
.rt  
启用 \fBparenb\fR、\fBcs7\fR 和 \fBparodd\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBspacep\fR\fR
.ad
.RS 28n
.rt  
启用 \fBparenb\fR、\fBcs7\fR 和 \fBparext\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmarkp\fR\fR
.ad
.RS 28n
.rt  
启用 \fBparenb\fR、\fBcs7\fR、\fBparodd\fR 和 \fBparext\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-parity\fR 或 \fB-evenp\fR\fR
.ad
.RS 28n
.rt  
禁用 \fBparenb\fR 并设置 \fBcs8\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-oddp\fR\fR
.ad
.RS 28n
.rt  
禁用 \fBparenb\fR 和 \fBparodd\fR 并设置 \fBcs8\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-spacep\fR\fR
.ad
.RS 28n
.rt  
禁用 \fBparenb\fR 和 \fBparext\fR 并设置 \fBcs8\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-markp\fR\fR
.ad
.RS 28n
.rt  
禁用 \fBparenb\fR、\fBparodd\fR 和 \fBparext\fR 并设置 \fBcs8\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBraw\fR（\fB-raw\fR 或 \fBcooked\fR）\fR
.ad
.RS 28n
.rt  
启用（禁用）原始输入和输出。原始模式等效于设置： 
.sp
.in +2
.nf
stty cs8 -icanon min 1 time 0 -isig -xcase \e
    -inpck -opost
.fi
.in -2

.RE

.SS "/usr/bin/stty, /usr/xpg6/bin/stty"
.sp
.ne 2
.mk
.na
\fB\fBnl\fR (\fB-nl\fR)\fR
.ad
.RS 12n
.rt  
取消设置（设置）\fBicrnl\fR、\fBonlcr\fR。此外，\fB-nl\fR 还会取消设置 \fBinlcr\fR、\fBigncr\fR、\fBocrnl\fR 和 \fBonlret\fR。
.RE

.SS "/usr/xpg4/bin/stty"
.sp
.ne 2
.mk
.na
\fB\fBnl\fR (\fB-nl\fR)\fR
.ad
.RS 28n
.rt  
设置（取消设置）\fBicrnl\fR。此外， \fB-nl\fR 还会取消设置 \fBinlcr\fR、\fBigncr\fR、\fBocrnl\fR 和 \fBonlret\fR；\fB-nl\fR 会设置 \fBonlcr\fR，\fBnl\fR 会取消设置 \fBonlcr\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlcase\fR (\fB-lcase\fR)\fR
.ad
.RS 28n
.rt  
设置（取消设置）\fBxcase\fR、\fBiuclc\fR 和 \fBolcuc\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLCASE\fR (\fB-LCASE\fR)\fR
.ad
.RS 28n
.rt  
与 \fBlcase\fR(\fB-lcase\fR) 相同。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtabs\fR（\fB-tabs\fR 或 \fBtab3\fR）\fR
.ad
.RS 28n
.rt  
打印时保留（扩展为空格）制表符。
.RE

.sp
.ne 2
.mk
.na
\fB\fBek\fR\fR
.ad
.RS 28n
.rt  
将 ERASE 和 KILL 分别重置为正常 DEL 和 CTRL-u。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsane\fR\fR
.ad
.RS 28n
.rt  
将所有模式重置为某种合理的值。
.RE

.sp
.ne 2
.mk
.na
\fB\fIterm\fR\fR
.ad
.RS 28n
.rt  
设置所有适合终端类型 \fIterm\fR 的模式，其中，\fIterm\fR 是 \fBtty33\fR、\fBtty37\fR、\fBvt05\fR、\fBtn300\fR、\fBti700\fR 或 \fBtek\fR 之一。
.RE

.sp
.ne 2
.mk
.na
\fB\fBasync\fR\fR
.ad
.RS 28n
.rt  
设置正常异步通信，其中，时钟设置为 \fBxcibrg\fR、\fBrcibrg\fR、\fBtsetcoff\fR 和 \fBrsetcoff\fR。
.RE

.SS "窗口大小"
.sp
.ne 2
.mk
.na
\fB\fBrows\fR \fIn\fR\fR
.ad
.RS 13n
.rt  
将窗口大小设置为 \fIn\fR 行。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcolumns\fR \fIn\fR\fR
.ad
.RS 13n
.rt  
将窗口大小设置为 \fIn\fR 列。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcols\fR \fIn\fR\fR
.ad
.RS 13n
.rt  
将窗口大小设置为 \fIn\fR 列。\fBcols\fR 是列的一个简略别名。
.RE

.sp
.ne 2
.mk
.na
\fB\fBypixels\fR \fIn\fR\fR
.ad
.RS 13n
.rt  
将垂直窗口大小设置为 \fIn\fR 像素。
.RE

.sp
.ne 2
.mk
.na
\fB\fBxpixels\fR \fIn\fR\fR
.ad
.RS 13n
.rt  
将水平窗口大小设置为 \fIn\fR 像素。
.RE

.SH 用法
.sp
.LP
\fB-g\fR 标志有利于保存和恢复 shell 级别的终端状态。例如，程序可以： 
.sp
.in +2
.nf
saveterm="$(stty -g)"      # save terminal state
stty (new settings)        # set new state
\&...                        # ...
stty $saveterm             # restore terminal state
.fi
.in -2
.sp

.sp
.LP
由于 \fB-a\fR 格式的规范十分宽松，因此，保存和恢复终端设置的脚本应使用 \fB-g\fR 选项。
.SH 环境变量
.sp
.LP
有关影响 \fBcrontab\fR 执行的以下环境变量的说明，请参见 \fBenviron\fR(5)：\fBLANG\fR、\fBLC_ALL\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR 和 \fBNLSPATH\fR。
.SH 退出状态
.sp
.LP
将返回以下退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
成功完成。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
出现错误。
.RE

.SH 属性
.sp
.LP
有关下列属性的说明，请参见 \fBattributes\fR(5)：
.SS "/usr/bin/stty"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
.TE

.SS "/usr/xpg4/bin/stty"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/xopen/xcu4
_
接口稳定性Committed（已确定）
_
标准请参见 \fBstandards\fR(5)。
.TE

.SS "/usr/xpg6/bin/stty"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/xopen/xcu6
_
接口稳定性Committed（已确定）
_
标准请参见 \fBstandards\fR(5)。
.TE

.SH 另请参见
.sp
.LP
\fBtabs\fR(1)、\fBioctl\fR(2)、\fBwrite\fR(2)、\fBgetwidth\fR(3C)、\fBattributes\fR(5)、\fBenviron\fR(5)、\fBstandards\fR(5)、\fBldterm\fR(7M)、\fBtermio\fR(7I)、\fBtermiox\fR(7I)
.SH 附注
.sp
.LP
Solaris 不支持由 System V 发行版 4 上的 \fBsxt\fR 驱动程序使用的 \fBswtch\fR 所隐含的任何操作。Solaris 允许设置 \fBswtch\fR 值，并在已设置的情况下将其打印出来，但它不执行 \fBswtch\fR 操作。
.sp
.LP
Solaris 上的作业切换功能实际上是由作业控制处理的。为此，\fBsusp\fR 是正确设置。 
