Alhadis/Silos/Solaris-11.3/ja_JP.UTF-8/man5/audit_flags.5
'\" te
.\" Copyright (c) 2010, 2012, Oracle and/or its affiliates. All rights reserved.
.TH audit_flags 5 "2012 年 1 月 5 日" "SunOS 5.11" "標準、環境、マクロ"
.SH 名前
audit_flags \- 監査の事前選択フラグ
.SH 機能説明
.sp
.LP
監査フラグは、プロセスで監査される監査クラスを指定します。監査クラスは \fBaudit_class\fR(4) ファイルで定義され、\fBaudit_event\fR(4) ファイルで定義されたとおりに監査イベントなどをグループ化します。\fBauditconfig\fR(1M) を使用すると、デフォルトの Solaris システム全体の監査フラグが監査サービスの一部として構成されます。追加のユーザーごとの監査フラグまたは役割ごとの監査フラグが、\fBuser_attr\fR(4) データベース内または \fIaudit_flags\fR=\fIalways-audit-flags\fR:\fInever-audit-flags\fR キーワードでユーザーに付与されたプロファイル内に構成されている場合があります。プロセスの監査フラグは事前選択マスクと呼ばれています。デフォルトの Solaris システム全体の監査フラグとユーザーごとの監査フラグ(デフォルトのフラグ \fB+\fR \fIalways-audit-flags\fR) \fB-\fR \fInever-audit-flags\fR を組み合わせると、事前選択マスクがログイン時および役割の引き受け時に設定されます。
.sp
.LP
監査フラグは、監査対象の監査クラス名を表す文字列として指定されます。各フラグは監査クラスを識別し、文字列内のほかの文字とコンマ (\fB,\fR) で区切られます。監査クラス名の前に \fB-\fR が付いている場合は、失敗したクラスのみが監査対象となり、成功した試行は監査されません。監査クラス名の前に \fB+\fR が付いている場合は、成功したクラスのみが監査対象となり、失敗した試行は監査されません。プレフィックスが付いていない監査クラス名は、成功と失敗の両方のクラスが監査対象となることを示します。特殊な文字列 “all” を指定すると、すべての監査イベントが監査対象となります。\fB-all\fR を指定すると、失敗したすべての試行が監査対象となり、\fB+all\fR を指定すると、成功したすべての試行が監査対象となります。プレフィックス \fB^\fR、\fB^-\fR、および \fB^+\fR は、以前に文字列に指定されたフラグを無効にします (\fB^-\fR は失敗の試行、\fB^+\fR 成功の試行、\fB^\fR は両方の試行に指定されます)。通常は、フラグをリセットするために使用します。特殊な文字列 \fBno\fR を指定すると、監査イベントは監査されません。
.SH 使用例
.LP
\fB例 1 \fR成功および失敗した「lo」(ログイン/ログアウト)、「am」(管理) 監査イベント、および失敗した「fm」(ファイル属性の変更) イベントを除くすべての失敗した監査イベントを監査する場合に事前選択します。
.sp
.in +2
.nf
lo,am,-all,^-fm
.fi
.in -2
.sp

.LP
\fB例 2 \fR成功および失敗した「lo」 (ログイン/ログアウト)、「as」 (システム全体の管理)、および失敗した「fm」 (ファイル属性の変更) イベントを監査する場合に事前選択します。
.sp
.in +2
.nf
lo,as,-fm
.fi
.in -2
.sp

.SH 関連項目
.sp
.LP
\fBprofiles\fR(1), \fBauditconfig\fR(1M), \fBauditd\fR(1M), \fBusermod\fR(1M), \fBaudit_class\fR(4), \fBaudit_event\fR(4), \fBprof_attr\fR(4), \fBuser_attr\fR(4)
.sp
.LP
\fI『Managing Auditing in Oracle Solaris 11.3 』\fR
