Alhadis/Silos/Solaris-11.3/ja_JP.UTF-8/man5/grub.5
'\" te
.\" Copyright (c) 2005, 2012, Oracle and/or its affiliates. All rights reserved.
.TH grub 5 "2012 年 5 月 25 日" "SunOS 5.11" "標準、環境、マクロ"
.SH 名前
grub \- Oracle Solaris の GRand Unified Bootloader 2 ソフトウェア
.SH 機能説明
.sp
.LP
Oracle Solaris オペレーティングシステムの現行リリースには、GRUB (GRand Unified Bootloader) 2 ソフトウェアが付属しています。GRUB は、Free Software Foundation によって開発およびサポートされています。
.sp
.LP
\fBwww.gnu.org\fR からアクセス可能な GRUB マニュアルの「Overview」では、GRUB を次のように説明しています。
.sp
.LP
Briefly, a boot loader is the first software program that runs when a computer starts. It is responsible for loading and transferring control to an operating system kernel software (such as Linux or GNU Mach). The kernel, in turn, initializes the rest of the operating system (for example, a GNU [Ed. note: or Solaris] system). 
.sp
.LP
GNU GRUB は、幅広い無料および商用のオペレーティングシステムをチェーンロードせずにロードできる非常に強力なブートローダーです。GRUB は、複雑なパーソナルコンピュータのブートに対処するように設計されています。今後、ほかのプラットフォームへの移植が検討される可能性もありますが、プログラムとこのドキュメントの両方は該当するコンピュータプラットフォームに緊密に結合されています。注: Oracle Solaris オペレーティングシステムには GRUB が移植されています。
.sp
.LP
One of the important features in GRUB is flexibility; GRUB understands filesystems and kernel executable formats, so you can load an arbitrary operating system the way you like, without recording the physical position of your kernel on the disk. Thus you can load the kernel just by specifying its file name and the drive and partition where the kernel resides. 
.sp
.LP
GRUB がサポートされるのは、Solaris マシンのうち、x86 プラットフォームのみです。Solaris に付属する GRUB ソフトウェアには、オープンソースディストリビューションには含まれていない、次のユーティリティーが追加されています:
.sp
.ne 2
.mk
.na
\fB\fBbootadm\fR(1M)\fR
.ad
.RS 15n
.rt  
ブートアーカイブの管理と GRUB メニューの変更を可能にします。
.RE

.sp
.LP
この Solaris 固有ユーティリティー以外の GRUB ソフトウェアについては、GRUB ドキュメント内で説明されています。その PDF 版は Oracle の Web サイトから入手可能となっています。
.sp
.LP
\fBbootadm\fR(1M) には、GRUB メニューから変更できるインタフェースが備わっているため、ほとんどの管理者は、GRUB ユーティリティー (BIOS ファームウェアの場合は \fB/usr/lib/grub2/bios\fR、64 ビットの UEFI ファームウェアの場合は \fB/usr/lib/grub2/uefi64\fR にあります) を手動で実行する必要はありません。
.sp
.LP
管理者は GRUB 構成ファイル (\fBgrub.cfg\fR) を手動で編集しないでください。このファイルは、システムのルートプール (つまり、\fB/rpool/boot/grub\fR) の最上位 ZFS データセットの \fB/boot/grub\fR サブディレクトリにあります。このファイルは、管理者が \fBbootadm\fR(1M) を使用してブート構成を変更すると自動的に再生成されます。GRUB メニューエントリを直接作成する上級管理者は、\fBgrub.cfg\fR ファイルと同じディレクトリに格納されている補足の GRUB 構成ファイル \fBnamed custom.cfg\fR を編集する必要があります。新たにインストールされたシステムには、このファイルは存在しないため、管理者が作成する必要があることに注意してください。
.SH 関連項目
.sp
.LP
\fBboot\fR(1M), \fBbootadm\fR(1M), \fBinstallgrub\fR(1M)
.sp
.LP
\fI『Installing Oracle Solaris 11.3 Systems 』\fR
.sp
.LP
\fIIntroduction to Oracle Solaris 11.3                 Administration\fR
.sp
.LP
http://www.gnu.org/software/grub
.SH 注意事項
.sp
.LP
以前のバージョンの Solaris では、GRUB ブートローダーをインストールするための \fBinstallgrub\fR(1M) コマンドの使用法についてドキュメント化していました。このコマンドは非推奨になり、利便性、障害回復、および GRUB レガシーがシステムブートローダーとなっている Solaris ブート環境にダウングレードするためにだけ存在します。詳細については、Oracle Solaris のブートおよびシャットダウンのドキュメントを参照してください。
