Alhadis/Silos/Solaris-11.3/ja_JP.UTF-8/man5/iconv_ja.5
'\" te
.\" Copyright (c) 1999, 2014, Oracle and/or its affiliates. All rights reserved.
.TH iconv_ja 5 "2014 年 1 月 8 日" "" "標準、環境、マクロ"
.SH 名前
iconv_ja \- ja ロケールのコード変換
.SH 機能説明
.sp
.LP
ja ロケールでは、以下のコードセット変換が可能です。
.sp

.sp
.TS
tab() box;
lw(1.94i) |lw(3.56i) 
lw(1.94i) |lw(3.56i) 
.
サポートしているコードセット変換
_
変換元文字集合変換先文字集合
_
eucJPPCK
eucJPISO-2022-JP
eucJPISO-2022-JP.RFC1468
eucJPJIS7
eucJPSJIS
eucJP (各種 Unicode) 
eucJPUTF-8-Java
eucJPjis
eucJPibmj
eucJPibmj-EBCDIK
SJISeucJP
SJISISO-2022-JP
SJIS (各種 Unicode) 
SJISjis
SJISibmj
PCKeucJP
PCK (各種 Unicode) 
PCKUTF-8-Java
PCKISO-2022-JP
PCKISO-2022-JP.RFC1468
PCKjis
PCKibmj
PCKibmj-EBCDIK
ISO-2022-JPeucJP 
ISO-2022-JPPCK
ISO-2022-JPSJIS
ISO-2022-JPUTF-8
 (各種 Unicode) eucJP
 (各種 Unicode) SJIS
 (各種 Unicode) PCK
UTF-8ISO-2022-JP
UTF-8ISO-2022-JP.RFC1468
UTF-8-JavaeucJP
UTF-8-JavaPCK
JIS7eucJP
jiseucJP
jisPCK
jisSJIS
ibmjeucJP
ibmjPCK
ibmjSJIS
ibmj-EBCDIKeucJP
ibmj-EBCDIKPCK
.TE

.sp

.sp
.TS
tab() box;
lw(1.94i) |lw(3.56i) 
lw(1.94i) |lw(3.56i) 
.
サポートしているコードセット変換
_
変換元文字集合変換先文字集合
_
eucJPibm930
eucJPibm931
eucJPibm939
eucJPibm5026
eucJPibm5035
eucJPFujitsuJEF-ascii-code
eucJPFujitsuJEF-kana-code
eucJPFujitsuJEF-ascii-face
eucJPFujitsuJEF-kana-face
eucJPHitachiKEIS83
eucJPHitachiKEIS90
eucJPNECJIPS
PCKibm930
PCKibm931
PCKibm939
PCKibm5026
PCKibm5035
PCKFujitsuJEF-ascii-code
PCKFujitsuJEF-kana-code
PCKFujitsuJEF-ascii-face
PCKFujitsuJEF-kana-face
PCKHitachiKEIS83
PCKHitachiKEIS90
PCKNECJIPS
UTF-8 ibm930
UTF-8ibm931
UTF-8ibm939
UTF-8ibm5026
 UTF-8ibm5035
 (各種 Unicode) ms932
 (各種 Unicode) eucJP-ms
UTF-8UTF-8-ms932
UTF-8FujitsuJEF-ascii-code
UTF-8FujitsuJEF-kana-code
UTF-8FujitsuJEF-ascii-face
UTF-8FujitsuJEF-kana-face
UTF-8HitachiKEIS83
UTF-8HitachiKEIS90
UTF-8NECJIPS
UTF-8-ms932UTF-8
ibm930eucJP
ibm930PCK
ibm930UTF-8
ibm931eucJP
ibm931PCK
ibm931UTF-8
ibm939eucJP
ibm939PCK
ibm939UTF-8
ibm5026eucJP
ibm5026PCK
ibm5026UTF-8
ibm5035eucJP
ibm5035PCK
ibm5035UTF-8
.TE

.sp

.sp
.TS
tab() box;
lw(1.94i) |lw(3.56i) 
lw(1.94i) |lw(3.56i) 
.
サポートしているコードセット変換
_
変換元文字集合変換先文字集合
_
FujitsuJEF-ascii-codeeucJP
FujitsuJEF-ascii-codePCK
FujitsuJEF-ascii-codeUTF-8
FujitsuJEF-kana-codeeucJP
FujitsuJEF-kana-codePCK
FujitsuJEF-kana-codeUTF-8
FujitsuJEF-ascii-faceeucJP
FujitsuJEF-ascii-facePCK
FujitsuJEF-ascii-faceUTF-8
FujitsuJEF-kana-faceeucJP
FujitsuJEF-kana-facePCK
FujitsuJEF-kana-faceUTF-8
HitachiKEIS83eucJP
HitachiKEIS83PCK
HitachiKEIS83UTF-8
HitachiKEIS90eucJP
HitachiKEIS90PCK
HitachiKEIS90UTF-8
NECJIPSeucJP
NECJIPSPCK
NECJIPSUTF-8
ms932 (各種 Unicode)
eucJP-ms (各種 Unicode)
.TE

.sp
.LP
上記の文字集合の意味は以下のとおりです。
.sp

.sp
.TS
tab();
lw(1.85i) |lw(3.65i) 
lw(1.85i) |lw(3.65i) 
.
符号化文字集合の意味
_
文字集合名意味
_
eucJP日本語 EUC
PCKPC 漢字
SJISPC 漢字と同じ (将来はなくなる予定)
ISO-2022-JPT{
ISO 2022 情報交換用符号による G0 への指示機能を用いて UI/OSF 日本語環境実装規約 Version 1.1 の項目 7.1 の規定に従い表現された、ISO 646 IRV または JIS X 0201、JIS X 0208 、および JIS X 0212
T}
JIS7ISO-2022-JP と同じ
ISO-2022-JP.RFC1468T{
ISO 2022 情報交換用符号による G0 への指示機能を用いて RFC1468 (Request for Comments: 1468 Japanese Character Encoding for Internet Messages) の規定に従い表現された、ISO 646 IRV または JIS X 0201-1976 (片仮名用図形キャラクタ集合を除く) および JIS X 0208-1983
T}
jisT{
JLE、JFP 2.4 以前に提供されていた 7 ビット JIS コード
T}
ibmjIBM 漢字コード
ibmj-EBCDIKT{
IBM ホストコードの 1 バイトコードセット (SBCS) に、一般に「EBCDIK」と呼ばれるコードセットと同じ文字セットを割り当てる。この文字セットは IBM のコードページ 290 に '`' (0x79) 、'{' (0xc0) 、'}' (0xd0) の 3 文字を加えたもので、カタカナ文字を含むが英小文字は含まない。2 バイトコードセット (DBCS) に関してはコードセット名 「ibmj」の場合と同じ
T}
(各種Unicode)T{
Unicode の各種エンコーディングのうち以下のいずれかを指定可能
T}
T{
UTF-8 、UTF-16   、UTF-32 、UCS-2 、UCS-4 
T}
T{
または、エンディアンを固定する場合以下のいずれかを指定可能
T}
T{
(ビッグエンディアン) UTF-16BE 、UTF-32BE 、UCS-2BE 、UCS-4BE
T}
T{
(リトルエンディアン) UTF-16LE、UTF-32LE、UCS-2LE、UCS-4LE
T}
UTF-8Unicode の UTF-8 表現
UTF-8-JavaJava で実装されている UNICODE
.TE

.sp

.sp
.TS
tab() box;
lw(1.85i) |lw(3.65i) 
lw(1.85i) |lw(3.65i) 
.
符号化文字集合の意味
_
文字集合名意味
_
ibm930T{
IBM CCSID 930:  SBSC コードページ 290 (拡張)、文字セット 1172、DBCS コードページ 300、文字セット 1001 ユーザー定義文字 4370 文字
T}
ibm931T{
IBM CCSID 931:  SBSC コードページ 37、文字セット 101、DBCS コードページ 300、文字セット 1001 ユーザー定義文字 4370 文字
T}
ibm939T{
IBM CCSID 930:  SBSC コードページ 1027、文字セット 1172、DBCS コードページ 300、文字セット 1001 ユーザー定義文字 4370 文字
T}
ibm5026T{
IBM CCSID 5026:  ユーザー定義文字が 1880 文字である点以外は ibm930 と同じ
T}
ibm5035T{
IBM CCSID 5035:  ユーザー定義文字が 1880 文字である点以外は ibm939 と同じ
T}
FujitsuJEF-ascii-codeT{
富士通 JEF コードで、1 バイト文字セットが EBCDIC (ASCII) であるもの。JIS C 6226:1978 と JIS X 0208:1983 の間で扱いの異なる文字については、コード値に基づいた変換を行う。
T}
FujitsuJEF-ascii-faceT{
富士通 JEF コードで、1 バイト文字セットが EBCDIC (ASCII) であるもの。JIS C 6226:1978 と JIS X 0208:1983 の間で扱いの異なる文字については、字形に基づいた変換を行う。
T}
FujitsuJEF-kana-codeT{
富士通 JEF コードで、1 バイト文字セットが EBCDIC (カナ) であるもの。JIS C 6226:1978 と JIS X 0208:1983 の間で扱いの異なる文字については、コード値に基づいた変換を行う。
T}
FujitsuJEF-kana-faceT{
富士通 JEF コードで、1 バイト文字セットが EBCDIC (カナ) であるもの。JIS C 6226:1978 と JIS X 0208:1983 の間で扱いの異なる文字については、字形に基づいた変換を行う。
T}
HitachiKEIS83日立 KEIS83
HitachiKEIS90日立 KEIS90
NECJIPSNEC JIPS コード
ms932T{
Windows NT 3.51 で使用されているシフト JIS コード。このコードセットと UTF-8 との間の変換では Windows NT 3.51 と同様の文字の対応を行う。
T}
eucJP-msT{
日本語 EUC。このコードセットと Unicode との間の変換では Windows NT 3.51 と同様の文字の対応を行う。
T}
UTF-8-ms932T{
ms932 から変換された UTF-8 表現の Unicode
T}
.TE

.sp
.LP
変換処理は、以下に示すように行われます。 各変換処理は変換元の文字集合に含まれるが、 変換先の文字集合に含まれない場合には、すべて「置換文字」に変換されて出力されます。
.sp
.ne 2
.mk
.na
\fBeucJP から PCK (SJIS)・PCK (SJIS) から eucJP\fR
.ad
.sp .6
.RS 4n
eucJP と  PCK (SJIS) 間の変換は、 「TOG 日本語ベンダ協議会推奨日本語 EUC・シフト JIS 間コード変換仕様」 に基づいて JIS X 0201 、 JIS X 0208  、 JIS X 0212 とユーザーおよびベンダー定義文字が 変換可能です。変換元の文字集合に属さない入力データが与えられた 場合は、 \fBiconv\fR(3C) は \fBerrno\fR に \fBEILSEQ\fR を設定して戻ります。 \fBiconv\fR(1) は、 最後に変換が成功した箇所で終了します。
.RE

.sp
.ne 2
.mk
.na
\fBeucJP から ISO-2022-JP (JIS7)・ISO-2022-JP (JIS7) から eucJP\fR
.ad
.sp .6
.RS 4n
eucJP と ISO-2022-JP (JIS7) 間の変換は、JIS X 0201、JIS X 0208、 JIS X 0212 の文字が変換可能です。変換元の文字集合に属さない入力 データが与えられた場合は、 \fBiconv\fR(3C) は \fBerrno\fR に \fBEILSEQ\fR を設定して戻ります。 \fBiconv\fR(1) は、最後に変換が成功した箇所で終了します。
.RE

.sp
.ne 2
.mk
.na
\fBeucJP から ISO-2022-JP.RFC1468\fR
.ad
.sp .6
.RS 4n
eucJP  から  ISO-2022-JP.RFC1468 への変換は、 JIS X 0201 ( 片仮名用図形キャラクタ集合を除く) および JIS X 0208 が変換可能です。 JIS X 0201 ( 片仮名用図形キャラクタ集合)、 JIS X 0212、 ユーザー定義文字およびベンダー定義文字が与えられた場合は置換文字 「?」(0x3f) に変換されます。 変換元の文字集合に属さない入力データが与えられた場合は、 \fBiconv\fR(3C) は \fBerrno\fR に \fBEILSEQ\fR を設定して戻ります。 \fBiconv\fR(1) は、最後に変換が成功した箇所で終了します。
.RE

.sp
.ne 2
.mk
.na
\fBeucJP から jis・jis から eucJP\fR
.ad
.sp .6
.RS 4n
eucJP と jis 間の変換は、\fBujtojis7()\fR および \fBjis7touj()\fR ライブラリと、\fBeuctojis\fR および \fBjistoeuc\fR ユーティリティ との互換性を保つために 提供されますが、JIS X 0212 を扱えるように拡張されています。 \fBjistoeuc\fR(1) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fBeucJP から (各種 Unicode)・(各種 Unicode) から eucJP\fR
.ad
.sp .6
.RS 4n
eucJP と UTF-8 間の変換は、JIS X 0201、JIS X 0208、JIS X 0212 とユーザーおよびベンダー定義文字が変換可能です。変換先の文字集合に対応する文字のない入力データが与えられた場合は、置換文字 (eucJP: 「?」(0x3f)、 UTF-8: U+FFFD (0xefbfbd)) に変換されます。変換元の文字集合に属さない入力データが与えられた場合は、\fBiconv\fR(3C) は \fBerrno\fR に \fBEILSEQ\fR を設定して戻ります。 \fBiconv\fR(1) は、最後に変換が成功した箇所で終了します。
.RE

.sp
.ne 2
.mk
.na
\fBeucJP から UTF-8-Java・UTF-8-Java から eucJP\fR
.ad
.sp .6
.RS 4n
eucJP と UTF-8-Java 間の変換は、JIS X 0201、JIS X 0208、JIS X 0212  の文字が変換可能です。入力データとしてユーザー定義文字またはベンダー定義文字が与えられた場合は、置換文字 (eucJP: 「?」(0x3f)、UTF-8: U+FFFD (0xefbfbd))  に変換されます。変換元の文字集合に属さない入力データが与えられた場合は、\fBiconv\fR(3C) は  \fBerrno\fR に \fBEILSEQ\fR を設定して戻ります。  \fBiconv\fR(1) は、最後に変換が成功した箇所で終了します。
.RE

.sp
.ne 2
.mk
.na
\fBeucJP から ibmj・ibmj から eucJP\fR
.ad
.sp .6
.RS 4n
eucJP と ibmj 間の変換は、IBM 漢字コード一覧表 (第 4 版、1987 年 9 月)、JIS X 0201 および JIS X 0208-1983 に基づいています。eucJP  から ibmj に変換する場合、JIS X 0201 カナおよび JIS X 0212 はすべて「置換文字」に変換されます。 
.RE

.sp
.ne 2
.mk
.na
\fBeucJP から ibmj-EBCDIK・ibmj-EBCDIK から eucJP\fR
.ad
.sp .6
.RS 4n
eucJP と ibmj-EBCDIK 間の変換は、IBM 漢字コード一覧表 (第 4 版、1987 年 9 月)、JIS X 0201 および JIS X 0208-1983 に基づいています。eucJP  から ibmj-EBCDIK に変換する場合、ibmj-EBCDIK 側に対応する文字のない  JIS X 0201 英小文字および JIS X 0212 文字はすべて「置換文字」に変換されます。 
.RE

.sp
.ne 2
.mk
.na
\fBPCK (SJIS) から ISO-2022-JP・ISO-2022-JP から PCK (SJIS)\fR
.ad
.sp .6
.RS 4n
PCK (SJIS) と ISO-2022-JP 間の変換は、「TOG 日本語ベンダ協議会推奨日本語 EUC・シフト JIS 間コード変換仕様」 に基づいて、JIS X 0201、JIS X 0208、JIS X 0212 とユーザーおよびベンダー定義文字が 変換可能です。変換元の文字集合に属さない入力データが与えられた場合は、 \fBiconv\fR(3C) は \fBerrno\fR に \fBEILSEQ\fR を設定して戻ります。 \fBiconv\fR(1) は、 最後に変換が成功した箇所で終了します。
.RE

.sp
.ne 2
.mk
.na
\fBPCK (SJIS) から ISO-2022-JP.RFC1468\fR
.ad
.sp .6
.RS 4n
PCK (SJIS) から ISO-2022-JP.RFC1468 への変換は、JIS X 0201 (片仮名用図形キャラクタ集合を除く) および JIS X 0208 が変換可能です。JIS X 0201  (片仮名用図形キャラクタ集合)、ユーザー定義文字およびベンダー定義文字が与えられた場合は置換文字 「?」(0x3f)  に変換されます。変換元の文字集合に属さない入力データが与えられた場合は、 \fBiconv\fR(3C) は  \fBerrno\fR に \fBEILSEQ\fR を設定して戻ります。 \fBiconv\fR(1) は、最後に変換が成功した箇所で終了します。
.RE

.sp
.ne 2
.mk
.na
\fBPCK (SJIS) から (各種 Unicode)・(各種 Unicode) から PCK (SJIS)\fR
.ad
.sp .6
.RS 4n
PCK (SJIS) と UTF-8 間の変換は、JIS X 0201、JIS X 0208 とユーザー定義文字およびベンダー定義文字が変換可能です。変換先の文字集合に対応する文字のない入力データが与えられた場合は、置換文字 (PCK: 「?」(0x3f)、 UTF-8: U+FFFD (0xefbfbd)) に変換されます。変換元の文字集合に属さない入力データが与えられた場合は、\fBiconv\fR(3C) は \fBerrno\fR に \fBEILSEQ\fR を設定して戻ります。 \fBiconv\fR(1) は、最後に変換が成功した箇所で終了します。
.RE

.sp
.ne 2
.mk
.na
\fBPCK (SJIS) から UTF-8-Java・UTF-8-Java から PCK (SJIS)\fR
.ad
.sp .6
.RS 4n
PCK (SJIS) と UTF-8-Java 間の変換は、JIS X 0201、JIS X 0208 の文字が変換可能です。入力データとしてユーザー定義文字またはベンダー定義文字が与えられた場合は、置換文字  (PCK: 「?」(0x3f)、UTF-8: U+FFFD (0xefbfbd))  に変換されます。変換元の文字集合に属さない入力データが与えられた場合は、\fBiconv\fR(3C) は  \fBerrno\fR に \fBEILSEQ\fR を設定して戻ります。  \fBiconv\fR(1) は、最後に変換が成功した箇所で終了します。
.RE

.sp
.ne 2
.mk
.na
\fBPCK (SJIS) から jis・jis から PCK (SJIS)\fR
.ad
.sp .6
.RS 4n
PCK (SJIS) と jis 間の変換は、\fBsjtojis7()\fR および \fBjis7tosj()\fR ライブラリと、\fBsjtojis\fR および \fBjistosj\fR ユーティリティ との互換性を保つために 提供されますが、「TOG 日本語ベンダ協議会推奨日本語 EUC・シフト JIS 間コード変換仕様」 に基づいて拡張されています。 \fBjistoeuc\fR(1) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fBPCK (SJIS) から ibmj・ibmj から PCK (SJIS)\fR
.ad
.sp .6
.RS 4n
PCK (SJIS) と ibmj 間の変換は、IBM 漢字コード一覧表 (第 4 版、1987 年 9 月)、JIS X 0201 および JIS X 0208-1983 に基づいています。PCK (SJIS) から ibmj に変換する場合、0xa1 から 0xdf のカナ文字および 「TOG 日本語ベンダ協議会推奨日本語 EUC・シフト JIS 間コード変換仕様」 によって JIS X 0212 領域へ変換される文字はすべて「置換文字」に変換されます。 
.RE

.sp
.ne 2
.mk
.na
\fBPCK から ibmj-EBCDIK・ibmj-EBCDIK から PCK\fR
.ad
.sp .6
.RS 4n
PCK と ibmj-EBCDIK 間の変換は、IBM 漢字コード一覧表 (第 4 版、1987 年 9 月)、JIS X 0201 および JIS X 0208-1983 に基づいています。PCK から ibmj-EBCDIK に変換する場合、JIS X 0201 の英小文字および 「TOG 日本語ベンダ協議会推奨日本語 EUC・シフト JIS 間コード変換仕様」 によって JIS X 0212 領域へ変換される文字はすべて「置換文字」に変換されます。 
.RE

.sp
.ne 2
.mk
.na
\fBISO-2022-JP から UTF-8・UTF-8 から ISO-2022-JP\fR
.ad
.sp .6
.RS 4n
ISO-2022-JP と UTF-8  間の変換は、 JIS X 0201、JIS X 0208、JIS X 0212  とユーザー定義文字およびベンダー定義文字が変換可能です。変換先の文字集合に対応する文字のない入力データが与えられた場合は、置換文字 (ISO-2022-JP: 「?」(0x3f)、UTF-8: U+FFFD (0xefbfbd)) に変換されます。変換元の文字集合に属さない入力データが与えられた場合は、 \fBiconv\fR(3C) は  \fBerrno\fR に \fBEILSEQ\fR を設定して戻ります。  \fBiconv\fR(1) は、最後に変換が成功した箇所で終了します。
.RE

.sp
.ne 2
.mk
.na
\fBUTF-8 から ISO-2022-JP.RFC1468\fR
.ad
.sp .6
.RS 4n
UTF-8  から ISO-2022-JP.RFC1468 への変換は、JIS X 0201  (片仮名用図形キャラクタ集合を除く) および  JIS X 0208  が変換可能です。JIS X 0201  (片仮名用図形キャラクタ集合)、JIS X 0212、ユーザー定義文字およびベンダー定義文字が与えられた場合は置換文字  「?」(0x3f) に変換されます。変換元の文字集合に属さない入力データが与えられた場合は、 \fBiconv\fR(3C) は  \fBerrno\fR に \fBEILSEQ\fR を設定して戻ります。  \fBiconv\fR(1) は、最後に変換が成功した箇所で終了します。
.RE

.sp
.ne 2
.mk
.na
\fBeucJP,PCK,UTF-8 から ibm930,ibm931,ibm939,ibm5026,ibm5035\fR
.ad
.sp .6
.RS 4n
eucJP,PCK,UTF-8 から ibm930,ibm931,ibm939,ibm5026,ibm5035 への変換は、それぞれの入力文字セットでサポートされている文字の変換が可能です。このリリースで参照された DBCS コードページ 300、文字セット 1001 (CGCSGID 01001 00300) は、JIS X 0208、IBM 拡張文字、ユーザー定義文字をサポートしています。変換先の文字集合に対応する文字のない入力が与えられた場合は置換文字に変換されます。ibm931 は 1 バイト文字セット (SBCS) にカタカナを含まないため、ibm931 への変換では JIS X 0201 カナ文字は置換文字に変換されます。
.RE

.sp
.ne 2
.mk
.na
\fBibm930,ibm931,ibm939,ibm5026,ibm5035 から eucJP,PCK,UTF-8\fR
.ad
.sp .6
.RS 4n
ibm930,ibm931,ibm939,ibm5026,ibm5035 から eucJP,PCK,UTF-8 への変換は、それぞれの IBM コード化文字セットでサポートされている文字の変換が可能です。前述の通り、このリリースで参照された CGCSGID 01001 00300 は JIS X 0208、IBM 拡張文字、ユーザー定義文字をサポートしています。変換先の文字集合に対応する文字のない入力が与えられた場合は置換文字に変換されます。また、CGCSGID 01001 00300 の 1 バイト目の範囲は 16 進数で 40 から 7F の間です。1 バイト目がこの範囲外の場合は、 \fBiconv\fR(3C) は  \fBerrno\fR に \fBEILSEQ\fR を設定して戻ります。  \fBiconv\fR(1) は、最後に変換が成功した箇所で終了します。
.RE

.sp
.ne 2
.mk
.na
\fBFujitsuJEF-ascii-code,FujitsuJEF-kana-code から eucJP,PCK,UTF-8・eucJP,PCK,UTF-8 から FujitsuJEF-ascii-code,FujitsuJEF-kana-code\fR
.ad
.sp .6
.RS 4n
X 0201、JIS X 0208、JIS X 0212 で定義された文字を変換できます。変換先に対応する文字がない場合は置換文字に変換します。JIS C 6226:1978 と JIS X 0208:1983 の間で扱いの異なる文字については、コード値に基づいた変換を行います。FujitsuJEF-kana-code への変換の場合、JIS X 0201 のカタカナは置換文字に変換します。
.RE

.sp
.ne 2
.mk
.na
\fBFujitsuJEF-ascii-face,FujitsuJEF-kana-face から eucJP,PCK,UTF-8・eucJP,PCK,UTF-8 から FujitsuJEF-ascii-face,FujitsuJEF-kana-face\fR
.ad
.sp .6
.RS 4n
JIS C 6226:1978 と JIS X 0208:1983 の間で扱いの異なる文字については、字形に基づいた変換を行います。その他の動作については、対応する FujitsuJEF-ascii-code または FujitsuJEF-kana-code の場合と同様です。
.RE

.sp
.ne 2
.mk
.na
\fBHitachiKEIS83 から eucJP,PCK,UTF-8・eucJP,PCK,UTF-8 から HitachiKEIS83\fR
.ad
.sp .6
.RS 4n
X 0201、JIS X 0208、JIS X 0212 で定義された文字を変換できます。変換先に対応する文字がない場合は置換文字に変換します。
.RE

.sp
.ne 2
.mk
.na
\fBHitachiKEIS90 から eucJP,PCK,UTF-8・eucJP,PCK,UTF-8 から HitachiKEIS90\fR
.ad
.sp .6
.RS 4n
JIS X 0201、JIS X 0208、JIS X 0212 で定義された文字を変換できます。変換先に対応する文字がない場合は置換文字に変換します。
.RE

.sp
.ne 2
.mk
.na
\fBNECJIPS から eucJP,PCK,UTF-8・eucJP,PCK,UTF-8 から NECJIPS\fR
.ad
.sp .6
.RS 4n
JIS X 0201、JIS X 0208、JIS X 0212 で定義された文字を変換できます。変換先に対応する文字がない場合は置換文字に変換します。JIPS コードの 1 バイト文字セットとして EBCDIC カタカナ (EK) コードを使用します。
.RE

.sp
.ne 2
.mk
.na
\fBms932 から (各種 Unicode)・(各種 Unicode) から ms932\fR
.ad
.sp .6
.RS 4n
ms932 と UTF-8 との間の変換は、シフト JIS コード (ms932) と Unicode の間の文字の対応を Windows NT 3.51 で実装されているのと同じ方法で行います。
.RE

.sp
.ne 2
.mk
.na
\fBeucJP-ms から (各種 Unicode)・(各種 Unicode) から eucJP-ms\fR
.ad
.sp .6
.RS 4n
日本語 EUC と Unicode との間の変換を、Windows NT 3.51 で実装されているのと同じ方法で行います。
.RE

.sp
.ne 2
.mk
.na
\fBUTF-8 から UTF-8-ms932・UTF-8-ms932 から UTF-8\fR
.ad
.sp .6
.RS 4n
「UTF-8」は変換元文字集合 PCK から変換された結果の Unicode (UTF-8 表現)、「UTF-8-ms932」は変換元文字集合 ms932 から変換された結果の Unicode (UTF-8 表現) とし、それら相互の変換を行います。
.RE

.SH 関連項目
.sp
.LP
\fBiconv\fR(1), \fBjistoeuc\fR(1), \fBjistosj\fR(1), \fBiconv\fR(3C), \fBiconv\fR(5), \fBiconv_unicode\fR(5) 
