Alhadis/Silos/Solaris-11.3/ja_JP.UTF-8/man5/ipfilter.5
'\" te
.\" To view license terms, attribution, and copyright for IP Filter, the default path is /usr/lib/ipf/IPFILTER.LICENCE.If the Solaris operating environment has been installed anywhere other than the default, modify the given path to access the file at the installed location.
.\" Portions Copyright (c) 2009, 2015, Oracle and/or its affiliates. All rights reserved.
.TH ipfilter 5 "2015 年 4 月 9 日" "SunOS 5.11" "標準、環境、マクロ"
.SH 名前
ipfilter \- IP パケットフィルタ処理ソフトウェア
.SH 機能説明
.sp
.LP
IP フィルタは、Solaris システムにパケットフィルタ処理機能を提供するソフトウェアです。適切に設定されたシステムでは、ファイアウォールを構築するために使用できます。
.sp
.LP
Solaris IP フィルタは、Solaris オペレーティングシステムとともにインストールされます。ただし、パケットフィルタ処理はデフォルトでは有効になっていません。IP フィルタ機能を有効にしてアクティブ化する手順については、\fBipf\fR(1M) を参照してください。 
.SS "場所プロファイルとの相互作用"
.sp
.LP
IP フィルタの構成およびアクティブ化は場所プロファイルで管理されます (場所プロファイルの詳細については、\fBnetcfg\fR(1M) を参照)。これらのプロファイルは、固定 (つまり、ネットワーク構成は従来の方法で管理される) とリアクティブ (つまり、ネットワーク構成は自動的に管理され、プロファイルに指定されたポリシールールに従ってネットワーク環境の変更に反応する) のいずれかです。
.sp
.LP
固定の場所 (現在は、DefaultFixed 場所の 1 つのみ) がアクティブな場合は、場所を無効にしたときに SMF リポジトリへの変更がその場所に適用され、場所を再度有効にしたときに復元されます。
.sp
.LP
リアクティブな場所がアクティブのときは、変更は SMF リポジトリに直接適用すべきではありません。これらの変更は場所プロファイルに保持されないため、場所が無効にされるか、\fBsvc:/network/physical:default\fR および \fBsvc:/network/location:default\fR によって管理されるシステムのネットワーク構成がリフレッシュまたは再起動された場合に失われます。代わりに、変更は、\fBnetcfg\fR コマンドを使用して場所自体に適用すべきです。これによって、変更は場所プロファイルリポジトリに保存され、SMF リポジトリにも適用されます (現在アクティブな場所に対して変更が行われた場合)。
.sp
.LP
IPv4 フィルタ構成ファイルが \fBipfilter-config-file\fR プロパティーで指定されている場合は、\fBipfilter\fR SMF サービスが有効になります。追加のフィルタタイプを有効にするために、\fBipfilter-v6-config-file\fR、\fBipnat-config-file\fR、および \fBippool-config-file\fR プロパティーを指定することも可能です。
.SH サービス
.sp
.LP
\fBipfilter\fR SMF サービスは、\fBstart\fR、\fBstop\fR、\fBrestart\fR、および \fBrefresh\fR メソッドをサポートします。これらのメソッドは、\fBsvcadm\fR(1M) を使用して呼び出されます。
.sp
.ne 2
.mk
.na
\fB\fBstart\fR\fR
.ad
.RS 11n
.rt  
\fBipfilter\fR カーネルモジュールをロードし、構成に従ってファイアウォールまたは NAT 規則をアクティブにします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstop\fR\fR
.ad
.RS 11n
.rt  
適用されたすべてのファイアウォールと NAT 規則、および作成されたアクティブなセッション情報をクリアします。ネットワーク接続が有効な状態でのサービスの停止は、ネットワークトラフィックがホストに入るリスクがない場合にのみ実行するようにしてください。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBrestart\fR\fR
.ad
.RS 11n
.rt  
\fBipfilter\fR サービスの停止と開始を実行します。動作中のファイアウォールに対してこのメソッドを使用すると、トラフィックがファイアウォールに侵入したり、フィルタリングされずに通過することができる、危険にさらされやすい期間が生じることになります。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBrefresh\fR\fR
.ad
.RS 11n
.rt  
現在の構成をロードし、セキュリティーポリシーが両方ともアクティブに使用されない時間をまったく生じさせずに古い構成から新しい構成に切り替えます。 
.RE

.SH ホストベースのファイアウォール
.sp
.LP
IP フィルタ構成の管理を簡素化するためにファイアウォールフレームワークが作成され、ユーザーはシステムレベルとサービスレベルのファイアウォールポリシーを記述することによって IP フィルタを構成できます。ユーザーが定義したファイアウォールポリシーから、必要なシステム動作が得られるようにフレームワークによって一連の IP フィルタ規則が生成されます。ユーザーは、特定のホスト、サブネット、およびインタフェースからのネットワークトラフィックを許可または拒否するよう、システムおよびサービスのファイアウォールポリシーを指定します。これらのポリシーが一連のアクティブな IPF 規則に変換されることにより、指定されたファイアウォールポリシーが適用されます。
.sp
.LP
ユーザーはフレームワークを利用しないことを選択した場合でも、独自の \fBipf\fR 規則ファイルを指定できます。カスタマイズされた規則を有効にする方法については、\fBipf\fR(1M) を、\fBipf\fR 規則の構文を見つけるには、\fBipf\fR(4) を参照してください。
.sp
.LP
IPF では、\fBipmon\fR(1M) サービスを使用してファイアウォールイベントのログをとります。\fBipmon\fR SMF サービスは、\fBipfilter\fR SMF サービスに依存しています。\fBipfilter\fR が “\fBsvcadm enable ipfilter\fR” によって自動的に有効になるとすぐに、\fBipmon\fR サービスが \fBipfilter\fR サービス開始メソッドによって一時的に有効になります。
.SS "モデル"
.sp
.LP
このセクションでは、ホストベースのファイアウォールフレームワークについて説明します。ファイアウォールポリシーを構成する方法については、\fBsvc.ipfd\fR(1M) を参照してください。
.sp
.LP
ユーザーは、優先度の異なる 3 つのレイヤーを利用して、必要な動作を実現できます。
.sp
.ne 2
.mk
.na
\fBGlobal Default\fR
.ad
.sp .6
.RS 4n
Global Default - システム全体のデフォルトファイアウォールポリシー。このポリシーは、サービスで独自にファイアウォールポリシーが変更されている場合を除き、すべてのサービスによって自動的に継承されます。
.RE

.sp
.ne 2
.mk
.na
\fBNetwork Services\fR
.ad
.sp .6
.RS 4n
Global Default よりも優先されます。サービスのポリシーは、Global Default ポリシーにかかわらず、その特定のポートに対するトラフィックを許可または禁止します。
.RE

.sp
.ne 2
.mk
.na
\fBGlobal Override\fR
.ad
.sp .6
.RS 4n
もう一つのシステム全体のポリシーで、Network Services レイヤーの個々のサービスの要求よりも優先されます。
.RE

.sp
.in +2
.nf
Global Override
      |
      |
Network Services
      |
      |
Global Default
.fi
.in -2
.sp

.sp
.LP
ファイアウォールポリシーには、ファイアウォールモードと、必要に応じてネットワークソースを設定します。ネットワークソースとは、システムが着信トラフィックを受け取る可能性のある、発信元の IP アドレス、サブネット、およびローカルネットワークインタフェースです。基本的なファイアウォールモードは次のとおりです。
.sp
.ne 2
.mk
.na
\fBNone\fR
.ad
.sp .6
.RS 4n
ファイアウォールなしで、すべての着信トラフィックを許可します。
.RE

.sp
.ne 2
.mk
.na
\fBDeny\fR
.ad
.sp .6
.RS 4n
すべての着信トラフィックを許可しますが、指定した発信元からの着信トラフィックは拒否します。
.RE

.sp
.ne 2
.mk
.na
\fBAllow\fR
.ad
.sp .6
.RS 4n
すべての着信トラフィックを拒否しますが、指定した発信元からの着信トラフィックは許可します。
.RE

.SS "レイヤーの詳細"
.sp
.LP
最初のシステム全体のレイヤー Global Default では、\fB任意\fRの着信トラフィックに適用するファイアウォールポリシーを定義します。たとえば、ある IP アドレスからのトラフィックをすべて許可またはブロックするように指定します。これにより、すべての着信トラフィックをブロックする、または望まない発信元からの着信トラフィックをすべてブロックするポリシーを簡単に作成できます。
.sp
.LP
Network Services レイヤーには、\fBtelnetd\fR、\fBsshd\fR、\fBhttpd\fR などのリモートクライアントにサービスを提供するローカルプログラムのためのファイアウォールポリシーが含まれています。このようなプログラム (ネットワークサービス) にはそれぞれ、サービスへのアクセスを制御する独自のファイアウォールポリシーがあります。最初は、サービスのポリシーは Global Default ポリシーを継承するように設定されています。つまり、「グローバルデフォルトを使用する」モードです。これにより、1 つのポリシーを Global Default レイヤーで設定し、それをすべてのサービスで簡単に継承することができます。
.sp
.LP
サービスのポリシーが Global Default ポリシーと異なっている場合は、サービスのポリシーが優先されます。あるサブネットからのトラフィックをすべてブロックするように Global Default ポリシーが設定されている場合でも、SSH サービスではそのサブネットの特定のホストからはアクセスを許可するように構成できます。Network Service レイヤーは、すべてのネットワークサービスに関するすべてのポリシーから成ります。
.sp
.LP
2 番目のシステム全体のレイヤー Global Override にも、任意の着信ネットワークトラフィックに適用されるファイアウォールポリシーが含まれています。このポリシーはもっとも優先度が高く、ほかのレイヤーのポリシーよりも優先されるため、個々のネットワークサービスの要求もオーバーライドします。たとえば、サービスのポリシーにかかわらず、悪意のある既知の発信元をブロックする場合に適しています。
.SS "ユーザーとの対話"
.sp
.LP
このフレームワークは IP フィルタ機能を活用するため、\fBsvc:/network/ipfilter\fR が有効になっている場合だけアクティブになり、\fBnetwork/ipfilter\fR が無効になっている場合はアクティブになりません。同様に、ネットワークサービスのファイアウォールポリシーは、サービスが有効になっている場合だけアクティブになり、サービスが無効になっている場合はアクティブになりません。ファイアウォールがアクティブになっているシステムには、実行中または有効になっている各ネットワークサービスの IP フィルタ規則が存在し、ファイアウォールモード \fBNone\fR ではないシステム全体のポリシーが存在します。
.sp
.LP
ユーザーは、システム全体のポリシーと各ネットワークサービスのポリシーを設定することにより、ファイアウォールを構成します。ファイアウォールポリシーの構成方法については、svc.ipfd(1M) を参照してください。
.sp
.LP
ファイアウォールフレームワークは、ポリシーの構成と、そのポリシーから IP フィルタ規則を生成して適用することによって必要な IP フィルタ構成を実現するメカニズムから成ります。設計およびユーザーとの対話のサマリーは次のとおりです。
.RS +4
.TP
.ie t \(bu
.el o
システム全体のポリシーは \fBnetwork/ipfilter\fR に保存されます
.RE
.RS +4
.TP
.ie t \(bu
.el o
ネットワークサービスのポリシーは各 SMF サービスに保存されます
.RE
.RS +4
.TP
.ie t \(bu
.el o
ユーザーは \fBnetwork/ipfilter\fR を有効にすることでファイアウォールをアクティブにします (\fBipf\fR(1M) を参照)
.RE
.RS +4
.TP
.ie t \(bu
.el o
ユーザーはネットワークサービスを有効または無効にすることで、そのサービスのファイアウォールをアクティブまたは非アクティブにします
.RE
.RS +4
.TP
.ie t \(bu
.el o
システム全体またはサービスごとのファイアウォールポリシーを変更すると、システムのファイアウォール規則が更新されます
.RE
.SH 属性
.sp
.LP
属性についての詳細は、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
\fB属性タイプ\fR\fB属性値\fR
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBsvcs\fR(1)、\fBipf\fR(1M)、\fBipmon\fR(1M)、\fBipnat\fR(1M)、\fBnetcfg\fR(1M)、\fBsvcadm\fR(1M)、\fBsvc.ipfd\fR(1M)、\fBipf\fR(4)、\fBipnat\fR(4)、\fBattributes\fR(5)、\fBsmf\fR(5)
.sp
.LP
\fI『Managing IP Quality of Service in Oracle Solaris 11.3 』\fR
.sp
.LP
\fI『Configuring and Managing Network Components in Oracle Solaris 11.3 』\fR
.SH 注意事項
.sp
.LP
\fBipfilter\fR サービスは、サービス管理機能 \fBsmf\fR(5) により次のサービス識別子として管理されます。
.sp
.in +2
.nf
svc:/network/ipfilter:default
.fi
.in -2
.sp

.sp
.LP
有効化、無効化、または再起動要求など、このサービスに関する管理操作は、\fBsvcadm\fR(1M) を使用して実行できます。サービスステータスを照会するには、\fBsvcs\fR(1) コマンドを使用します。
.sp
.LP
IP フィルタの起動時構成ファイルは \fB/etc/ipf\fR に保存されます。
