Alhadis/Silos/Solaris-11.3/ja_JP.UTF-8/man5/smf.5
'\" te
.\" Copyright (c) 2009, 2014, Oracle and/or its affiliates.All rights reserved.
.TH smf 5 "2014 年 2 月 13 日" "SunOS 5.11" "標準、環境、マクロ"
.SH 名前
smf \- サービス管理機能
.SH 機能説明
.sp
.LP
Solaris サービス管理機能は、「\fIサービス\fR」と呼ばれる永続的に実行されるアプリケーションを提供するためのプログラミングモデルを定義します。また、この機能は、サービスを実行するためのインフラストラクチャーも提供します。サービスは、実行中のアプリケーション、デバイスのソフトウェア状態、その他の一連のサービスのいずれかを表現できます。このフレームワーク内では、サービスは「\fIサービスインスタンス\fR」オブジェクトとして表現されます。これは、サービスオブジェクトの子になります。インスタンスオブジェクトは、親であるサービスオブジェクトの構成を継承またはオーバーライドできます。これにより、複数のサービスインスタンス間で構成情報を共有することができます。すべてのサービスオブジェクトとインスタンスオブジェクトは、一連の構成情報を表現した単一の「\fIスコープ\fR」内に格納されます。ローカル Solaris インスタンスの構成は「localhost」スコープと呼ばれますが、これが現在サポートされている唯一のスコープとなります。
.sp
.LP
各サービスインスタンスの名前は、障害管理リソース識別子 (Fault Management Resource Identifier、FMRI) に基づいて、スキーム「\fBsvc:\fR」を使って付けられます。たとえば、システム起動時に起動される \fBsyslogd\fR(1M) デーモンは、次のような名前を持つデフォルトサービスインスタンスです。
.sp
.in +2
.nf
svc://localhost/system/system-log:default
svc:/system/system-log:default
system/system-log:default
.fi
.in -2

.sp
.LP
多くのコマンドでは FMRI の省略形も使用できます。そのような例については、\fBsvcs\fR(1) のマニュアルページを参照してください。
.sp
.LP
上記の例では、\fBdefault\fR がインスタンスの名前、\fBsystem/system-log\fR がサービス名です。サービス名は、スラッシュ (\fB/\fR) で区切られた複数のコンポーネントから構成される場合があります。最後のものを除くすべてのコンポーネントで、そのサービスの「\fIカテゴリ\fR」が構成されます。サイト固有のサービスに名前を付ける場合は、\fBsite\fR で始まるカテゴリを使用するようにしてください。
.sp
.LP
サービスインスタンスは、有効化または無効化されます。すべてのサービスは、\fBsvcadm\fR(1M) コマンドを使って有効化または無効化できます。
.sp
.LP
システム上の管理対象サービスインスタンスを一覧表示するには、\fBsvcs\fR(1) コマンドを使用します。
.sp
.LP
管理者が標準の場所にあるマニフェストまたはプロファイルに基づくエンティティーを削除すると、そのエンティティーはマスクされて、SMF への通常のクエリーで表示されなくなります。マスクされたエンティティーを見つけるには \fBsvccfg listcust\fR を使用し、削除するには \fBsvccfg\fR の \fBdelcust\fR サブコマンドを使用します。詳細は、\fBsvccfg\fR(1M) を参照してください。
.SS "依存関係"
.sp
.LP
サービスインスタンスは、サービス、インスタンス、ファイルなどの一連の \fBentities\fR (エンティティー) に対する依存関係を持つ可能性があります。依存関係により、サービスがいつ起動され、いつ自動的に停止されるかが左右されます。サービスが有効化されていてもその依存関係が満たされていない場合、そのサービスはオフライン状態に保たれます。その依存関係が満たされると、そのサービスは起動されます。起動が成功すると、そのサービスはオンライン状態に移行します。サービスやインスタンスとは異なり、ファイルの依存関係は、ファイルが作成または削除されるたびに動的に評価されるということはありません。これらは 1 回だけ評価されます。
.sp
.LP
依存関係が満たされるかどうかは、サービスの \fBgrouping\fR (グループ化) によって決まります。
.sp
.ne 2
.mk
.na
\fB\fBrequire_all\fR\fR
.ad
.RS 16n
.rt  
引用されているすべてのサービスが実行中 (オンライン、機能低下のいずれか) の場合、または指定されているすべてのファイルが存在している場合に満たされます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrequire_any\fR\fR
.ad
.RS 16n
.rt  
引用されているサービスのいずれかが実行中 (オンライン、機能低下のいずれか) の場合、または指定されているファイルの少なくとも 1 つが存在している場合に満たされます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBoptional_all\fR\fR
.ad
.RS 16n
.rt  
引用されているサービスが実行中 (オンライン、機能低下のいずれか) の場合、または管理アクションが行われないためにそれらのサービスが実行されていない場合 (つまり、管理アクションが行われないために起動されない依存関係に対して待機状態にあるために、それらのサービスが無効、保守、存在しない、またはオフライン状態になっている場合) に満たされます。不完全なサービスも、オプションの依存関係を満たします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBexclude_all\fR\fR
.ad
.RS 16n
.rt  
引用されているすべてのサービスが無効になっているか保守状態にある場合、または引用されているサービスまたはファイルが存在していない場合に満たされます。
.RE

.sp
.LP
\fBrequire_all\fR、\fBrequire_any\fR、\fBoptional_all\fR のいずれかの依存関係から引用されている特定のサービスが、いったん実行中 (オンライン、機能低下のいずれか) になったあとで停止またはリフレッシュされた場合、SMF は、そのサービスが停止した理由とその依存関係の \fBrestart_on\fR 属性に基づいて、サービスを停止するかどうかを決定します。
.sp
.in +2
.nf
                   |  restart_on value
event              |  none  error restart refresh
-------------------+------------------------------
stop due to error  |  no    yes   yes     yes
non-error stop     |  no    no    yes     yes
refresh            |  no    no    no      yes
.fi
.in -2

.sp
.LP
あるサービスがエラーによって停止したとみなされるのは、コアダンプなどのハードウェアエラーやソフトウェアエラーがそのサービスで発生した場合です。\fBexclude_all\fR 依存関係の場合、引用されているサービスが起動され、かつ \fBrestart_on\fR 属性が \fBnone\fR 以外になっている場合にサービスが停止されます。
.sp
.LP
特定のサービスの依存関係を一覧表示するには \fBsvcs\fR(1) または \fBsvccfg\fR(1M) を使用し、変更するには \fBsvccfg\fR(1M) を使用します。
.SS "リスタータ"
.sp
.LP
各サービスは特定のリスタータによって管理されます。マスターリスタータ \fBsvc.startd\fR(1M) は、一連のサービスインスタンスとその依存関係の状態をすべて管理します。マスターリスタータは、自身のサービスに代って各種処理を行うほか、特定アプリケーションクラス向けの特定実行環境を提供できる委任リスタータを制御します。たとえば、\fBinetd\fR(1M) は委任リスタータであり、入力ファイル記述子と出力ファイル記述子で表されるネットワーク接続から成る初期環境を、自身のサービスインスタンスに対して提供します。\fBinetd\fR(1M) に委任された各インスタンスは、オンライン状態になっています。ある特定のインスタンスのデーモンが実行されていなくても、そのインスタンスを実行することは可能です。
.sp
.LP
依存関係が満たされるには、各インスタンスがオンライン状態に移行する必要があります。このため、\fBsvc.startd\fR(1M) は、ほかのインスタンスの起動メソッドを呼び出すか、委任リスタータにそうするように指示します。これらの処理はオーバーラップする可能性があります。
.sp
.LP
現在のサービス群およびそれらに関連付けられたリスタータを確認するには、\fBsvcs\fR(1) を使用します。すべてのリスタータが使用する共通の構成については、\fBsmf_restarter\fR(5) を参照してください。
.SS "メソッド"
.sp
.LP
各サービスまたはサービスインスタンスは、サービスの起動、停止、およびリフレッシュ (オプション) を行う一連のメソッドを定義する必要があります。\fBsvc.startd\fR(1M) および類似の \fBfork\fR(2)-\fBexec\fR(2) リスタータ用のメソッド規約の詳細については、\fBsmf_method\fR(5) を参照してください。
.sp
.LP
レガシー構成情報を取得してリポジトリ内に格納するメソッドなど、各種の管理メソッドについては、\fBsvccfg\fR(1M) のマニュアルページを参照してください。
.sp
.LP
特定のサービスのメソッドを一覧表示したり変更したりするには、\fBsvccfg\fR(1M) コマンドを使用します。
.SS "状態"
.sp
.LP
各サービスインスタンスは常に明確に定義された特定の状態にありますが、どの状態になるかは、その依存関係、メソッドの実行結果、および契約イベントの可能性によって決まります。定義されている状態は、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB未初期化\fR\fR
.ad
.RS 22n
.rt  
これは、すべてのサービスインスタンスの初期状態です。インスタンスは、\fBsvc.startd\fR(1M) または適切なリスタータによって評価された結果、保守、オフライン、無効のいずれかの状態に移行します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOFFLINE\fR\fR
.ad
.RS 22n
.rt  
インスタンスは有効になっていますが、まだ実行中でも実行可能でもありません。リスタータがあるサービスの起動メソッドまたはそれと同等のメソッドを正常に実行できた場合、そのインスタンスはオンライン状態に移行します。失敗した場合は通常、機能低下、保守のいずれかの状態に移行することがあります。管理アクションを行うと未初期化状態に移行する可能性があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBONLINE\fR\fR
.ad
.RS 22n
.rt  
インスタンスは有効になっており、実行中であるか実行可能になっています。オンライン状態の具体的な内容はアプリケーションモデルに固有であり、サービスインスタンスを管理するリスタータによって定義されます。オンラインは、適切に構成されたサービスのすべての依存関係が満たされた場合に予想される動作状態です。インスタンスで障害が発生すると、機能低下、保守のいずれかの状態に移行する可能性があります。インスタンスが依存するサービスで障害が発生すると、オフライン、機能低下のいずれかの状態に移行する可能性があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDEGRADED\fR\fR
.ad
.RS 22n
.rt  
インスタンスは有効になっており、実行中であるか実行可能になっています。ただし、通常の動作と比較すると、インスタンスはある制限された機能レベルで動作しています。インスタンスで障害が発生すると、保守状態に移行する可能性があります。インスタンスが依存するサービスで障害が発生すると、オフライン、機能低下のいずれかの状態に移行する可能性があります。機能が回復すると、オンライン状態に移行します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB保守\fR\fR
.ad
.RS 22n
.rt  
インスタンスを開始、停止、または継続実行できません。インスタンスを保守状態から移行させるには、(修正ステップの実行後の \fBsvcadm clear\fR による) 管理アクションが必要です。インスタンスが無効な場合、保守状態は一時的です。この場合に \fBsvcadm clear\fR が発行されると、インスタンスはインスタンスが保守状態に移行する原因となった \fBstop\fR メソッドを再実行せず、単に無効状態に復帰します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB無効\fR\fR
.ad
.RS 22n
.rt  
インスタンスは無効になっています。サービスを有効化するとオフライン状態に移行し、最終的には、すべての依存関係が満たされた時点でオンライン状態に移行します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBレガシー実行\fR\fR
.ad
.RS 22n
.rt  
この状態は、サービス管理機能によって管理されていないレガシーインスタンスを表します。この状態のインスタンスはある時点で起動されたものですが、それが実行中かどうかはわかりません。この機能を使って行えるのは、インスタンスの監視だけであり、ほかの状態に移行させることはできません。
.RE

.sp
.LP
状態の移行には、結果的に元の状態に戻るようなものもあります。
.SS "イベント通知"
.sp
.LP
SMF では、SNMP または SMTP を使用することで状態の遷移を通知できます。状態遷移に関する情報イベントが発行され、\fBsnmp-notify\fR(1M) や \fBsmtp-notify\fR(1M) などの通知デーモンによって処理されます。無効になっているサービスの SMF 状態遷移では、通知は生成されません。ただし、遷移の最終状態が「無効」で、その遷移に関する通知パラメータが存在する場合に限り、通知が生成されます。遷移の初期状態と最終状態が同じである場合、通知は生成されません。
.SS "通知パラメータ"
.sp
.LP
SMF 状態遷移によって生成される情報イベントを除き、FMA イベントの通知パラメータは \fBsvc:/system/fm/notify-params:default \fR に保存されます。これらは、サービスまたは遷移中のサービスのインスタンスに保存されます。SMF 状態遷移によって生成されるイベントの通知パラメータは、システム全体のパラメータとして \fBsvc:/system/svc/global:default\fR で設定できます。システム全体の通知パラメータは、\fBscf_instance_get_pg_composed\fR(3SCF) と同様の合成検索が遷移中のインスタンスに見つからない場合に使用されます。通知パラメータは \fBsvccfg\fR(1M) を使用すると操作できます。DTD に記述されている \fBnotification_parameters\fR 要素を使用すると、サービスマニフェストまたはサービスプロファイルで通知パラメータを構成できます。次に例を示します。
.sp
.in +2
.nf
<notification_parameters>
     <event  value='from-online' />
     <type name='smtp' active="false">
        <parameter name='to'>
            <value_node value='root@local' />
            <value_node value='admin-alias@eng' />
        </parameter>
     </type>
     <type name='snmp' />
</notification_parameters>
.fi
.in -2
.sp

.sp
.LP
\fIevents\fR は、SMF 状態遷移セットをコンマで区切ったリストか、または FMA イベントクラスをコンマで区切ったリストです。\fIevents\fR に SMF 状態遷移セットと FMA イベントクラスを混在させることはできません。 
.sp
.LP
FMA サブシステムで診断される問題のライフサイクルを、初期の診断から暫定的な更新、最後の問題解決まで、\fBproblem- {diagnosed,updated,repaired,resolved} \fR の各タグを利用して記述できます。これらのタグは、基になる FMA プロトコルイベントクラス (すべて \fBlist.*\fR 階層に含まれる) の別名ですが、後者は通知の構成に使用しないようにしてください。
.sp
.ne 2
.mk
.na
\fB\fBproblem-diagnosed\fR\fR
.ad
.sp .6
.RS 4n
新しい問題が FMA サブシステムによって診断されました。診断には、1 つ以上の疑わしいリソースからなるリストが含まれています。これらのリソースは、それ以上のエラーの発生を防ぐために、自動的に隔離されている可能性があります (適切な場合)。問題はイベントペイロードの UUID で識別されます。この問題の解決ライフサイクルを表す追加のイベントには、一致する UUID が使用されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBproblem-updated\fR\fR
.ad
.sp .6
.RS 4n
問題の診断に含まれていた疑わしいリソースの 1 つ以上が、修復または交換されたか、または疑いがなくなりました (あるいは、再度障害が発生しました)。ただし、障害の発生したリソースが少なくとも 1 つリストに残っています。修復は、\fBfmadm\fR コマンド行 (\fBfmadm repaired、fmadm acquit、fmadm replaced\fR) の結果として、あるいは部品シリアル番号の変更の検出などを通して自動的に検出された可能性があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBproblem-repaired\fR\fR
.ad
.sp .6
.RS 4n
問題の診断に含まれていた疑わしいリソースのすべてが、修復または解決されたか、または疑いがなくなりました。この段階では、一部またはすべてのリソースがまだ隔離されている可能性があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBproblem-resolved\fR\fR
.ad
.sp .6
.RS 4n
問題の診断に含まれていた疑わしいリソースのすべてが、修復または解決されたか、疑いがなくなりました。\fBさらに\fR、隔離も解除されました (オフラインになっていた疑わしい CPU がオンラインに戻った場合など。通常、この隔離解除のアクションは自動的に行われます)。
.RE

.sp
.LP
状態遷移セットは次のように定義されます。
.sp
.ne 2
.mk
.na
\fB\fBto-<state>\fR\fR
.ad
.RS 16n
.rt  
遷移の最終状態が <state> である、すべての遷移のセット。
.RE

.sp
.ne 2
.mk
.na
\fB\fBfrom-<state>\fR\fR
.ad
.RS 16n
.rt  
遷移の初期状態が <state> である、すべての遷移のセット。
.RE

.sp
.ne 2
.mk
.na
\fB\fB<state>\fR\fR
.ad
.RS 16n
.rt  
遷移の初期状態が <state> である、すべての遷移のセット。
.RE

.sp
.ne 2
.mk
.na
\fB\fBall\fR\fR
.ad
.RS 16n
.rt  
すべての遷移のセット。
.RE

.sp
.LP
state の有効な値は、maintenance、offline、disabled、online、および degraded です。遷移セットの定義の例は、\fBmaintenance\fR、\fB from-online\fR、\fBto-degraded\fR などです。
.SS "プロパティーとプロパティーグループ"
.sp
.LP
これまでに説明した依存関係、メソッド、委任リスタータ、およびインスタンス状態は、サービスまたはサービスインスタンスのプロパティーまたはプロパティーグループとして表現されます。サービスまたはサービスインスタンスは、任意の数のプロパティーグループを、アプリケーションデータの格納先として持つことができます。プロパティーグループをこのような方法で使用すれば、リポジトリがこの機能内のすべてのデータに対して提供する属性を、アプリケーションの構成情報から導き出すことができます。また、アプリケーションは、\fBservice_bundle\fR(4) DTD の適切なサブセットを使ってフレームワーク内の自身の構成データを表現することもできます。
.sp
.LP
プロパティーの検索は合成されます。あるプロパティーグループとプロパティーの組み合わせがサービスインスタンス上で見つからなかった場合、\fBlibscf\fR(3LIB) の大部分のコマンドや高レベルインタフェースは、その同じプロパティーとプロパティーグループの組み合わせを、そのインスタントを含むサービス上で検索します。これにより、共通の構成をサービスインスタンス間で共有することが可能になります。この合成は、サービスインスタンスとその親であるサービスとの間の一種の継承関係として捉えることができます。
.sp
.LP
プロパティーは、承認されていないプロセスによる変更から保護されます。\fBsmf_security\fR(5) を参照してください。
.SS "general プロパティーグループ"
.sp
.LP
\fBgeneral\fR プロパティーグループはすべてのサービスインスタンスに適用されます。次のプロパティーが含まれています。
.sp
.ne 2
.mk
.na
\fBenabled (boolean)\fR
.ad
.RS 22n
.rt  
インスタンスが有効になっているかどうかを指定します。このプロパティーがインスタンス上に存在しない場合、SMF は、そのインスタンスのリスタータにインスタンスの存在について通知しません。
.RE

.sp
.ne 2
.mk
.na
\fBrestarter (fmri)\fR
.ad
.RS 22n
.rt  
このサービスのリスタータ。詳細については、「リスタータ」のセクションを参照してください。このプロパティーが設定されていない場合は、システムのデフォルトのリスタータが使用されます。
.RE

.sp
.ne 2
.mk
.na
\fBcomplete (astring)\fR
.ad
.RS 22n
.rt  
このサービスが完了したか、または開始すべきでない部分的な定義であるかを示します。このプロパティーは、マニフェストのインポート時に自動的に設定されます。あるいは、このプロパティーを持たないインスタンスがテンプレート定義に対して正常に検証された場合は (\fBscf_tmpl_validate_fmri\fR(3SCF) を参照)、このインスタンスが有効になるときに \fBsvcadm\fR(1M) によってこのプロパティーが作成されます。
.RE

.SS "レイヤー"
.sp
.LP
リポジトリは、管理カスタマイズ、現在の状態、および標準の場所にあるファイルからのデフォルト値の組み合わせで構成されています。SMF 管理のファイルシステムの位置にあるマニフェストによって定義されているサービス、インスタンス、プロパティーグループ、およびプロパティーは、リポジトリ内で常に正確に表現されます。管理者またはほかのプログラムによって実行時に行われたカスタマイズは、捕獲されてリポジトリに保管されます。
.sp
.LP
プロパティーはリポジトリ内で、マニフェスト、プロファイル、および管理カスタマイズからの異なる設定を反映した異なる値を持つ場合があります。デフォルトでユーザーおよびサービスに提供される値は、\fB レイヤー\fRと呼ばれる単純な優先度スキームによって調停されます。 
.sp
.LP
SMF によって 4 つのレイヤーが追跡されます。優先度の高い順に示すと、次のようになります。
.sp
.ne 2
.mk
.na
\fBadmin\fR
.ad
.RS 18n
.rt  
SMF コマンドまたはライブラリの対話型使用によって実行されたすべての変更。このレイヤーは優先度がもっとも高くなります。
.RE

.sp
.ne 2
.mk
.na
\fBsite-profile\fR
.ad
.RS 18n
.rt  
\fB/etc/svc/profile/site\fR ディレクトリのファイルか、レガシーの \fB/etc/svc/profile/site.xml\fR および \fB/var/svc/profile/site.xml\fR ファイルのすべての値。
.RE

.sp
.ne 2
.mk
.na
\fBsystem-profile\fR
.ad
.RS 18n
.rt  
システムプロファイルの場所 \fB/etc/svc/profile/generic.xml\fR および \fB/etc/svc/profile/platform.xml\fR のすべての値
.RE

.sp
.ne 2
.mk
.na
\fBmanifest\fR
.ad
.RS 18n
.rt  
システムマニフェストの場所 \fB/lib/svc/manifest\fR または \fB/var/svc/manifest\fR のすべての値。 
.RE

.sp
.LP
個々のレイヤー内におけるプロパティーの競合は許可されません。\fBadmin\fR レイヤーに競合するプロパティーがある場合、以前のプロパティーが単純に上書きされます。同じプロパティーが複数のファイルによってほかのレイヤーで配信され、高いレイヤーで設定されない場合、インスタンス全体に競合状態のタグが付けられ、競合中の定義が削除されるか高いレイヤーでプロパティーが設定されるまでは、\fBsvc.startd\fR(1M) によって開始されません。\fBsvccfg\fR および \fBsvcprop\fR などの単一の値を要求するその他の \fBlibscf\fR 利用者は、すべての適切な値からランダムなプロパティー設定を取得します。競合中のどの値が返されるかは保証されません。
.SS "スナップショット"
.sp
.LP
リポジトリ内の各インスタンスに関する履歴データが、サービス管理機能によって管理されます。このデータは、管理上の検査やロールバック向けの読み取り専用スナップショットとして利用可能となります。利用可能なスナップショットタイプは次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBinitial\fR\fR
.ad
.RS 12n
.rt  
管理者によって作成されたかパッケージインストール中に生成されたインスタンスの初期構成。
.RE

.sp
.ne 2
.mk
.na
\fB\fBprevious\fR\fR
.ad
.RS 12n
.rt  
元に戻す管理操作を実行する際に取得された、その時点における構成。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrunning\fR\fR
.ad
.RS 12n
.rt  
インスタンスの実行中の構成。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstart\fR\fR
.ad
.RS 12n
.rt  
オンライン状態への正常移行中に取得された構成。
.RE

.sp
.LP
\fBsvccfg\fR(1M) コマンドを使用すれば、スナップショットを操作できます。
.SS "特殊なプロパティーグループ"
.sp
.LP
プロパティーグループの中には、「\fB非永続的\fR」とマークされているものがあります。それらのグループはスナップショット内にバックアップされず、その内容はシステムブート中にクリアされます。そのようなグループは一般に、システムの再起動時に消えてもかまわないようなアクティブプログラム状態を保持します。
.SS "構成リポジトリ"
.sp
.LP
サービスやサービスインスタンスに関連付けられたプロパティーに加え、各サービスインスタンスの現在の状態が、\fBsvc.configd\fR(1M) が管理するシステムリポジトリ内に格納されます。 
.sp
.LP
サービス管理機能データ用のリポジトリを管理するには、\fBsvc.configd\fR(1M) を使用します。
.SS "サービスバンドル、マニフェスト、およびプロファイル"
.sp
.LP
構成リポジトリ内に格納されている、サービスまたはサービスインスタンスに関連付けられた情報は、XML ベースのファイルとしてエクスポートできます。サービスバンドルと呼ばれるそれらの XML ファイルは移植性に優れており、バックアップ用途に適しています。サービスバンドルは次のいずれかのタイプに分類されます。
.sp
.ne 2
.mk
.na
\fB\fBmanifests\fR\fR
.ad
.RS 13n
.rt  
特定のサービス群またはサービスインスタンス群に関連付けられたプロパティーをすべて含んだファイル。
.RE

.sp
.ne 2
.mk
.na
\fB\fBprofiles\fR\fR
.ad
.RS 13n
.rt  
一連のサービスインスタンスと各インスタンスの enabled プロパティー (general プロパティーグループの \fBboolean\fR 型プロパティー) の値を含んだファイル。
.sp
プロファイルには、サービスおよびインスタンスのプロパティーの構成値も含まれることがあります。プロファイルにテンプレート要素を定義することはできません。
.sp
プロファイルでは、\fBservice_bundle\fR(4) で説明されている DTD の要素の緩和されたセットを使用できます。これらを使用するには、\fBDOCTYPE\fR エントリに次の定義を追加するようにしてください:
.sp
.in +2
.nf
<!ENTITY % profile "INCLUDE">
<!ENTITY % manifest "IGNORE">
.fi
.in -2
.sp

.RE

.sp
.LP
特定のリポジトリに対してサービスバンドルのインポート、エクスポートを行うには、\fBsvccfg\fR(1M) コマンドを使用します。サービスバンドルのファイル形式や作成時のガイドラインについては、\fBservice_bundle\fR(4) を参照してください。
.SS "マイルストーン"
.sp
.LP
\fBsmf\fR マイルストーンは、複数のサービス依存関係を集約するサービスです。通常、マイルストーンは、それ自体で有用な機能を果たすことはありませんが、ほかのサービスが利用できるようにシステム対応状況の特定の状態を宣言します。たとえば、\fBname-services\fR マイルストーンは、単に現在有効になっているネームサービスに依存します。
.SS "レガシー起動スクリプト"
.sp
.LP
\fB/etc/rc?.d\fR ディレクトリ内の起動プログラムは、対応する実行レベルのマイルストーンの一部として実行されます。
.sp
.ne 2
.mk
.na
\fB\fB/etc/rcS.d\fR\fR
.ad
.RS 14n
.rt  
\fBmilestone/single-user:default\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/rc2.d\fR\fR
.ad
.RS 14n
.rt  
\fBmilestone/multi-user:default\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/rc3.d\fR\fR
.ad
.RS 14n
.rt  
\fBmilestone/multi-user-server:default\fR
.RE

.sp
.LP
各プログラムの実行は特定の機能限定版のサービスインスタンスとして表現され、プログラムのパスに基づいて命名されます。これらのインスタンスは、特殊な状態であるレガシー実行状態に保たれます。
.sp
.LP
これらのインスタンスは enabled プロパティー (general プロパティーグループの \fBboolean\fR 型プロパティー) を持たず、一般に \fBsvcadm\fR(1M) コマンドを使って操作することもできません。これらのプログラムについては、エラー診断や再起動は行われません。
.SH 関連項目
.sp
.LP
\fBsvcs\fR(1), \fBinetd\fR(1M), \fBsnmp-notify\fR(1M), \fBsmtp-notify\fR(1M), \fBsvcadm\fR(1M), \fBsvccfg\fR(1M), \fBsvc.configd\fR(1M), \fBsvc.startd\fR(1M), \fBexec\fR(2), \fBfork\fR(2), \fBlibscf\fR(3LIB), \fBscf_tmpl_validate_fmri\fR(3SCF), \fBstrftime\fR(3C), \fBcontract\fR(4), \fBservice_bundle\fR(4), \fBsmf_bootstrap\fR(5), \fBsmf_method\fR(5), \fBsmf_restarter\fR(5), \fBsmf_security\fR(5)
