Alhadis/Silos/Solaris-11.3/ja_JP.UTF-8/man5/smf_bootstrap.5
'\" te
.\" Copyright (c) 2010, 2013, Oracle and/or its affiliates. All rights reserved.
.TH smf_bootstrap 5 "2011 年 12 月 28 日" "SunOS 5.11" "標準、環境、マクロ"
.SH 名前
smf_bootstrap \- サービス管理機能のブート、パッケージ化、および互換性の動作
.SH 機能説明
.sp
.LP
サービス管理機能は、サービスマニフェストの配信、サービスマニフェストの変更の組み込み、サービス構成の安定性の記述、サービス構成の優先指定の使用、およびサービスプロファイルの使用に関する規約を定めます。
.SS "ブート時のマニフェストの読み込み"
.sp
.LP
システムのブート時と、管理者またはプログラムが実行するときは常に、標準のディレクトリツリー \fB/lib/svc/manifest\fR および \fB/var/svc/manifest\fR からのマニフェストが処理されます。
.sp
.in +2
.nf
$ svcadm restart manifest-import
.fi
.in -2
.sp

.sp
.LP
以前インポートされなかったか、最後にインポートされてから変更されたマニフェストが処理されます。マニフェストが変更されたかどうかを判断するためにハッシュが使用されます。
.sp
.LP
標準の場所にあるマニフェストがはじめてインポートされると、マニフェストのプロパティー、インスタンス、およびサービスが、\fBmanifest\fR レイヤーの一部としてリポジトリに追加されます。
.sp
.LP
標準の場所にあるマニフェストは、更新されると自動的にインポートされます。新しいサービスおよびインスタンスは追加され、変更されたプロパティーはアップグレードされ、削除されたサービス、インスタンス、およびプロパティーは削除されます。
.sp
.LP
マニフェストはブート中に 2 つの段階で処理されます。 
.sp
.LP
サービス \fBsvc:/system/early-manifest-import:default\fR は、最初のマニフェスト処理を担当する擬似サービスです。このサービスは \fB/lib/svc/manifest\fR ディレクトリツリーにあるマニフェストだけを処理します。この処理は、\fBsvc.startd\fR(1M) がサービスを初期化する前に行われるため、\fB/lib/svc/manifest\fR で配信されているサービスは常に最新の定義で起動されます。これは擬似サービスなので \fBsvcadm\fR(1M) コマンドは無視されます。ただし、\fBsvcs\fR(1) を使用して、ステータスの監視とログファイル情報の取得を行うことはできます。
.sp
.LP
\fBsvc:/system/manifest-import:default\fR サービスは 2 番目のマニフェスト処理を担当し、まず \fB/lib/svc/manifest\fR、次に \fB/var/svc/manifest\fR の順に、これら両方のディレクトリツリーからマニフェストファイルをインポートします。
.sp
.LP
\fB/var/svc/manifest\fR のサポートは、\fBsystem/early-manifest-import:default\fR の導入より前にそのディレクトリツリーで配信されていたマニフェストに対する互換性サポートです。\fB/var/svc/manifest\fR で配信されているサービスには、アップグレード関連の問題が発生する可能性があります。つまり、更新されたマニフェストがまだインポートされていないために、サービスが古いリポジトリ構成で起動する可能性があります。同様に、マニフェストファイルがまだ処理されていないために、新たに追加されたサービスが使用できなくなったり、削除されたサービスがブート中に起動したりすることもあります。このような問題を避けるために、開発者にはマニフェストを \fB/lib/svc/manifest\fR に移動することを強くお勧めします。
.sp
.LP
このセクションで説明している操作では、\fB*.xml\fR ファイルのみが考慮されます。
.SS "プロファイルの適用"
.sp
.LP
プロファイルは early-manifest-import サービスおよび manifest-import サービスによっても適用されます。
.sp
.LP
\fB/etc/svc/profile/generic.xml\fR および \fB/etc/svc/profile/platform.xml\fR にあるシステム配信プロファイルは \fBsystem-profile\fR レイヤーにインポートされます。
.sp
.LP
\fB/etc/svc/profile/generic.xml\fR にあるシステム配信プロファイルは system-profile レイヤーにインポートされます。
.sp
.LP
管理者は次を実行することによって、これらのプロファイルが再適用されることを要求できます。
.sp
.in +2
.nf
$ svcadm restart manifest-import
.fi
.in -2
.sp

.sp
.LP
プロファイルによって定義されるプロパティー、インスタンス、およびサービスの動作は、マニフェストによって定義される動作と同じです。 
.sp
.LP
このセクションで説明している操作では、\fB*.xml\fR ファイルのみが考慮されます。
.SS "パッケージ化操作中のマニフェストの処理"
.sp
.LP
パッケージ内のサービスマニフェストは、クラス \fBmanifest\fR によって識別されます。サービスマニフェストのインストールと削除を行うクラスアクションスクリプトは、パッケージ化サブシステムに含まれています。\fBpkg install\fR が呼び出されると、サービスマニフェストがインポートされます。
.sp
.LP
\fBpkg uninstall\fR が呼び出されると、無効になっているマニフェスト内のインスタンスが削除されます。マニフェスト内のインスタンスで、オンライン状態または機能低下状態になっているものは、まず無効化され、そのあとで削除されます。また、インスタンスが残っていないマニフェスト内のサービスもすべて削除されます。
.SS "安定性の宣言"
.sp
.LP
マニフェストで配信する各サービスグループおよび各プロパティーグループには、\fBattributes\fR(5) の定義に基づく安定性レベルを宣言するようにしてください。アプリケーション開発者は、サービスやオブジェクトの存在またはそのコンポーネントを基に機能を開発する場合に、安定性レベルがわかっていれば、リリースが変わっても動作するかどうかを判断しやすくなります。
.sp
.LP
\fBsmf\fR(5) のコンテキストでは、安定性の値は、そのサービスのリリースが変わるときに想定される、プロパティーグループ内のプロパティーに対する変更の範囲も示します。これにはそのサービスのパッチも含まれます。次の 2 つのセクションでは、これについて詳細に説明します。
.SS "プロパティーグループの削除"
.sp
.LP
\fBservice_bundle\fR(4) ドキュメント型定義には、サービスマニフェスト内の各プロパティーグループに適用できる delete 属性があります。\fB true\fR に設定されている場合、delete 属性は \fBsvccfg\fR(1M) およびほかのマニフェストインポートツールに対し、このプロパティーグループをリポジトリから削除するように指示します。delete 属性が存在しないか \fBfalse\fR に設定されている場合、そのプロパティーグループはリポジトリに保持されます。
.sp
.LP
「安定」または「開発中」と宣言されているプロパティーグループは削除されません。「不安定」と宣言されているプロパティーグループは、リリースが変わるときに削除される可能性があります。
.SH 関連項目
.sp
.LP
\fBsvcs\fR(1), \fBsvcadm\fR(1M), \fBsvccfg\fR(1M), \fBsvc.startd\fR(1M), \fBlibscf\fR(3LIB), \fBservice_bundle\fR(4), \fBattributes\fR(5), \fBsmf\fR(5), \fBsmf_security\fR(5), \fBpkg\fR(1)
.sp
.LP
\fI『Packaging and Delivering Software With the Image Packaging System in Oracle Solaris 11.3 』\fR
.SH 注意事項
.sp
.LP
\fBsmf\fR(5) の現在のバージョンでは、複数のリポジトリはサポートされていません。
