Alhadis/Silos/Solaris-11.3/ja_JP.UTF-8/man1/auths.1
'\" te
.\" Copyright (c) 2004, 2015, Oracle and/or its affiliates.All rights reserved.
.TH auths 1 "2015 年 3 月 10 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
auths \-  承認の管理および一覧表示
.SH 形式
.LP
.nf
\fBauths\fR [\fIuser\fR]...
.fi

.LP
.nf
\fBauths\fR \fBlist\fR [\fB-S\fR \fIrepository\fR] [\fB-vx\fR] [\fB-u\fR \fIuser\fR]
.fi

.LP
.nf
\fBauths\fR \fBinfo\fR [\fB-S\fR \fIrepository\fR] [\fB-v\fR] [\fIauthorization\fR]
.fi

.LP
.nf
\fBauths\fR \fBcheck\fR [\fB-u\fR \fIuser\fR] \fIauthorization\fR
.fi

.LP
.nf
\fBauths\fR \fBadd\fR [\fB-S\fR \fIrepository\fR] \fB-t\fR \fIdescription\fR 
     [\fB-h\fR \fIhelp_file_path\fR] \fIauthorization\fR
.fi

.LP
.nf
\fBauths\fR \fBmodify\fR [\fB-S\fR \fIrepository\fR] [\fB-t\fR \fIdescription\fR]
     [\fB-h\fR \fIhelp_file_path\fR] \fIauthorization\fR
.fi

.LP
.nf
\fBauths\fR \fBremove\fR [\fB-S\fR \fIrepository\fR] \fIauthorization\fR
.fi

.SH 機能説明
.sp
.LP
\fBauths\fR コマンドは、自分や任意指定のユーザーまたは役割に付与された承認を標準出力に書き込みます。承認は、制限付き機能をユーザーが実行できるかどうかを決定するために、特定の特権付きプログラムによって検査される特権です。
.sp
.LP
このコマンドではまた、ローカルファイルのネームサービスまたは LDAP ネームサービスの \fBauth_attr\fR(4) データベース内の承認とそのプロパティーの作成および変更も行います。また、\fBauths\fR コマンドは、自分や必要に応じて指定されたユーザーまたは役割に付与された承認を標準出力に出力します。
.sp
.LP
管理者が追加、変更、または削除サブコマンドを使用して \fBauth_attr\fR(4) データベース内の承認を管理できるようにするには、その管理者に Rights Management プロファイルが付与されている必要があります。
.sp
.LP
各ユーザーはゼロまたはそれ以上の承認を持つことができます。承認は、承認を作成した組織と制御対象の機能とを識別する完全指定名で表現されます。Java の規約に準じて、承認の階層コンポーネントはドット (\fB\&.\fR) で区切られ、作成元組織のインターネットドメイン名を逆順にした形式で始まり、承認クラス内の特定の機能で終わります。承認をドット (\fB\&.\fR) で終わらせることはできません。
.sp
.LP
アスタリスク (\fB*\fR) はクラス内のすべての承認を示します。
.sp
.LP
ユーザーの承認は、\fBuser_attr\fR(4) および \fB/etc/security/policy.conf\fR ファイル (\fBpolicy.conf\fR(4) を参照) 内で検索されます。承認は、\fBuser_attr\fR(4) 内で直接、または \fBprof_attr\fR(4) を通して間接的に指定できます。また、\fB/etc/security/policy.conf\fR ファイル内で、承認をデフォルトの承認として直接、またはデフォルトプロファイルとして間接的に、システムの各ユーザーに割り当てることもできます。
.sp
.LP
ユーザーごとに、認証されたセットと認証されていないセットという、プロファイルの 2 つのセットがあります。認証されたセットでの承認は常に有効ですが、認証されていないセットでの承認は、認証検査への正常な応答のあとでのみ有効になります。このような検査は、ユーザーが、認証されたプロファイルのセット内のエントリに一致するコマンドを実行すると自動的に発行されます。\fBpfexec\fR(1) を参照してください。
.SS "サブコマンド"
.sp
.ne 2
.mk
.na
\fB\fBadd [-S \fIrepository\fR] -t \fIdescription\fR [-h \fIhelp_file_path\fR] \fI authorization\fR\fR\fR
.ad
.sp .6
.RS 4n
指定された承認 (\fIauthorization\fR) を指定されたネームサービスリポジトリ (\fIrepository\fR) 内に作成します。 
.sp
リポジトリオプションが指定されていない場合、承認はそのファイルのネームサービス内に作成されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcheck [-u \fIuser\fR] \fI authorization\fR\fR\fR
.ad
.sp .6
.RS 4n
指定された承認 (\fIauthorization\fR) が指定されたユーザー名 (\fIuser\fR) または現在のユーザーに付与されているかどうかを確認します。 
.sp
ユーザーに正しい承認が付与されている場合、\fBauths\fR は終了コード \fB0\fR で終了します。それ以外の場合は、\fB1\fR より大きい終了コードを返します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBinfo [-S \fIrepository\fR] [-v] [\fIauthorization\fR]\fR\fR
.ad
.sp .6
.RS 4n
指定された承認 (\fIauthorization\fR) が指定されたネームサービスリポジトリ (\fIrepository\fR) 内に存在するかどうかを確認するか、または \fBnsswitch.conf\fR(4)nsswitch.conf(4) に基づいて検索します。指定された承認が存在する場合は、その承認が一覧表示され、\fBauths\fR はリターンコード \fB0\fR で終了します。 
.sp
承認が指定されていない場合、\fBauths\fR は、指定されたネームサービスリポジトリ内に存在するすべての承認を出力するか、または \fBnsswitch.conf\fR(4) に基づいて出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlist [-S \fIrepository\fR] [-vx] [-u \fIuser\fR]\fR\fR
.ad
.sp .6
.RS 4n
指定されたユーザー (\fIuser\fR) または (ユーザー名が指定されていない場合は) 現在のユーザーに割り当てられているすべての承認をネームサービスリポジトリ (\fIrepository\fR) に基づいて一覧表示します。 
.sp
リポジトリが指定されていない場合は、\fBnsswitch.conf\fR(4) に基づいて情報が検索されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmodify [-S \fIrepository\fR] [ -t \fIdescription\fR ] [ -h \fIhelp_file_path\fR] \fR\fR
.ad
.sp .6
.RS 4n
指定されたネームサービスリポジトリ内の既存の承認を変更します。リポジトリが指定されていない場合は、\fBnsswitch.conf\fR(4) に基づいて検索された最初のネームサービス内の承認が変更されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBremove [-S \fIrepository\fR] \fI authorization\fR\fR\fR
.ad
.sp .6
.RS 4n
指定されたネームサービスリポジトリ (\fIrepository\fR) 内の既存の承認 (\fIauthorization\fR) を削除します。 
.sp
リポジトリが指定されていない場合は、\fBnsswitch.conf\fR(4) に基づいて検索された最初のネームサービスから承認が削除されます。
.RE

.SH オプション
.sp
.LP
\fBauths\fR サブコマンドは次のオプションをサポートします。
.sp
.ne 2
.mk
.na
\fB\fB-h\fR \fIhelp_file_path\fR\fR
.ad
.RS 21n
.rt  
承認に関する情報を含むヘルプファイルの場所を設定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR \fIrepository\fR\fR
.ad
.RS 21n
.rt  
変更または検索されるネームサービスリポジトリ (リポジトリ) を指定します。サポートされるリポジトリオプションは \fBfiles\fR と \fBldap\fR です。
.LP
注 - 
.sp
.RS 2
LDAP リポジトリを更新する場合、LDAP サーバーとクライアントの両方が \fBEnableShadowUpdate=true\fR で構成されている必要があります。
.RE
このオプションが省略されている場合は、\fBnsswitch.conf\fR(4) に基づいて検索されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fIdescription\fR\fR
.ad
.RS 21n
.rt  
承認のテキストでの説明を指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fI user\fR \fR
.ad
.RS 21n
.rt  
承認を一覧表示または確認するユーザー名 (\fIuser\fR) を指定します。 
.sp
このオプションが省略されている場合は、現在のユーザーが使用されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 21n
.rt  
承認の説明を出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.RS 21n
.rt  
承認のみを出力します。
.RE

.SH 使用例
.LP
\fB例 1 \fR\fBauths\fR コマンドの使用
.sp
.LP
\fBauths\fR の出力は次のようになります。

.sp
.in +2
.nf
example% auths tester01 tester02
tester01 : solaris.system.date,solaris.jobs.admin
tester02 : solaris.system.*
example%
.fi
.in -2
.sp

.sp
.LP
\fBtester01\fR 内の承認名を区切るコンマのあとにスペースはありません。

.sp
.LP
次のコマンドは、ユーザー \fBtester01\fR に割り当てられている承認を一覧表示します。

.sp
.in +2
.nf
example% auths list -u tester01

tester01:
solaris.jobs.admin
solaris.system.date
.fi
.in -2
.sp

.LP
\fB例 2 \fR承認の一覧表示
.sp
.LP
次のコマンドは、ユーザー \fBtester01\fR に割り当てられている承認を説明とともに一覧表示します。

.sp
.in +2
.nf
example% auths list -v -u tester01
tester01:
solaris.jobs.admin
Manage All Jobs
solaris.system.date
Set Date & Time
.fi
.in -2
.sp

.LP
\fB例 3 \fR承認の一覧表示
.sp
.LP
次のコマンドは、ネームサービス内の承認を説明とともに一覧表示します。

.sp
.in +2
.nf
example% auths info -v solaris.user.manage
solaris.user.manage:
Manage user accounts
example%
.fi
.in -2
.sp

.LP
\fB例 4 \fR承認の追加
.sp
.LP
次のコマンドは、承認 \fBsolaris.foo.manage\fR を説明 \fBmanage foo\fR およびヘルプファイル \fBAuthFoo.html\fR とともにファイルのネームサービスリポジトリに追加します。

.sp
.in +2
.nf
example% auths add -t "manage foo"\e
              -h /home/abc/AuthFoo.html solaris.foo.manage
.fi
.in -2
.sp

.LP
\fB例 5 \fR承認の変更
.sp
.LP
次の例では、承認 \fBsolaris.foo.manage\fR を変更し、説明を \fBmanage foo and bar\fR に設定したあと、LDAP でヘルプファイルを \fBAuthFooBar.html\fR に設定します。

.sp
.in +2
.nf
example% auths -S ldap modify -t " manage foo and bars"\e
              -h /home/abc/AuthFooBar.html solaris.foo.manage
.fi
.in -2
.sp

.SH 終了ステータス
.sp
.LP
次の終了ステータスが返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
エラーが発生した。
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 5n
.rt  
承認されていないユーザー。
.RE

.SH ファイル
.sp
.LP
\fB/etc/user_attr\fR
.sp
.LP
\fB/etc/security/auth_attr\fR
.sp
.LP
\fB/etc/security/policy.conf\fR
.sp
.LP
\fB/etc/security/prof_attr\fR
.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
.TE

.SH 関連項目
.sp
.LP
\fBprofiles\fR(1), \fBroles\fR(1), \fBgetauthattr\fR(3C), \fBauth_attr\fR(4), \fBpolicy.conf\fR(4), \fBprof_attr\fR(4), \fBuser_attr\fR(4), \fBattributes\fR(5)
.sp
.LP
\fI『Working With Oracle Solaris 11.3 Directory and         Naming Services: LDAP』\fR
