Alhadis/Silos/Solaris-11.3/ja_JP.UTF-8/man1/date.1
'\" te
.\" Copyright (c) 2004, 2011, Oracle and/or its affiliates. All rights Reserved.
.\" Copyright 1989 AT&T
.\" Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/. 
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation. In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html. This notice shall appear on any product containing this material.
.TH date 1 "2011 年 1 月 20 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
date \- 日付と時間の出力と設定
.SH 形式
.LP
.nf
\fB/usr/bin/date\fR [\fB-u\fR] [+\fIformat\fR]
.fi

.LP
.nf
\fB/usr/bin/date\fR [\fB-a\fR [-]\fIsss.fff\fR]
.fi

.LP
.nf
\fB/usr/bin/date\fR [\fB-u\fR] [ [\fImmdd\fR] \fIHHMM\fR | \fImmddHHMM\fR [\fIcc\fR] \fIyy\fR] [\fI\&.SS\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/date\fR [\fB-u\fR] [+\fIformat\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/date\fR [\fB-a\fR [-]\fIsss.fff\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/date\fR [\fB-u\fR]
     [ [\fImmdd\fR] \fIHHMM\fR | \fImmddHHMM\fR [\fIcc\fR] \fIyy\fR] [\fI\&.SS\fR]
.fi

.SH 機能説明
.sp
.LP
\fBdate\fR ユーティリティーは、日付と時間を標準出力に出力するほか、システムの日付と時間の設定も行います。デフォルトでは、現在の日付と時間を出力します。
.sp
.LP
月や曜日の名前を各国語に変換する仕様がサポートされています。使用される月や曜日の名前は、環境変数 \fBLC_TIME\fR で指定されたロケールに基づいて決定します (\fBenviron\fR(5) 参照)。
.sp
.LP
\fBC\fR ロケールのデフォルト形式は次のようになっています。
.sp
.in +2
.nf
\fI%a %b %e %T %Z %Y\fR
.fi
.in -2

.sp
.LP
たとえば、
.sp
.in +2
.nf
Fri Dec 23 10:10:42 EST 1988
.fi
.in -2
.sp

.SH オプション
.sp
.LP
サポートしているオプションは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR [ \fB-\fR ] \fIsss.fff\fR \fR
.ad
.RS 21n
.rt  
システムクロックをゆっくり調整します。調整の単位は \fIsss\fR.\fIfff\fR 秒です (\fIfff\fR は秒の小数部)。調整は、プラスとマイナスの両方が可能です。システムクロックは、指定された秒だけ速くまたは遅くなります。日付の調整を行うことができるのはスーパーユーザーだけです。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.RS 21n
.rt  
日付の表示や設定を行う際に、通常のローカル時間に変換しないでグリニッジ標準時間 (GMT - 標準時間 ) を使用します。
.RE

.SH オペランド
.sp
.LP
次のオペランドがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB+\fR\fIformat\fR \fR
.ad
.RS 12n
.rt  
引数が \fB+\fR で始まる場合、\fBdate\fR の出力は、\fIformat \fRと現時間を \fBstrftime()\fR に渡すことによって得られる値になります。\fBdate\fR は、\fBstrftime\fR(3C) のマニュアルページにある変換規則と、\fB%C\fR の変換規則を使用します。この変換規則は、 \fB/usr/bin/date\fR と \fB/usr/xpg4/bin/date \fR のどちらが使われているかにより異なります。 
.sp
.ne 2
.mk
.na
\fB\fB/usr/bin/date\fR \fR
.ad
.RS 23n
.rt  
ロケールの日付と時間の表現。\fBdate\fR のデフォルト出力
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/xpg4/bin/date\fR \fR
.ad
.RS 23n
.rt  
西暦 (年の上 2 桁)。つまり、年を 100 で割って端数を切り捨てた数字 (00-99)。
.RE

さらに、日付には \fI%N\fR もサポートされています。これは、Epoch (\fB1970 年 1 月 1 日の 00:00:00 UTC\fR) からの現在時間のナノ秒部分を 10 進数 [\fB000000000-999999999\fR] で表現します。この変換仕様では、\fBstrftime()\fR で指定されているオプションのフラグ文字、オプションのフィールド幅、またはその両方を指定できます。ただし、指定されたフィールド幅が 9 未満の場合、実際の日付出力には、ナノ秒部分の左から指定された桁数の数字だけが含まれています。
.sp
文字列は常に復帰改行文字で終わります。引数に空白文字が含まれるときは、引用符で囲んでください。詳細については「使用例」の項を参照してください。\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fImm\fR\fR
.ad
.RS 12n
.rt  
月
.RE

.sp
.ne 2
.mk
.na
\fB\fIdd\fR\fR
.ad
.RS 12n
.rt  
日
.RE

.sp
.ne 2
.mk
.na
\fB\fIHH\fR\fR
.ad
.RS 12n
.rt  
時 (24 時 (間) 表示 )
.RE

.sp
.ne 2
.mk
.na
\fB\fIMM\fR\fR
.ad
.RS 12n
.rt  
分
.RE

.sp
.ne 2
.mk
.na
\fB\fISS\fR \fR
.ad
.RS 12n
.rt  
秒
.RE

.sp
.ne 2
.mk
.na
\fB\fIcc\fR\fR
.ad
.RS 12n
.rt  
西暦 (年の上 2 桁)。つまり、年を 100 で割って端数を切り捨てた数字 (00-99)。たとえば、1988 年の場合、\fIcc\fR は \fB19\fR で、2007 年の場合、\fBcc\fR は 20 です。
.RE

.sp
.ne 2
.mk
.na
\fB\fIyy\fR\fR
.ad
.RS 12n
.rt  
年の下 2 桁。\fIcc\fR を指定しない場合、「\fB69–99\fR」という範囲は「1969 年から 1999 年まで (1969 年と 1999 年を含む)」を示し、「\fB00–68\fR」の範囲は「2000 年から 2068 年まで (2000 年と 2068 年を含む)」を示します。
.RE

.sp
.LP
月 (mm) 、日 (dd) 、年 (yy)、世紀 (cc) は省略できます。この場合は、現在の値がデフォルト値になります。例を示します。
.sp
.in +2
.nf
example% \fBdate 10080045\fR
.fi
.in -2
.sp

.sp
.LP
この例では、日付と時刻が 10 月 8 日午前 12 時 45 分に設定されます。年を指定していないので、現在の年がデフォルトで使用されます。システムは GMT で動作していますが、\fBdate\fR はローカルの標準時間の変換を処理します。日付を変更することができるのは、スーパーユーザーだけです。日付と時間を正しく設定し終わると、\fBdate\fR は、デフォルトのフォーマットで新しい日付を表示します。また、\fBdate\fR コマンドは正しいタイムゾーン情報を決定するために \fBTZ\fR を使用しています (\fBenviron\fR(5) 参照)。 
.SH 使用例
.LP
\fB例 1 \fR出力の生成
.sp
.LP
次のコマンドを見てください。

.sp
.in +2
.nf
example% \fBdate '+DATE: %m/%d/%y%nTIME:%H:%M:%S'\fR
.fi
.in -2
.sp

.sp
.LP
このコマンドによって、次の内容が出力されます。

.sp
.in +2
.nf
DATE: 08/01/76

TIME: 14:45:05
.fi
.in -2
.sp

.LP
\fB例 2 \fR現在の時間の設定
.sp
.LP
次のコマンドは現在の時間を \fB12:34:56\fR に設定します。

.sp
.in +2
.nf
example# \fBdate 1234.56\fR
.fi
.in -2
.sp

.LP
\fB例 3 \fRグリニッジ平均時による現在の時間の設定
.sp
.LP
次のコマンドは現在の時刻を 2000 年 1 月 1 日、午前 12 時 30 分に設定します。 

.sp
.in +2
.nf
example# \fBdate -u 010100302000\fR
.fi
.in -2
.sp

.sp
.LP
コマンドを実行すると、次のように表示されます。

.sp
.in +2
.nf
Thu Jan 01 00:30:00 GMT 2000
.fi
.in -2
.sp

.SH 環境
.sp
.LP
\fBdate\fR の実行に影響を与える次の環境変数の詳細については、\fBenviron\fR(5) を参照してください。\fBLANG\fR、\fBLC_ALL\fR、\fBLC_CTYPE\fR、\fBLC_TIME\fR、\fBLC_MESSAGES\fR、および \fBNLSPATH\fR。
.sp
.ne 2
.mk
.na
\fB\fBTZ\fR\fR
.ad
.RS 6n
.rt  
\fB-u\fR オプションが省略されたときに、 時間と日付の出力に使用するタイムゾーンを指定します。この \fBTZ\fR 変数が設定されず、 \fB-u\fR も省略されている場合は、システムのデフォルトのタイムゾーンが 使用されます。
.RE

.SH 終了ステータス
.sp
.LP
次の終了ステータスが返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB>\fB0\fR\fR
.ad
.RS 6n
.rt  
エラーが発生した。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.SS "/usr/bin/date"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
CSI有効
.TE

.SS "/usr/xpg4/bin/date"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/xopen/xcu4
_
CSI有効
_
インタフェースの安定性確実
_
標準T{
\fBstandards\fR(5) を参照してください。
T}
.TE

.SH 関連項目
.sp
.LP
\fBstrftime\fR(3C), \fBattributes\fR(5), \fBenviron\fR(5), \fBstandards\fR(5)
.SH 診断
.sp
.ne 2
.mk
.na
\fB\fBno permission\fR \fR
.ad
.RS 19n
.rt  
スーパーユーザーではないので日付を変更できません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBbad conversion\fR \fR
.ad
.RS 19n
.rt  
日付設定の構文が正しくありません。
.RE

.SH 注意事項
.sp
.LP
標準タイムゾーンから別のタイムゾーンに切り替わる日 (たとえば、夏時間が始まる日または終わる日) を現在の日付とし、標準タイムゾーンの時間から別のタイムゾーンの時間に切り替わるときを現在の時間にしようとした場合の結果は、保証されません。
.sp
.LP
システムの日時の変更を行うために、ウィンドウ環境で \fBdate\fR コマンドを使用すると、不具合が発生する可能性があります。この場合の結果は保証されません。また、ウィンドウ環境以外のマルチユーザーモードでも、システムの日時を大幅に変更したりすると、結果が不安定になることがあります。システムの日時を変更するには、コマンド \fBdate\fR \fB-a\fR を使用することをお勧めします。
.sp
.LP
\fB03:14:07 UTC Jan 19, 2038\fR を超える日時にシステム日時を設定すること、つまりその日時を越えてシステム日時が進行することは、Solaris ではサポートされていません。
