Alhadis/Silos/Solaris-11.3/ja_JP.UTF-8/man1/du.1
'\" te
.\" Copyright (c) 1992, X/Open Company Limited.All Rights Reserved.
.\" Portions Copyright (c)2007, Sun Microsystems, Inc. All Rights Reserved.
.\"  Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation. In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html. This notice shall appear on any product containing this material.
.TH du 1 "2007 年 2 月 6 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
du \- ディスク使用量の集計
.SH 形式
.LP
.nf
\fB/usr/bin/du\fR [\fB-dorx\fR] [\fB-a\fR | \fB-s\fR] [\fB-h\fR | \fB-k\fR | \fB-m\fR] [\fB-H\fR | \fB-L\fR] 
     [\fIfile\fR ...]
.fi

.LP
.nf
\fB/usr/xpg4/bin/du\fR [\fB-dorx\fR] [\fB-a\fR | \fB-s\fR] [\fB-h\fR | \fB-k\fR | \fB-m\fR] [\fB-H\fR | \fB-L\fR] 
     [\fIfile\fR ...]
.fi

.SH 機能説明
.sp
.LP
\fBdu\fR ユーティリティーは、指定された各ファイルをルートとするファイル階層に割り当てられたファイル領域のサイズ、およびそのファイル階層の各サブディレクトリに割り当てられたファイル領域のサイズを標準出力に書き出します。ディレクトリタイプのファイルに割り当てられたファイル領域のサイズは、そのディレクトリをルートとするファイル階層内のすべてのファイルに割り当てられた容量の合計に、そのディレクトリ自体に割り当てられた容量を加えたものとして定義されます。この合計には、検出された拡張属性に割り当てられた容量もすべて含まれます。
.sp
.LP
複数のリンクを持つファイルは、1 つだけのエントリとしてカウントされ、書き出されます。レポート内で選択されるディレクトリエントリは特定できません。デフォルトでは、ファイルサイズは 512 バイト単位で書き出され、次の 512 バイト単位に切り上げられます。
.SS "/usr/xpg4/bin/du"
.sp
.LP
\fBdu\fR がファイル属性の取得またはディレクトリの読み取りを行えない場合 (\fBstat\fR(2) を参照)、エラー状態が報告され、最終的な終了ステータスが影響を受けます。
.SH オプション
.sp
.LP
次のオプションは、\fB/usr/bin/du\fR および \fB/usr/xpg4/bin/du\fR でサポートされています。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 7n
.rt  
デフォルトの出力に加えて、指定されたファイルをルートとするファイル階層内のディレクトリタイプ以外の各ファイルのサイズも報告します。\fB-a\fR オプションの存在に関係なく、\fIfile\fR オペランドとして指定された非ディレクトリが常に一覧表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 7n
.rt  
ファイルシステム境界を越えません。たとえば、コマンド \fBdu -d /\fR はルートパーティション上の使用量のみを報告します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 7n
.rt  
すべてのサイズは縮小され、読みやすい形式で表示されます。たとえば、\fB14K\fR、\fB234M\fR、\fB2.7G\fR、\fB3.0T\fR などのようになります。縮尺は、\fB1024\fR を除数として行われます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR \fR
.ad
.RS 7n
.rt  
ディレクトリへのシンボリックリンクがコマンド行に指定された場合、そのシンボリックリンク自体ではなく、そのリンクが参照するディレクトリを使用して、シンボリックリンクを処理します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR\fR
.ad
.RS 7n
.rt  
ファイルサイズを、デフォルトの 512 バイト単位ではなく、1024 バイト単位で書き出します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fR
.ad
.RS 7n
.rt  
シンボリックリンクの処理を、そのシンボリックリンク自体ではなく、そのリンクが参照するファイルまたはディレクトリを使用して行います。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.RS 7n
.rt  
ファイルサイズを、デフォルトの 512 バイト単位ではなく、メガバイト単位で書き出します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR\fR
.ad
.RS 7n
.rt  
子ディレクトリの使用量を親の合計に加算しません。このオプションを指定しないと、特定のディレクトリに対して表示される使用量は、そのディレクトリ内のファイルと、その下にあるすべてのディレクトリ内のファイルで使用される容量になります。\fB-s\fR が使用されている場合、このオプションは何も行いません。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.RS 7n
.rt  
ステータスを取得できない読み取り不可のディレクトリおよびファイルに関する診断メッセージを生成します。これらの状態が発生したときに \fB-r\fR が指定されていない場合、/usr/bin/du は何も出力しません。\fB/usr/xpg4/bin/du\fR は、\fB-r\fR が常に指定されているように動作します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 7n
.rt  
デフォルトの出力の代わりに、指定された各ファイルの総量のみを報告します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.RS 7n
.rt  
ファイルサイズを評価するときは、ファイルオペランドによって指定されたファイルと同じデバイスを持つファイルのみを評価します。 
.RE

.sp
.LP
これらのオプションを相互に排他的なペア \fB-H\fR と \fB-L\fR で複数指定しても、エラーとはみなされません。最後に指定されたオプションによって出力形式が決められます。
.sp
.LP
これらのオプションを相互に排他的なオプションセット \fB-h\fR、\fB-k\fR、および \fB-m\fR で複数指定しても、エラーとはみなされません。最後に指定されたオプションによって出力形式が決められます。
.SH オペランド
.sp
.LP
次のオペランドを指定できます。
.sp
.ne 2
.mk
.na
\fB\fIfile\fR\fR
.ad
.RS 8n
.rt  
サイズが書き出されるファイルのパス名。\fIfile\fR が指定されていない場合は、現在のディレクトリが使用されます。
.RE

.SH 出力
.sp
.LP
\fBdu\fR からの出力は、ファイルに割り当てられた領域の量とそのファイルの名前で構成されます。
.SH 使用法
.sp
.LP
2G バイト (2^31 バイト) 以上のファイルを検出したときの \fBdu\fR の動作については、\fBlargefile\fR(5) を参照してください。
.SH 環境
.sp
.LP
\fBdu\fR の実行に影響を与える次の環境変数の詳細は、\fBenviron\fR(5) を参照してください。\fBLANG\fR、\fBLC_ALL\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR、および \fBNLSPATH\fR。
.SH 終了ステータス
.sp
.LP
次の終了ステータスが返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fI\fR\fR
.ad
.RS 6n
.rt  
エラーが発生した。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.SS "/usr/bin/du"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
CSI有効
_
インタフェースの安定性確実
.TE

.SS "/usr/xpg4/bin/du"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/xopen/xcu4
_
CSI有効
_
インタフェースの安定性標準
.TE

.SH 関連項目
.sp
.LP
\fBls\fR(1), \fBstat\fR(2), \fBattributes\fR(5), \fBenviron\fR(5), \fBfsattr\fR(5), \fBlargefile\fR(5), \fBstandards\fR(5)
.sp
.LP
\fIIntroduction to Oracle Solaris 11.3                 Administration\fR
.SH 注意事項
.sp
.LP
2 つ以上のリンクを持つファイルは一度しかカウントされません。ただし、異なるディレクトリ内のファイル間にリンクが存在し、それらのディレクトリがファイルシステム階層の別々のブランチにある場合、\fBdu\fR は余分なファイルを複数回カウントします。
.sp
.LP
ファイルにホールが含まれていると、ブロック数が正しく表示されません。
