Alhadis/Silos/Solaris-11.3/ja_JP.UTF-8/man1/pr.1
'\" te
.\" Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\" Copyright 1989 AT&T
.\" Portions Copyright (c) 1995, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation. In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html. This notice shall appear on any product containing this material.
.TH pr 1 "2011 年 8 月 17 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
pr \- ファイルの出力
.SH 形式
.LP
.nf
\fB/usr/bin/pr\fR [+ \fIpage\fR] [\fB-column\fR] [\fB-adFmrt\fR] [\fB-e\fR [\fIchar\fR] [\fIgap\fR]] [\fB-h\fR \fIheader\fR] [\fB-i\fR [\fIchar\fR] [\fIgap\fR]] [\fB-l\fR \fIlines\fR] [\fB-n\fR [\fIchar\fR] [\fIwidth\fR]] [\fB-o\fR \fIoffset\fR] [\fB-s\fR [\fIchar\fR]] [\fB-w\fR \fIwidth\fR] [\fB-fp\fR] [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/xpg4/bin/pr\fR [+ \fIpage\fR] [\fB-column\fR | \fB-c\fR \fIcolumn\fR] [\fB-adFmrt\fR] [\fB-e\fR [\fIchar\fR] [\fIgap\fR]] [\fB-h\fR \fIheader\fR] [\fB-i\fR [\fIchar\fR] [\fIgap\fR]] [\fB-l\fR \fIlines\fR] [\fB-n\fR [\fIchar\fR] [\fIwidth\fR]] [\fB-o\fR \fIoffset\fR] [\fB-s\fR [\fIchar\fR]] [\fB-w\fR \fIwidth\fR] [\fB-fp\fR] [\fIfile\fR]...
.fi

.SH 機能説明
.sp
.LP
\fBpr\fR ユーティリティーは、印刷とページ設定用のフィルタです。複数のファイルを指定すると、その各々を読み込み、書式化して、標準出力に書き出します。デフォルトでは、入力データを 66 行からなるページに分割します。各ページには以下のものが含まれます。
.RS +4
.TP
.ie t \(bu
.el o
5 行からなるヘッダー。ページ番号、日付、時間、ファイルのパス名を含む
.RE
.RS +4
.TP
.ie t \(bu
.el o
5 行の空行からなるトレーラ
.RE
.sp
.LP
標準出力が端末に割り当てられているとき、診断メッセージは \fBpr\fR ユーティリティーの処理が完了してから出力されます。
.sp
.LP
複数カラム出力を示すオプションを指定すると、テキストカラムは等しい幅で出力されます。この幅に収まらない入力行は切り捨てられます。デフォルトでは、出力テキストカラムは 1 つ以上の空白文字で区切られます。
.SH オプション
.sp
.LP
以下のオプションがサポートされています。なおオプションの説明において、\fIcolumn\fR、\fIlines\fR、\fIoffset\fR、\fIpage\fR、\fIwidth\fR は正の 10 進整数を表し、\fIgap\fR は負でない 10 進整数を表します。オプション引数の中には、省略可能なものがあります。また直前のオプション文字と分離して独立した引数として指定できないものがあります。具体例としては、\fB-s\fR オプションと引数とを離して記述することはできません。また \fB-e\fR、\fB-i\fR、\fB-n\fR の各オプションは、2 つの引数を記述するのであれば、それらをオプション文字と離すことはできません。
.sp
.LP
次のオプションは、\fB/usr/bin/pr\fR と \fB/usr/xpg4/bin/pr\fR の両方で使用できます。
.sp
.ne 2
.mk
.na
\fB\fB+\fR\fIpage\fR \fR
.ad
.RS 25n
.rt  
書式化された入力の、\fIpage\fR で示すページ番号から出力を開始します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-\fR\fIcolumn\fR \fR
.ad
.RS 25n
.rt  
\fIcolumn\fR で示す数 (デフォルトは \fB1\fR) のカラムからなる複数カラム出力を生成します。これらのカラムには、入力ファイルからテキストを受け取った順序でデータが書き込まれます。このオプションは \fB-m\fR オプションと同時に使うことはできません。複数カラム出力を指定すると、\fB-e\fR と \fB-i\fR の両オプションも指定されたと見なされます。同一行数となるようなテキストカラムの生成を指定したか否かに関わらず、テキストカラムがページの長さを超えることはありません (\fB-l\fR オプションの説明を参照) 。このオプションを \fB-t\fR とともに指定した場合、最少の行数で出力データを書き出します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 25n
.rt  
出力ページ内において、連鎖的にカラムが印刷されるよう、\fB-\fR\fIcolumn\fR オプション指定による出力を加工します。たとえば、\fIcolumn\fR の値が 2 のとき、最初の入力行が 1 行目のカラム 1 に、2 番目の入力行が 1 行目のカラム 2 に出力された後、続く 3 番目の行は 2 行目のカラム 1 に置かれます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 25n
.rt  
入力内に復帰改行文字が現れるたびに、そのあとにもう 1 つ 改行文字を挿入して、ダブルスペース (2 倍の改行幅) で出力を生成します。\fB\fR\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB\fR\fB-e\fR\fB [ \fR\fIchar\fR\fB ][ \fR\fIgap\fR\fB ]\fR \fR
.ad
.RS 25n
.rt  
入力内の各タブ文字を、式 \fIn\fR \fI*gap+1\fR を満たす次のカラム位置に展開します。\fIn\fR は正の整数です。\fB\fR\fB\fR\fIgap\fR に \fB0\fR を指定するか、gap を省略すると、デフォルトとして \fB8\fR が用いられます。入力内のタブ文字はすべて、適切な数のスペース文字に展開されます。\fB\fR\fB\fR数字でない文字 \fIchar\fR を指定すると、それは入力タブ文字と見なされます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 25n
.rt  
改ページの際に、デフォルトである一連の復帰改行文字の代わりに、用紙送り文字を使用します。\fB\fR\fB\fR標準出力が端末に割り当てられているとき、最初のページの出力を始める前に一時停止します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR \fIheader\fR \fR
.ad
.RS 25n
.rt  
ページヘッダーの見出しとして、\fIfile\fR オペランドの値の代わりに \fIheader\fR で示す文字列を使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIlines\fR \fR
.ad
.RS 25n
.rt  
ページの長さを、デフォルトの 66 の代わりに \fIlines\fR で示す行数に設定します。\fIlines\fR の値がヘッダーとトレーラの長さの合計行数以下の場合、\fBpr\fR は \fB-t\fR オプションが有効な場合と同じように、ヘッダーとトレーラの出力を抑止します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.RS 25n
.rt  
ファイルをマージします。\fBpr\fR は、\fIfile\fR で指定された複数のファイルから 1 行ずつを読み込み、同じ幅のテキストカラムにそれらの行の内容を書き込んで標準出力を生成します。最大 9 個のファイルのマージがサポートされています。\fI\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n [ \fR\fIchar\fR\fB ][ \fR\fIwidth\fR\fB ]\fR \fR
.ad
.RS 25n
.rt  
行番号の桁数を \fIwidth\fR で示す値とします。デフォルトは \fB5\fR です。\fI\fR出力上において行番号は、デフォルト出力の場合には各テキストカラムの先頭の \fIwidth\fR 個のカラムを、\fB-m\fR 出力の場合には各行の先頭の width 個のカラムを占めます。数字でない文字 \fIchar\fR を指定すると、行番号と後続の出力を隔てるために行番号に付加されます。\fIchar\fR のデフォルトはタブ文字です。\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIoffset\fR \fR
.ad
.RS 25n
.rt  
各出力行の前にオフセットの <スペース> が置かれます。\fB-o\fR オプションを省略すると、デフォルトのオフセット値は \fB0\fR となります。ここで指定するオフセット値は、出力行の幅に追加されます (後述する \fB-w\fR オプションの説明を参照) 。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.RS 25n
.rt  
標準出力が端末に割り当てられているとき、ページの出力を始める前に一時停止します。\fBpr\fR は警告 (\fBALERT\fR) 文字を標準エラー出力に送り、\fB/dev/tty\fR 上で復帰改行文字が読み込まれるのを待ちます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.RS 25n
.rt  
ファイルをオープンできなくても、それに関する診断レポートを出力しません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fB[\fR\fIchar\fR\fB]\fR \fR
.ad
.RS 25n
.rt  
テキストカラムを区切る文字として、一連のスペース文字の代わりに、\fIchar\fR で示す 1 文字を使用します。\fIchar\fR のデフォルトはタブ文字です。\fB\fR\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.RS 25n
.rt  
各ページに通常出力される 5 行のヘッダーと 5 行のトレーラを出力しません。各ファイルの最終行を出力した後、そのページの最終行まで行送りをせず、出力を停止します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-w\fR \fIwidth\fR \fR
.ad
.RS 25n
.rt  
行の幅を \fIwidth\fR で示す数のカラム位置に設定します。この指定は複数カラム出力に対してのみ有効です。このオプションを省略したときのデフォルトの行幅は、\fB-s\fR オプションも省略されていれば \fB72\fR となり、\fB-\fR\fB-s\fR オプションが指定されていれば \fB512\fR となります。\fB-\fR
.sp
シングルカラム出力の場合には、入力行の内容が出力幅の制限によって切り捨てられることはありません。
.RE

.SS "/usr/bin/pr"
.sp
.LP
次のオプションは、\fB/usr/bin/pr\fR でのみ使用できます。
.sp
.ne 2
.mk
.na
\fB\fB-F\fR\fR
.ad
.RS 23n
.rt  
入力ファイルの行を折り返します。\fB-a\fR または \fB-m\fR オプション指定による複数カラムモード使用時は、現在のカラム幅に合うように行を折り返します。それ以外の場合は、現在の行幅 (80 カラム) に合うように行を折り返します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB\fR\fB-i\fR\fB [ \fR\fIchar\fR\fB ][ \fR\fIgap\fR\fB ]\fR \fR
.ad
.RS 23n
.rt  
出力上で 1 つ以上の連続したスペース文字が \fIgap+1\fR、\fI2*gap+1\fR、\fI3*gap+1\fR のカラム位置に到達した場合、それらのスペース文字をタブ文字で置き換えます。\fB\fR\fB\fR\fB\fR\fIgap\fR を省略するか、\fB0\fR を指定した場合、デフォルトとして 8 カラムごとにタブ位置が設定されていると見なされます。\fB\fR数字でない文字 \fIchar\fR を指定すると、それが出力タブ文字として使用されます。\fB\fR
.RE

.SS "/usr/xpg4/bin/pr"
.sp
.LP
次のオプションは、\fB/usr/xpg4/bin/pr\fR でのみ使用できます。
.sp
.ne 2
.mk
.na
\fB\fB-F\fR\fR
.ad
.RS 23n
.rt  
改ページの際に、デフォルトである一連の復帰改行文字の代わりに、用紙送り文字を使用します。\fB\fR\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB\fR\fB-i\fR\fB [ \fR\fIchar\fR\fB ][ \fR\fIgap\fR\fB ]\fR \fR
.ad
.RS 23n
.rt  
出力上で 2 つ以上の連続したスペース文字が \fIgap+1\fR、\fI2*gap+1\fR、\fI3*gap+1\fR のカラム位置に到達した場合、それらのスペース文字をタブ文字で置き換えます。\fB\fR\fB\fR\fB\fR\fIgap\fR を省略するか、\fB0\fR を指定した場合、デフォルトとして 8 カラムごとにタブ位置が設定されていると見なされます。\fB\fR数字でない文字 \fIchar\fR を指定すると、それが出力タブ文字として使用されます。\fB\fR
.RE

.SH オペランド
.sp
.LP
次のオペランドを指定できます。
.sp
.ne 2
.mk
.na
\fB\fIfile\fR\fR
.ad
.RS 8n
.rt  
内容を印刷するファイルのパス名。このオペランドを省略するか、\fB-\fR を指定すると、標準入力が用いられます。\fI\fR\fI\fR
.RE

.SH 使用例
.LP
\fB例 1 \fR現在のディレクトリ中の全ファイルの番号付き一覧を出力する
.sp
.in +2
.nf
example% \fBls -a | pr -n -h "Files in $(pwd)."\fR
.fi
.in -2
.sp

.LP
\fB例 2 \fRファイルをカラムに出力する
.sp
.LP
この例では、\fBfile1\fR および \fBfile2\fR を、\fBfile list\fR というヘッダーを付けた、3 カラムからなる 2 倍の改行幅のリストに出力します。

.sp
.in +2
.nf
example% \fBpr -3d -h "file list" file1 file2\fR
.fi
.in -2
.sp

.LP
\fB例 3 \fR拡張したカラムタブを使用してファイルを書き出す
.sp
.LP
次の例では、タブ位置をカラム \fB10\fR、\fB19\fR、\fB28\fR に設定して、\fBfile1\fR を \fBfile2\fR に書き出します。

.sp
.in +2
.nf
example% \fBpr -e9 -t <file1 >file2\fR
.fi
.in -2
.sp

.SH 環境
.sp
.LP
\fBpr\fR の実行に影響を与える次の環境変数についての詳細は、\fBenviron\fR(5) を参照してください。\fBLANG\fR、\fBLC_ALL \fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR、\fBLC_TIME\fR、\fBTZ\fR、および \fBNLSPATH\fR。
.SH 終了ステータス
.sp
.LP
次の終了ステータスが返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB>\fB0\fR\fR
.ad
.RS 6n
.rt  
エラーが発生した。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.SS "/usr/bin/pr"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
CSI有効
.TE

.SS "/usr/xpg4/bin/pr"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/xopen/xcu4
_
CSI有効
_
インタフェースの安定性確実
_
標準T{
\fBstandards\fR(5) を参照してください。
T}
.TE

.SH 関連項目
.sp
.LP
\fBexpand\fR(1), \fBattributes\fR(5), \fBenviron\fR(5), \fBstandards\fR(5)
