Alhadis/Silos/Solaris-11.3/ja_JP.UTF-8/man1/ps.1
'\" te
.\" Copyright 1989 AT&T
.\" Portions Copyright (c) 2009, 2014, Oracle and/or its affiliates.All rights reserved.
.\" Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation.In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html. This notice shall appear on any product containing this material.
.TH ps 1 "2014 年 1 月 29 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
ps \- プロセスのステータス報告
.SH 形式
.LP
.nf
\fBps\fR [\fB-aAcdefjHlLPyZ\fR] [\fB-g\fR \fIgrplist\fR] [\fB-h\fR \fIlgrplist\fR] 
     [\fB-n\fR \fInamelist\fR] [\fB-o\fR \fIformat\fR]... [\fB-p\fR \fIproclist\fR] 
     [\fB-s\fR \fIsidlist\fR] [\fB-t\fR \fIterm\fR] [\fB-u\fR \fIuidlist\fR] [\fB-U\fR \fIuidlist\fR] 
     [\fB-G\fR \fIgidlist\fR] [\fB-z\fR \fIzonelist\fR]
.fi

.SH 機能説明
.sp
.LP
\fBps\fR コマンドは、活動中のプロセスに関する情報を出力します。オプションを指定しないと、\fBps\fR は、「コマンドを実行したユーザー」と同じ実効ユーザー \fBID\fR および同じ制御端末に関連するプロセスについての情報を出力します。出力される情報は、プロセス \fBID\fR、端末識別子、累積実行時間およびコマンド名のみです。それ以外の場合、出力される情報はオプションによって制御されます。
.sp
.LP
オプションのなかには、リストを引数として使うものがあります。リストの項目は、コンマで区切られるか、あるいは引用符で囲まれてコンマかスペースで区切られます。\fIproclist\fR および \fIgrplist\fR には、数値を指定してください。
.sp
.LP
\fBps\fR コマンドは、ネイティブにコマンドを呼び出すか、\fBps\fR(1B) で必要なコマンド構文を使用して呼び出すかを決定しようとします。後者の場合、\fBps\fR コマンドは \fBps\fR(1B) で説明されているのとまったく同じように動作します。 
.SH オプション
.sp
.LP
サポートしているオプションは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
もっとも頻繁に要求されるすべてのプロセスに関する情報を表示します。ただし、プロセスのセッションリーダーおよび端末に関連していないプロセスは除きます。\fB\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB-A\fR\fR
.ad
.sp .6
.RS 4n
すべてのプロセスの情報を表示します。後述の \fB-e\fR と同じです。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.sp .6
.RS 4n
\fBpriocntl\fR(1) で説明するように、スケジューラ特性を反映する形式で情報を出力します。以下で説明するように、\fB-c\fR オプションは、\fB-f\fR オプションと \fB-l\fR オプションの出力に影響します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
セッションリーダーを除くすべてのプロセスに関する情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.sp .6
.RS 4n
現在実行中のすべてのプロセスに関する情報を表示します。\fB\fR
.sp
\fB-e\fR オプションを指定すると、\fB-z\fR、\fB-t\fR、\fB-u\fR、\fB-U\fR、\fB-g\fR、\fB-G\fR、\fB-p\fR、\fB-g\fR、\fB-s\fR、および \fB-a\fR オプションは効果がありません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
完全リストを作成します\fB\fR (完全リストにおけるカラムの意味については、以下を参照)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR \fIgrplist\fR\fR
.ad
.sp .6
.RS 4n
\fIgrplist\fR にグループリーダーの \fBID\fR 番号が指定されているプロセスの情報を表示します (グループリーダーとは、プロセス \fBID\fR 番号がプロセスグループ \fBID\fR 番号と同じプロセスのこと)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-G\fR \fIgidlist\fR\fR
.ad
.sp .6
.RS 4n
\fIgidlist\fR に実グループの ID 番号が指定されているプロセスの情報を出力します。\fIgidlist\fR は、複数の ID を空白またはコンマで区切って記述するリストで、単一の引数として指定する必要があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR \fIlgrplist\fR\fR
.ad
.sp .6
.RS 4n
指定された \fIlgrplist\fR が存在するプロセスだけを表示します。\fIlgrplist\fR で指定されている無効なグループについては、何も表示されません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR \fR
.ad
.sp .6
.RS 4n
追加の列ヘッダー (LGRP) にプロセスのホーム lgroup を出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-j\fR\fR
.ad
.sp .6
.RS 4n
セッション \fBID\fR およびプロセスグループ \fBID\fR を出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
長い形式のリストを作成します\fB\fR (下記を参照)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fR
.ad
.sp .6
.RS 4n
選択された各プロセス中の各軽量プロセス (\fIlwp\fR) についての情報を出力します (下記を参照)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR \fInamelist\fR\fR
.ad
.sp .6
.RS 4n
\fInamelist\fR で示すシステムファイルをデフォルトの代わりに使用します。このオプションは、互換のために受け入れられますが無視されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIformat\fR\fR
.ad
.sp .6
.RS 4n
\fIformat\fR が示す書式指定に従って出力情報を表示します。詳細は「表示書式」の節を参照してください。\fB\fR\fB-o\fR オプションは複数回指定することが可能です。その場合、複数の書式指定引数は、スペース文字で区切られて継続していると見なされます。\fI\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIproclist\fR\fR
.ad
.sp .6
.RS 4n
プロセス \fBID\fR 番号が \fIproclist\fR で指定されたプロセスの情報のみを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR\fR
.ad
.sp .6
.RS 4n
追加のカラムヘッダー \fBPSR\fR (もしある場合) をつけて、プロセスまたは lwp が接続されたプロセッサ数を出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIsidlist\fR\fR
.ad
.sp .6
.RS 4n
\fBID\fR が  \fIsidlist\fR にあるすべてのセッションリーダーの情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fIterm\fR\fR
.ad
.sp .6
.RS 4n
\fIterm\fR に関連するプロセスの情報のみを表示します。端末識別子は、デバイスのファイル名および識別子として指定されます。たとえば、\fBterm/a\fR や \fBpts/0\fR などです。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR \fIuidlist\fR\fR
.ad
.sp .6
.RS 4n
実効ユーザー \fBID\fR またはログイン名が \fIuidlist\fR で指定されたプロセスデータのみを表示します。リスト出力時に、ログイン名を表示する \fB-f\fR オプションをユーザーが指定しないかぎり、ユーザー \fBID\fR は数字で出力されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-U\fR \fIuidlist\fR\fR
.ad
.sp .6
.RS 4n
実グループ \fBID\fR またはログイン名が \fIuidlist\fR に存在するプロセスの情報を表示します。\fIuidlist\fR は、複数の ID を空白またはコンマで区切って記述するリストで、単一の引数として指定する必要があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-y\fR\fR
.ad
.sp .6
.RS 4n
長い形式のリストで (\fB-l\fR)、廃止された \fBF\fR と \fBADDR\fR カラムが省略され、プロセスの常駐の設定サイズを示す \fBRSS\fR カラムが含まれます。\fB-y\fR オプションを指定すると、\fBRSS\fR と \fBSZ\fR (後述参照) の両方が、ページの代わりに K バイト単位で報告されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzonelist\fR\fR
.ad
.sp .6
.RS 4n
指定されたゾーン内のプロセスだけを表示します。ゾーンは名前と ID のどちらでも指定できます。このオプションは、グローバルゾーンで実行する場合にのみ便利です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
プロセスに関連するゾーン名を、追加のカラムヘッダー \fBZONE\fR の下に表示します。\fBZONE\fR カラムの幅は 8 文字に制限されます。現在実行中のすべてのプロセスと関連ゾーン名に関する情報をすばやく確認するには、\fBps\fR \fB-eZ\fR を使用します。8 文字幅を超えるゾーン名を表示するには、 
.sp
.in +2
.nf
ps -eo zone,uid,pid,ppid,time,comm,...
.fi
.in -2
.sp

を使用します。
.RE

.sp
.LP
\fB/usr/ucb/ps\fR コマンドでは、次のオプションが使用されます (\fBps\fR(1B) を参照)。これらは \fB/usr/bin/ps\fR でサポートされており、後者が UCB の動作をエミュレートすることを可能にします。UCB オプションでは、ハイフンは使用しません。これらのオプションを、前述のオプションと混在させることはできません。
.sp
.ne 2
.mk
.na
\fB\fBr\fR\fR
.ad
.sp .6
.RS 4n
出力を実行中および実行可能なプロセスに制限します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBS\fR\fR
.ad
.sp .6
.RS 4n
このプロセスおよび取得されるすべての子プロセスで使用される \fBCPU\fR 時間の累計を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBv\fR\fR
.ad
.sp .6
.RS 4n
仮想メモリーを含む出力のバージョンを表示します。これには、次で説明する \fBSIZE\fR、\fB%CPU\fR、\fB%MEM\fR、および \fBRSS\fR フィールドが含まれます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBw\fR\fR
.ad
.sp .6
.RS 4n
80 カラムではなく 132 カラムのワイド出力形式を使用します。\fB-ww\fR とオプション文字が繰り返される場合、任意幅の出力が使用されます。この情報を使用して、長いコマンドをどれだけ出力するかが決定されます。\fB注:\fR ワイド出力オプションを表示できるのは、スーパーユーザーまたはこのプロセスを所有するユーザーだけです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBx\fR\fR
.ad
.sp .6
.RS 4n
制御端末のないプロセスが含まれます。
.RE

.sp
.ne 2
.mk
.na
\fB\fInum\fR\fR
.ad
.sp .6
.RS 4n
プロセス番号を指定できます (この場合、出力はそのプロセスに限定されます)。このオプションは、最後に指定する必要があります。
.RE

.sp
.LP
前述の多くのオプションは、対象とするプロセスをリストに選択するために使用します。これらのオプションが指定された場合、\fBps\fR はデフォルトリストを無視し、オプションの選択条件の論理和により示されるプロセスを選択します。
.SH 表示書式
.sp
.LP
\fB-f\fR オプションが指定された場合、\fBps\fR は、ユーザーブロックを検索することによって、プロセスが作成されたときに指定されたコンド名および引数を特定しようとします。これができない場 合には、\fB-f\fR オプションを指定しない場合のコマンド名が角括弧に囲まれて出力されます。
.sp
.LP
\fBps\fR の実行結果として表示されるリストのカラムの見出しおよびカラムの意味を説明します。文字 \fBf\fR および \fBl\fR は、それに相当する見出しを作成するオプション (それぞれ完全形式または長い形式) を示します。\fBall\fR は、見出しを常に出力することを意味します。\fB\fR\fB\fR\fB注:\fR これら 2 つのオプションは、プロセスのどの情報が表示されるかを決定するだけで、どのプロセスが表示されるかということは決定しません。
.sp
.ne 2
.mk
.na
\fB\fBF\fR (l)\fR
.ad
.sp .6
.RS 4n
プロセスに関連するフラグ (16 進数表現の論理和) 。これらのフラグは過去においては意味を持っていたが、現在では何の意味も持たない
.RE

.sp
.ne 2
.mk
.na
\fB\fBS\fR (l)\fR
.ad
.sp .6
.RS 4n
プロセスの状態
.sp
.ne 2
.mk
.na
\fBO\fR
.ad
.sp .6
.RS 4n
プロセスは、プロセッサ上で実行中
.RE

.sp
.ne 2
.mk
.na
\fBS\fR
.ad
.sp .6
.RS 4n
休止状態。 プロセスは、イベントが完了するのを待っている
.RE

.sp
.ne 2
.mk
.na
\fBR\fR
.ad
.sp .6
.RS 4n
実行可能状態。 プロセスは、実行待ち行列上にある
.RE

.sp
.ne 2
.mk
.na
\fBT\fR
.ad
.sp .6
.RS 4n
ジョブ制御シグナルにより、もしくはトレース状態にあるため、プロセスは停止されている
.RE

.sp
.ne 2
.mk
.na
\fBW\fR
.ad
.sp .6
.RS 4n
待機状態。プロセスは、CPU 使用率が CPU キャップの強制された制限値まで下がるのを待っている。
.RE

.sp
.ne 2
.mk
.na
\fBZ\fR
.ad
.sp .6
.RS 4n
ゾンビ状態。 プロセスは終了していて、親プロセスは待っていない
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBUID\fR (f,l)\fR
.ad
.sp .6
.RS 4n
プロセスの実効ユーザー \fBID\fR (\fB-f\fR オプションではログイン名が出力)
.RE

.sp
.ne 2
.mk
.na
\fB\fBPID\fR (all)\fR
.ad
.sp .6
.RS 4n
プロセスのプロセス \fBID\fR (このデータはプロセスを停止させるために必要)
.RE

.sp
.ne 2
.mk
.na
\fB\fBPPID\fR (f,l)\fR
.ad
.sp .6
.RS 4n
親プロセスのプロセス \fBID\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fBC\fR (f,l)\fR
.ad
.sp .6
.RS 4n
スケジューリングのためのプロセッサ利用率 (廃止) \fB-c\fR オプションを使用した場合は、出力されない
.RE

.sp
.ne 2
.mk
.na
\fB\fBCLS\fR (f,l)\fR
.ad
.sp .6
.RS 4n
スケジューリングクラス。\fB-c\fR オプションを使用した場合にのみ、出力される
.RE

.sp
.ne 2
.mk
.na
\fB\fBPRI\fR (l)\fR
.ad
.sp .6
.RS 4n
プロセスの優先度。\fB-c\fR オプションを指定しないと、数が大きいほど優先度が低くなる。\fB-c\fR オプションを指定すると、数が大きいほど優先度が高いことを意味する
.RE

.sp
.ne 2
.mk
.na
\fB\fBNI\fR (l)\fR
.ad
.sp .6
.RS 4n
優先度の計算に使用される nice 値。\fB-c\fR オプションを使用した場合は、出力されない特定のスケージューリングクラスのプロセスのみが、nice 値を持つ
.RE

.sp
.ne 2
.mk
.na
\fB\fBADDR\fR (l)\fR
.ad
.sp .6
.RS 4n
プロセスのメモリーアドレス。すべての特権で実行中以外は \fB0\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSZ\fR (l)\fR
.ad
.sp .6
.RS 4n
割り当てられたすべてのファイルとデバイスを含む、仮想メモリー内のプロセスの合計サイズ (ページ単位)。\fBpagesize\fR(1) を参照
.RE

.sp
.ne 2
.mk
.na
\fB\fBWCHAN\fR (l)\fR
.ad
.sp .6
.RS 4n
プロセスが休止状態のイベントのアドレス。すべての特権で実行される場合にのみ表示されます。それ以外の場合は \fB0\fR です。プロセスが休止中であるかどうかを確認するには、\fBS\fR 列をチェックします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTIME\fR (f)\fR
.ad
.sp .6
.RS 4n
時間、分、秒で示されるプロセスの開始時間 (\fBps\fR が実行される 24 時間以上前に開始したプロセスは、月および日で示される)
.RE

.sp
.ne 2
.mk
.na
\fB\fBTTY\fR (all)\fR
.ad
.sp .6
.RS 4n
プロセスを制御している端末 (制御端末がない場合は、メッセージ \fB?\fR が出力される)
.RE

.sp
.ne 2
.mk
.na
\fB\fBTIME\fR (all)\fR
.ad
.sp .6
.RS 4n
プロセスの累積実行時間。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLTIME\fR (all)\fR
.ad
.sp .6
.RS 4n
報告される lwp の実行時間。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCMD\fR (all)\fR
.ad
.sp .6
.RS 4n
コマンド名 (\fB-f\fR オプションでは、完全なコマンド名と引数を最大 80 文字まで出力)
.RE

.sp
.LP
\fB-j\fR オプションを指定すると、次の 2 つのカラムも出力されます。
.sp
.ne 2
.mk
.na
\fB\fBPGID\fR\fR
.ad
.sp .6
.RS 4n
プロセスグループリーダーのプロセス ID
.RE

.sp
.ne 2
.mk
.na
\fB\fBSID\fR\fR
.ad
.sp .6
.RS 4n
セッションリーダーのプロセス ID
.RE

.sp
.LP
\fB-L\fR オプションを指定すると、次の 2 つのカラムも出力されます。
.sp
.ne 2
.mk
.na
\fB\fBLWP\fR\fR
.ad
.sp .6
.RS 4n
情報が出力されている lwp の lwp ID
.RE

.sp
.ne 2
.mk
.na
\fB\fBNLWP\fR\fR
.ad
.sp .6
.RS 4n
プロセス中の lwp 数 (\fB-f\fR も指定した場合)
.RE

.sp
.LP
\fB-L\fR オプションを指定すると、プロセス中の各 lwp が 1 行に 1 つずつ出力され、プロセスではなく lwp に対する時間のフィールド \fBSTIME\fR と \fBLTIME\fR を示します。従来のシングルスレッドプロセスは 1 つの lwp だけを含みます。
.sp
.LP
すでに終了し、親プロセスを持ち、ただし、その親プロセスが待ち状態になっていないプロセスは、\fB<defunct>\fR と符号で示されます。
.SS "\fB-o\fR format"
.sp
.LP
\fB-o\fR オプションを使用すると、出力書式をユーザーが指定することができます。
.sp
.LP
出力書式は、空白またはコンマで区切った引数のリストで指定します。各変数にはデフォルトのヘッダーがあります。等号と新しいヘッダーのテキストを追加することによって、デフォルトのヘッダーを上書きできます。引数の残りの文字は、ヘッダーテキストとして使用されます。コマンド行で指定した順番でフィールドが書き込まれ、カラムとして出力されます。フィールド幅は、少なくともヘッダーを表示できる幅 (デフォルト値または指定値) がシステムによって選択されます。\fB-o\fR \fIuser=,\fR のようにヘッダーテキストが NULL である場合、フィールド幅は少なくともデフォルトのヘッダーテキストを表示できる幅になります。すべてのヘッダーテキストが NULL である場合、ヘッダー行が出力されません。
.sp
.LP
POSIX ロケールでは、次の名前が認識されます。
.sp
.ne 2
.mk
.na
\fB\fBuser\fR \fR
.ad
.sp .6
.RS 4n
プロセスの実効ユーザー \fBID\fR。テキストのユーザー \fBID\fR を取得でき、フィールド幅が足りる場合は、テキストのユーザー ID になります。そうでない場合は、10 進数の ID になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBruser\fR\fR
.ad
.sp .6
.RS 4n
プロセスの実ユーザー \fBID\fR。テキストのユーザー \fBID\fR を取得でき、フィールド幅が足りる場合は、テキストのユーザー ID になります。そうでない場合は、10 進数の ID になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBgroup\fR \fR
.ad
.sp .6
.RS 4n
プロセスの実効グループ \fBID\fR。テキストのグループ \fBID\fR を取得でき、フィールド幅が足りる場合は、テキストのグループ ID になります。そうでない場合は、10 進数の ID になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrgroup\fR\fR
.ad
.sp .6
.RS 4n
プロセスの実グループ \fBID\fR。テキストのグループ \fBID\fR を取得でき、フィールド幅が足りる場合は、テキストのグループ ID になります。そうでない場合は、10 進数の ID になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpid\fR \fR
.ad
.sp .6
.RS 4n
プロセス \fBID\fR の 10 進数値。
.RE

.sp
.ne 2
.mk
.na
\fB\fBppid\fR\fR
.ad
.sp .6
.RS 4n
親プロセス \fBID\fR の 10 進数値。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpgid\fR\fR
.ad
.sp .6
.RS 4n
プロセスグループ \fBID\fR の 10 進値。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpcpu\fR\fR
.ad
.sp .6
.RS 4n
最近のある期間において、使用できる CPU 時間に対して実際に使用された CPU 時間の割合 (単位: %)。ここでいう「最近」は、不特定の期間です。使用できる CPU 時間は不特定な方法で決まります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvsz\fR\fR
.ad
.sp .6
.RS 4n
仮想メモリー中のプロセスの合計サイズ (単位: キロバイト)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnice\fR\fR
.ad
.sp .6
.RS 4n
プロセスの、システムスケジューリング優先度を表す 10 進数値。\fBnice\fR(1) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBetime\fR\fR
.ad
.sp .6
.RS 4n
プロセスが開始してからの経過時間。POSIX ロケールでの形式:
.sp
\fB[[\fR\fIdd\fR-\fB]\fR\fIhh\fR:\fB]\fR\fImm\fR:\fIss\fR 
.sp
各情報の意味は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fIdd\fR\fR
.ad
.sp .6
.RS 4n
日 
.RE

.sp
.ne 2
.mk
.na
\fB\fIhh\fR\fR
.ad
.sp .6
.RS 4n
時間 
.RE

.sp
.ne 2
.mk
.na
\fB\fImm\fR\fR
.ad
.sp .6
.RS 4n
 分 
.RE

.sp
.ne 2
.mk
.na
\fB\fIss\fR\fR
.ad
.sp .6
.RS 4n
 秒
.RE

\fIdd\fR フィールドの値は 10 進の整数です。\fIhh\fR、\fImm\fR、\fIss\fR フィールドは、ゼロによって左揃えされた 2 桁の 10 進整数です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtime\fR\fR
.ad
.sp .6
.RS 4n
プロセスの累積 CPU 時間。POSIX ロケールでの形式:
.sp
\fB[\fR\fIdd\fR-\fB]\fR\fIhh\fR:\fImm\fR:\fIss\fR
.sp
\fIdd\fR、\fIhh\fR, \fImm\fR、\fIss\fR フィールドは、\fBetime\fR と同様です。etime の説明を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtty\fR\fR
.ad
.sp .6
.RS 4n
プロセスの制御端末の名前。書式は \fBwho\fR(1) コマンドによって使用されるものと同じです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcomm\fR\fR
.ad
.sp .6
.RS 4n
実行されているコマンドの、文字列としての名前 (\fBargv[0]\fR の値)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBargs\fR \fR
.ad
.sp .6
.RS 4n
文字列としての、コマンドとそのすべての引数。実装によってフィールド幅までに切り捨てられることがあります。これは実装に依存します。この文字列が、コマンドが起動されたときにコマンドに渡された引数であるか、またはアプリケーションによって変更された引数であるかは、不特定です。アプリケーションは、引数リストを変更できて、その変更を \fBps\fR の出力に反映することに依存しません。Solaris 実装では、この文字列は 80 文字以内に限定され、コマンドが起動されたときにコマンドに渡された引数となります。
.RE

.sp
.LP
Solaris 実装では、次の名前が認識されます。
.sp
.ne 2
.mk
.na
\fB\fBf\fR\fR
.ad
.sp .6
.RS 4n
プロセスに関連するフラグ (16 進数表現の論理和) 。
.RE

.sp
.ne 2
.mk
.na
\fB\fBs\fR\fR
.ad
.sp .6
.RS 4n
プロセスの状態。
.RE

.sp
.ne 2
.mk
.na
\fB\fBc\fR\fR
.ad
.sp .6
.RS 4n
スケジューリングのためのプロセッサ利用率 (廃止) 
.RE

.sp
.ne 2
.mk
.na
\fB\fBuid\fR\fR
.ad
.sp .6
.RS 4n
プロセスの実効ユーザー \fBID\fR (10 進整数)
.RE

.sp
.ne 2
.mk
.na
\fB\fBruid\fR\fR
.ad
.sp .6
.RS 4n
プロセスの実ユーザー \fBID\fR (10 進整数)
.RE

.sp
.ne 2
.mk
.na
\fB\fBgid\fR\fR
.ad
.sp .6
.RS 4n
プロセスの実効グループ \fBID\fR (10 進整数)
.RE

.sp
.ne 2
.mk
.na
\fB\fBrgid\fR\fR
.ad
.sp .6
.RS 4n
プロセスの実グループ \fBID\fR (10 進整数)
.RE

.sp
.ne 2
.mk
.na
\fB\fBprojid\fR\fR
.ad
.sp .6
.RS 4n
プロセスのプロジェクト \fBID\fR (10 進整数)
.RE

.sp
.ne 2
.mk
.na
\fB\fBproject\fR \fR
.ad
.sp .6
.RS 4n
プロセスのプロジェクト \fBID\fR (取得できる場合はテキスト。そうでない場合は 10 進整数)
.RE

.sp
.ne 2
.mk
.na
\fB\fBzoneid\fR\fR
.ad
.sp .6
.RS 4n
プロセスのゾーン \fBID\fR 番号 (10 進整数)
.RE

.sp
.ne 2
.mk
.na
\fB\fBzone\fR\fR
.ad
.sp .6
.RS 4n
プロセスのゾーン \fBID\fR (取得できる場合はテキスト。そうでない場合は 10 進整数)
.RE

.sp
.ne 2
.mk
.na
\fB\fBsid\fR\fR
.ad
.sp .6
.RS 4n
セッションリーダーのプロセス ID
.RE

.sp
.ne 2
.mk
.na
\fB\fBtaskid\fR \fR
.ad
.sp .6
.RS 4n
プロセスのタスク \fBID\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fBclass\fR\fR
.ad
.sp .6
.RS 4n
プロセスのスケジューリングクラス
.RE

.sp
.ne 2
.mk
.na
\fB\fBpri\fR\fR
.ad
.sp .6
.RS 4n
プロセスの優先度。 (数値が大きいほど優先度が高い)
.RE

.sp
.ne 2
.mk
.na
\fB\fBopri\fR\fR
.ad
.sp .6
.RS 4n
プロセスの廃止優先度 (数値が小きいほど優先度が高い)
.RE

.sp
.ne 2
.mk
.na
\fB\fBlwp\fR\fR
.ad
.sp .6
.RS 4n
lwp \fBID\fR (10 進数)。1 行に 1 つの進行中の軽量プロセスが示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnlwp\fR\fR
.ad
.sp .6
.RS 4n
軽量プロセスの数
.RE

.sp
.ne 2
.mk
.na
\fB\fBpsr\fR\fR
.ad
.sp .6
.RS 4n
プロセスまたは軽量プロセスがバインドされているプロセッサの数
.RE

.sp
.ne 2
.mk
.na
\fB\fBpset\fR\fR
.ad
.sp .6
.RS 4n
プロセスまたは軽量プロセスがバインドされているプロセッサセットの \fBID\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fBaddr\fR\fR
.ad
.sp .6
.RS 4n
プロセスのメモリーアドレス
.RE

.sp
.ne 2
.mk
.na
\fB\fBosz\fR\fR
.ad
.sp .6
.RS 4n
仮想メモリー中のプロセスの合計サイズ (単位: ページ)
.RE

.sp
.ne 2
.mk
.na
\fB\fBwchan\fR\fR
.ad
.sp .6
.RS 4n
プロセスが休止中のイベントのアドレス (- の場合、プロセスは動作中)
.RE

.sp
.ne 2
.mk
.na
\fB\fBstime\fR\fR
.ad
.sp .6
.RS 4n
プロセスの開始時間または開始日。空白なしで出力されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrss\fR\fR
.ad
.sp .6
.RS 4n
プロセスの常駐の設定サイズ (単位: キロバイト)。\fBps\fR が報告する \fBrss\fR 値は \fBproc\fR(4) が提供する概算です。したがって、実際の常駐の設定サイズを下回る可能性があります。容量を計画するときに、より正確な使用状況を知りたい場合は、\fBpmap\fR(1) \fB-x\fR を使用してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpmem\fR\fR
.ad
.sp .6
.RS 4n
マシン上の物理メモリーに対する、プロセスの常駐の設定サイズの割合 (単位: %)
.RE

.sp
.ne 2
.mk
.na
\fB\fBfname\fR\fR
.ad
.sp .6
.RS 4n
プロセスの実行可能ファイルのベース名の先頭 8 バイト
.RE

.sp
.ne 2
.mk
.na
\fB\fBctid\fR\fR
.ad
.sp .6
.RS 4n
プロセスがメンバーであるプロセス契約の契約 ID (10 進整数)
.RE

.sp
.ne 2
.mk
.na
\fB\fBlgrp\fR\fR
.ad
.sp .6
.RS 4n
プロセスのホーム lgroup。
.RE

.sp
.LP
\fBcomm\fR および \fBargs\fR だけに、空白文字を含めることができます。Solaris 実装の変数およびその他すべての名前には、空白文字を含めることができません。
.sp
.LP
POSIX ロケールで使用されるデフォルトヘッダーとそれに対応する書式指定子は、次のとおりです。
.sp

.sp
.TS
tab() box;
cw(1.38i) cw(1.38i) cw(1.38i) cw(1.38i) 
cw(1.38i) cw(1.38i) cw(1.38i) cw(1.38i) 
.
表記形式デフォルト表記形式デフォルト
指定子ヘッダー指定子ヘッダー
_
argsCOMMANDppidPPID
commCOMMANDrgroupRGROUP
etimeELAPSEDruserRUSER
groupGROUPtime時間
niceNIttyTT
pcpu%CPUuserUSER
pgidPGIDvszVSZ
pidPID
.TE

.sp
.LP
Solaris 実装における書式指定子と対応するデフォルトヘッダーは、次のとおりです。
.sp

.sp
.TS
tab() box;
cw(1.38i) cw(1.38i) cw(1.38i) cw(1.38i) 
cw(1.38i) cw(1.38i) cw(1.38i) cw(1.38i) 
.
表記形式デフォルト表記形式デフォルト
指定子ヘッダー指定子ヘッダー
_
addrADDRprojidPROJID
cCprojectPROJECT
classCLSpsrPSR
fFrgidRGID
fnameCOMMANDrssRSS
gidGIDruidRUID
lgrpLGRPsS
lwpLWPsidSID
nlwpNLWPstimeSTIME
opriPRItaskidTASKID
oszSZuidUID
pmem%MEMwchanWCHAN
priPRIzoneZONE
ctidCTIDzoneidZONEID
.TE

.SH 使用例
.LP
\fB例 1 \fR\fBps\fR コマンドの例
.sp
.LP
次のコマンド

.sp
.in +2
.nf
example% \fBps -o user,pid,ppid=MOM -o args\fR
.fi
.in -2
.sp

.sp
.LP
このコマンドによって、POSIX ロケールでは次の内容が出力されます。

.sp
.in +2
.nf
 USER  PID   MOM   COMMAND
helene  34    12   ps -o uid,pid,ppid=MOM -o args
.fi
.in -2
.sp

.sp
.LP
切り捨てが発生する可能性があるため、\fBCOMMAND\fR の内容は必ずしも前述の例と一致しません。

.SH 環境
.sp
.LP
\fBps\fR の実行に影響を与える次の環境変数についての詳細は、\fBenviron\fR(5) を参照してください。\fBLANG\fR、\fBLC_ALL\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR、\fBLC_TIME\fR、および \fBNLSPATH\fR。
.sp
.ne 2
.mk
.na
\fB\fBCOLUMNS\fR\fR
.ad
.sp .6
.RS 4n
画面の水平方向のサイズとして、システムが決定する値の代わりに使用する値を定義します。この値により、表示するテキストカラム数が決まります。
.RE

.SH 終了ステータス
.sp
.LP
次の終了ステータスが返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB>\fB0\fR\fR
.ad
.sp .6
.RS 4n
エラーが発生した。
.RE

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/dev/pts/*\fR\fR
.ad
.sp .6
.RS 4n

.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/term/*\fR\fR
.ad
.sp .6
.RS 4n
端末 (tty) 名を検索するファイル
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/passwd\fR\fR
.ad
.sp .6
.RS 4n
\fBUID\fR 情報を提供
.RE

.sp
.ne 2
.mk
.na
\fB\fB/proc/*\fR\fR
.ad
.sp .6
.RS 4n
プロセス制御ファイル
.RE

.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
CSI有効 (「使用法」参照)
_
インタフェースの安定性確実
_
標準T{
\fBstandards\fR(5) を参照してください。
T}
.TE

.SH 関連項目
.sp
.LP
\fBkill\fR(1), \fBlgrpinfo\fR(1), \fBnice\fR(1), \fBpagesize\fR(1), \fBpmap\fR(1), \fBpriocntl\fR(1), \fBwho\fR(1), \fBps\fR(1B), \fBgetty\fR(1M), \fBproc\fR(4), \fBttysrch\fR(4), \fBattributes\fR(5), \fBenviron\fR(5), \fBresource-controls \fR(5), \fBstandards\fR(5), \fBzones\fR(5)
.SH 注意事項
.sp
.LP
\fBps\fR の実行中に状況が変化することがあります。ps が提供する情報は、ある瞬間だけに当てはまるものであり、ユーザーがそれを参照するときには正確ではないことがあります。すでに存在しないプロセスについてのデータなど、該当しなくなった情報が ps の出力結果に含まれていることもあります。
.sp
.LP
プロセスを選択するオプションを 1 つも指定しない場合、\fBps\fR はその制御端末に関連するプロセスすべてについて報告します。制御端末がない場合には、ヘッダー以外には何も報告されません。
.sp
.LP
\fBps\fR \fB-ef\fR および \fBps\fR \fB-o\fR \fBstime\fR は、tty ログインセッションの実際の開始時間を報告せず、実際よりも少し早い時間、つまり \fBgetty\fR が最後に \fBtty\fR 行に再生成された時間を報告します。
.sp
.LP
以前のリリースでは、プロセスまたはイベント (あるいはその両方) のカーネルメモリーアドレスが待機中でも \fBADDR\fR および \fBWCHAN\fR フィールドに含まれることがありました。現在では、すべての特権で実行されるプロセスで要求されないかぎり、これらのフィールドは常に \fB0\fR になっています。\fBmdb\fR 内で \fB::ps and ::thread dcmds\fR を使用すると、値を取得できます。
.sp
.LP
\fBps\fR はログイン名 (ユーザー名) を除いて \fBCSI\fR 対応が可能です。
