Alhadis/Silos/Solaris-11.3/ja_JP.UTF-8/man1/uname.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2003, 2012, Oracle and/or its affiliates. All rights reserved.
.\" Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation. In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html. This notice shall appear on any product containing this material.
.TH uname 1 "2012 年 5 月 8 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
uname \- 現在のシステム名の表示
.SH 形式
.LP
.nf
\fBuname\fR [\fB-aimnprsvX\fR]
.fi

.LP
.nf
\fBuname\fR [\fB-S\fR \fIsystem_name\fR]
.fi

.SH 機能説明
.sp
.LP
\fBuname\fR ユーティリティーは、現在のシステムに関する情報を標準出力に出力します。オプションを指定した場合、1 つ以上のシステム特性を表すシンボルが 標準出力に書き込まれます。オプションを指定しない場合、\fBuname\fR は、現在のオペレーティングシステムのシステム名を出力します。オプションを指定すると、\fBuname\fR(2) と \fBsysinfo\fR(2) (またはいずれか一方) が返した選択情報を出力します。
.SH オプション
.sp
.LP
サポートしているオプションは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
システムから現在、入手できる基本情報を出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.sp .6
.RS 4n
プラットフォーム名を出力します。\fBsun4v\fR アーキテクチャーのマシンの場合、\fB-i\fR オプションで \fBsun4v\fR が返されます。\fBsun4v\fR マシンのプラットフォーム名を取得するには、\fBprtconf\fR(1M) を \fB-b\fR オプションを付けて実行します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.sp .6
.RS 4n
コンピュータのハードウェア名 (クラス) を出力します。このオプションを使用するのは望ましくありません。代わりに \fBuname\fR \fB-p\fR を指定してください。(「注意事項」のセクションを参照)
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
ノード名を出力します (ノード名とは、システムが通信ネットワークに認識されている名前です)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
現在のホストの \fBISA\fR またはプロセッサ型を出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
オペレーティングシステムのリリースレベルを出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.sp .6
.RS 4n
オペレーティングシステムのシステム名を出力します。これはデフォルトです。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR \fIsystem_name\fR\fR
.ad
.sp .6
.RS 4n
システム名の引数を指定することによって、ノード名を変更できます。システム名の引数は、\fBSYS_NMLN\fR の文字数に限られています。\fBSYS_NMLN\fR は、\fB<sys/utsname.h>\fR に定義された実装特有の値です。スーパーユーザーだけがこの機能を使用できます。このオプションを使用して変更した内容は、システムのリブート後には無効になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
オペレーティングシステムのバージョンを出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-X\fR \fR
.ad
.sp .6
.RS 4n
システムの拡張情報を出力します。SCO UNIX による情報と同じように、1 行に 1 つの情報が出力されます。表示される情報には次のものが含まれます。 
.RS +4
.TP
.ie t \(bu
.el o
システム名、ノード、リリース、バージョン、マシン、CPU 番号
.RE
.RS +4
.TP
.ie t \(bu
.el o
バス形式、シリアル、およびユーザー (Solaris では \fBunknown\fR に設定)
.RE
.RS +4
.TP
.ie t \(bu
.el o
OEM 番号 (\fB0\fR に設定) とオリジナルの番号 (\fB1\fR に設定)
.RE
.RE

.SH 使用例
.LP
\fB例 1 \fRオペレーティングシステム名とリリースレベルの表示
.sp
.LP
次のコマンドを実行すると、オペレーティングシステム名とリリースレベルが 1 文字のスペース文字で区切られて出力されます。

.sp
.in +2
.nf
example% \fBuname \(misr\fR
.fi
.in -2
.sp

.SH 環境
.sp
.LP
\fBuname\fR の実行に影響を与える次の環境変数についての詳細は、\fBenviron\fR(5) を参照してください。\fBLANG\fR、\fBLC_ALL\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR、および \fBNLSPATH\fR。
.SH 終了ステータス
.sp
.LP
次の終了ステータスが返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB>\fB0\fR\fR
.ad
.sp .6
.RS 4n
エラーが発生した。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
インタフェースの安定性確実
_
標準T{
\fBstandards\fR(5) を参照してください。
T}
.TE

.SH 関連項目
.sp
.LP
\fBarch\fR(1), \fBisalist\fR(1), \fBprtconf\fR(1M), \fBsysinfo\fR(2), \fBuname\fR(2), \fBnodename\fR(4), \fBattributes\fR(5), \fBenviron\fR(5), \fBstandards\fR(5)
.SH 注意事項
.sp
.LP
独立ソフトウェアベンダー (\fBISV\fR) やその他のベンダーで、それぞれの提供するソフトウェアがインストールされているまたは実行されているプラットフォームの詳しい特性を知りたい場合は、\fBuname\fR コマンドを使用してください。
.sp
.LP
オペレーティングシステム名とオペレーティングシステムのリリースレベルを表示するには、\fBuname \fR\fB-sr\fR を使用してください。オペレーティングシステムのリリースレベルだけを表示するには、\fBuname \fR\fB-r\fR を使用してください。オペレーティングシステムのリリースレベルは \fIx.y\fR 形式 (たとえば 5.3、5.4、5.5 など) に限らず、\fIx.y.z\fR 形式 (たとえば 5.3.1、5.3.2、5.4.1 など) でも表示される場合があります。
.sp
.LP
SunOS 4.\fIx\fR リリースにおいて、\fBuname\fR コマンドと同様の情報を得るために \fBarch\fR(1) コマンドがよく使用されていました。この \fBarch\fR(1) コマンドの \fBsun4\fR という出力が SunOS SPARC システムを示すものとして誤って解釈されることがありました。ハードウェアプラットフォームの情報を得るには、\fBuname \fR\fB-sp\fR を使用してください。
.sp
.LP
\fBarch\fR \fB-k\fR コマンドと \fBuname\fR \fB-m\fR コマンドは 同じ値を返します。ただし、一般的に \fBarch\fR コマンドの使用が望ましくないのと同様に、この 2 つのコマンドをサードパーティのプログラム上で使用することは望ましくありません。マシンの Instruction Set Architecture (\fBISA\fR またはプロセッサ型) を確認するには、\fBuname\fR \fB-p\fR を使用してください。
