Alhadis/Silos/Solaris-11.3/ja_JP.UTF-8/man1/who.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2000, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation. In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html. This notice shall appear on any product containing this material.
.TH who 1 "2011 年 3 月 29 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
who \- システムにログインしているユーザーの表示
.SH 形式
.LP
.nf
\fB/usr/bin/who\fR [\fB-abdHlmpqrstTu\fR] [\fIfile\fR]
.fi

.LP
.nf
\fB/usr/bin/who\fR \fB-q\fR [\fB-n\fR \fIx\fR] [\fIfile\fR]
.fi

.LP
.nf
\fB/usr/bin/who\fR am i
.fi

.LP
.nf
\fB/usr/bin/who\fR am I
.fi

.LP
.nf
\fB/usr/xpg4/bin/who\fR [\fB-abdHlmpqrtTu\fR] [\fIfile\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/who\fR \fB-q\fR [\fB-n\fR \fIx\fR] [\fIfile\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/who\fR \fB-s\fR [\fB-bdHlmpqrtu\fR] [\fIfile\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/who\fR am i
.fi

.LP
.nf
\fB/usr/xpg4/bin/who\fR am I
.fi

.SH 機能説明
.sp
.LP
\fBwho\fR ユーティリティーは、現在の UNIX システムを使用しているそれぞれのユーザーについて、ユーザー名、端末回線名、ログイン時間、回線を稼働し始めてからの経過時間、コマンドインタプリタ (シェル) のプロセス ID を表示することができます。who は、\fB/var/adm/utmpx\fR ファイルを検索して、その情報を入手します。\fIfile\fR を指定した場合、そのファイルを検索します (ファイルは、\fButmpx\fR(4) フォーマットでなければなりません)。通常、\fIfile\fR は \fB/var/adm/wtmpx\fR で、これはファイルが最後に作成されてからの すべてのログイン記録を格納しています。
.sp
.LP
出力のための一般形式は次のようになります。
.sp
.in +2
.nf
\fIname\fR [\fIstate\fR] \fIline time\fR [\fIidle\fR] [\fIpid\fR] [\fIcomment\fR] [\fIexit\fR]
.fi
.in -2
.sp

.sp
.LP
各表記の意味は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fIname\fR\fR
.ad
.RS 11n
.rt  
ユーザーのログイン名
.RE

.sp
.ne 2
.mk
.na
\fB\fIstate\fR\fR
.ad
.RS 11n
.rt  
端末への書き込み権
.RE

.sp
.ne 2
.mk
.na
\fB\fIline\fR \fR
.ad
.RS 11n
.rt  
\fB/dev\fR に存在する回線名
.RE

.sp
.ne 2
.mk
.na
\fB\fItime\fR\fR
.ad
.RS 11n
.rt  
ユーザーがログインしてからの時間
.RE

.sp
.ne 2
.mk
.na
\fB\fIidle\fR \fR
.ad
.RS 11n
.rt  
ユーザーが最後に実行してからの経過時間
.RE

.sp
.ne 2
.mk
.na
\fB\fIpid\fR \fR
.ad
.RS 11n
.rt  
ユーザーのプロセス ID
.RE

.sp
.ne 2
.mk
.na
\fB\fIcomment\fR\fR
.ad
.RS 11n
.rt  
\fBinittab\fR(4) の注釈欄
.RE

.sp
.ne 2
.mk
.na
\fB\fIexit\fR\fR
.ad
.RS 11n
.rt  
活動していないプロセスの終了ステータス
.RE

.SH オプション
.sp
.LP
サポートしているオプションは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 9n
.rt  
\fB/var/adm/utmpx\fR または指定された \fIfile\fR を、\fB-b\fR、\fB-d\fR、\fB-l\fR、\fB-p\fR、\fB-r\fR、\fB-t\fR、\fB-T\fR、\fB-u\fR オプションをつけた場合と同様に処理します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-b\fR\fR
.ad
.RS 9n
.rt  
直前のリブートの時間と日付を示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 9n
.rt  
時間切れになっていて、 \fBinit\fR によって再生成されていないすべてのプロセスを表示します。\fBexit\fR フィールドは、活動していないプロセスについて出力され、最終プロセスの最終値および終了値 (\fBwait\fR(3C) が戻す値) を表示します。これは、プロセス終了の原因を究明するのに役立ちます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR \fR
.ad
.RS 9n
.rt  
標準出力の上のカラムヘッダーを出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 9n
.rt  
誰かがログインするのをシステムが待っている 回線のみを表示します。そのような場合、 \fIname\fR フィールドは、\fBLOGIN\fR です。\fIstate\fR フィールドが存在しないということを除けば、 その他のフィールドは、ユーザーエントリと同じです。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.RS 9n
.rt  
使用している端末についての情報だけを出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR \fIx\fR \fR
.ad
.RS 9n
.rt  
ユーザーの数を行ごとにディスプレイへ指定する数値引数、 \fIx\fR が付きます。\fIx\fR は、\fB1\fR 以上でなければなりません。\fB-n\fR オプションは、\fB-q\fR と共に使用してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.RS 9n
.rt  
現在アクティブで、 \fBinit\fR によって以前に生成された他のプロセスを表示します。\fIname\fR フィールドは、 \fB/usr/sbin/inittab\fR 内の \fBinit\fR によって実行されたプログラム名です。 \fIstate\fR 、\fIline\fR、および \fIidle\fR フィールドは、意味がありません。\fIcomment\fR フィールドは、このプロセスを生成した \fB/usr/sbin/inittab\fR からの回線の \fBid\fR フィールドを示します。\fBinittab\fR(4) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR\fR
.ad
.RS 9n
.rt  
(\fBwho\fR の簡略版) 現在ログオンしているユーザーの名前とユーザー番号しか表示しません。このオプションを使用するときには、その他のオプションはすべて無視されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.RS 9n
.rt  
このオプションは、 \fBinit\fR プロセスの現在の実行レベル (\fIrun-level\fR) を示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 9n
.rt  
(デフォルト) \fIname\fR、\fIline\fR、および \fItime\fR のフィールドのみを表示します。
.RE

.SS "/usr/bin/who"
.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fR
.ad
.RS 7n
.rt  
\fB-s\fR オプションと同じです。ただし \fIT\fR では、\fIstate\fR、\fIidle\fR 、\fIpid\fR、および comment フィールドが表示されます。\fIstate\fR は次に示す文字のどれか 1 つです。
.sp
.ne 2
.mk
.na
\fB\fB+\fR\fR
.ad
.RS 5n
.rt  
端末に他のユーザーの書き込みが可能である
.RE

.sp
.ne 2
.mk
.na
\fB\fB-\fR\fR
.ad
.RS 5n
.rt  
端末に他のユーザーの書き込みが可能でない
.RE

.sp
.ne 2
.mk
.na
\fB\fB?\fR\fR
.ad
.RS 5n
.rt  
端末の書き込みアクセス状態が判定できない
.RE

.RE

.SS "/usr/xpg4/bin/who"
.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fR
.ad
.RS 7n
.rt  
\fB-s\fR オプションと同じです。ただし \fIT\fR では、 state フィールドが表示されます。\fIstate\fR はこのオプションの \fB/usr/bin/who\fR バージョンに表示されている文字のどれか 1 つです。\fB-u\fR オプションが \fB-T\fR と一緒に使用されている場合、 アイドル時間は前のフォーマットの 最後に追加されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.RS 7n
.rt  
\fBroot\fR による システムクロックの最後の変更 (\fBdate\fR ユーティリティーを使用) を示します。\fBsu\fR(1M) および \fBdate\fR(1) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.RS 7n
.rt  
現在ログイン中のユーザーのみを表示します。\fIname\fR は、ユーザーのログイン名です。\fIline\fR は回線名です。 \fB/dev\fR ディレクトリにあります。\fItime\fR は、ユーザーがログインした時間です。\fIidle\fR カラムは、ある特定の回線を最後に稼働し始めてからの 経過時間を意味します。ドット (\fB\&.\fR) は、端末がごく最近起動したことを認識しており、それが現在の入力であることを示します。24 時間以上が経過したり、ブート時間から回線が使用されていない場合は、エントリに \fBold\fR とマークされます。人が端末で操作しているかどうかを判別しようとするとき、 このフィールドが役に立ちます。\fIpid\fR は、ユーザーのシェルのプロセス ID です。\fIcomment\fR は、この回線に関連する注釈欄です。 \fB/usr/sbin/inittab\fR ( \fBinittab\fR(4) を参照) にあります。注釈欄には、どこに端末があるか、データセットの電話番号、 直結の場合は端末の型などについての情報を盛り込むことができます。
.RE

.SH オペランド
.sp
.LP
次のオペランドがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fBam\fR \fBi\fR \fR
.ad
.br
.na
\fB\fBam\fR \fBI\fR \fR
.ad
.RS 9n
.rt  
C ロケールでは、起動したユーザーの出力に限られます。これは \fB-m\fR オプションと同じです。\fBam\fR と、\fBi\fR または \fBI\fR 引数は空白で区切らなければなりません。
.RE

.sp
.ne 2
.mk
.na
\fB\fIfile\fR\fR
.ad
.RS 9n
.rt  
\fBwho\fR がデフォルトで使用する、ログインしたユーザーのデータベースの代わりに使用するファイルのパス名を指定します。
.RE

.SH 環境
.sp
.LP
\fBwho\fR の実行に影響を与える次の環境変数についての詳細は、\fBenviron\fR(5) を参照してください。\fBLANG\fR、\fBLC_ALL\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR、\fBLC_TIME\fR、および \fBNLSPATH\fR。
.SH 終了ステータス
.sp
.LP
次の終了ステータスが返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB>\fB0\fR\fR
.ad
.RS 6n
.rt  
エラーが発生した。
.RE

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/usr/sbin/inittab\fR\fR
.ad
.RS 21n
.rt  
\fBinit\fR のスクリプト
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/adm/utmpx\fR \fR
.ad
.RS 21n
.rt  
現在のユーザーとアカウンティングの情報
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/adm/wtmp\fR \fR
.ad
.RS 21n
.rt  
記録されているユーザーとアカウンティングの情報
.RE

.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.SS "/usr/bin/who"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
.TE

.SS "/usr/xpg4/bin/who"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/xopen/xcu4
_
インタフェースの安定性確実
_
標準T{
\fBstandards\fR(5) を参照してください。
T}
.TE

.SH 関連項目
.sp
.LP
\fBdate\fR(1), \fBlogin\fR(1), \fBmesg\fR(1), \fBinit\fR(1M), \fBsu\fR(1M), \fBwait\fR(3C), \fBinittab\fR(4), \fButmpx\fR(4), \fBattributes\fR(5), \fBenviron\fR(5), \fBstandards\fR(5)
.SH 注意事項
.sp
.LP
\fBスーパーユーザーへの注意: \fR シャットダウン後のシングルユーザー状態において、 \fBwho\fR は、プロンプトを返します。理由は、\fB/var/adm/utmpx\fR がログイン時に更新され、シングルユーザー状態のログインがないと、\fBwho\fR がこの状態を正確に報告できないからです。しかし、\fBwho\fR \fBam i\fR は、正しい情報を返します。
