Alhadis/Silos/Solaris 11.3/man1/foomatic-configure.1
'\" te
.\" This -*- nroff -*- source file is part of foomatic.
.\"
.TH FOOMATIC-CONFIGURE 1 "2002-01-06" "Foomatic Project"
.SH NAME
foomatic-configure \- the main configuration program of the foomatic
printing system.
.SH SYNOPSIS
.B foomatic-configure
[\fIOPTION\fR]...

.BI foomatic-configure\ \-n \ queuename \ [\ \-N \ description \ ] \ [\ \-L \ location \ ] \ [\ \-c \ connect \ ] \ [\ \-d \ driver \ ] \ [\ \-p \ printer \ ] \ [\ \--ppd \ ppdfile \ ] \ [\ \-s \ spooler \ ] \ \fB[\ \fB\-C \ \fB[\ \fIsourcespooler\fB\ \fB]\ \fIsourcequeue\fB \ \fB] \ \fB[\ \fB\-o \ \fIoption1\fB=\fIvalue1\fB \ \fB\-o \ \fIoption2\fB \ \fB...\ \fB]\ \fB[\ \fB\-q\ \fB]\

.BI foomatic-configure\ \-D\ \-n \ queuename \ [\ \-s \ spooler \ ]\ [\ \-q\ ]

.BI foomatic-configure\ \-R\ \-n \ queuename \ [\ \-s \ spooler \ ]\ [\ \-q\ ]

.BI foomatic-configure\ \-Q\ \ [\ \-s \ spooler \ ]\ [\ \-n \ queuename \ ]\ [\ \-r\ ]

.BI foomatic-configure\ \-P\ \ [\ \-s \ spooler \ ]\ [\ \-n \ queuename \ ] \ \fB[\ \fB\-d \ \fIdriver \ \fB] \ \fB[\ \fB\-p \ \fIprinter \ \fB] \ \fB[\ \fB\--ppd \ \fIppdfile \ \fB] \ \fB[\ \fIindex \ \fB]

.BI foomatic-configure\ \-X\ \-p \ printer \ |\ \-d \ driver \ |
.BI \-p \ printer \ \-d \ driver

.BI foomatic-configure\ \-O

.BI foomatic-configure\ \-h

.BI foomatic-configure\ \--help

.SH DESCRIPTION
.B foomatic-configure 
is a program to set up and configure print queues for every known
spooler (CUPS, LPRng, LPD, GNUlpr, PPR, PDQ. CPS, no spooler) and
every valid printer/driver combo in the Foomatic database or every PPD
file coming with PostScript printers. As RIP filter (Raster Image
Processor, translation from PostScript to the native language of the
printer) always \fBfoomatic-rip(1)\fR will be used, except for PPD
files of PostScript printers under CUPS or PPR, they will be used
without RIP filter.

It also comprises half of a programatic API for user tools: you can
learn and control everything about the static properties of print
queues here. With the sister program \fBfoomatic-printjob(1)\fR, you
can do everything related to the print queue's dynamic state: submit
jobs, and query, cancel, reorder, and redirect them.

.SS Options
.TP 10
.BI \-n \ queuename
Configure this print queue
.TP 10
.BI \-N \ Name/Description
Use this proper human-readable name/description
.TP 10
.BI \-L \ Location
Short phrase describing this printer's location
.TP 10
.BI \-c \ connection
Printer is connected thusly (ex file:/dev/lp0)
.TP 10
.BI \-d \ driver
Foomatic database name for desired printer driver
.TP 10
.BI \-p \ printer
Foomatic id for printer
.TP 10
.BI \--ppd \ ppdfile
PPD file, for example the one supplied by the manufacturer of a PostScript printer
.TP 10
.BI \-s \ spooler
Explicit spooler type (cups, lpd, lprng, pdq, ppr, direct)
.TP 10
.BI \-o \ option=value
Set the default of option to value
.TP 10
.BI \-o \ option
Turn on option by default
.TP 10
.BI \-D
Set this queue as the default queue (just give \fB\-n\fP \fIqueuename\fP)
.TP 10
.BI \-R
Remove this whole queue entirely (just give \fB\-n\fP \fIqueuename\fP)
.TP 10
.BI \-C \ [ \ sourcespooler \ ] \ sourcequeue
Copy sourcequeue from sourcespooler (or the current one if sourcespooler is not given) into the queue given by \fB\-n\fP \fIqueuename\fP (of the current spooler).
.TP 10
.BI \-Q
Query existing configuration (gives XML summary)
.TP 10
.BI \-r
List also remotely defined queues (CUPS only)
.TP 10
.BI \-P \ [ \ index \ ]
Get Perl dump of current configuration (as a Perl array named QUEUES, the first index is index, or zero if index is not given)
.TP 10
.BI \-O
Print XML Overview of all known printer/drivers (this shows also the Foomatic IDs of the printers)
.TP 10
.BI \-X
Print XML data for \fB\-p\fP \fIprinter\fP and/or \fB\-d\fP \fIdriver\fP object
.TP 10
.BI \-q
Run quietly


.SS Commands
No commands, just options

.\".SH FILES
.\".TP 25
.\"/etc/foomatic/lpd/<queue>
.\".TP 25
.\"/etc/foomatic/<queue>.xml
.\".TP 25
.\"/etc/printcap
.\"The systems list of configured printers.
.\".PD 0


.\" Oracle has added the ARC stability level to this manual page
.SH ATTRIBUTES
See
.BR attributes (5)
for descriptions of the following attributes:
.sp
.TS
box;
cbp-1 | cbp-1
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE 
=
Availability	print/cups/filter/foomatic-db-engine
=
Stability	Volatile
.TE 
.PP
.SH SEE ALSO
.IR foomatic-printjob (1), \ foomatic-rip (1)

.SH EXIT STATUS
.B foomatic-configure
returns 0 if no errors occurred.

.SH AUTHOR
Manfred Wassmann <\fImanolo@NCC-1701.B.Shuttle.de\fR> for the foomatic
project using comments from the source.

.SH BUGS
\fBfoomatic-configure\fR currently cannot handle printcap files in the
\fBlprng\fR style.  As \fBlprng\fR can use BSD style printcaps this is
not much of a problem, as long as the GUI based print manager
\fBlprngtool\fR is not used.
The difference between those formats is, that BSD style requires
continuation lines in printer definitions to be ended with a colon and
the newline character to be escaped with a backslash.  \fBLprng\fR has
no such restriction.

To use a printcap file generated or edited with \fBlprngtool\fR with
\fBfoomatic-configure\fR it is necessary to add \fB:\\\fR to the end
of all but the last line of every printer definition, just as shown
below:
.nf
.sp
.ft CW
#comment
# primary printer name
lp
#alternate names
 |lp2|lp3
 |Example of a printer
 :sd=/usr/spool/LPD/lp
 :rw:lp=/dev/lp:mx#100
 :
.sp
.fi
.LP
must be converted to:
.nf
.sp
.ft CW
#comment
# primary printer name
lp\\
 |lp2|lp3\\
 |Example of a printer\\
 :sd=/usr/spool/LPD/lp:\\
 :rw:lp=/dev/lp:mx#100:
.sp
.fi
.LP
This manpage may be out of date.


.SH NOTES

.\" Oracle has added source availability information to this manual page
This software was built from source available at https://java.net/projects/solaris-userland.  The original community source was downloaded from  /foomatic-db-engine-3.0-20080903.tar.gz

Further information about this software can be found on the open source community website at http://www.linuxfoundation.org/collaborate/workgroups/openprinting/database/foomatic/.
