Alhadis/Silos/Solaris-11.3/ja_JP.UTF-8/man1m/dladm.1m
'\" te
.\" Copyright (c) 2012, 2015, Oracle and/or its affiliates.All rights reserved.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation. In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html. This notice shall appear on any product containing this material.
.TH dladm 1M "2015 年 4 月 6 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
dladm \- データリンクの管理
.SH 形式
.LP
.nf
\fBdladm\fR
.fi

.LP
.nf
\fBdladm show-link\fR [\fB-PZ\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]
\fBdladm rename-link\fR [\fB-R\fR \fIroot-dir\fR] \fIlink\fR \fInew-link\fR
.fi

.LP
.nf
\fBdladm delete-phys\fR \fIphys-link\fR
\fBdladm show-phys\fR [\fB-PZ\fR] [\fB-Lm\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-H\fR]
     [\fB-z\fR \fIzone\fR[,...]] [\fB-D\fR [\fIdcb-feature\fR]] [\fB-lr\fR]] [\fIphys-link\fR]
.fi

.LP
.nf
\fBdladm create-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-m\fR \fImode\fR] [\fB-P\fR \fIpolicy\fR] [\fB-L\fR \fIlacpmode\fR] 
     [\fB-T\fR \fItime\fR] [\fB-u\fR \fIaddress\fR] \fB-l\fR \fIether-link1\fR [\fB-l\fR \fIether-link2\fR...] \fIaggr-link\fR
\fBdladm modify-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-m\fR \fImode\fR] [\fB-P\fR \fIpolicy\fR] [\fB-L\fR \fIlacpmode\fR] 
     [\fB-T\fR \fItime\fR] [\fB-u\fR \fIaddress\fR] \fIaggr-link\fR
\fBdladm delete-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIaggr-link\fR
\fBdladm add-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fIether-link1\fR [\fB-l\fR \fIether-link2\fR...] 
     \fIaggr-link\fR
\fBdladm remove-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fIether-link1\fR [\fB-l\fR \fIether-link2\fR...]
     \fIaggr-link\fR
\fBdladm show-aggr\fR [\fB-PLxZS\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIaggr-link\fR]
.fi

.LP
.nf
\fBdladm create-bridge\fR [\fB-P\fR \fIprotect\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-p\fR \fIpriority\fR]
     [\fB-m\fR \fImax-age\fR] [\fB-h\fR \fIhello-time\fR] [\fB-d\fR \fIforward-delay\fR] [\fB-f\fR \fIforce-protocol\fR]
     [\fB-l\fR \fIlink\fR...] \fIbridge-name\fR
\fBdladm modify-bridge\fR [\fB-P\fR \fIprotect\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-p\fR \fIpriority\fR]
     [\fB-m\fR \fImax-age\fR] [\fB-h\fR \fIhello-time\fR] [\fB-d\fR \fIforward-delay\fR] [\fB-f\fR \fIforce-protocol\fR]
     \fIbridge-name\fR
\fBdladm delete-bridge\fR [\fB-R\fR \fIroot-dir\fR] \fIbridge-name\fR
\fBdladm add-bridge\fR [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fIlink\fR [\fB-l\fR \fIlink\fR...]\fIbridge-name\fR
\fBdladm remove-bridge\fR [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fIlink\fR [\fB-l\fR \fIlink\fR...] \fIbridge-name\fR
\fBdladm show-bridge\fR [\fB-flt\fR] [\fB-s\fR [\fB-i\fR \fIinterval\fR]] [[\fB-p\fR] \fB-o\fR \fIfield\fR,...]
     [\fIbridge-name\fR]
.fi

.LP
.nf
dladm create-vlan [-ft] [-R \fIroot-dir\fR] -l \fIether-link\fR -v
          vid[,\fIpvlan-svid\fR[,\fIpvlan-type\fR]] [\fIvlan-link\fR]
dladm modify-vlan [-t] [-R \fIroot-dir\fR] [-l \fIether-link\fR] [-v
          vid[,\fIpvlan-svid\fR[,\fIpvlan-type\fR]] [-f]]
 	  {\fIvlan-link\fR,[\fIvlan-link\fR,...] | -L \fIether-link\fR}
\fBdladm delete-vlan\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIvlan-link\fR
\fBdladm show-vlan\fR [\fB-PZ\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIvlan-link\fR]
.fi

.LP
.nf
\fBdladm scan-wifi\fR [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fIwifi-link\fR]
\fBdladm connect-wifi\fR [\fB-e\fR \fIessid\fR] [\fB-i\fR \fIbssid\fR] [\fB-k\fR \fIkey\fR,...]
     [\fB-s\fR none | wep | wpa ] [\fB-a\fR open | shared] [\fB-b\fR bss | ibss] [\fB-c\fR]
     [\fB-m\fR a | b | g | n ] [\fB-T\fR \fItime\fR] [\fIwifi-link\fR]
\fBdladm disconnect-wifi\fR [\fB-a\fR] [\fIwifi-link\fR]
\fBdladm show-wifi\fR [\fB-Z\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIwifi-link\fR]
.fi

.LP
.nf
\fBdladm show-ether\fR [\fB-xZ\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]]
     [\fB-P\fR \fIprotocol\fR] [\fIether-link\fR]
.fi

.LP
.nf
\fBdladm set-linkprop\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-p\fR \fIprop\fR=\fIvalue\fR[,...] \fIlink\fR
\fBdladm reset-linkprop\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-p\fR \fIprop\fR[,...]] \fIlink\fR
\fBdladm show-linkprop\fR [\fB-HPZ\fR] [[\fB-c\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-p\fR \fIprop\fR[,...]]
     [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]
.fi

.LP
.nf
\fBdladm create-secobj\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-f\fR \fIfile\fR] \fB-c\fR \fIclass\fR \fIsecobj\fR
\fBdladm delete-secobj\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIsecobj\fR[,...]
\fBdladm show-secobj\fR [\fB-P\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fIsecobj\fR,...]
.fi

.LP
.nf
dladm create-vnic [-t] [-f] -l \fIlink\fR [-R \fIroot-dir\fR] [-m value | auto |
          {factory [-n \fIslot-identifier\fR]} | {vrrp -A {inet | inet6} -V \fIvrid\fR}
          | {random [-r \fIprefix\fR]}] [-v \fIvlan-id\fR] 
          [-P \fIpkey\fR] [-p prop=value[,...]] \fIvnic-link\fR
\fBdladm create-vnic\fR \fB-t -c\fR <\fIevsname\fR>[/<\fIvportname\fR>] [\fB-T\fR <\fItenant\fR>] <\fIvnic-link\fR>
\fBdladm modify-vnic\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-l\fR \fIlink\fR]  [\fB-m\fR \fIvalue\fR | auto | 
     {factory [\fB-n\fR \fIslot-identifier\fR]} | {vrrp \fB-A\fR {inet | inet6} \fB-V\fR \fIvrid\fR}
     | {random [\fB-r\fR \fIprefix\fR]}] [\fB-v\fR \fIvlan-id\fR[,\fIpvlan-svid\fR[,\fIpvlan-type\fR]]]
     {\fIvnic-link\fR,[\fIvnic-link\fR,...] | \fB-L\fR \fIlink\fR}
\fBdladm delete-vnic\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIvnic-link\fR
\fBdladm show-vnic\fR [-P | {-z zone[,..]}] [[-p] -o \fIfield\fR[,..]] [-l \fIlink\fR] 
[\fIvnic-link\fR]
\fBdladm show-vnic\fR [-Zmv] [-l \fIlink\fR] [\fIvnic-link\fR]
.fi

.LP
.nf
\fBdladm create-etherstub\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIetherstub\fR
\fBdladm delete-etherstub\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIetherstub\fR
\fBdladm show-etherstub\fR [\fB-Z\fR] [\fB-z\fR \fIzone\fR[,...]] [\fIetherstub\fR]
.fi

.LP
.nf
\fBdladm create-iptun\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-T\fR \fItype\fR [\fB-a\fR {local|remote}=\fIaddr\fR,...]
     \fIiptun-link\fR
\fBdladm modify-iptun\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-a\fR {local|remote}=\fIaddr\fR,...
     \fIiptun-link\fR
\fBdladm delete-iptun\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIiptun-link\fR
\fBdladm show-iptun\fR [\fB-PZ\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIiptun-link\fR]
.fi

.LP
.nf
\fBdladm create-part\fR [\fB-t\fR] [\fB-f\fR] \fB-l\fR \fIib-link\fR [\fB-R\fR \fIroot-dir\fR] \fB-P\fR \fIpkey\fR
     [\fB-p\fR prop=\fIvalue\fR[,...]] \fIpart-link\fR
\fBdladm delete-part\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIpart-link\fR
\fBdladm show-part\fR [\fB-pP\fR] [\fB-o\fR \fIfield\fR[,...]] [\fB-l\fR \fIib-link\fR]  [\fIpart-link\fR]
.fi

.LP
.nf
\fBdladm show-ib\fR [\fB-pP\fR] [\fB-o\fR \fIfield\fR[,...]] [\fIib-link\fR]
.fi

.LP
.nf
\fBdladm create-eoib\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fIib-link\fR \fB-g\fR \fIgw-system-name\fR
     \fB-c\fR \fIgw-eth-port\fR \fIeoib-link\fR
\fBdladm delete-eoib\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIeoib-link\fR
\fBdladm show-eoib\fR [\fB-PZ\fR] [\fB-g\fR \fIgw-system-name\fR] [\fB-l\fR \fIib-link\fR] [[\fB-p\fR]
     \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR [,...]] [\fIeoib-link\fR]
\fBdladm show-ib\fR [\fB-pP\fR] [\fB-o\fR \fIfield\fR[,...]] [\fIib-link\fR]
.fi

.LP
.nf
\fBdladm create-vxlan\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-p\fR \fIvni\fR=<\fIvxlan id\fR>,\fBaddr\fR=<\fIip_address\fR>[,\fIprop=value\fR[,...]]
          \fIvxlan-link\fR
\fBdladm create-vxlan\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-p\fR \fIvni\fR=<\fIvxlan id\fR>,\fBinterface\fR=<\fIinterface_name\fR>[,\fIprop=value\fR[,...]]
          \fIvxlan-link\fR
\fBdladm show-vxlan\fR [\fB-pP\fR] [\fB-o\fR \fIfield\fR[,...]] [\fIvxlan-link\fR]
\fBdladm delete-vxlan\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIvxlan-link\fR
.fi

.LP
.nf
\fBdladm create-cap\fR  [-t] [-R \fIroot-dir\fR] \fIcap-link\fR 
\fBdladm show-cap\fR [-pP] [-o  field[,...]] [\fIcap-link\fR] 
\fBdladm delete-cap\fR  [-t] [-R \fIroot-dir\fR] \fIcap-link\fR
.fi

.LP
.nf
\fBdladm help\fR [\fIsubcommand-name\fR]
.fi

.SH 機能説明
.sp
.LP
\fBdladm\fR コマンドは、データリンクを管理するために使用されます。データリンクはシステム内で、\fBTCP/IP\fR などのプロトコルスタックの下で plumb できる \fBSTREAMS DLPI\fR (v2) インタフェースとして表されます。各データリンクは、単一のネットワークデバイスまたはデバイスのアグリゲーションを使用して、ネットワーク間でパケットを送受信します。
.sp
.LP
すべてのリンク構成は、ネットワーク構成プロファイル (NCP) の一部です。NCP は 1 つのシステムにいくつでも定義できますが、アクティブな NCP は常に 1 つになります。\fBdladm\fR コマンドを使用して行われた変更は、現在アクティブになっている NCP に適用されます。
.sp
.LP
NCP は「固定」または「リアクティブ」にできます。DefaultFixed と呼ばれる固定 NCP が 1 つあります。この NCP にはアクティブ化の直後にそのすべての構成が適用され、構成の一部が成功したか失敗したかにかかわらず、システムは一切の変更を加えません。リアクティブ NCP はいくつあってもかまいません。これらの NCP は、プロファイルを構成する追加のポリシールールに基づいて適用されるため、NCP のポリシールールをもとに、システム構成がネットワーク状態の変化に応じて自動的に変更される可能性があります。リアクティブ NCP のポリシールールは、\fBnetcfg\fR(1M) コマンドを使って作成できます。
.sp
.LP
各 \fBdladm\fR サブコマンドは、次のいずれかのオブジェクトに対して動作します。
.sp
.ne 2
.mk
.na
\fB\fBlink\fR\fR
.ad
.sp .6
.RS 4n
データリンク。名前で識別されます。名前には最大 30 文字を使用でき、名前の先頭は英字、末尾は 0 から 4294967294 までの数字 (両端含む) にする必要があります。数字の先頭にゼロを付けることはできません。名前の残りの部分では、アルファベット文字の任意の組み合わせを使用できるほか、「.」と「_」も使用できます。さらにデータリンク名には、次に説明するように、特殊な区切り文字「/」や「-」を含めることもできます。 
.sp
ゾーン内のデータリンクを大域ゾーンから表示する場合、(ゾーンを識別する) 接頭辞と「/」のあとに、従来のデータリンク名が続きます。したがって、ゾーン「myzone」内のデータリンク「net0」を大域ゾーンから表示すると、「myzone/net0」と表示されます。これにより、データリンク名が常に一意になることが保証されます。
.sp
dladm の外部で作成されたデータリンクでは、(作成者を識別する) 接頭辞と「-」のあとに、従来のデータリンク名が続きます (例: \fBldoms-vsw1.port2\fR)。これにより、外部で作成されたデータリンクで名前の衝突が起こらないことが保証されます。したがって、「-」を含むデータリンクを dladm を使って作成することはできません。 
.sp
一部のサブコマンドは、データリンクの特定のタイプまたはクラスに対してのみ動作します。その場合は、次のオブジェクト名が使用されます。
.sp
.ne 2
.mk
.na
\fB\fBaggr-link\fR\fR
.ad
.sp .6
.RS 4n
集約データリンク (またはキー、「注意事項」を参照)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBether-link\fR\fR
.ad
.sp .6
.RS 4n
物理 Ethernet データリンク。
.RE

.sp
.ne 2
.mk
.na
\fB\fBeoib-link\fR\fR
.ad
.sp .6
.RS 4n
Ethernet-over-InfiniBand (EoIB) データリンク。
.RE

.sp
.ne 2
.mk
.na
\fB\fBiptun-link\fR\fR
.ad
.sp .6
.RS 4n
IP トンネルリンク。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpart-link\fR\fR
.ad
.sp .6
.RS 4n
InfiniBand (IB) パーティションデータリンク。
.RE

.sp
.ne 2
.mk
.na
\fB\fBphys-link\fR\fR
.ad
.sp .6
.RS 4n
物理データリンク。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvlan-link\fR\fR
.ad
.sp .6
.RS 4n
VLAN データリンク。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvnic-link\fR\fR
.ad
.sp .6
.RS 4n
リンクまたは \fBetherstub\fR 上に作成された仮想ネットワークインタフェース。これは、マシン上でネットワークインタフェースカードであるかのように扱うことが可能な疑似デバイスです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBwifi-link\fR\fR
.ad
.sp .6
.RS 4n
WiFi データリンク。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBbridge\fR\fR
.ad
.sp .6
.RS 4n
ブリッジインスタンス。管理用に選択された名前で識別されます。この名前には任意の英数字または下線 \fB_\fR を使用できますが、英字で始まり、英字で終わる必要があります。ブリッジ名には最大 31 文字を使用できます。\fBdefault\fR という名前は、\fBSUNW\fR で始まるすべての名前を表すため、予約されています。
.sp
ブリッジ名にゼロ (\fB0\fR) を付加すると、可観測性に使用される有効なリンク名が生成されることに注意してください。
.sp
また、下の \fBdladm\fR サブコマンドで説明されているブリッジ関連のサブコマンドには \fBpkg://solaris/network/bridging\fR パッケージのインストールが必要であることにも注意してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdev\fR\fR
.ad
.sp .6
.RS 4n
ネットワークデバイス。ドライバ名とインスタンス番号の連結で識別されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBetherstub\fR\fR
.ad
.sp .6
.RS 4n
物理 NIC の代わりに Ethernet スタブを使用して VNIC を作成することもできます。\fBetherstub\fR 上に作成された VNIC は、仮想スイッチを経由して接続されているように表示されるため、物理ハードウェアなしで完全な仮想ネットワークを構築できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpart\fR\fR
.ad
.sp .6
.RS 4n
IB 物理リンク上に作成された IB パーティションリンク。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsecobj\fR\fR
.ad
.sp .6
.RS 4n
セキュリティー保護されたオブジェクト。管理用に選択された名前で識別されます。この名前には、任意の英数字のほか、下線 (\fB_\fR)、ピリオド (\fB\&.\fR)、およびハイフン (\fB-\fR) を使用できます。セキュリティー保護されたオブジェクトの名前には最大 32 文字を使用できます。
.RE

.sp
.LP
\fBdladm\fR は、対応するオプションを備えた一連のサブコマンドとして実装されています。オプションについては各サブコマンドの文脈で説明します。多くのサブコマンドには次の共通オプションがあります:
.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
作成、削除、名前変更などの操作が適用する代替ルートディレクトリを指定します。
.RE

.sp
.LP
\fBdladm\fR は、引数なしのコマンド形式もサポートします。\fBdladm\fR は、この方法で呼び出されると、システムの全データリンクの基本構成情報を表示します。「\fB使用例\fR」を参照してください。
.SS "サブコマンド"
.sp
.LP
サポートされているサブコマンドは次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBdladm show-link\fR [\fB-PZ\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR] \fR
.ad
.sp .6
.RS 4n
すべてのデータリンクまたは指定されたリンクのリンク構成情報を表示します。デフォルトでは、システムは、既知のネットワークデバイスごとに 1 つのデータリンクで構成されます。リンクの統計情報を出力するためのオプションは \fBdlstat\fR(1M) に移行されました。
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...], \fB- –output\fR=\fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。デフォルトでは (\fB-o\fR の指定なし)、\fBshow-link\fR はすべてのフィールドを表示します。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
データリンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBZONE\fR\fR
.ad
.sp .6
.RS 4n
データリンクの現在のゾーン。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCLASS\fR\fR
.ad
.sp .6
.RS 4n
データリンクのクラス。\fBdladm\fR は、次のクラスを識別します。
.sp
.ne 2
.mk
.na
\fB\fBaggr\fR\fR
.ad
.sp .6
.RS 4n
データリンクマルチパス (\fBdlmp\fR) と IEEE 802.3ad \fBtrunk\fR のいずれかのリンクアグリゲーション。\fBshow-aggr\fR サブコマンドは、このクラスのデータリンクに関する詳細を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBbridge\fR\fR
.ad
.sp .6
.RS 4n
ブリッジインスタンス。管理用に選択された名前で識別されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBeoib\fR\fR
.ad
.sp .6
.RS 4n
EoIB インタフェース。\fBshow-eoib\fR サブコマンドは、このクラスのデータリンクに関する詳細を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBetherstub\fR\fR
.ad
.sp .6
.RS 4n
etherstub のインスタンス。物理 NIC の代わりに Ethernet スタブを使用して VNIC を作成することもできます。\fBetherstub\fR 上に作成された VNIC は、仮想スイッチを経由して接続されているように表示されるため、物理ハードウェアなしで完全な仮想ネットワークを構築できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBiptun\fR\fR
.ad
.sp .6
.RS 4n
IP トンネルリンクのインスタンス。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpart\fR\fR
.ad
.sp .6
.RS 4n
IP-over-IB インタフェース。\fBshow-part\fR サブコマンドは、このクラスのデータリンクに関する詳細を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBphys\fR\fR
.ad
.sp .6
.RS 4n
物理データリンク。\fBshow-phys\fR サブコマンドは、このクラスのデータリンクに関する詳細を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvlan\fR\fR
.ad
.sp .6
.RS 4n
VLAN データリンク。\fBshow-vlan\fR サブコマンドは、このクラスのデータリンクに関する詳細を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvnic\fR\fR
.ad
.sp .6
.RS 4n
仮想ネットワークインタフェース。\fBshow-vnic\fR サブコマンドは、このクラスのデータリンクに関する詳細を表示します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBMTU\fR\fR
.ad
.sp .6
.RS 4n
表示されるデータリンクの最大送信単位のサイズ。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
データリンクの仮想リンク状態。この状態は、up、down、unknown のいずれかにできます。NIC が複数の仮想 NIC (VNIC) に切り分けられている場合は、仮想スイッチが内部で作成されて、それらの VNIC とプライマリデータリンクが通信できるようになります (それらが同じ VLAN 上にあるかぎり)。これらのデータリンクは、物理データリンクに外部ネットワークとの接続がない場合でも相互に通信できます。これによって、データリンクの仮想リンク状態が形成されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBRIDGE\fR\fR
.ad
.sp .6
.RS 4n
このリンクが割り当てられているブリッジの名前 (ある場合)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOVER\fR\fR
.ad
.sp .6
.RS 4n
データリンクが動作している物理データリンク。これは、データリンクの \fBaggr\fR、\fBbridge\fR、\fBeoib\fR、\fBvlan\fR、および \fBpart\fR クラスに適用されます。1 つの VLAN、IB パーティション、または EoIB データリンクは 1 つの物理的なデータリンク上に作成され、1 つのブリッジには複数のリンクが接続され、1 つのアグリゲーションは 1 つ以上の物理的なデータリンクで構成されます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。\fB-p\fR には \fB-o\fR オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR, \fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
永続リンクの構成を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
\fBZONE\fR 列を出力に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
指定されたゾーンからのリンクを表示します。デフォルトでは、大域ゾーンから実行されている場合、\fBdladm\fR はすべてのゾーン内のリンクを表示します。ほかのゾーン内のリンクは、対応するゾーン名がその接頭辞として付き、そのあとにスラッシュ (\fB/\fR) 区切り文字が続いて表示されます。例: \fBzone1/net0\fR
.sp
非大域ゾーンから実行されている場合、このサブコマンドはそのゾーンのリンクのみを表示します。非大域ゾーンでは、ほかのゾーン内のリンクを表示することはできません。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm rename-link\fR [\fB-R\fR \fI root-dir\fR] \fIlink\fR \fInew-link\fR\fR
.ad
.sp .6
.RS 4n
\fIlink\fR の名前を \fInew-link\fR に変更します。これは、リンクに意味のある名前を付けたり、削除されたデバイスのリンクプロパティーのような既存のリンク構成を新しいデバイスに関連付けたりするために使用されます。このサブコマンドの使用方法の具体例については、「使用例」のセクションを参照してください。\fB\fR
.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-phys\fR \fIphys-link\fR\fR
.ad
.sp .6
.RS 4n
このコマンドは、システムから削除された物理ハードウェアに関連付けられているリンクの永続構成を削除するために使用されます。
.sp
IP インタフェースなどのレイヤー 3 コンポーネントは、\fBipadm delete\fR コマンドを使用して手動で削除するようにしてください。「\fB使用例\fR」のセクションを参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-phys\fR [\fB-PZ\fR] [\fB-Lm\fR] [[\fB-p\fR] \fB-o\fR \fIfield \fR[,...]] [\fB-H\fR] [\fB-z\fR \fIzone\fR[,...]] [\fB-D\fR [\fIdcb-feature\fR] [\fB-lr\fR]] [\fB-V\fR] [\fIphys-link\fR]\fR
.ad
.sp .6
.RS 4n
物理デバイスと、すべての物理リンクまたは指定された物理リンクの属性を表示します。\fB-P\fR を指定しない場合は、実行中のシステム上で使用可能な物理リンクのみが表示されます。
.sp
.ne 2
.mk
.na
\fB\fB-D\fR [\fIdcb-feature\fR]\fR
.ad
.sp .6
.RS 4n
DCB (Data Center Bridging) 関連の構成情報を phys-link 上に表示します。サポートされる \fIdcb-feature\fR には、\fBets\fR (Enhanced Transmission Selection、IEEE 802.1Qaz) および \fBpfc\fR (Priority-based Flow Control、IEEE 802.1Qbb) が含まれます。\fBdcb-feature\fR の出力は不安定 (Unstable) です。
.sp
\fB-D\fR \fBets\fR からの出力には、次の ETS DCB 機能の要素が表示されます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
データリンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCOS\fR\fR
.ad
.sp .6
.RS 4n
802.1p 優先度の値。
.RE

.sp
.ne 2
.mk
.na
\fB\fBETSBW_LCL_EFFECT\fR\fR
.ad
.sp .6
.RS 4n
有効な ETS BW の CoS (802.1p 優先度) 値に対する割合 (パーセント)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBETSBW_RMT_EFFECT\fR\fR
.ad
.sp .6
.RS 4n
有効な ETS BW の、ピア上の CoS (802.1p 優先度) 値に対する割合 (パーセント)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBETSBW_LCL_SOURCE\fR\fR
.ad
.sp .6
.RS 4n
\fBETSBW_LCL_EFFECT\fR 値のソースを示します。これはローカル (構成)、リモート (推奨) のいずれかの値になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCLIENTS\fR\fR
.ad
.sp .6
.RS 4n
CoS 値を使用している MAC クライアント。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
ETS DCB 機能の場合、これは追加のローカル情報を表示します。
.sp
.ne 2
.mk
.na
\fB\fBETSBW_LCL\fR\fR
.ad
.RS 21n
.rt  
構成された ETS BW の CoS (802.1p 優先度) 値に対する割合 (パーセント)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBETSBW_LCL_EFFECT\fR\fR
.ad
.RS 21n
.rt  
有効な ETS BW の CoS (802.1p 優先度) 値に対する割合 (パーセント)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBETSBW_LCL_ADVICE:\fR\fR
.ad
.RS 21n
.rt  
ETS BW の、ピアから推奨される CoS (802.1p 優先度) 値に対する割合。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
ETS DCB 機能の場合、これは追加のリモート情報を表示します。
.sp
.ne 2
.mk
.na
\fB\fBETSBW_RMT_EFFECT\fR\fR
.ad
.RS 20n
.rt  
有効な ETS BW の、ピア上の CoS (802.1p 優先度) 値に対する割合 (パーセント)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBETSBW_RMT_ADVICE:\fR\fR
.ad
.RS 21n
.rt  
ETS BW の、ピアに推奨される CoS (802.1p 優先度) 値に対する割合。
.RE

\fB-D\fR \fBpfc\fR からの出力では、\fB-D\fR \fBets\fR の出力と同様に \fBLINK\fR、\fBCOS\fR、および \fBCLIENTS\fR フィールドが表示されます。さらに、\fB-D\fR \fBpfc\fR では、特に PFC DCB 機能用の次の要素が表示されます。
.sp
.ne 2
.mk
.na
\fB\fBPFC\fR\fR
.ad
.sp .6
.RS 4n
構成された PFC が CoS (802.1p priority) 値に対して有効な場合。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPFC_EFFECT\fR\fR
.ad
.sp .6
.RS 4n
有効な PFC が CoS (802.1p priority) 値に対して有効な場合。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR \fR
.ad
.sp .6
.RS 4n
NIC ドライバによって返される、ハードウェアリソースの使用状況を表示します。\fB-H\fR からの出力には、次の要素が表示されます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
データリンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBRINGTYPE\fR\fR
.ad
.sp .6
.RS 4n
リングのタイプ (RX または TX のどちらか)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBRINGS\fR\fR
.ad
.sp .6
.RS 4n
リングのインデックス。リングとはハードウェアリソースのことで、通常は DMA チャネルにマップされ、特定の用途のためにプログラムできます。たとえば、RX リングをプログラムすると、特定の MAC アドレスに属するパケットのみを受信できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCLIENTS\fR\fR
.ad
.sp .6
.RS 4n
リングを使用している MAC クライアント。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fR
.ad
.sp .6
.RS 4n
物理デバイス/リンクの位置情報を表示します。出力は配置順 (つまり、オンボードデバイス、拡張スロットの順) で行われ、位置情報 (PCIexp Slot 2、MB など) は利用可能な場合に提供されます。\fB-L\fR からの出力は、次の要素をサポートしています。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
NIC ドライバに対応する物理デバイス。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDEVICE\fR \fR
.ad
.sp .6
.RS 4n
このリンクの下にある物理デバイスの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLOC\fR\fR
.ad
.sp .6
.RS 4n
物理的な位置を記述する文字列 (利用可能な場合)。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.sp .6
.RS 4n
ファクトリ MAC アドレス、そのスロット識別子、およびその可用性を一覧表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR \fR
.ad
.sp .6
.RS 4n
物理リンクの SR-IOV 情報を表示します。出力には次が表示されます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.RS 13n
.rt  
物理リンク名。
.RE

.sp
.ne 2
.mk
.na
\fB\fBVFS-AVAIL\fR\fR
.ad
.RS 13n
.rt  
この物理リンクで使用可能な VF の数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBVFS-INUSE\fR\fR
.ad
.RS 13n
.rt  
この物理リンクで使用されている VF の数。
.RE

.sp
.ne 2
.mk
.na
\fBFLAGS\fR
.ad
.RS 13n
.rt  
使用可能なフラグは l (LDoms 管理の略) のみです。このフラグが設定されている場合、\fBdladm\fR はこの物理リンク上で VF VNIC を作成できなくなります。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR, \fB- -output\fR=\fIfield\fR\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。リンクごとに、次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
データリンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMEDIA\fR\fR
.ad
.sp .6
.RS 4n
物理データリンクによって提供されるメディアタイプ。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
データリンクの物理リンク状態。これは、up、down、unknown のいずれかにできます。物理リンク状態は、物理デバイスに外部ネットワークとの接続があるかどうか (ケーブルが接続され、そのケーブルの反対側にあるポートの状態が「up」の場合は接続がある) を識別します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSPEED\fR \fR
.ad
.sp .6
.RS 4n
リンクの現在の速度 (Mbps 単位)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDUPLEX\fR\fR
.ad
.sp .6
.RS 4n
Ethernet リンクでリンクステータスが \fBup\fR の場合は、そのリンクの二重通信のステータス (全二重/半二重) が表示されます。それ以外の場合は、二重通信の状態は \fBunknown\fR と表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDEVICE\fR \fR
.ad
.sp .6
.RS 4n
このリンクの下にある物理デバイスの名前。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。\fB-p\fR には \fB-o\fR オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR, \fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
このオプションを指定すると、システムから削除されたリンクを含むすべてのリンクの永続構成が表示されます。出力には \fBFLAGS\fR 列が表示されます。この列の \fBr\fR フラグは、物理リンクに関連付けられた物理デバイスが削除されたことを示します。このようなリンクの場合は、\fBdelete-phys\fR を使用すると、そのリンクの構成をシステムから消去できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
\fBZONE\fR 列を出力に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
上記の \fBdladm show-link\fR の下にある \fB-z\fR オプションの説明を参照してください。
.RE

デフォルトでは、Solaris は接頭辞 \fBnet\fR を使ってリンク名を割り当てます。Solaris をインストールする前に、サービス \fBsvc:/network/datalink-management:default\fR の \fBlinkname-policy/phys-prefix\fR SMF プロパティーの値を変更することで、このデフォルトを変更できます。自動インストール (AI) プログラムが使用するシステム構成マニフェスト内で、このプロパティーの新しい値を指定します。詳細は、Chapter 2, \fI「Administering Datalink Configuration in Oracle Solaris,」\fR in \fI『Configuring and Managing Network Components in Oracle Solaris 11.3 』\fRを参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-m\fR \fI mode\fR] [\fB-P\fR \fIpolicy\fR] [\fB-L\fR \fIlcapmode\fR] [\fB-T\fR \fI time\fR] [\fB-u\fR \fIaddress\fR] \fB- l\fR \fIether-link1\fR [\fB-l\fR \fI ether-link2\fR...] \fIaggr-link\fR\fR
.ad
.sp .6
.RS 4n
一連のリンクを、\fIaggr-link\fR という名前の 1 つのリンクアグリゲーションに結合します。このアグリゲーションは、データリンクマルチパス (dlmp) または IEEE 802.3ad 準拠にすることができます。また、下位互換性のために、整数キーによるアグリゲーション用リンク名の生成もサポートされています。\fI\fR下記の \fB*\fR\fB-aggr\fR サブコマンドの多くでは、キーによる特定のアグリゲーションの参照もサポートされていますが、集約リンク名の使用をお勧めします。\fI\fRキーの詳細は、「\fB注意事項\fR」のセクションを参照してください。
.sp
\fBdladm\fR は、ポート集約のためのポート選択ポリシーをいくつかサポートしています。(下記の \fB-P\fR オプションの説明を参照してください。)ポリシーを指定しない場合、\fBcreate-aggr\fR は、\fB-P\fR オプションで説明されているデフォルトの L4 ポリシーを使用します。
.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIether-link\fR, \fB- -link\fR=\fIether-link\fR\fR
.ad
.sp .6
.RS 4n
アグリゲーションの各 Ethernet リンク (またはポート) は、\fB-l\fR オプションのあとに、そのアグリゲーションに含めるリンクの名前を使用して指定します。複数の \fB-l\fR オプションを指定すると、複数のリンクがアグリゲーションに含まれます。旧バージョンの Solaris との下位互換性を確保するため、\fBdladm\fR コマンドでは、\fB-d\fR オプション (または \fB--dev\fR) をデバイス名とともに使用して、基本となるデバイス名でリンクを指定する方法もサポートされています。また、\fB-l\fR オプションを取るほかの \fB*\fR\fB-aggr\fR サブコマンドも \fB-d\fR を受け入れます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
アグリゲーションを一時的なものとして指定します。一時的なアグリゲーションは、次回のリブートまで保持されます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fImode\fR\fR
.ad
.sp .6
.RS 4n
モードは、次のいずれかに設定する必要があります:
.sp
.ne 2
.mk
.na
\fB\fBtrunk\fR\fR
.ad
.sp .6
.RS 4n
IEEE 802.3ad に準拠したリンクアグリゲーション。指定されていない場合、\fImode\fR は \fBtrunk\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdlmp\fR\fR
.ad
.sp .6
.RS 4n
データリンクマルチパスモード。複数のスイッチ間でのフェイルオーバーを提供でき、スイッチ構成を必要としないレイヤー 2 の高可用性テクノロジ。\fBdlmp\fR リンクアグリゲーションは、同じスイッチに接続されているポートも集約できます。ただし、連続セットアップで使用することはできません。
.sp
\fBdlmp\fR リンクアグリゲーションは、その負荷分散機能のみに制限されています: plumb された \fBdlmp\fR \fBaggr\fR で構成された MAC クライアントは、すべての \fBaggr\fR ポート間に分散されますが、個別の MAC クライアントが複数のポートに負荷を分散させることはできません。
.sp
このモードは、IEEE 802.3ad に準拠していません。\fBpolicy\fR、\fBlacpmode\fR、\fBtime\fR、または MAC アドレスの設定は、このモードでは無効です。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fIpolicy\fR, \fB- -policy\fR=\fIpolicy\fR\fR
.ad
.br
.na
\fB\fR
.ad
.sp .6
.RS 4n
送信トラフィックの負荷分散に使用するポート選択ポリシーを指定します。このポリシーでは、パケットを送信するためにどの \fIdev\fR オブジェクトが使用されるかを指定します。ポリシーは、1 つ以上のレイヤー指定子をコンマで区切ったリストです。レイヤー指定子は、次のいずれかです。
.sp
.ne 2
.mk
.na
\fB\fBL2\fR\fR
.ad
.sp .6
.RS 4n
パケットの発信元および着信先 \fBMAC\fR アドレスに従ってアウトバウンドデバイスを選択します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBL3\fR\fR
.ad
.sp .6
.RS 4n
パケットの発信元および着信先 \fBIP\fR アドレスに従ってアウトバウンドデバイスを選択します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBL4\fR\fR
.ad
.sp .6
.RS 4n
パケットに含まれている上位レイヤーのプロトコル情報に従って送信デバイスを選択します。\fBTCP\fR と \fBUDP\fR の場合、これには発信元および着信先ポートが含まれます。IPsec の場合、これには \fBSPI\fR (セキュリティーパラメータインデックス) が含まれます。
.RE

たとえば、上位レイヤーのプロトコル情報を使用するには、次のポリシーを使用できます。
.sp
.in +2
.nf
-P L4
.fi
.in -2
.sp

ポリシー L4 がデフォルトであることに注意してください。
.sp
発信元および着信先 \fBMAC\fR アドレスとともに発信元および着信先 \fBIP\fR アドレスを使用するには、次のポリシーを使用できます。
.sp
.in +2
.nf
-P L2,L3
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR \fIlacpmode\fR, \fB- -lacp-mode\fR=\fImode\fR\fR
.ad
.sp .6
.RS 4n
\fBLACP\fR を使用するかどうか、および使用する場合は LACP が動作するモードを指定します。サポートされている値は、\fBoff\fR、\fBactive\fR、または \fBpassive\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fItime\fR, \fB--lacp-timer \fR=\fItime\fR\fR
.ad
.br
.na
\fB\fR
.ad
.sp .6
.RS 4n
\fBLACP\fR タイマー値を指定します。サポートされている値は、\fBshort\fR または \fBlong\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR \fIaddress\fR, \fB- -unicast\fR=\fIaddress\fR\fR
.ad
.sp .6
.RS 4n
アグリゲーションに使用される固定のユニキャストハードウェアアドレスを指定します。このオプションが指定されていない場合、アドレスはコンポーネントデバイスのアドレスのセットから自動的に選択されます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm modify-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-m\fR \fI mode\fR] [\fB-P\fR \fIpolicy\fR] [\fB-L\fR \fIlacpmode\fR] [\fB-T\fR \fI time\fR] [\fB-u\fR \fIaddress\fR] \fI aggr-link\fR\fR
.ad
.sp .6
.RS 4n
指定されたアグリゲーションのパラメータを変更します。 
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
変更を一時的なものとして指定します。一時的なアグリゲーションは、次回のリブートまで保持されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fImode\fR\fR
.ad
.sp .6
.RS 4n
前述の \fBcreate-aggr\fR サブコマンドの \fB-m\fR \fImode\fR オプションに関する説明を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fIpolicy\fR, \fB- -policy\fR=\fIpolicy\fR\fR
.ad
.sp .6
.RS 4n
送信トラフィックの負荷分散に使用するポート選択ポリシーを指定します。有効なポリシー値については、\fBdladm create-aggr\fR を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR \fIlacpmode\fR, \fB- -lacp-mode\fR=\fImode\fR\fR
.ad
.sp .6
.RS 4n
\fBLACP\fR を使用するかどうか、および使用する場合は LACP が動作するモードを指定します。サポートされている値は、\fBoff\fR、\fBactive\fR、または \fBpassive\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fItime\fR, \fB--lacp-timer \fR=\fItime\fR\fR
.ad
.br
.na
\fB\fR
.ad
.sp .6
.RS 4n
\fBLACP\fR タイマー値を指定します。サポートされている値は、\fBshort\fR または \fBlong\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR \fIaddress\fR, \fB- -unicast\fR=\fIaddress\fR\fR
.ad
.sp .6
.RS 4n
アグリゲーションに使用される固定のユニキャストハードウェアアドレスを指定します。このオプションが指定されていない場合、アドレスはコンポーネントデバイスのアドレスのセットから自動的に選択されます。
.sp
(固定のユニキャストハードウェアアドレスを変更すると、アグリゲーションのために以前に定義された \fBmac-address\fR リンクプロパティーがすべてオーバーライドされることに注意してください。「一般的なリンクのプロパティー」を参照してください。)
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIaggr-link\fR\fR
.ad
.sp .6
.RS 4n
指定されたアグリゲーションを削除します。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
削除を一時的なものとして指定します。一時的な削除は、次回のリブートまで保持されます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm add-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fI ether-link1\fR [\fB--link\fR=\fIether-link2\fR...] \fI aggr-link\fR\fR
.ad
.sp .6
.RS 4n
指定されたアグリゲーションにリンクを追加します。
.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIether-link\fR, \fB- -link\fR=\fIether-link\fR\fR
.ad
.sp .6
.RS 4n
アグリゲーションに追加する Ethernet リンクを指定します。複数の \fB-l\fR オプションを指定すると、複数のリンクを追加できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
追加を一時的なものとして指定します。一時的な追加は、次回のリブートまで保持されます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm remove-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fI ether-link1\fR [\fB--l\fR=\fIether-link2\fR...] \fI aggr-link\fR\fR
.ad
.sp .6
.RS 4n
指定されたアグリゲーションからリンクを削除します。
.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIether-link\fR, \fB- -link\fR=\fIether-link\fR\fR
.ad
.sp .6
.RS 4n
アグリゲーションから削除する Ethernet リンクを指定します。複数の \fB-l\fR オプションを指定すると、複数のリンクを追加できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
削除を一時的なものとして指定します。一時的な削除は、次回のリブートまで保持されます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-aggr\fR [\fB-PLxZS\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIaggr-link \fR]\fR
.ad
.sp .6
.RS 4n
すべてのアグリゲーションまたは指定されたアグリゲーションのどちらかのアグリゲーション構成 (デフォルト)、LACP 情報、または DLMP プローブベースの障害/復旧検出ステータスを表示します。
.sp
デフォルトでは (オプションの指定なし)、次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
集約リンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMODE\fR\fR
.ad
.sp .6
.RS 4n
アグリゲーションモード (\fBtrunk\fR または \fBdlmp\fR)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPOLICY\fR\fR
.ad
.sp .6
.RS 4n
アグリゲーションの LACP ポリシー。指定可能な値については、\fBcreate-aggr\fR の \fB-P\fR オプションを参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBADDRPOLICY\fR\fR
.ad
.sp .6
.RS 4n
アグリゲーションがユニキャスト MAC アドレスを自動的に構成するように構成されている場合は \fBauto\fR (アグリゲーションを作成または変更するために \fB-u\fR オプションが使用されなかった場合のデフォルトです)、\fB-u\fR を使用して固定の MAC アドレスが設定された場合は \fBfixed\fR になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLACPACTIVITY\fR\fR
.ad
.sp .6
.RS 4n
アグリゲーションの LACP モード。指定可能な値は、\fBcreate-aggr\fR または \fBmodify-aggr\fR の \fB-l\fR オプションで設定された、\fBoff\fR、\fBactive\fR、または \fBpassive\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLACPTIMER\fR\fR
.ad
.sp .6
.RS 4n
\fBcreate-aggr\fR または \fBmodify-aggr\fR の \fB-T\fR オプションで設定された、アグリゲーションの LACP タイマー値。
.RE

次のフィールドは、デフォルト出力の一部ではありませんが、\fB-o\fR を使用してクエリーを実行できます。
.sp
.ne 2
.mk
.na
\fB\fBFLAGS\fR\fR
.ad
.sp .6
.RS 4n
アグリゲーションに関連付けられた状態フラグのセット。指定可能なフラグは \fBf\fR のみです。このフラグは、管理者が \fBcreate-aggr\fR の \fB-f\fR オプションを使用してアグリゲーションを強制的に作成した場合に表示されます。将来、ほかのフラグが定義される可能性があります。
.RE

\fBshow-aggr\fR コマンドで使用できるオプションは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-L\fR, \fB--lacp\fR\fR
.ad
.sp .6
.RS 4n
集約リンクおよび基本となる各ポートの詳細な \fBLACP\fR 情報を表示します。このオプションで表示される状態情報の大部分は、IEEE 802.3 で定義されています。このオプションを使用すると、次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
集約リンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPORT\fR\fR
.ad
.sp .6
.RS 4n
基本となるいずれかの集約ポートの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBAGGREGATABLE\fR\fR
.ad
.sp .6
.RS 4n
アグリゲーションにポートを追加できるかどうか。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSYNC\fR\fR
.ad
.sp .6
.RS 4n
\fByes\fR の場合、システムはこのポートが同期されていて、アグリゲーションの一部であるとみなします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCOLL\fR\fR
.ad
.sp .6
.RS 4n
\fByes\fR の場合、関連付けられたポート上で受信フレームの収集が有効になっています。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDIST\fR\fR
.ad
.sp .6
.RS 4n
\fByes\fR の場合、関連付けられたポート上で送信フレームの配信が有効になっています。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDEFAULTED\fR\fR
.ad
.sp .6
.RS 4n
\fByes\fR の場合、ポートはデフォルトのパートナー情報を使用しています (つまり、LACP パートナーから LACP データを受信していません)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBEXPIRED\fR\fR
.ad
.sp .6
.RS 4n
\fByes\fR の場合、ポートの受信状態が \fBEXPIRED\fR 状態になっています。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR, \fB--extended\fR\fR
.ad
.sp .6
.RS 4n
基本となる各ポートに関する詳細情報を含む追加のアグリゲーション情報を表示します。\fB-x\fR を使用すると、次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
集約リンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPORT\fR\fR
.ad
.sp .6
.RS 4n
基本となるいずれかの集約ポートの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSPEED\fR \fR
.ad
.sp .6
.RS 4n
リンクまたはポートの速度 (Mbps 単位)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDUPLEX\fR\fR
.ad
.sp .6
.RS 4n
リンクステータスが \fBup\fR の場合は、そのリンクまたはポートの二重通信のステータス (全二重/半二重) のステータスが表示されます。それ以外の場合は、二重通信のステータスは \fBunknown\fR と表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
リンク状態。この状態は、\fBup\fR、\fBdown\fR、\fBunknown\fR のいずれかになります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBADDRESS\fR\fR
.ad
.sp .6
.RS 4n
リンクまたはポートの MAC アドレス。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPORTSTATE\fR\fR
.ad
.sp .6
.RS 4n
これは、個々の集約ポートが \fBstandby\fR または \fBattached\fR のどちらの状態にあるかを示します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR\fR
.ad
.sp .6
.RS 4n
指定された DLMP アグリゲーションリンクおよび基本となる各ポートの詳細なプローブ情報を表示します。\fB-S\fR を使用すると、次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.RS 12n
.rt  
集約リンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPORT\fR\fR
.ad
.RS 12n
.rt  
基本となるいずれかの集約ポートの名前。
.RE

.sp
.ne 2
.mk
.na
\fBFLAGS\fR
.ad
.RS 12n
.rt  
\fBFLAGS\fR フィールドの 4 つの文字は次を表します。 
.sp
.ne 2
.mk
.na
\fBlink state\fR
.ad
.RS 16n
.rt  
リンク起動の場合は「u」、リンク停止の場合は「d」、不明なリンク状態の場合は「-」です。
.RE

.sp
.ne 2
.mk
.na
\fBprober state\fR
.ad
.RS 16n
.rt  
選ばれた ICMP プローバの場合は「p」(すべてのポートに障害が発生した場合)。
.RE

.sp
.ne 2
.mk
.na
\fBL2 state\fR
.ad
.RS 16n
.rt  
「L2 active」の場合は「2」。
.RE

.sp
.ne 2
.mk
.na
\fBICMP state\fR
.ad
.RS 16n
.rt  
「ICMP active」の場合は「3」。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.RS 12n
.rt  
ポートの状態。指定可能な値は「active」、「failed」、または「unknown」です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTARGETS\fR\fR
.ad
.RS 12n
.rt  
このポートのアクティブな ICMP ターゲット。
.RE

.sp
.ne 2
.mk
.na
\fB\fBXTARGETS\fR\fR
.ad
.RS 12n
.rt  
このポートのアクティブな推移的プローブターゲット。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...], \fB- -output\fR=\fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、前述のフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。\fB-o\fR オプションに適用できるフィールドは、各出力モードの下に一覧表示されているフィールドに制限されます。たとえば、\fB-L\fR を使用している場合は、前述のように、\fB-L\fR の下に一覧表示されているフィールドのみを \fB-o\fR とともに使用できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。\fB-p\fR には \fB-o\fR オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR, \fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
実行中のシステムの状態ではなく、永続的な集積構成を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
\fBZONE\fR 列を出力に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
上記の \fBdladm show-link\fR の下にある \fB-z\fR オプションの説明を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-bridge\fR [ \fB-P\fR \fI protect\fR] [\fB-R\fR \fIroot-dir\fR] [ \fB-p\fR \fIpriority\fR] [ \fB-m\fR \fI max-age\fR] [ \fB-h\fR \fIhello-time\fR] [ \fB-d\fR \fIforward-delay\fR] [ \fB-f\fR \fI force-protocol\fR] [\fB-l\fR \fIlink\fR...] \fI bridge-name\fR\fR
.ad
.sp .6
.RS 4n
802.1D ブリッジインスタンスを作成し、必要に応じて新しいブリッジに 1 つ以上のネットワークリンクを割り当てます。デフォルトでは、システム上にブリッジインスタンスは存在しません。
.sp
リンクをブリッジするには、少なくとも 1 つのブリッジインスタンスを作成する必要があります。各ブリッジインスタンスは独立しており、ブリッジ間の転送接続は存在しません。
.sp
ブリッジ関連のサブコマンド (特に \fBcreate-bridge\fR) には \fBpkg://solaris/network/bridging\fR パッケージのインストールが必要であることに注意してください。
.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fIprotect\fR, \fB- -protect\fR=\fIprotect\fR\fR
.ad
.sp .6
.RS 4n
保護の方式を指定します。定義されている保護方式は、Spanning Tree Protocol の \fBstp\fR と、RBridge 上で使用される \fBTRILL\fR の trill です。デフォルト値は \fBstp\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIpriority\fR, \fB- -priority\fR=\fIpriority\fR\fR
.ad
.sp .6
.RS 4n
ブリッジの優先度を指定します。これにより、ネットワーク内のルートブリッジノードを決定する IEEE STP の優先度の値が設定されます。デフォルト値は \fB32768\fR です。有効な値は \fB0\fR (もっとも高い優先度) - \fB61440\fR (もっとも低い優先度) で、4096 ずつ増分します。
.sp
4096 で割り切れない値が使用された場合、システムはその値を自動的に 4096 で割り切れる次の小さい値に切り捨てます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fImax-age\fR, \fB- -max-age\fR=\fImax-age\fR\fR
.ad
.sp .6
.RS 4n
構成情報の最長有効期間 (秒単位) を指定します。これにより、STP Bridge Max Age パラメータが設定されます。このノードがルートブリッジである場合は、ネットワーク内のすべてのノードに対してこの値が使用されます。この時間より前のブリッジリンク情報は破棄されます。デフォルトは 20 秒です。有効な値は 6 - 40 秒です。その他の制約については、\fB-d\fR \fIforward-delay\fR パラメータを参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR \fIhello-time\fR, \fB- -hello-time\fR=\fIhello-time\fR\fR
.ad
.sp .6
.RS 4n
STP Bridge Hello Time パラメータを指定します。このノードがルートノードである場合、このノードは、ネットワーク全体にわたってこの間隔で構成 BPDU を送信します。デフォルト値は 2 秒です。有効な値は 1 - 10 秒です。その他の制約については、\fB-d\fR \fIforward-delay\fR パラメータを参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIforward-delay\fR, \fB- -forward-delay\fR=\fIforward-delay\fR\fR
.ad
.sp .6
.RS 4n
STP Bridge Forward Delay パラメータを指定します。このノードがルートノードである場合、ポートが有効になっていると、ネットワーク内のすべてのブリッジがこのタイマーを使用してリンク状態を順序付けます。デフォルト値は 15 秒です。有効な値は 4 - 30 秒です。
.sp
ブリッジは次の 2 つの制約に従う必要があります。
.sp
.in +2
.nf
2 * (\fIforward-delay\fR - 1.0) >= \fImax-age\fR

\fImax-age\fR >= 2 * (\fIhello-time\fR + 1.0)
.fi
.in -2
.sp

これらの制約に違反するパラメータ設定はすべてエラーとして扱われるため、コマンドが失敗して診断メッセージが生成されます。このメッセージには、指定された値に代わる有効な値が表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIforce-protocol\fR, \fB- -force-protocol\fR=\fIforce-protocol\fR\fR
.ad
.sp .6
.RS 4n
MSTP で強制的にサポートされる最大プロトコルを指定します。デフォルトの値は 3 です。有効な値は、負ではない整数です。現在の実装では RSTP や MSTP がサポートされていないため、現在この値は無視されます。ただし、将来 MSTP が使用されないようにするために、このパラメータを STP のみの場合は \fB0\fR に、STP と RSTP の場合は \fB2\fR に設定できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIlink\fR, \fB--link \fR=\fIlink\fR\fR
.ad
.sp .6
.RS 4n
新しく作成されたブリッジに追加する 1 つ以上のリンクを指定します。これは、\fBadd-bridge\fR サブコマンドのように、ブリッジを作成してから 1 つ以上のリンクを追加する場合と同様です。ただし、いずれかのリンクを追加できない場合は、コマンド全体が失敗し、新しいブリッジ自体が作成されません。同じコマンド行で複数のリンクを追加するには、リンクごとにこのオプションを繰り返します。リンクなしのブリッジも作成できます。リンクの割り当ての詳細については、\fBadd-bridge\fR サブコマンドを参照してください。
.RE

ブリッジの作成およびリンクの割り当てには、\fBPRIV_SYS_DL_CONFIG\fR 特権が必要です。オプションのブリッジ機能がシステムにインストールされていない場合、ブリッジの作成が失敗する可能性があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm modify-bridge\fR [ \fB-P\fR \fI protect\fR] [\fB-R\fR \fIroot-dir\fR] [ \fB-p\fR \fIpriority\fR] [ \fB-m\fR \fI max-age\fR] [ \fB-h\fR \fIhello-time\fR] [ \fB-d\fR \fIforward-delay\fR] [ \fB-f\fR \fI force-protocol\fR] [\fB-l\fR \fIlink\fR...] \fI bridge-name\fR\fR
.ad
.sp .6
.RS 4n
既存のブリッジの動作パラメータを変更します。これらのオプションは \fBcreate-bridge\fR サブコマンドの場合と同じですが、\fB-l\fR オプションが許可されていない点が異なります。既存のブリッジにリンクを追加するには、\fBadd-bridge\fR サブコマンドを使用します。
.sp
ブリッジのパラメータの変更には、\fBPRIV_SYS_DL_CONFIG\fR 特権が必要です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-bridge\fR [\fB-R\fR \fI root-dir\fR] \fIbridge-name\fR\fR
.ad
.sp .6
.RS 4n
ブリッジインスタンスを削除します。削除されるブリッジにリンクが追加されていてはいけません。ブリッジを削除する前にリンクを無効にするには、\fBremove-bridge\fR サブコマンドを使用します。
.sp
ブリッジの削除には、\fBPRIV_SYS_DL_CONFIG\fR 特権が必要です。
.sp
\fB-R\fR (\fB--root-dir\fR) オプションは、\fBcreate-bridge\fR サブコマンドの場合と同じです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm add-bridge\fR [\fB-R\fR \fI root-dir\fR] \fB-l\fR \fIlink\fR [\fB- l\fR \fIlink\fR...] \fIbridge-name\fR\fR
.ad
.sp .6
.RS 4n
既存のブリッジに 1 つ以上のリンクを追加します。複数のリンクが指定され、そのいずれかを追加するときにエラーが発生した場合、そのコマンドは失敗し、システムには変更が加えられません。
.sp
ブリッジへのリンクの追加には、\fBPRIV_SYS_DL_CONFIG\fR 特権が必要です。
.sp
1 つのリンクは、最大 1 つのブリッジのメンバーになることができます。すでに別のブリッジに属しているリンクを追加しようとすると、エラーが発生します。あるブリッジインスタンスから別のブリッジインスタンスにリンクを移動するには、現在のブリッジからそのリンクを削除してから、新しいブリッジに追加します。
.sp
ブリッジに割り当てるリンクが、同時に VLAN、VNIC、またはトンネルであってはいけません。ブリッジに割り当てられるのは、物理 Ethernet データリンク、集約データリンク、および Ethernet スタブだけです。
.sp
ブリッジに割り当てるリンクはすべて、MTU が同じである必要があります。これは、リンクが割り当てられるときにチェックされます。リンクがブリッジ上の最初のリンクでなく、MTU が異なっている場合、そのリンクは無効な形式でブリッジに追加されます。
.sp
ブリッジを使用しているシステムでは、\fBeeprom\fR(1M) \fBlocal-mac-address?\fR 変数を false に設定するべきではないことに注意してください。
.sp
これらのオプションは、\fBcreate-bridge\fR サブコマンドの場合と同じです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm remove-bridge\fR [\fB-R\fR \fI root-dir\fR] \fB-l\fR \fIlink\fR [\fB- l\fR \fIlink\fR...] \fIbridge-name\fR\fR
.ad
.sp .6
.RS 4n
ブリッジインスタンスから 1 つ以上のリンクを削除します。複数のリンクが指定されていて、そのいずれかを削除するときにエラーが発生した場合、そのコマンドは失敗し、何も削除されません。
.sp
ブリッジからのリンクの削除には、\fBPRIV_SYS_DL_CONFIG\fR 特権が必要です。
.sp
これらのオプションは、\fBcreate-bridge\fR サブコマンドの場合と同じです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-bridge\fR [\fB-flt\fR] [\fB-s\fR [\fB-i\fR \fIinterval\fR]] [[\fB-p\fR] \fB-o\fR \fIfield\fR,...] [\fIbridge-name\fR]\fR
.ad
.sp .6
.RS 4n
ブリッジの実行ステータスと構成、追加されているリンク、学習された転送エントリ、および \fBTRILL\fR ニックネームデータベースを表示します。全体的なブリッジのステータスと構成を表示する場合は、ブリッジ名を省略すると、すべてのブリッジを表示できます。その他の形式の場合は、ブリッジの指定が必要です。
.sp
show-bridge サブコマンドで使用できるオプションは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fIinterval\fR, \fB- -interval\fR=\fIinterval\fR\fR
.ad
.sp .6
.RS 4n
統計情報を表示する間隔 (秒) を指定するために \fB-s\fR オプションとともに使用されます。このオプションが指定されていない場合、統計情報は 1 回だけ表示されます。このオプションは、\fBdlstat\fR(1M) の \fBshow-bridge\fR サブコマンドによって廃止されました。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR, \fB--statistics\fR\fR
.ad
.sp .6
.RS 4n
指定されたブリッジ、または特定のブリッジに追加されたリンクの統計情報を表示します。このオプションは \fB-f\fR オプションおよび \fB-t\fR オプションとともに使用することはできません。このオプションは、\fBdlstat\fR(1M) の \fBshow-bridge\fR サブコマンドによって廃止されました。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。下記の「解析可能な出力形式」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...], \fB- -output\fR=\fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名については、あとで説明します。特殊な値 all はすべてのフィールドを表示します。\fB-o\fR が指定されていない場合、フィールドの各セットには、表示する独自のデフォルトセットがあります。
.RE

デフォルトでは、\fBshow-bridge\fR サブコマンドはブリッジ構成を表示します。次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBBRIDGE\fR\fR
.ad
.sp .6
.RS 4n
ブリッジの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBADDRESS\fR\fR
.ad
.sp .6
.RS 4n
ブリッジの一意の識別子の値 (MAC アドレス)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPRIORITY\fR\fR
.ad
.sp .6
.RS 4n
\fBcreate-bridge\fR および \fBmodify-bridge\fR の \fB-p\fR で設定された、構成済みの優先度の値。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBMAXAGE\fR\fR
.ad
.sp .6
.RS 4n
\fBcreate-bridge\fR および \fBmodify-bridge\fR の \fB-m\fR で設定された、構成済みのブリッジ最長有効期間。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBHELLOTIME\fR\fR
.ad
.sp .6
.RS 4n
\fBcreate-bridge\fR および \fBmodify-bridge\fR の \fB-h\fR で設定された、構成済みのブリッジ Hello 時間。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBFWDDELAY\fR\fR
.ad
.sp .6
.RS 4n
\fBcreate-bridge\fR および \fBmodify-bridge\fR の \fB-d\fR で設定された、構成済みの転送遅延。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFORCEPROTO\fR\fR
.ad
.sp .6
.RS 4n
\fBcreate-bridge\fR および \fBmodify-bridge\fR の \fB-f\fR で設定された、構成済みの強制適用最大プロトコル。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTCTIME\fR\fR
.ad
.sp .6
.RS 4n
最後のトポロジ変更からの時間 (秒単位)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTCCOUNT\fR\fR
.ad
.sp .6
.RS 4n
トポロジ変更の回数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTCHANGE\fR\fR
.ad
.sp .6
.RS 4n
これは、トポロジ変更が検出されたことを示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDESROOT\fR\fR
.ad
.sp .6
.RS 4n
ルートノードのブリッジ識別子。
.RE

.sp
.ne 2
.mk
.na
\fB\fBROOTCOST\fR\fR
.ad
.sp .6
.RS 4n
ルートノードへのパスのコスト。
.RE

.sp
.ne 2
.mk
.na
\fB\fBROOTPORT\fR\fR
.ad
.sp .6
.RS 4n
ルートノードに到達するために使用されるポート番号。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMAXAGE\fR\fR
.ad
.sp .6
.RS 4n
ルートノードからの最長有効期間の値。
.RE

.sp
.ne 2
.mk
.na
\fB\fBHELLOTIME\fR\fR
.ad
.sp .6
.RS 4n
ルートノードからの Hello 時間の値。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFWDDELAY\fR\fR
.ad
.sp .6
.RS 4n
ルートノードからの転送遅延の値。
.RE

.sp
.ne 2
.mk
.na
\fB\fBHOLDTIME\fR\fR
.ad
.sp .6
.RS 4n
最小の BPDU 間隔。
.RE

デフォルトでは、\fB-o\fR オプションが指定されていない場合、\fBBRIDGE\fR、\fBADDRESS\fR、\fBPRIORITY\fR、および \fBDESROOT\fR フィールドのみが表示されます。
.sp
\fB-s\fR オプションが指定されている場合、\fBshow-bridge\fR サブコマンドはブリッジの統計情報を表示します。次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBBRIDGE\fR\fR
.ad
.sp .6
.RS 4n
ブリッジ名。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDROPS\fR\fR
.ad
.sp .6
.RS 4n
リソースの問題のためにドロップされたパケットの数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFORWARDS\fR\fR
.ad
.sp .6
.RS 4n
あるリンクから別のリンクに転送されたパケットの数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMBCAST\fR\fR
.ad
.sp .6
.RS 4n
ブリッジによって処理されたマルチキャストパケットとブロードキャストパケットの数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBRECV\fR\fR
.ad
.sp .6
.RS 4n
追加されているすべてのリンク上で受信されたパケットの数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSENT\fR\fR
.ad
.sp .6
.RS 4n
追加されているすべてのリンク上で送信されたパケットの数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBUNKNOWN\fR\fR
.ad
.sp .6
.RS 4n
不明な宛先を含んだ処理済みパケットの数。これらのパケットはすべてのリンクに送信されます。
.RE

デフォルトでは、\fB-o\fR オプションが指定されていない場合、\fBBRIDGE\fR、\fBDROPS\fR、および \fBFORWARDS\fR フィールドのみが表示されます。
.sp
\fBshow-bridge\fR サブコマンドでは、次のオプションも使用できます。
.sp
.ne 2
.mk
.na
\fB\fB-l\fR, \fB--link\fR\fR
.ad
.sp .6
.RS 4n
1 つのブリッジインスタンスに追加されているすべてのリンクについて、リンク関連のステータスと統計情報を表示します。\fB-s\fR オプションを指定せずにこのオプションを使用すると、リンクごとに次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
リンク名。
.RE

.sp
.ne 2
.mk
.na
\fB\fBINDEX\fR\fR
.ad
.sp .6
.RS 4n
ブリッジ上のポート (リンク) のインデックス番号。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
リンクの状態。この状態は、\fBdisabled\fR、\fBdiscarding\fR、\fBlearning\fR、\fBforwarding\fR、\fBnon-stp\fR、\fBbad-mtu\fR のいずれかになります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBUPTIME\fR\fR
.ad
.sp .6
.RS 4n
最後のリセットまたは初期化からの秒数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOPERCOST\fR\fR
.ad
.sp .6
.RS 4n
使用されている実際のコスト (1 - 65535)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOPERP2P\fR\fR
.ad
.sp .6
.RS 4n
これは、ポイントツーポイント (\fBP2P\fR) モードが検出されたかどうかを示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOPEREDGE\fR\fR
.ad
.sp .6
.RS 4n
これは、エッジモードが検出されたかどうかを示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDESROOT\fR\fR
.ad
.sp .6
.RS 4n
このポート上で確認されたルートブリッジ識別子。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDESCOST\fR\fR
.ad
.sp .6
.RS 4n
指定されたポートを経由するネットワークルートノードへのパスコスト。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDESBRIDGE\fR\fR
.ad
.sp .6
.RS 4n
このポートのブリッジ識別子。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDESPORT\fR\fR
.ad
.sp .6
.RS 4n
このポートの構成メッセージを送信するために使用されるポートの ID と優先度。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTCACK\fR\fR
.ad
.sp .6
.RS 4n
これは、トポロジ変更確認応答が検出されたかどうかを示します。
.RE

\fB-o\fR オプションなしで \fB-l\fR オプションが指定されている場合、\fBLINK\fR、\fBSTATE\fR、\fBUPTIME\fR、および \fBDESROOT\fR フィールドのみが表示されます。
.sp
\fB-l\fR オプションが指定されている場合、\fB-s\fR オプションを使用すると、リンクごとに次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
リンク名。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCFGBPDU\fR\fR
.ad
.sp .6
.RS 4n
受信された構成 BPDU の数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTCNBPDU\fR\fR
.ad
.sp .6
.RS 4n
受信されたトポロジ変更 BPDU の数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBRSTPBPDU\fR\fR
.ad
.sp .6
.RS 4n
受信された Rapid Spanning Tree BPDU の数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTXBPDU\fR\fR
.ad
.sp .6
.RS 4n
送信された BPDU の数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDROPS\fR\fR
.ad
.sp .6
.RS 4n
リソースの問題のためにドロップされたパケットの数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBRECV\fR\fR
.ad
.sp .6
.RS 4n
ブリッジによって受信されたパケットの数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBXMIT\fR\fR
.ad
.sp .6
.RS 4n
ブリッジによって送信されたパケットの数。
.RE

\fB-o\fR オプションが指定されていない場合、\fBLINK\fR、\fBDROPS\fR、\fBRECV\fR、および \fBXMIT\fR フィールドのみが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR, \fB--forwarding\fR\fR
.ad
.sp .6
.RS 4n
1 つのブリッジインスタンスの転送エントリを表示します。このオプションを使用すると、転送エントリごとに次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBDEST\fR\fR
.ad
.sp .6
.RS 4n
着信先 MAC アドレス。
.RE

.sp
.ne 2
.mk
.na
\fB\fBAGE\fR\fR
.ad
.sp .6
.RS 4n
エントリの有効期間 (秒およびミリ秒単位)。ローカルエントリでは省略されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFLAGS\fR\fR
.ad
.sp .6
.RS 4n
MAC アドレスが、追加されたリンクか、またはいずれかの追加されたリンク上の VNIC に属している場合は、\fBL\fR (ローカル) フラグが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOUTPUT\fR\fR
.ad
.sp .6
.RS 4n
ローカルエントリの場合、これは MAC アドレスを含む追加されたリンクの名前です。それ以外の場合、Spanning Tree Protocol を使用するブリッジでは、これは出力インタフェースの名前になります。RBridge では、これは出力 \fBTRILL\fR ニックネームになります。
.RE

\fB-o\fR オプションが指定されていない場合、\fBDEST\fR、\fBAGE\fR、\fBFLAGS\fR、および \fBOUTPUT\fR フィールドが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--trill\fR\fR
.ad
.sp .6
.RS 4n
1 つのブリッジインスタンスの \fBTRILL\fR ニックネームエントリを表示します。このオプションを使用すると、\fBTRILL\fR ニックネームエントリごとに次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBNICK\fR\fR
.ad
.sp .6
.RS 4n
この RBridge の \fBTRILL\fR ニックネーム。これは、1 - 65535 の数字です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFLAGS\fR\fR
.ad
.sp .6
.RS 4n
このニックネームでローカルシステムが識別される場合は、\fBL\fR フラグが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
この RBridge にメッセージを送信するときの出力のリンク名。
.RE

.sp
.ne 2
.mk
.na
\fB\fBNEXTHOP\fR\fR
.ad
.sp .6
.RS 4n
このニックネームを持つ RBridge に到達するために使用される次のホップの RBridge の MAC アドレス。
.RE

\fB-o\fR オプションが指定されていない場合、\fBNICK\fR、\fBFLAGS\fR、\fBLINK\fR、および \fBNEXTHOP\fR フィールドが表示されます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-vlan\fR [\fB-ft\fR] [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fI ether-link\fR \fB-v\fR \fIvid\fR[,\fIpvlan-svid\fR[,\fIpvlan-type\fR]] [\fIvlan-link\fR]\fR
.ad
.sp .6
.RS 4n
Ethernet リンク \fIether-link\fR 上に \fIvid\fR の ID を持つタグ付き VLAN リンクを作成します。VLAN リンクの名前は、\fIvlan\fR-\fIlink\fR として指定できます。この名前をゾーン名/リンク名として指定できます。これにより、指定されたゾーンの名前空間内に VLAN が作成されます。名前が指定されていない場合、次の名前が自動的に生成されます (\fIether-link\fR が \fIname\fR\fIPPA\fR であると仮定)。
.sp
.in +2
.nf
<\fIname\fR><1000 * \fIvlan-tag\fR + \fIPPA\fR>
.fi
.in -2
.sp

たとえば、\fIether-link\fR が \fBbge1\fR で \fIvid\fR が 2 の場合、生成される名前は \fBbge2001\fR になります。
.sp
.ne 2
.mk
.na
\fB\fB-f\fR、\fB-–force\fR\fR
.ad
.sp .6
.RS 4n
VLAN リンクの作成を強制します。一部のデバイスでは、VLAN ヘッダーを含めることができる大きさのフレームサイズが許可されません。このようなデバイス上に VLAN リンクを作成するには \fB-f\fR オプションが必要で、結果として得られる VLAN 上の IP インタフェースの MTU を 1500 ではなく 1496 に設定する必要があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIether-link\fR\fR
.ad
.sp .6
.RS 4n
VLAN が作成される Ethernet リンクを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
VLAN リンクを一時的なものとして指定します。一時的な VLAN リンクは、次回のリブートまで保持されます。非大域ゾーンの名前空間内に VLAN を作成する場合は、\fB-t\fR オプションを指定する必要があります。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm modify-vlan\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-l\fR \fIether-link\fR] [\fB-v\fR \fIvid\fR[,\fIpvlan-svid\fR[,\fIpvlan-type\fR]] [\fB-f\fR]] {\fIvlan-link\fR,[\fIvlan-link\fR,...] | \fB-L\fR \fIsource-ether-link\fR}\fR
.ad
.sp .6
.RS 4n
ベースとなるリンクや指定された VLAN リンクの VLAN-ID を変更します。VLAN リンクは、コンマ区切りのリストで指定することも、\fB-L\fR \fIsource-ether-link\fR として「\fIsource-ether-link\fR 上のすべての VLAN」を指定することもできます。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
VLAN の変更を一時的なものとして指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIether-link\fR\fR
.ad
.sp .6
.RS 4n
VLAN の移動先の Ethernet リンク。Ethernet リンクは、VLAN が使用している現在のリンクとは異なるものにする必要があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR \fIvid\fR, [\fIpvlan-svid\fR,[\fIpvlan-type\fR]] [\fB-f\fR] \fR
.ad
.sp .6
.RS 4n
使用する VLAN-ID を指定します。このオプションを使用できるのは、1 つの VLAN リンクが指定されている場合だけです。\fB-f\fR オプションの目的は、前述の \fBcreate-vlan\fR と同じです。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-vlan\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIvlan-link \fR\fR
.ad
.sp .6
.RS 4n
指定された VLAN リンクを削除します。
.sp
\fBdelete-vlan\fR サブコマンドで使用できるオプションは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
削除を一時的なものとして指定します。一時的な削除は、次回のリブートまで保持されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-vlan\fR [\fB-PZ\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIvlan-link \fR]\fR
.ad
.sp .6
.RS 4n
すべての VLAN リンクまたは指定された VLAN リンクの VLAN 構成を表示します。
.sp
\fBshow-vlan\fR サブコマンドで使用できるオプションは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...], \fB- -output\fR=\fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。VLAN リンクごとに、次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
VLAN リンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBVID\fR\fR
.ad
.sp .6
.RS 4n
VLAN に関連付けられた ID。または、PVLAN に関連付けられたプライマリ VID。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSVID\fR\fR
.ad
.sp .6
.RS 4n
VNIC に関連付けられた PVLAN セカンダリ VLAN ID。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPVLAN-TYPE\fR\fR
.ad
.sp .6
.RS 4n
VNIC に関連付けられた PVLAN タイプ。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOVER\fR\fR
.ad
.sp .6
.RS 4n
この VLAN が構成されている物理リンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFLAGS\fR\fR
.ad
.sp .6
.RS 4n
VLAN リンクに関連付けられたフラグのセット。指定可能なフラグは次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBf\fR\fR
.ad
.sp .6
.RS 4n
この VLAN は、\fBcreate-vlan\fR の \fB-f\fR オプションを使用して作成されました。
.RE

.sp
.ne 2
.mk
.na
\fB\fBi\fR\fR
.ad
.sp .6
.RS 4n
この VLAN は、DLPI リンクが開かれたときに暗黙的に作成されました。これらの VLAN リンクは、その DLPI リンクが最後に閉じられたときに (たとえば、その VLAN リンクに関連付けられている IP インタフェースが unplumb されたときに) 自動的に削除されます。
.RE

将来、追加のフラグが定義される可能性があります。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。\fB-p\fR には \fB-o\fR オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR, \fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
実行中のシステムの状態ではなく、永続的な VLAN 構成を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
\fBZONE\fR 列を出力に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
上記の \fBdladm show-link\fR の下にある \fB-z\fR オプションの説明を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm scan-wifi\fR [[\fB-p\fR] \fB- o\fR \fIfield\fR[,...]] [\fIwifi-link\fR] \fR
.ad
.sp .6
.RS 4n
すべての \fBWiFi\fR リンク上、または指定された \fIwifi-link\fR 上のみにある \fBWiFi\fR ネットワークをスキャンします。
.sp
デフォルトでは、\fBBSSTYPE\fR を除く現在のすべてのフィールドが表示されます。
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...], \fB- -output\fR=\fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。見つかった \fBWiFi\fR ネットワークごとに、次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
\fBWiFi\fR ネットワークが存在するリンクの名前。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBESSID\fR\fR
.ad
.sp .6
.RS 4n
\fBWiFi\fR ネットワークの \fBESSID\fR (名前)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBSSID\fR\fR
.ad
.sp .6
.RS 4n
\fBWiFi\fR ネットワークのアクセスポイントのハードウェアアドレス (\fBBSS\fR ネットワークの場合)、または \fBWiFi\fR ネットワークのランダムに生成された一意のトークン (\fBIBSS\fR ネットワークの場合) のどちらか。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSEC\fR\fR
.ad
.sp .6
.RS 4n
\fBnone\fR (セキュリティーを使用しない \fBWiFi\fR ネットワークの場合)、\fBwep\fR (WEP (Wired Equivalent Privacy) が必要な \fBWiFi\fR ネットワークの場合)、または \fBwpa\fR (WPA (Wi-Fi Protected Access) が必要な WiFi ネットワークの場合) のいずれか。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMODE\fR\fR
.ad
.sp .6
.RS 4n
サポートされている接続モード (\fBa\fR、\fBb\fR、\fBg\fR、\fBn\fR のうちの 1 つまたは複数)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTRENGTH\fR\fR
.ad
.sp .6
.RS 4n
信号の強さ (\fBexcellent\fR、\fBvery good\fR、\fBgood\fR、\fBweak\fR、\fBvery weak\fR のうちのいずれか)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSPEED\fR \fR
.ad
.sp .6
.RS 4n
\fBWiFi\fR ネットワークの最大速度 (Mbps 単位)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBSSTYPE\fR\fR
.ad
.sp .6
.RS 4n
\fBbss\fR (\fBBSS\fR (インフラストラクチャー) ネットワークの場合)、または \fBibss\fR (\fBIBSS\fR (アドホック) ネットワークの場合) のどちらか。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。\fB-p\fR には \fB-o\fR オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm connect-wifi\fR [\fB-e\fR \fI essid\fR] [\fB-i\fR \fIbssid\fR] [\fB-k\fR \fIkey\fR,...] [\fB-s\fR \fB none\fR | \fBwep\fR | \fBwpa\fR] [\fB-a\fR \fB open\fR|\fBshared\fR] [\fB-b\fR \fBbss\fR|\fB ibss\fR] [\fB-c\fR] [\fB-m\fR \fBa\fR|\fB b\fR|\fBg\fR|\fBn\fR] [\fB-T\fR \fI time\fR] [\fIwifi-link\fR]\fR
.ad
.sp .6
.RS 4n
\fBWiFi\fR ネットワークに接続します。これは、\fI検出\fR、\fIフィルタ処理\fR、\fI優先順位付け\fR、および\fI関連付け\fRの 4 つの手順で構成されます。ただし、非ブロードキャスト \fBWiFi\fR ネットワークへの接続を可能にし、パフォーマンスを向上させるために、\fB-e\fR または \fB-i\fR オプションを使用して \fBBSSID\fR または \fBESSID\fR が指定されている場合、最初の 3 つの手順は省略され、\fBconnect-wifi\fR は、指定された残りのパラメータに一致する \fBBSSID\fR または \fBESSID\fR への関連付けをただちに試みます。この関連付けが失敗したものの、指定された条件に一致するほかのネットワークが存在する可能性がある場合は、後述する従来の発見プロセスが開始されます。 
.sp
発見の手順では、指定された WiFi リンク上の使用可能なすべての \fBWiFi\fR ネットワークが検索されますが、この段階では接続を実行してはいけません。管理の便宜上、システム上に \fBWiFi\fR リンクが 1 つしか存在しない場合は、\fIwifi-link\fR を省略できます。
.sp
検出が完了すると、次のオプションの値に従ってネットワークのリストがフィルタ処理されます。 
.sp
.ne 2
.mk
.na
\fB\fB-e\fR \fIessid,\fR \fB- -essid\fR=\fIessid\fR\fR
.ad
.sp .6
.RS 4n
同じ \fIessid\fR を持たないネットワークがフィルタ処理によって除外されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-b\fR \fBbss\fR|\fBibss\fR, \fB- -bsstype\fR=\fBbss\fR|\fBibss\fR\fR
.ad
.sp .6
.RS 4n
同じ \fBbsstype\fR を持たないネットワークがフィルタ処理によって除外されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fBa\fR|\fBb\fR|\fB g\fR, \fB--mode\fR=\fBa\fR|\fBb\fR|\fB g\fR|\fBn\fR\fR
.ad
.sp .6
.RS 4n
指定された 802.11 モードに適していないネットワークがフィルタ処理によって除外されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR \fIkey,...\fR, \fB- -key\fR=\fIkey, ...\fR\fR
.ad
.sp .6
.RS 4n
キーで指定された \fBsecobj\fR を使用してネットワークに接続します。指定されたキーに適していないネットワークがフィルタ処理によって除外されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fBnone\fR|\fBwep\fR|\fB wpa\fR, \fB--sec\fR=\fBnone\fR|\fBwep\fR|\fB wpa\fR\fR
.ad
.sp .6
.RS 4n
指定されたセキュリティーモードに適していないネットワークがフィルタ処理によって除外されます。
.RE

次に、残りのネットワークが、最初に信号強度で、次に最大速度で優先付けされます。最後に、リスト内の各ネットワークに (順番に) 関連付けする試みが、1 つのネットワークで成功するか、または残りのネットワークがなくなるまで行われます。 
.sp
前述のオプションに加えて、次のオプションも \fBconnect-wifi\fR の動作を制御します。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fBopen\fR|\fBshared\fR, \fB- -auth\fR=\fBopen\fR|\fBshared\fR\fR
.ad
.sp .6
.RS 4n
指定された認証モードを使用して接続します。デフォルトでは、\fBopen\fR と \fBshared\fR が順番に試行されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR, \fB--create-ibss\fR\fR
.ad
.sp .6
.RS 4n
指定された \fBESSID\fR に一致するアドホックネットワークが見つからない場合に、新しいアドホックネットワークを作成するために \fB-b ibss\fR とともに使用されます。\fBESSID\fR が指定されていない場合、\fB-c -b ibss\fR は、常に新しいアドホックネットワークの作成を開始します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fItime\fR, \fB--timeout \fR=\fItime\fR\fR
.ad
.sp .6
.RS 4n
関連付けが成功するまで待機する秒数を指定します。\fItime\fR を \fBforever\fR にすると、関連付けを無期限に待機します。現在のデフォルト値は 10 秒ですが、将来変更される可能性があります。デフォルト値より短いタイムアウトは、成功しない可能性があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR \fIkey,...\fR, \fB- -key\fR=\fIkey,...\fR\fR
.ad
.sp .6
.RS 4n
前述のフィルタ処理に加えて、関連付けが確実に行われるようにするために、指定されたキーが使用されます。使用するセキュリティーモードはキークラスに基づきます。セキュリティーモードが明示的に指定された場合、そのセキュリティーモードはキークラスと互換性を持っている必要があります。すべてのキーが同じクラスに属している必要があります。 
.sp
複数のキースロットをサポートするセキュリティーモードの場合、キーを格納するスロットは、コロンとそれに続くインデックスで指定されます。したがって、\fB-k mykey:3\fR と指定すると、\fBmykey\fR がスロット 3 に格納されます。デフォルトでは、スロット 1 とみなされます。複数のキーをサポートするセキュリティーモードの場合、最初のキーをアクティブなキーにしたコンマ区切りリストを指定できます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm disconnect-wifi\fR [\fB-a\fR] [\fIwifi-link\fR]\fR
.ad
.sp .6
.RS 4n
1 つ以上の \fBWiFi\fR ネットワークとの接続を切断します。接続済みの \fBWiFi\fR リンクが \fIwifi-link\fR で指定されている場合は、そのリンクが切断されます。管理の便宜上、\fBWiFi\fR リンクが 1 つしか接続されていない場合は、\fIwifi-link\fR を省略できます。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR, \fB--all-links\fR\fR
.ad
.sp .6
.RS 4n
すべての接続されているリンクを切断します。これは、スクリプトによる使用を主に想定しています。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-wifi\fR [\fB-Z\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR,...] [\fB-z\fR \fIzone\fR[,...]] [\fIwifi-link \fR]\fR
.ad
.sp .6
.RS 4n
すべての \fBWiFi\fR リンクまたは指定されたリンク \fIwifi-link\fR の \fBWiFi\fR 構成情報を表示します。
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield,...\fR, \fB- -output\fR=\fIfield\fR\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。\fBWiFi\fR リンクごとに、次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
表示されているリンクの名前。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATUS\fR\fR
.ad
.sp .6
.RS 4n
\fBconnected\fR (リンクが接続されている場合)、または \fBdisconnected\fR (リンクが接続されていない場合) のどちらか。リンクが切断されている場合は、残りのすべてのフィールドに値 \fB--\fR が表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBESSID\fR\fR
.ad
.sp .6
.RS 4n
接続されている \fBWiFi\fR ネットワークの \fBESSID\fR (名前)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBSSID\fR\fR
.ad
.sp .6
.RS 4n
\fBWiFi\fR ネットワークのアクセスポイントのハードウェアアドレス (\fBBSS\fR ネットワークの場合)、または \fBWiFi\fR ネットワークのランダムに生成された一意のトークン (\fBIBSS\fR ネットワークの場合) のどちらか。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSEC\fR\fR
.ad
.sp .6
.RS 4n
\fBnone\fR (セキュリティーを使用しない \fBWiFi\fR ネットワークの場合)、\fBwep\fR (WEP が必要な \fBWiFi\fR ネットワークの場合)、または \fBwpa\fR (WPA が必要な WiFi ネットワークの場合) のいずれか。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMODE\fR\fR
.ad
.sp .6
.RS 4n
サポートされている接続モード (\fBa\fR、\fBb\fR、\fBg\fR、\fBn\fR のうちの 1 つまたは複数)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTRENGTH\fR\fR
.ad
.sp .6
.RS 4n
接続の強さ (\fBexcellent\fR、\fBvery good\fR、\fBgood\fR、\fBweak\fR、\fBvery weak\fR のうちのいずれか)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSPEED\fR \fR
.ad
.sp .6
.RS 4n
接続速度 (Mbps 単位)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBAUTH\fR\fR
.ad
.sp .6
.RS 4n
\fBopen\fR または \fBshared\fR のどちらか (\fBconnect-wifi\fR を参照)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBSSTYPE\fR\fR
.ad
.sp .6
.RS 4n
\fBbss\fR (\fBBSS\fR (インフラストラクチャー) ネットワークの場合)、または \fBibss\fR (\fBIBSS\fR (アドホック) ネットワークの場合) のどちらか。
.RE

デフォルトでは、現在、\fBAUTH\fR、\fBBSSID\fR、\fBBSSTYPE\fR を除くすべてのフィールド表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。\fB-p\fR には \fB-o\fR オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
\fBZONE\fR 列を出力に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
上記の \fBdladm show-link\fR の下にある \fB-z\fR オプションの説明を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-ether\fR [\fB-xZ\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR,...] [\fB-z\fR \fIzone\fR[,...]] [\fB-P\fR \fI protocol\fR] [\fIether-link\fR]\fR
.ad
.sp .6
.RS 4n
すべての物理 Ethernet リンクまたは指定された物理 Ethernet リンクの状態情報を表示します。
.sp
\fBshow-ether\fR サブコマンドで使用できるオプションは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR,..., \fB- -output\fR=\fIfield\fR\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。リンクごとに、次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
表示されているリンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPTYPE\fR\fR
.ad
.sp .6
.RS 4n
パラメータのタイプ。ここで、\fBcurrent\fR はリンクのネゴシエーションの状態を、\fBcapable\fR はデバイスでサポートされている機能を、\fBadv\fR は通知された機能を、\fBpeeradv\fR はリンクパートナーによって通知された機能を示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
データリンクの物理リンク状態。これは、up、down、unknown のいずれかにできます。物理リンク状態は、物理デバイスに外部ネットワークとの接続があるかどうか (ケーブルが接続され、そのケーブルの反対側にあるポートの状態が「up」の場合は接続がある) を識別します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBAUTO\fR\fR
.ad
.sp .6
.RS 4n
自動ネゴシエーションが通知されるかどうかを示す \fByes\fR/\fBno\fR の値。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSPEED-DUPLEX\fR\fR
.ad
.sp .6
.RS 4n
指定可能な速度と二重通信の値の組み合わせ。速度の単位は、\fBG\fR (Gbps) または \fBM\fR (Mbps) の接尾辞でエンコードされます。二重通信の値は、\fBf\fR (全二重) または \fBh\fR (半二重) としてエンコードされます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPAUSE\fR\fR
.ad
.sp .6
.RS 4n
フロー制御情報。\fBno\fR (フロー制御が使用できないことを示す場合)、\fBtx\fR (エンドポイントは一時停止フレームを送信できるものの、受信した一時停止フレームをすべて無視することを示す場合)、\fBrx\fR (エンドポイントは一時停止フレームを受信し、受信した一時停止フレームに基づいて動作することを示す場合)、\fBbi\fR (双方向のフロー制御を示す場合) のいずれかです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBREM_FAULT\fR\fR
.ad
.sp .6
.RS 4n
障害検出情報。有効な値は \fBnone\fR または \fBfault\fR です。
.RE

デフォルトでは、\fBREM_FAULT\fR を除くすべてのフィールドが「現在」の \fBPTYPE\fR で表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。\fB-p\fR には \fB-o\fR オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fIprotocol\fR\fR
.ad
.sp .6
.RS 4n
サポートされている Ethernet プロトコルの情報を表示します。サポートされるプロトコルには、\fBvdp\fR (VSI Discovery and Configuration Protocol) および \fBecp\fR (Edge Control Protocol) が含まれます。
.sp
VDP 情報は VNIC に固有です。このため、リンク引数が \fBphys-link\fR の場合、\fBphys-link\fR 上の全 VNIC の VDP 情報が表示されます。
.sp
ECP 情報は、\fBphys-link\fR に固有です。
.sp
VDP の場合、次の情報が表示されます:
.sp
.ne 2
.mk
.na
\fB\fBVSI\fR\fR
.ad
.sp .6
.RS 4n
Virtual Station Interface (VSI) または VNIC の名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
この VNIC が構成されている物理リンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBVSI-STATE\fR\fR
.ad
.sp .6
.RS 4n
VNIC の VDP プロトコル状態マシン。サポートされる状態には、\fBASSOC\fR、\fBDEASSOC\fR、\fBTIMEDOUT\fR が含まれます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBVSIID\fR\fR
.ad
.sp .6
.RS 4n
VSI または VNIC の識別子。この識別子は、ブリッジによりプロパティーを VNIC に関連付けるために使用されます。サポートされる VSIID の形式は、MAC アドレスです。このため、VNIC の VSIID はその MAC アドレスになります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBVSI-TYPEID\fR\fR
.ad
.sp .6
.RS 4n
これは、VNIC に関連付けられた VSI タイプ ID およびバージョンであり、VSI タイプ ID/バージョンの形式になります。VSI タイプは、VNIC に関連付けられたプロパティーを識別します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCMD-PENDING\fR\fR
.ad
.sp .6
.RS 4n
現在進行中の VDP コマンド。サポートされるコマンドは: \fBASSOC\fR、\fBDEASSOC\fR です。\fBASSOC\fR コマンドは、プロパティーを VSI (VSIID により識別される) と関連付けるようブリッジにリクエストし、\fBDEASSOC\fR は、指定されたプロパティーと VSIID との関連付けを解除するようブリッジにリクエストします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFILTER-INFO\fR\fR
.ad
.sp .6
.RS 4n
特定の VNIC へのパケットをフィルタ処理するために、スイッチが使用する情報。サポートされるフィルタ情報の形式には、MAC/VLAN ID の組み合わせが含まれます。このため、VNIC の \fBFilterInfo\fR はその MAC アドレスおよび VLAN ID (存在する場合) になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBKEEPALIVE-INTERVAL\fR\fR
.ad
.sp .6
.RS 4n
既存の関連付けに対してキープアライブメッセージが送信される間隔 (秒)。デフォルトは 11.6 秒です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBRESP-TIMEOUT\fR\fR
.ad
.sp .6
.RS 4n
リクエストがタイムアウトするまで、ブリッジからの応答を待機する時間 (秒)。
.RE

ECP の場合、次の情報が表示されます:
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
ECP インスタンスの物理リンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMAC-RETRIES\fR\fR
.ad
.sp .6
.RS 4n
ピアからの肯定応答を受信せずに転送を再試行する回数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTIMEOUT\fR\fR
.ad
.sp .6
.RS 4n
ピアからの肯定応答を待機する時間間隔 (ミリ秒)。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR, \fB--extended\fR\fR
.ad
.sp .6
.RS 4n
\fBcurrent\fR、\fBcapable\fR、\fBadv\fR、および \fBpeeradv\fR の \fBPTYPE\fR 値に対して、拡張出力が表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
\fBZONE\fR 列を出力に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
上記の \fBdladm show-link\fR の下にある \fB-z\fR オプションの説明を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm set-linkprop\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-p\fR \fI prop\fR=\fIvalue\fR[,...] \fIlink\fR\fR
.ad
.sp .6
.RS 4n
指定されたリンク上の 1 つ以上のプロパティーの値を設定します。プロパティーとそれらのプロパティーで指定可能なリストは、リンクタイプ、ネットワークデバイスドライバ、およびネットワーキングハードウェアによって異なります。これらのプロパティーは、\fBshow-linkprop\fR を使用すると取得できます。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
変更を一時的なものとして指定します。一時的な変更は、次回のリブートまで保持されます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIprop\fR=\fI value\fR[,...], \fB--prop\fR \fIprop\fR=\fI value\fR[,...]\fR
.ad
.br
.na
\fB\fR
.ad
.sp .6
.RS 4n
指定された値に設定するプロパティーのコンマ区切りのリスト。
.RE

永続的な値が設定されると、一時的な値が同じ値に変更されることに注意してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm reset-linkprop\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-p\fR \fI prop\fR,...] \fIlink\fR\fR
.ad
.sp .6
.RS 4n
1 つ以上のプロパティーを、指定されたリンク上のそれらの値にリセットします。プロパティーは、起動時に設定されていた値にリセットされます。プロパティーが指定されていない場合、すべてのプロパティーがリセットされます。プロパティーについては、\fBshow-linkprop\fR を参照してください。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
リセットを一時的なものとして指定します。値はデフォルト値にリセットされます。一時的なリセットは、次回のリブートまで保持されます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIprop, ...\fR, \fB- –prop\fR=\fIprop, ...\fR\fR
.ad
.sp .6
.RS 4n
リセットするプロパティーのコンマ区切りのリスト。
.RE

永続的な値がリセットされると、一時的な値は同じ値に変更されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-linkprop\fR [\fB-HPZ\fR] [[\fB-c\fR] \fB-o\fR \fIfield\fR[,...]][\fB- p\fR \fIprop\fR[,...]] [\fB-z\fR \fI zone\fR[,...]] [\fIlink\fR]\fR
.ad
.sp .6
.RS 4n
すべてのデータリンクまたは指定されたリンクについて、1 つ以上のプロパティーの現在の値または永続的な値を表示します。デフォルトでは、現在の値が表示されます。プロパティーが指定されていない場合、使用可能なすべてのリンクプロパティーが表示されます。プロパティーごとに、次のフィールドが表示されます。
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...], \fB- -output\fR=\fIfield\fR\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。リンクごとに、次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
データリンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPROPERTY\fR\fR
.ad
.sp .6
.RS 4n
プロパティーの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPERM\fR\fR
.ad
.sp .6
.RS 4n
プロパティーの読み取り権と書き込み権。表示される値は \fBro\fR または \fBrw\fR のいずれかです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBVALUE\fR\fR
.ad
.sp .6
.RS 4n
現在の (または永続的な) プロパティー値。値が設定されていない場合は、\fB--\fR と表示されます。値が不明な場合は、\fB?\fR と表示されます。設定されていないか、またはリセットされた永続的な値は \fB--\fR と表示され、システムの \fBDEFAULT\fR 値 (ある場合) を使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBEFFECTIVE\fR\fR
.ad
.sp .6
.RS 4n
システムによって選択されるプロパティー値。一部のプロパティーでは、システムによって選択される値が、ユーザーが構成した値と同じでない場合があります。これは、そのプロパティー値がリソースの可用性、ベースとなる物理データリンクの機能、または場合によってはデータリンクのパートナーによって制約されるためです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDEFAULT\fR\fR
.ad
.sp .6
.RS 4n
プロパティーのデフォルト値。プロパティーにデフォルト値がない場合は、\fB--\fR が表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPOSSIBLE\fR\fR
.ad
.sp .6
.RS 4n
プロパティーに設定できる値のコンマ区切りのリスト。値が数値の範囲にまたがる場合は、短縮形として \fImin\fR - \fImax\fR が表示される可能性があります。指定可能な値が不明または無限の場合は、\fB--\fR が表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBHWPOSSIBLE\fR\fR
.ad
.sp .6
.RS 4n
ハードウェアサポートがある場合は値が表示されます。これは、物理 NIC にプロパティーを指定できることを示します。\fB--\fR の値は、サポートがないことを意味します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSWPOSSIBLE\fR\fR
.ad
.sp .6
.RS 4n
capable ネットワークスタックでプロパティーに関するソフトウェアサポートがある場合に値が示されます。\fB--\fR の値は、サポートがないことを意味します。
.sp
\fBHWPOSSIBLE\fR と \fBSWPOSSIBLE\fR の両方で、数値範囲と \fB:\fR のあとに、値の粒度要件 (ステップ値) が示されます。現在、\fBmaxbw\fR プロパティーのみにステップ値の値が示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMODE\fR\fR
.ad
.sp .6
.RS 4n
プロパティーを実装するためにデータリンクに使用される現在のモードが示されます。可能な値、\fBsw\fR (ソフトウェアのみ)、\fBhw\fR (ハードウェアのみ)、および \fBnone\fR (サポートなし) をリンクに対して指定できます。ハードウェアサポートまたはソフトウェアサポートがあっても \fBMODE\fR に \fBnone\fR を指定できます。
.RE

現在、\fBHWFLAGS\fR および \fBSWFLAGS\fR では、アウトバウンドには \fBo\fR、インバウンドには \fBi\fR、インバウンドとアウトバウンドには \fBoi\fR のフラグが示されます。現在、\fBSLA properties\fR、\fBmaxbw\fR、\fBbwshare\fR、および \fBpriority\fR の値のみが示されます。
.sp
プロパティーのリストはリンクタイプやネットワークデバイスドライバによって異なり、特定のプロパティーに対して指定可能な値はさらに、基本となるネットワークハードウェアやその状態によって異なります。一般的なリンクのプロパティーについては、「一般的なリンクのプロパティー」のセクションで説明されています。ただし、「\fB_\fR」(下線) で始まるリンクプロパティーは特定のリンクまたはその基礎となるネットワークデバイスに固有であり、変更または削除される可能性があります。詳細については、該当するネットワークデバイスドライバのマニュアルページを参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。このオプションには \fB-o\fR オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR \fR
.ad
.sp .6
.RS 4n
show-linkprop \fB-H\fR は、プロパティーのサポートについて基盤となる物理リンク機能とネットワークスタックソフトウェア機能に関する情報を示します。また、データリンクに対して現在使用されているモードを示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR, \fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
永続的なリンクプロパティーの情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIprop, ...\fR, \fB- -prop\fR=\fIprop, ...\fR\fR
.ad
.sp .6
.RS 4n
表示するプロパティーのコンマ区切りのリスト。サブコマンドの説明に続くリンクプロパティーのセクションを参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
\fBZONE\fR 列を出力に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
上記の \fBdladm show-link\fR の下にある \fB-z\fR オプションの説明を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-secobj\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-f\fR \fI file\fR] \fB-c\fR \fIclass\fR \fI secobj\fR\fR
.ad
.sp .6
.RS 4n
指定された \fIclass\fR 内に、暗号化されたネットワークへの接続時に WEP または WPA キーとしてあとで使用される \fIsecobj\fR という名前のセキュリティー保護されたオブジェクトを作成します。セキュリティー保護されたオブジェクトの値は、対話形式で指定することも、ファイルから読み取ることもできます。対話形式のプロンプトの並びやファイル形式は、セキュリティー保護されたオブジェクトのクラスによって異なります。 
.sp
現在、\fBwep\fR クラスと \fBwpa\fR クラスがサポートされています。\fBWEP\fR (Wired Equivalent Privacy) キーには、5 または 13 バイト長のいずれかを指定できます。\fBASCII\fR 文字列または 16 進文字列として指定できるため、\fB12345\fR と \fB0x3132333435\fR は同じ 5 バイトキーです (接頭辞 \fB0x\fR は省略できます)。\fBWEP\fR キーを含むファイルは、いずれかの \fBWEP\fR キー形式を使用した 1 行で構成されている必要があります。WPA (Wi-Fi Protected Access) キーは、8 - 63 バイトまでの長さを持つ ASCII 文字列として指定する必要があります。
.sp
このサブコマンドは、「ネットワークリンクセキュリティー」\fBRBAC\fR プロファイルに属しているユーザーまたは役割のみが使用できます。
.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIclass\fR, \fB- -class\fR=\fIclass\fR\fR
.ad
.sp .6
.RS 4n
\fIclass\fR は \fBwep\fR または \fBwpa\fR のいずれかです。前の説明を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
作成を一時的なものとして指定します。一時的な作成は、次回のリブートまで保持されます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIfile\fR, \fB--file \fR=\fIfile\fR\fR
.ad
.sp .6
.RS 4n
セキュリティー保護されたオブジェクトの値を取得するために使用するべきファイルを指定します。このファイルの形式は、セキュリティー保護されたオブジェクトのクラスによって異なります。このオプションを使用して \fBWEP\fR キーを設定する例については、「使用例」のセクションを参照してください。\fB\fR
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-secobj\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIsecobj\fR[,...] \fR
.ad
.sp .6
.RS 4n
指定された 1 つ以上のセキュリティー保護されたオブジェクトを削除します。このサブコマンドは、「ネットワークリンクセキュリティー」\fBRBAC\fR プロファイルに属しているユーザーまたは役割のみが使用できます。 
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
削除を一時的なものとして指定します。一時的な削除は、次回のリブートまで保持されます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-secobj\fR [\fB-P\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fIsecobj\fR,...]\fR
.ad
.sp .6
.RS 4n
セキュリティー保護された現在のオブジェクトまたは永続オブジェクトの情報を表示します。1 つ以上のセキュリティー保護されたオブジェクトが指定されている場合は、各オブジェクトの情報が表示されます。それ以外の場合は、セキュリティー保護された現在のオブジェクトまたは永続オブジェクトがすべて表示されます。
.sp
デフォルトでは、セキュリティー保護された現在のオブジェクトが表示されます。これは、永続的に作成されてから一時的に削除されていないか、または一時的に作成されたすべてのセキュリティー保護されたオブジェクトです。
.sp
セキュリティー上の理由から、セキュリティー保護されたオブジェクトの値を表示することはできません。 
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...], \fB--output\fR=\fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれかである必要があります。表示されるセキュリティー保護されたオブジェクトの場合は、次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBOBJECT\fR\fR
.ad
.sp .6
.RS 4n
セキュリティー保護されたオブジェクトの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCLASS\fR\fR
.ad
.sp .6
.RS 4n
セキュリティー保護されたオブジェクトのクラス。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。\fB-p\fR には \fB-o\fR オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR, \fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
セキュリティー保護された永続オブジェクトの情報を表示します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-vnic\fR [\fB-t\fR] [\fB-f\fR] \fB- l\fR \fIlink\fR [\fB-R\fR \fIroot-dir \fR] [\fB-m\fR \fIvalue\fR | auto | {factory [\fB-n\fR \fIslot-identifier\fR]} | {vrrp \fB-A\fR {inet | inet6} \fB-V\fR \fIvrid\fR} | {random [\fB-r\fR \fIprefix\fR]}] [\fB-v\fR \fI vlan-id\fR] [\fB-P\fR \fIpkey\fR] [\fB-p\fR prop=value[,...]] \fIvnic-link\fR\fR
.ad
.sp .6
.RS 4n
指定されたリンク上に \fIvnic-link\fR という名前の VNIC を作成します。\fIvnic-link\fR をゾーン名/リンク名として指定できます。これにより、指定されたゾーンの名前空間内に VLAN が作成されます。 
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB-–temporary\fR\fR
.ad
.sp .6
.RS 4n
VNIC を一時的なものとして指定します。一時的な VNIC は、次回のリブートまで保持されます。非大域ゾーンの名前空間内に VNIC を作成する場合は、\fB-t\fR オプションを指定する必要があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR, \fB--force\fR\fR
.ad
.sp .6
.RS 4n
VNIC が IPoIB VNIC の場合は、\fIpkey\fR がポート上に存在しない場合、マルチキャストグループが存在しない場合、またはポートが停止している場合でも、VNIC を強制的に作成します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- –root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIlink\fR, \fB-–link \fR=\fIlink\fR\fR
.ad
.sp .6
.RS 4n
\fIlink\fR には、物理リンク、\fBetherstub\fR、またはアグリゲーションリンク (\fIaggr-link\fR) を指定できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fIvalue\fR | \fI keyword\fR, \fB-–mac-address\fR=\fIvalue\fR | \fI keyword\fR\fR
.ad
.sp .6
.RS 4n
このオプションは Ethernet VNIC にのみ当てはまります。
.sp
指定された値またはキーワードに基づいて VNIC の MAC アドレスを設定します。\fIvalue\fR がキーワードでない場合は、ユニキャスト MAC アドレスとして解釈されます。これは、基礎となる NIC にとって有効なアドレスである必要があります。ユーザー指定の MAC アドレスは、MAC アドレスのグローバルで一意のタイプおよびローカルで管理されるタイプによって指定された範囲から取得する必要があります。
.sp
次の特殊なキーワードを使用できます。
.sp
.ne 2
.mk
.na
\fBfactory [\fB-n\fR \fIslot-identifier\fR], \fR
.ad
.br
.na
\fBfactory [\fB-–slot\fR=\fIslot-identifier\fR] \fR
.ad
.sp .6
.RS 4n
ファクトリ MAC アドレスを VNIC に割り当てます。ファクトリ MAC アドレスが要求される場合は、\fB-m\fR を \fB-n\fR オプションと組み合わせて、MAC アドレススロットを指定して使用できます。\fB-n\fR が指定されていない場合、システムは、次に使用可能なファクトリ MAC アドレスを選択します。\fBshow-phys\fR サブコマンドの \fB-m\fR オプションを使用すると、ファクトリ MAC アドレス、そのスロット識別子、およびその可用性を一覧表示できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fR
.ad
.br
.na
\fB\fBrandom\fR [\fB-r\fR \fI prefix\fR],\fR
.ad
.br
.na
\fBrandom [\fB-–mac-prefix\fR=\fI prefix\fR]\fR
.ad
.sp .6
.RS 4n
ランダムな MAC アドレスを VNIC に割り当てます。ローカルビットが設定された有効な IEEE OUI で構成されたデフォルトの接頭辞が使用されます。その接頭辞は、\fB-r\fR オプションを使用すると上書きできます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvrrp\fR \fB-A\fR {\fBinet\fR | \fB inet6\fR} \fB-V\fR \fIvrid\fR\fR
.ad
.sp .6
.RS 4n
指定されたアドレスファミリと \fIvrid\fR に基づいて、VRRP 仮想 MAC アドレスを VNIC に割り当てます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBauto\fR\fR
.ad
.sp .6
.RS 4n
最初に、ファクトリ MAC アドレスの使用を試みます。どれも使用できない場合は、ランダムな MAC アドレスを割り当てます。\fB-m\fR オプションが指定されていない場合は、\fBauto\fR がデフォルトの動作です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR \fIvlan-id\fR\fR
.ad
.sp .6
.RS 4n
このオプションは Ethernet VNIC にのみ当てはまります。
.sp
この VNIC の VLAN タグ付けを有効にします。VLAN タグには、ID \fIvlan-id\fR が割り当てられます。
.LP
注 - 
.sp
.RS 2
EoIB (Ethernet-over-Infiniband) データリンク上に VNIC を作成するとき、InfiniBand ゲートウェイスイッチの \fBdisallowhostconfig\fR または \fBallowhostconfig\fR コマンドの直後に \fBdladm create-vnic\fR を実行すると失敗する可能性があります。これらのコマンドはゲートウェイのブリッジマネージャーを再起動して、ゲートウェイとホストの間で一連の非同期イベントをトリガーします。そのようなイベントの完了にはしばらく時間がかかり、その途中でホストが VNIC の作成を要求すると拒否されます。
.LP
これを防ぐには、\fBdisallowhostconfig\fR または \fBallowhostconfig\fR コマンドが戻ったあと、しばらく待ってから \fBcreate-vnic\fR コマンドを実行します。
.RE
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR, \fB--pkey=pkey\fR\fR
.ad
.sp .6
.RS 4n
使用するパーティションキー。このオプションは IPoIB VNIC には必須で、ほかのタイプのリンクには適用できません。指定された \fIpkey\fR は、接頭辞 0x が付いているかどうかにかかわらず、常に 16 進数として扱われます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIprop\fR=\fI value\fR,..., \fB-–prop\fR \fIprop\fR=\fI value\fR,...\fR
.ad
.sp .6
.RS 4n
指定された値に設定するプロパティーのコンマ区切りのリスト。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fR
.ad
.br
.na
\fB\fBdladm create-vnic\fR \fB-t\fR \fB-c\fR <\fIevsname\fR>[/<\fIvportname\fR>] [\fB-T\fR <\fItenant\fR>] <\fIvnic-link\fR>\fR
.ad
.sp .6
.RS 4n
.LP
注 - 
.sp
.RS 2
この形式の \fBcreate-vnic\fR を使用するためにエラスティック仮想スイッチ (EVS) IPS パッケージをインストールしたあと、\fBevsadm\fR(1M) のマニュアルページおよび\fI『Managing Network Virtualization and Network Resources in Oracle Solaris 11.3 』\fRに説明されているように EVS コントローラを構成する必要があります。 
.RE
必要に応じて指定された仮想ポート (VPort) \fIvportname\fR で EVS \fIevsname\fR に接続することにより、\fIvnic-link\fR という名前の VNIC を作成します。\fItenantname\fR が指定されている場合は、テナントの名前空間内で EVS が検索されます。VPort が指定されている場合は、その VPort の SLA プロパティー (\fBmaxbw\fR、\fBcos\fR、および \fBpriority\fR)、IP アドレス、および MAC アドレスが VNIC に継承されます。VPort が指定されていない場合は、EVS コントローラにより、EVS の IP アドレス、MAC アドレス、およびデフォルトの SLA プロパティーを持つシステム VPort が生成されたあと、VNIC がこのシステム VPort に接続されます。
.sp
EVS に接続されたときの VNIC には次の制限があります (\fBdladm\fR によってそれらをどのように管理できるかという観点から)。
.RS +4
.TP
.ie t \(bu
.el o
\fBdladm rename-link\fR によってそれらの名前を変更できません
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBdladm set-linkrop\fR または \fBdladm reset-linkprop\fR を使用して、それらのプロパティーを変更できません
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBdladm modify-vnic\fR を使用してそれらを変更できません
.RE
EVS、VPort、およびテナントの詳細は、\fBevsadm\fR(1M) のマニュアルページを参照してください。
.sp
作成された VNIC は一時的なものであり、次回リブート時に失われます。使用法の例については、下記の「使用例」のセクションを参照してください。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
VNIC を一時的なものとして指定します。これは必須オプションです。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR <\fItenantname\fR>, \fB--tenant\fR <\fItenantname\fR>\fR
.ad
.sp .6
.RS 4n
EVS を所有するテナントの名前を指定します。それが指定されていない場合は、デフォルトのテナント \fBsys-global\fR が想定されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR <\fIevsname\fR>[/<\fIvportname\fR>], \fB--connect\fR <\fIevsname\fR>[/\fIvportname\fR]\fR
.ad
.sp .6
.RS 4n
VNIC の接続先となる必要がある EVS の名前を指定します。\fIvportname\fR が指定されている場合、VNIC はその VPort に接続されます。\fIvportname\fR が指定されていない場合は、VPort が自動的に生成され、VNIC に割り当てられます。
.sp
VNIC を EVS に接続する処理によって、VNIC は EVS または指定された VPort からプロパティーを継承します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fR
.ad
.br
.na
\fB\fBdladm modify-vnic\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-l\fR \fI link\fR] [\fB-m\fR \fIvalue\fR | auto | {factory [\fB-n\fR \fIslot-identifier\fR]} | {vrrp \fB-A\fR {inet | inet6} \fB-V\fR \fIvrid\fR} | {random [\fB-r\fR \fIprefix\fR]}] [\fB-v\fR \fI vlan-id\fR] {\fIvnic-link\fR,[\fIvnic-link \fR,...] | \fB-L\fR \fIsource-link\fR}\fR
.ad
.sp .6
.RS 4n
ベースとなるリンクや指定された VNIC リンクの MAC アドレス/VLAN-ID を変更します。VNIC リンクは、コンマ区切りのリストで指定することも、\fB-L\fR \fIsource-link\fR (「source-link 上の全 VNIC」を意味する) を指定することもできます。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
VNIC の変更を一時的なものとして指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIlink\fR, \fB-link \fR=\fIlink\fR\fR
.ad
.sp .6
.RS 4n
VNIC の移動先のリンクを指定します。\fIlink\fR は、\fBcreate-vnic\fR でサポートされる任意のリンクタイプにできます。\fIlink\fR は、VNIC が現在使用しているリンクとは異なっている必要があります。VNIC がファクトリ MAC アドレスを使用していて、\fB-m\fR が指定されていない場合、\fB-m\fR \fIauto\fR スキームを使用してターゲットリンク上で新しい MAC アドレスが割り付けられて、VNIC に割り当てられます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fIvalue\fR | \fI keyword\fR, \fB--mac-address\fR=\fIvalue\fR | \fI keyword\fR\fR
.ad
.sp .6
.RS 4n
このオプションは Ethernet VNIC にのみ当てはまります。
.sp
サポートされるオプションについては、前述の \fBcreate-vnic\fR を参照してください。複数の VNIC が指定されている場合、\fBauto\fR、\fBrandom\fR、および \fBfactory\fR (\fB-n\fR なし) アドレス割り当てスキームのみがサポートされます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-vnic\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIvnic-link\fR\fR
.ad
.sp .6
.RS 4n
指定された VNIC を削除します。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB-–temporary\fR\fR
.ad
.sp .6
.RS 4n
削除を一時的なものとして指定します。一時的な削除は、次回のリブートまで保持されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- –root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-vnic\fR [\fB-P\fR | {\fB-z\fR \fIzone\fR[,..]}] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,..]] [\fB-l\fR \fIlink\fR] [\fIvnic-link\fR]\fR
.ad
.br
.na
\fB\fBshow-vnic\fR [\fB-Zmv\fR] [\fB-l\fR \fIlink\fR] [\fIvnic-link\fR]\fR
.ad
.sp .6
.RS 4n
すべての VNIC、リンク上のすべての VNIC、または指定された \fIvnic-link\fR のみの VNIC 構成情報を表示します。
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...], \fB--output\fR=\fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。デフォルトでは (\fB-o\fR の指定なし)、\fBshow-vnic\fR はすべてのフィールドを表示します。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
VNIC の名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOVER\fR\fR
.ad
.sp .6
.RS 4n
この VNIC が構成されている物理リンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSPEED\fR \fR
.ad
.sp .6
.RS 4n
VNIC の最大速度 (Mbps 単位)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMACADDRESS\fR\fR
.ad
.sp .6
.RS 4n
VNIC の MAC アドレス。
.sp
IPoIB VNIC の場合、デフォルトでは (\fB-o\fR なし) MAC アドレスの最初の 5 バイトが表示され、6 バイト目の位置には「..」が表示されます。完全な MAC アドレスを表示するには \fB-o\fR オプションを使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMACADDRESSES\fR\fR
.ad
.sp .6
.RS 4n
VNIC が複数の MAC アドレスに関連付けられている場合、この列には 1 つの VNIC のすべての MAC アドレスが表示されます。
.sp
IPoIB VNIC の場合、デフォルトでは (\fB-o\fR なし) MAC アドレスの最初の 5 バイトが表示され、6 バイト目の位置には「..」が表示されます。完全な MAC アドレスを表示するには \fB-o\fR オプションを使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMACADDRTYPE\fR\fR
.ad
.sp .6
.RS 4n
VNIC の MAC アドレスタイプ。\fBdladm\fR は、次の MAC アドレスタイプを識別します。
.sp
.ne 2
.mk
.na
\fB\fBrandom\fR\fR
.ad
.sp .6
.RS 4n
VNIC に割り当てられたランダムなアドレス。
.RE

.sp
.ne 2
.mk
.na
\fB\fBfactory\fR\fR
.ad
.sp .6
.RS 4n
VNIC によって使用されるファクトリ MAC アドレス。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBMACADDRTYPES\fR\fR
.ad
.sp .6
.RS 4n
VNIC が複数の MAC アドレスに関連付けられている場合、この列には各 MAC アドレスの MAC アドレスタイプが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBVID\fR\fR
.ad
.sp .6
.RS 4n
VNIC に関連付けられた VLAN ID。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSVID\fR\fR
.ad
.sp .6
.RS 4n
VNIC に関連付けられたセカンダリ VLAN ID。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPVLAN-TYPE\fR\fR
.ad
.sp .6
.RS 4n
VNIC に関連付けられた PVLAN タイプ。
.RE

.sp
.ne 2
.mk
.na
\fB\fBVIDS\fR\fR
.ad
.sp .6
.RS 4n
VNIC が複数の VLAN ID に関連付けられている場合、この列にはすべての VLAN ID が表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBEVS\fR\fR
.ad
.sp .6
.RS 4n
VNIC の接続先となる EVS の名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBVPORT\fR\fR
.ad
.sp .6
.RS 4n
VNIC の接続先となり、プロパティーの継承元となる VPort の名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTENANT\fR\fR
.ad
.sp .6
.RS 4n
EVS を所有するテナントの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPKEY\fR\fR
.ad
.sp .6
.RS 4n
VNIC に関連付けられた IB パーティションキー。IPoIB データリンクにのみ適用可能です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBIDS\fR\fR
.ad
.sp .6
.RS 4n
Ethernet データリンクの場合は VIDS、IPoIB データリンクの場合は PKEY を、それぞれ「VID:<value>」および「PKEY:<value>」の形式で表示します。
.RE

\fBEVS\fR、\fBVPORT\fR、および \fBTENANT\fR の詳細は、前述の「\fBcreate-vnic\fR」のセクションを参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。\fB-p\fR には \fB-o\fR オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR, \fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
永続的な VNIC 構成を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIlink\fR, \fB-–link \fR=\fIlink\fR\fR
.ad
.sp .6
.RS 4n
指定されたリンク上のすべての VNIC の情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
\fBZONE\fR 列を出力に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR \fR
.ad
.sp .6
.RS 4n
VNIC の SR-IOV 情報を表示します。出力には次が表示されます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.RS 15n
.rt  
VNIC の名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBVF_ASSIGNED\fR\fR
.ad
.RS 15n
.rt  
VNIC に現在割り当てられている VF デバイスインスタンスの名前。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
上記の \fBdladm show-link\fR の下にある \fB-z\fR オプションの説明を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.sp .6
.RS 4n
指定された VNIC の EVS 情報を表示します。これは、\fBLINK\fR、\fBTENANT\fR、\fBEVS\fR、\fBVPORT\fR、\fBOVER\fR、\fBMACADDRESS\fR、\fBVIDS\fR の各フィールドのショートカットです。
.sp
詳細は、前述の「\fBcreate-vnic\fR」のセクションを参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.sp .6
.RS 4n
VNIC に関連付けられているすべての MAC アドレス、MAC アドレスタイプ、および VLAN ID を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
VNIC に関連付けられたすべての VLAN 情報を表示します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-part\fR [\fB-t\fR] [\fB-f\fR] [\fB-R\fR \fIroot-dir\fR] \fB- l\fR \fIib-link\fR [\fB-p\fR \fIprop \fR=\fIvalue\fR[,..]] \fB-P\fR \fI pkey\fR \fIpart-link\fR\fR
.ad
.sp .6
.RS 4n
指定されたリンク上に \fIpart-link\fR という名前の IP-over-IB リンクを作成します。このサブコマンドは、InfiniBand 物理リンク上でのみサポートされます。\fIpart-link\fR をゾーン名/リンク名として指定できます。これにより、指定されたゾーンの名前空間内にパーティションリンクが作成されます。 
.sp
.ne 2
.mk
.na
\fB\fB-f\fR, \fB--force\fR\fR
.ad
.sp .6
.RS 4n
\fIpkey\fR がポート上に存在しない場合、マルチキャストグループが存在しない場合、またはポートが停止している場合でも、パーティションリンクを強制的に作成します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIib-link\fR, \fB- -link\fR=\fIib-link\fR\fR
.ad
.sp .6
.RS 4n
IP-over-IB 物理リンク名。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR, \fB--pkey\fR=\fIpkey\fR\fR
.ad
.sp .6
.RS 4n
パーティションリンクを作成するために使用されるパーティションキー。指定された \fIpkey\fR は、接頭辞 \fB0x\fR が付いているかどうかにかかわらず、常に 16 進数として扱われます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIprop\fR=\fI value\fR[,..]\fR
.ad
.br
.na
\fB\fB--prop\fR \fIprop\fR=\fI value\fR[,..]\fR
.ad
.sp .6
.RS 4n
指定された値に設定するプロパティーのコンマ区切りのリスト。サポートされるプロパティーについては、後述の「一般的なリンクのプロパティー」のセクションで説明します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
パーティションリンクの作成を一時的なものとして指定します。一時的なパーティションリンクは、次回のリブートまで保持されます。非大域ゾーンの名前空間内にパーティションリンクを作成する場合は、\fB-t\fR オプションを指定する必要があります。 
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-part\fR [\fB-R\fR \fI root-dir\fR] \fIpart-link\fR\fR
.ad
.sp .6
.RS 4n
指定されたパーティションリンクを削除します。
.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
パーティションリンクの削除が一時的なものとして指定します。一時的な削除は、次回のリブートまで保持されます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-part\fR [\fB-pP\fR] [\fB-l\fR \fIib-link\fR] [\fB-o\fR \fI field\fR[,...]] [\fIpart-link\fR]\fR
.ad
.sp .6
.RS 4n
すべてのパーティションリンク、\fIib-link\fR 上のすべてのパーティション、または指定された \fIpart-link\fR のみの IB パーティションリンク情報を表示します。
.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIib-link\fR, \fB- -link\fR=\fIib-link\fR\fR
.ad
.sp .6
.RS 4n
指定されたリンク上のすべてのパーティションの情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。デフォルトでは (\fB-o\fR の指定なし)、\fBshow-part\fR はすべてのフィールドを表示します。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
パーティションリンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPKEY\fR\fR
.ad
.sp .6
.RS 4n
パーティションリンクに関連付けられた \fBPkey\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOVER\fR\fR
.ad
.sp .6
.RS 4n
このパーティションリンクが作成されている物理リンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
パーティションリンクの現在の状態。指定可能な値は、\fBup\fR、\fBdown\fR、\fBunknown\fR のいずれかになります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFLAGS\fR\fR
.ad
.sp .6
.RS 4n
パーティションリンクを作成するために使用される状態フラグのセット。指定可能な値は、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBf\fR\fR
.ad
.RS 5n
.rt  
パーティションは (パーティションが作成可能かどうかがチェックされることなく) 強制的に作成されました。
.RE

.sp
.ne 2
.mk
.na
\fB\fBt\fR\fR
.ad
.RS 5n
.rt  
パーティションリンクは一時的なものであり、次回のリブートまでしか保持されません。
.RE

.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR, \fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
永続的な IB パーティションリンク構成を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。\fB-p\fR には \fB-o\fR オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-ib\fR [\fB-pP\fR] [\fB-o\fR \fIfield\fR[,...]] [\fIib-link \fR]\fR
.ad
.sp .6
.RS 4n
すべての IB リンクまたは指定された IB リンク上の IB 物理リンク情報を表示します。
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。デフォルト (\fB-o\fR が指定されない場合) では、\fBshow-ib\fR は \fBHCA\fR、\fBGWID\fR、および \fBGWFLAGS\fR を除くすべてのフィールドを表示します。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
物理リンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBHCA\fR\fR
.ad
.sp .6
.RS 4n
\fBibadm\fR(1M) ユーティリティーによって管理される InfiniBand ホストチャネルアダプタ (HCA) の名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBHCAGUID\fR\fR
.ad
.sp .6
.RS 4n
HCA のグローバル一意識別子。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPORTGUID\fR\fR
.ad
.sp .6
.RS 4n
ポートのグローバル一意識別子。\fBPORTGUID\fR が設定されていない場合は、不明として表示されます。IB SR-IOV 仮想アダプタの場合、リンクが稼働しているときは \fBPORTGUID\fR が設定されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPORT\fR\fR
.ad
.sp .6
.RS 4n
ポート番号。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
物理リンクの現在の状態。指定可能な値は、\fBup\fR、\fBdown\fR、\fBunknown\fR のいずれかになります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBGWNAME\fR\fR
.ad
.sp .6
.RS 4n
この IB 物理リンクから発見された IB-Ethernet ゲートウェイスイッチの、構成されたシステム名。
.RE

.sp
.ne 2
.mk
.na
\fB\fBGWPORT\fR\fR
.ad
.sp .6
.RS 4n
ゲートウェイ Ethernet ポートに関連付けられたコネクタの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBGWID\fR\fR
.ad
.sp .6
.RS 4n
表示されたゲートウェイ Ethernet ポートに関連付けられたゲートウェイインスタンスの識別子。同じ InfiniBand ファブリックを複数のゲートウェイスイッチが共有する場合でも、値が一意になることが予想されます。ゲートウェイインスタンス識別子の値は、0 から 1023 までの範囲になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBGWFLAGS\fR\fR
.ad
.sp .6
.RS 4n
発見されたゲートウェイに関連付けられた一連のフラグ。指定可能なフラグは次のとおりです。
.sp
.ne 2
.mk
.na
\fBa\fR
.ad
.RS 5n
.rt  
ゲートウェイが、この IB ポートからログインできるかどうかを自身の通知内で示しました。
.RE

.sp
.ne 2
.mk
.na
\fBH\fR
.ad
.RS 5n
.rt  
ゲートウェイは、この IB ポートからのホスト管理 VNIC を許可します。
.RE

.sp
.ne 2
.mk
.na
\fBn\fR
.ad
.RS 5n
.rt  
ゲートウェイには、この IB ポートからの EoIB データリンクに割り当てられた MAC アドレスが、少なくとも 1 つあります。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBPKEYS\fR\fR
.ad
.sp .6
.RS 4n
\fBLINK\fR フィールドで指定された IP-over-IB リンクに関連付けられたポート上で使用可能な \fBPkey\fR。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR, \fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
永続的な IB 物理リンク構成を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。\fB-p\fR には \fB-o\fR オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-eoib\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fI ib-link\fR \fB-g\fR \fIgw-system-name\fR \fB- c\fR \fIgw-eth-port\fR \fIeoib-link\fR\fR
.ad
.sp .6
.RS 4n
指定されたリンク上に eoib-link という名前の EoIB リンクを作成します。このサブコマンドは、InfiniBand 物理リンク上でのみサポートされます。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB-—temporary\fR\fR
.ad
.sp .6
.RS 4n
EoIB リンクの作成を一時的なものとして指定します。一時的なリンクは、次回のリブートまで保持されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- -root-dir=root-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIib-link\fR,\fB- -link=ib-link\fR\fR
.ad
.sp .6
.RS 4n
InfiniBand 物理リンク名。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR \fIgw-system-name\fR\fR
.ad
.sp .6
.RS 4n
IB-Ethernet ゲートウェイスイッチのシステム名を指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIgw-eth-port\fR\fR
.ad
.sp .6
.RS 4n
ゲートウェイスイッチの Ethernet ポートに関連付けられたコネクタの名前を指定します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-eoib\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIeoib-link\fR\fR
.ad
.sp .6
.RS 4n
指定された EoIB リンクを削除します。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB-—temporary\fR\fR
.ad
.sp .6
.RS 4n
EoIB リンクの作成を一時的なものとして指定します。一時的なリンクは、次回のリブートまで保持されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- -root-dir=root-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-eoib\fR [\fB-PZ\fR] [\fB-g\fR \fIgw-system-name\fR] [\fB-l\fR \fI ib-link\fR] [[\fB-p\fR] \fB-o\fR \fIfield \fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIeoib-link\fR]\fR
.ad
.sp .6
.RS 4n
システム上のすべての EoIB データリンクに関する情報を表示するか、特定の ib-link または \fIgw-system-name\fR あるいはその両方の上の EoIB データリンクに関する情報を表示するか、あるいは特定の EoIB データリンクに関する情報を表示します。
.sp
.ne 2
.mk
.na
\fB\fB-P\fR, \fB--persistent\fR\fR
.ad
.RS 21n
.rt  
永続 EoIB リンクの構成を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.RS 21n
.rt  
ZONE 列を出力に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR \fIgw-system-name\fR\fR
.ad
.RS 21n
.rt  
指定されたゲートウェイの Ethernet ポートにバインドされた EoIB データリンクに関する情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIib-link\fR\fR
.ad
.RS 21n
.rt  
指定された IB リンク上に構築された EoIB データリンクに関する情報を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...]\fR
.ad
.RS 21n
.rt  
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値allにする必要があります。デフォルト (\fB-o\fR オプションなし) では、\fBshow-eoib\fR はすべてのフィールドを表示します。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.RS 14n
.rt  
EoIB データリンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBGWNAME\fR\fR
.ad
.RS 14n
.rt  
IB-Ethernet ゲートウェイスイッチの構成されたシステム名。永続的なリンクの場合、(リンクが古い管理モデルからの移行中であるために) ゲートウェイのシステム名が不明であり、かつリンクの GWID に対応するゲートウェイがまだ発見されていない場合、\fB?\fR が値として表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBGWPORT\fR\fR
.ad
.RS 14n
.rt  
ゲートウェイ Ethernet ポートに関連付けられたコネクタの名前。永続的なリンクの場合、(リンクが古い管理モデルからの移行中であるために) ゲートウェイのシステム名が不明であり、かつリンクの \fBGWID\fR に対応するゲートウェイがまだ発見されていない場合、\fB?\fR が値として表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBGWID\fR\fR
.ad
.RS 14n
.rt  
表示されたゲートウェイ Ethernet ポートに関連付けられたゲートウェイインスタンスの識別子。同じ InfiniBand ファブリックを複数のゲートウェイスイッチが共有する場合でも、値が一意になることが予想されます。ゲートウェイインスタンス識別子の値は、0 から 1023 までの範囲になります。ゲートウェイがまだ発見されていない場合、\fB--\fR が値として表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSPEED\fR \fR
.ad
.RS 14n
.rt  
リンクの最大の速度 (Mbps 単位)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMACADDRESS\fR\fR
.ad
.RS 14n
.rt  
ゲートウェイ上で EoIB リンクに割り当てられた MAC アドレス。背後でのゲートウェイへの接続がまだ確立されていない場合、\fBmacaddress\fR としてオールゼロが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOVER\fR\fR
.ad
.RS 14n
.rt  
この EoIB データリンクが作成されている IB 物理リンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFLAGS\fR\fR
.ad
.RS 14n
.rt  
EoIB リンクに関連付けられたフラグのセット。上の \fBshow-ib\fR の説明で列挙したフラグに加え、2 つの追加フラグ値が使用可能となっています。
.sp
.ne 2
.mk
.na
\fB\fBD\fR\fR
.ad
.RS 5n
.rt  
リンクに関連付けられた Ethernet ポートが現在 DOWN 状態になっています。
.RE

.sp
.ne 2
.mk
.na
\fB\fBU\fR\fR
.ad
.RS 5n
.rt  
リンクに関連付けられた Ethernet ポートが現在 UP 状態になっています。
.RE

.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.RS 21n
.rt  
安定したマシン解析可能な形式を使用して表示します。\fB-p\fR には \fB-o\fR オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-etherstub\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIetherstub\fR\fR
.ad
.sp .6
.RS 4n
指定された名前で etherstub を作成します。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB-–temporary\fR\fR
.ad
.sp .6
.RS 4n
etherstub を一時的なものとして指定します。一時的な etherstub は、リブート後には無効になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- –root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

VNIC は、物理 NIC ではなく etherstub 上に作成できます。物理 NIC と同様に、このような作成によって、スタックは、同じ etherstub 上に作成された VNIC 間に仮想スイッチを暗黙的に作成します。
.RE

.sp
.ne 2
.mk
.na
\fB\fR
.ad
.br
.na
\fB\fBdladm delete-etherstub\fR [\fB- t\fR] [\fB-R\fR \fIroot-dir\fR] \fI etherstub\fR\fR
.ad
.sp .6
.RS 4n
指定された etherstub を削除します。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB-–temporary\fR\fR
.ad
.sp .6
.RS 4n
削除を一時的なものとして指定します。一時的な削除は、次回のリブートまで保持されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- –root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-etherstub\fR [\fB-Z\fR] [\fB-z\fR \fIzone\fR[,...]] [\fIetherstub \fR]\fR
.ad
.sp .6
.RS 4n
デフォルトでは、構成されているすべての etherstub を表示します。\fIetherstub\fR が指定されている場合は、指定された etherstub を表示します。
.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
\fBZONE\fR 列を出力に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
上記の \fBdladm show-link\fR の下にある \fB-z\fR オプションの説明を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-iptun\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-T\fR \fI type\fR [\fB-a\fR {\fBlocal\fR|\fBremote\fR}=\fI addr\fR,...] \fIiptun-link\fR\fR
.ad
.sp .6
.RS 4n
\fIiptun-link\fR という名前の IP トンネルリンクを作成します。\fBipsecconf\fR(1M) を使用すると、このようなリンクを IPsec でさらに保護できます。
.sp
IP トンネルは、概念的に 2 つの部分で構成されます。1 つは、2 つ以上の IP ノード間の仮想リンク、もう 1 つはこのリンク上の IP インタフェースです。このインタフェースを使用すると、基礎となるリンクによってカプセル化された IP パケットをシステムで送受信できます。このサブコマンドは、仮想リンクを作成します。そのリンク上の IP インタフェースを構成するには、\fBipadm\fR(1M) コマンドを使用します。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
IP トンネルリンクを一時的なものとして指定します。一時的なトンネルは、次回のリブートまで保持されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fItype\fR, \fB--tunnel-type \fR=\fItype\fR\fR
.ad
.sp .6
.RS 4n
作成されるトンネルのタイプを指定します。タイプは、次のいずれかである必要があります。
.sp
.ne 2
.mk
.na
\fB\fBipv4\fR\fR
.ad
.sp .6
.RS 4n
2 つの IPv4 ノード間のポイントツーポイントな IP-over-IP トンネル。このタイプのトンネルを機能させるには、IPv4 発信元および着信先アドレスが必要です。このようなトンネル上で IPv4 インタフェースと IPv6 インタフェースを plumb すると、IPv4-over-IPv4 および IPv6-over-IPv4 トンネル構成を作成できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBipv6\fR\fR
.ad
.sp .6
.RS 4n
IETF RFC 2473 で定義されている、2 つの IPv6 ノード間のポイントツーポイントな IP-over-IP トンネル。このタイプのトンネルを機能させるには、IPv6 発信元および着信先アドレスが必要です。このようなトンネルの上で IPv4 インタフェースと IPv6 インタフェースを plumb すると、IPv4-over-IPv6 および IPv6-over-IPv6 トンネル構成を作成できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB6to4\fR\fR
.ad
.sp .6
.RS 4n
IETF RFC 3056 で定義されている、6to4 なポイントツーマルチポイントトンネル。このタイプのトンネルを機能させるには、IPv4 発信元アドレスが必要です。このようなトンネルリンク上で IPv6 インタフェースを plumb すると、6to4 ルーターを構成できます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR {\fBlocal\fR|\fBremote\fR}=\fI addr\fR,...\fR
.ad
.br
.na
\fB\fB--address\fR {\fBlocal\fR|\fB remote\fR}=\fIaddr\fR,...\fR
.ad
.sp .6
.RS 4n
ローカルまたはリモートのトンネルアドレスに対応するリテラル IP アドレスまたはホスト名。ローカルまたはリモートのどちらかを個別に指定することも、その両方をコンマで区切って指定することもできます (たとえば、\fB-a\fR \fBlocal=\fR\fIladdr\fR\fB,remote=\fR\fIraddr\fR)。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm modify-iptun\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-a\fR {\fB local\fR|\fBremote\fR}=\fIaddr\fR,... \fI iptun-link\fR\fR
.ad
.sp .6
.RS 4n
指定された IP トンネルのパラメータを変更します。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
変更を一時的なものとして指定します。一時的な変更は、次回のリブートまで保持されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fR
.ad
.br
.na
\fB\fR
.ad
.br
.na
\fB\fB-a\fR {\fBlocal\fR|\fB remote\fR}=\fIaddr\fR,...\fR
.ad
.br
.na
\fB\fB--address \fR {\fBlocal\fR|\fBremote\fR}=\fIaddr\fR,... \fR
.ad
.sp .6
.RS 4n
トンネルリンクの新しいローカルアドレスまたはリモートアドレスを指定します。説明については、\fBcreate-iptun\fR を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-iptun\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIiptun-link\fR\fR
.ad
.sp .6
.RS 4n
指定された IP トンネルリンクを削除します。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
削除を一時的なものとして指定します。一時的な削除は、次回のリブートまで保持されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-iptun\fR [\fB-PZ\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIiptun-link \fR]\fR
.ad
.sp .6
.RS 4n
1 つの IP トンネルまたはすべての IP トンネルの IP トンネルリンク構成を表示します。
.sp
.ne 2
.mk
.na
\fB\fB-P\fR, \fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
永続的な IP トンネル構成を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。-p では -o オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...], \fB- -output\fR=\fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。デフォルトでは (\fB-o\fR の指定なし)、\fBshow-iptun\fR はすべてのフィールドを表示します。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
IP トンネルリンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTYPE\fR\fR
.ad
.sp .6
.RS 4n
\fBcreate-iptun\fR の \fB-T\fR オプションで指定されたトンネルのタイプ。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFLAGS\fR\fR
.ad
.sp .6
.RS 4n
IP トンネルリンクに関連付けられたフラグのセット。指定可能なフラグは次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBs\fR\fR
.ad
.sp .6
.RS 4n
IP トンネルリンクは IPsec ポリシーによって保護されます。トンネルリンクに関連付けられた IPsec ポリシーを表示するには、次のように入力します。
.sp
.in +2
.nf
# \fBipsecconf -ln -i \fItunnel-link\fR\fR
.fi
.in -2
.sp

IPsec ポリシーを構成する方法の詳細は、\fBipsecconf\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBi\fR\fR
.ad
.sp .6
.RS 4n
この IP トンネルリンクは \fBipadm\fR(1M) を使用して暗黙的に作成されたもので、参照されなくなると (つまり、そのトンネルを経由する最後の IP インタフェースが削除されると) 自動的に削除されます。暗黙的なトンネル作成の詳細は、\fBipadm\fR(1M) を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBLOCAL\fR\fR
.ad
.sp .6
.RS 4n
ローカルのトンネルアドレス。
.RE

.sp
.ne 2
.mk
.na
\fB\fBREMOTE\fR\fR
.ad
.sp .6
.RS 4n
リモートのトンネルアドレス。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
\fBZONE\fR 列を出力に表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
上記の \fBdladm show-link\fR の下にある \fB-z\fR オプションの説明を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-vxlan\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-p\fR \fI vni\fR=<\fIvxlan id\fR>[,\fIprop=value \fR[,...] ] \fIvxlan-link\fR\fR
.ad
.sp .6
.RS 4n
\fBvxlan-link\fR と呼ばれる VXLAN リンクを作成します。VXLAN リンクとは IP インタフェース経由で作成される仮想リンクであり、VXLAN パケットの受信と転送に使用されます。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
変更を一時的なものとして指定します。一時的な変更は、次回のリブートまで保持されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIprop\fR=\fI value\fR[,...]\fR
.ad
.sp .6
.RS 4n
作成される VXLAN リンクのプロパティー。VXLAN 関連のプロパティーについては、「一般的なリンクのプロパティー」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-vxlan\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIvxlan-link\fR\fR
.ad
.sp .6
.RS 4n
指定された VXLAN リンクを削除します。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
変更を一時的なものとして指定します。一時的な変更は、次回のリブートまで保持されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-vxlan\fR [\fB-P\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fIvxlan-link\fR]\fR
.ad
.sp .6
.RS 4n
すべての VXLAN リンクまたは指定された VXLAN リンクの VXLAN 構成を表示します。
.sp
\fBshow-vxlan\fR サブコマンドは次のオプションを受け入れます。 
.sp
.ne 2
.mk
.na
\fB\fB-P\fR, \fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
永続的な IP トンネル構成を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。\fB-p\fR オプションには \fB-o\fR オプションが必要です。後述の「解析可能な出力形式」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...], \fB- -output\fR=\fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 all にする必要があります。VXLAN リンクごとに、次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.RS 10n
.rt  
VXLAN リンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBADDR\fR\fR
.ad
.RS 10n
.rt  
VXLAN リンクに関連付けられている IP インタフェースのアドレス。
.RE

.sp
.ne 2
.mk
.na
\fB\fBVNI\fR\fR
.ad
.RS 10n
.rt  
VXLAN リンクが属している VXLAN セグメント番号。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMGROUP\fR\fR
.ad
.RS 10n
.rt  
VXLAN リンクに関連付けられているマルチキャストグループ。
.RE

.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-cap\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIcap-link\fR\fR
.ad
.sp .6
.RS 4n
cap-link という名前でキャプチャーデータリンクを作成します。cap-link は、dladm コマンドが実行される特定のゾーンの名前空間で一意である必要があります。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
キャプチャーデータリンクが一時的であることを指定します。一時的なキャプチャーは、次回のリブートまで保持されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-cap\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIcap-link\fR\fR
.ad
.sp .6
.RS 4n
指定したキャプチャーデータリンクを削除します。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR, \fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
削除を一時的なものとして指定します。一時的な削除は、次回のリブートまで保持されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
前述の「オプション」を参照してください。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-cap\fR [\fB-P\fR] [[\fB-p\fR] \fB-o\fR <\fIfield\fR>,...] [\fIcap-link\fR] \fR
.ad
.sp .6
.RS 4n
dladm コマンドが実行されるゾーンにバインドされたすべてまたは個々の cap-link キャプチャーインタフェースを表示します。
.sp
.ne 2
.mk
.na
\fB\fB-P\fR, \fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
永続的なデータリンク構成を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
安定したマシン解析可能な形式を使用して表示します。\fB-p\fR オプションには \fB-o\fR オプションが必要です。下記の「解析可能な出力形式」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB-o field[,...], --output=field[,...]\fR
.ad
.sp .6
.RS 4n
表示する出力フィールドのコンマ区切りのリスト (大文字と小文字は区別されません)。フィールド名は、次に示すフィールドのいずれか、またはすべてのフィールドを表示するための特殊な値 \fBall\fR にする必要があります。キャプチャーリンクごとに、次のフィールドを表示できます。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.RS 8n
.rt  
キャプチャーリンクの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fBZONE\fR\fR
.ad
.RS 8n
.rt  
データリンクの現在のゾーン。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTYPE\fR\fR
.ad
.RS 8n
.rt  
データリンクタイプ。現在 \fBpflog\fR リンクタイプのみがサポートされています。
.RE

.sp
.ne 2
.mk
.na
\fBMTU\fR
.ad
.RS 8n
.rt  
mtu をリンクします。
.RE

.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBhelp\fR [\fIsubcommand-name\fR] \fR
.ad
.sp .6
.RS 4n
サポートされるすべての \fBdladm\fR サブコマンドまたは特定のサブコマンドの使用法を表示します。特定のサブコマンドのヘルプを呼び出すと、コマンド構文および例が表示されます。\fBdladm\fR ヘルプが引数なしで使用されると、すべてのサブコマンドを表示します。
.RE

.SS "解析可能な出力形式"
.sp
.LP
\fBdladm\fR サブコマンドの多くには、出力をマシン解析可能な形式で表示するオプションがあります。出力形式は、コロン (\fB:\fR) で区切られたフィールドで構成された 1 つ以上の行です。表示されるフィールドは、使用されているサブコマンドに固有のもので、特定のサブコマンドの \fB-o\fR オプションに対するエントリの下に一覧表示されます。出力には、\fB-o\fR オプションを使用して要求されたフィールドのみが、要求された順序で表示されます。
.sp
.LP
複数のフィールドを要求した場合、すべてのコロン文字は、バックスラッシュ (\fB\\fR) でエスケープされてから出力されます。同様に、バックスラッシュ文字もエスケープされます (\fB\\\fR)。シェルの \fBread\fR(1) 関数を環境変数 \fBIFS=:\fR とともに使用すると、このエスケープ形式を解析できます (下の「\fB使用例\fR」を参照)。1 つのフィールドのみを要求した場合はエスケープが実行されないことに注意してください。
.SS "一般的なリンクのプロパティー"
.sp
.LP
次の一般的なリンクのプロパティーがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fBaddr\fR\fR
.ad
.sp .6
.RS 4n
VXLAN リンクにのみ適用可能です。このプロパティーは、VXLAN リンクをホストする IP アドレス (IPv4 または IPv6) を指定します。IPv4 または IPv6 アドレスの一部として \fBprefixlen\fR を指定できます。IP アドレスの代わりにホスト名を指定することもできます。ホスト名が指定されている場合、その数値は \fB/etc/hosts\fR のエントリ、または \fBnsswitch.conf\fR(4) でホストまたは IP ノード用に指定されたリゾルバから取得されます。IP アドレスの作成はブートプロセスでネームサービスがオンラインになる前に行われるため、使用するホスト名がすべて \fB/etc/hosts\fR に含まれていることが重要です。VXLAN リンクが interface プロパティーでも構成されている場合は、このプロパティーを指定できません。このプロパティーは VXLAN リンクの作成時にのみ設定でき、その後は変更できません。このプロパティーは将来変更される可能性があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBautopush\fR\fR
.ad
.sp .6
.RS 4n
対応する DLPI デバイスが開かれたときに、あるリンクに関連付けられたストリームにプッシュする STREAMS モジュールのセットを指定します。これは、モジュールのスペース区切りリストです。
.sp
オプションの特殊文字シーケンス \fB[anchor]\fR は、ストリーム上にある、リストで以前に指定されたモジュールに STREAMS アンカーを配置するよう指示します。複数のアンカーを指定したり、リストの先頭にアンカーを配置したりするとエラーになります。
.sp
\fBautopush\fR プロパティーは、より汎用的な \fBautopush\fR(1M) コマンドよりも優先されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcos\fR\fR
.ad
.sp .6
.RS 4n
リンクに関連付けられた 802.1p 優先度。このプロパティーは、設定される場合、リンク上のアウトバウンドパケットでの 802.1p 優先度を表します。値の範囲は 0 - 7 です。このプロパティーを設定すると、リンク上のすべてのアウトバウンドパケットに VLAN タグが付けられ、プロパティーフィールドにプロパティー値が設定されます。このプロパティーを物理 NIC 上で設定すると、優先度がその物理 NIC 上のプライマリクライアント向けトラフィックのみに設定され、NIC 上のほかのデータリンクには設定されません。このプロパティーは、iEthernet データリンクのみで有効です。VLAN データリンクの場合、またはベースとなるデバイスが DCB 機能を登録する場合のデフォルト cos は 0 で、それ以外の場合にはデフォルトでは VLAN タグを追加しません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcpus\fR\fR
.ad
.sp .6
.RS 4n
特定のデータリンクのパケットの処理を 1 つのプロセッサまたはプロセッサのセットにバインドします。この値は、1 つ以上のプロセッサ ID のコンマ区切りリストか、または ID の範囲として指定できます。リストが複数のプロセッサで構成されている場合は、処理がすべてのプロセッサに分散されます。各接続について、プロセッサアフィニティーへの接続とパケットの順序は保持されます。
.sp
プロセッサまたはプロセッサのセットは、リンク用に排他的に予約されます。そのリンクの処理に関連付けられたカーネルスレッドと割り込みのみが、指定されたプロセッサまたはプロセッサのセットにバインドされます。指定のプロセッサをそのリンク専用にする場合は、\fBpsrset\fR(1M) を使用すると、プロセッサセットを作成し、そのプロセッサセットからリンクをバインドするプロセッサを指定できます。
.sp
以前の操作によってリンクがすでにプロセッサまたはプロセッサのセットにバインドされている場合、そのバインドは削除され、代わりに新しいプロセッサセットが使用されます。
.sp
デフォルトでは、CPU はバインドされません。つまり、パケットの処理は、どの特定のプロセッサまたはプロセッサセットにもバインドされません。
.sp
\fBpool\fR リンクプロパティーが設定されているリンクでは、\fBcpus\fR プロパティーを指定できません。
.sp
\fBcpus\fR プロパティーの有効な値によって、指定されたデータリンク上のパケット処理に使用される CPU のリストが表示されます。\fBcpus\fR プロパティーが設定されている場合、有効な値は、設定されている値と同じになります。pool プロパティーが設定されている場合、有効な値は、管理者によって指定されたプールから選択されます。pool プロパティーも \fBcpus\fR プロパティーも設定されていない場合、システムは \fBcpus\fR プロパティーの有効な値を選択します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBetsbw-lcl\fR\fR
.ad
.sp .6
.RS 4n
これは、リンクの TX 側で構成された ETS 帯域幅を示します。ベースとなる物理 NIC が DCB を登録し、かつ ETS をサポートする場合、このプロパティーをデータリンク上でのみ構成できます。値は物理 NIC の帯域幅の割合 (パーセント) で、物理 NIC 上のすべてのリンク上に対するこのプロパティーの値の合計が 100 を超えることはありません。現在のところ、DCB 機能を登録する物理 NIC のアグリゲーションはサポートされていないため、このプロパティーをアグリゲーションに設定することはできません。このプロパティーの有効な値は、LLDP ネゴシエーションに応じて \fBetsbw-lcl\fR の場合と \fBetsbw-lcl-advice\fR の場合があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBetsbw-lcl-advice\fR\fR
.ad
.sp .6
.RS 4n
これは、このリンクの接続先で推奨される ETS 帯域幅 (パーセント) を示します。値は LLDP により取得されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBetsbw-rmt\fR\fR
.ad
.sp .6
.RS 4n
これは、このリンクの接続先での ETS 帯域幅 (パーセント) を示します。値は LLDP により取得されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBetsbw-rmt-advice\fR\fR
.ad
.sp .6
.RS 4n
これは、このリンクのリモート端に推奨される ETS 帯域幅 (パーセント) を示します。この値は LLDP によって使用されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBinterface\fR\fR
.ad
.sp .6
.RS 4n
VXLAN リンクにのみ適用可能です。このプロパティーは、VXLAN リンクのベースとなる IP インタフェースを指定します。VXLAN は、指定されたインタフェースで使用可能な IP アドレスを使って作成されます。デフォルトでは IPv4 アドレスが VXLAN リンク用に選択されますが、ipvers プロパティーを使用すればこれを変更できます。このプロパティーは VXLAN リンクの作成時にのみ設定でき、その後は変更できません。このプロパティーは将来変更される可能性があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBipvers\fR\fR
.ad
.sp .6
.RS 4n
VXLAN データリンクにのみ適用可能です。このプロパティーは、IP インタフェース (interface プロパティーを使って VXLAN リンク用に指定したもの) に対して IPv4 または IPv6 のどちらのアドレスを選択すべきかを示します。このプロパティーは VXLAN リンクの作成時にのみ設定でき、その後は変更できません。このプロパティーは将来変更される可能性があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrxfanout\fR\fR
.ad
.sp .6
.RS 4n
受信側のファンアウトスレッドの数を指定できるようにします。
.sp
受信リング上で受信されるトラフィックを複数のスレッドにファンアウトし、並行して処理することができます。これは特に、システムに多数の CPU が搭載されている場合に有効です。このプロパティーは、特定のデータリンクの受信側のファンアウトスレッドの数を表すカウントです。このプロパティーによって管理者は必要な \fBrxfanout\fR を指定できます。ただし、利用可能な CPU とハードウェア RX リングの数に基づいて、システムは異なる (より小さいか、さらに大きい) ファンアウト値を選択する場合があります。CPU の数が受信側のファンアウトの上限となり、\fBrxrings\fR の数が下限となります。このため、受信側の実際のファンアウト数は、ユーザーが設定したものと異なる可能性があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlearn_limit\fR\fR
.ad
.sp .6
.RS 4n
ブリッジリンク上で学習される新しい MAC 発信元または変更された MAC 発信元の数を制限します。その数がこの値を超えると、そのリンク上での学習は一時的に無効になります。このプロパティーは、VLAN および VNIC 以外のタイプのリンクにのみ存在します。
.sp
デフォルト値は \fB1000\fR です。有効な値は 0 以上です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlearn_decay\fR\fR
.ad
.sp .6
.RS 4n
\fBlearn_limit\fR によって制限された発信元の変更の減衰率を指定します。この数値は、5 秒ごとにブリッジリンクのカウンタから減算されます。このプロパティーは、VLAN および VNIC 以外のタイプのリンクにのみ存在します。
.sp
デフォルト値は \fB200\fR です。有効な値は 0 以上です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlro\fR\fR
.ad
.sp .6
.RS 4n
LRO のオンまたはオフに関するユーザーの設定、またはデータリンクでのシステムデフォルト LRO 値の使用を指定します。
.sp
有効な値は、off、on、または auto です。デフォルト値は auto です。値 auto は、物理 NIC の場合はオフに設定され、仮想 NIC の場合は下位リンクの LRO 設定を継承します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmac-address\fR\fR
.ad
.sp .6
.RS 4n
データリンクのプライマリ MAC アドレスを設定します。設定されている場合は、基本となるデータリンクの現在および将来のすべての MAC クライアントによって使用されるプライマリ MAC アドレスを変更します。
.LP
注 - 
.sp
.RS 2
システムは、安全ではないと判断した場合、LRO をオンにしない可能性があります。たとえば、IP がデータリンクを使用してトラフィックを転送している場合、システムがそのデータリンクで LRO をオンにするのは安全でないとみなすことがあります。その場合、有効な値は構成済みの値とは異なります。
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fBmaxbw\fR\fR
.ad
.sp .6
.RS 4n
リンクの全二重帯域幅を設定します。この帯域幅は、いずれかのスケールサフィックス (K ビット/秒、M ビット/秒、または G ビット/秒を示す \fBK\fR、\fBM\fR、または \fBG\fR) が付いた整数として指定されます。単位が指定されていない場合、入力値は Mbps として読み取られます。デフォルトでは、帯域幅の制限はありません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBbwshare\fR\fR
.ad
.sp .6
.RS 4n
VNIC の帯域幅共有は、同じデータリンク上のほかの VNIC との競合が発生した場合に VNIC が取得する帯域幅の最小共有です。帯域幅はすべてのアクティブな VNIC の間で割り当てられます。割り当て量はそれぞれの共有に比例します。たとえば、
.sp
.in +2
.nf
# \fBdladm set-linkprop -p bwshare=40 vnic1\fR
# \fBdladm set-linkprop -p bwshare=10 vnic2\fR
.fi
.in -2
.sp

1G ビット/秒のリンクで、次の 2 つの VNIC のみが存在していると想定した場合、\fBvnic1\fR は最大 800M ビット/秒 (1G ビット/秒 * 40/(40+10))、\fBvnic2\fR は最大 200M ビット/秒 (1G ビット/秒 * 10/(40+10)) が得られます。
.sp
前述の例では、両方の VNIC に帯域幅の共有を消費するトラフィックが存在することを前提としています。ただし、\fBvnic1\fR が 100M ビット/秒のみ消費する場合、\fBvnic2\fR は 900M ビット/秒まで消費できます。帯域幅共有の目標は、ほかの VNIC との競合が発生する場合に割り当てられた共有を確保すること、および、VNIC が使用できる帯域幅がある場合にその帯域幅を無駄にしないことです。
.sp
現在、このプロパティーは特定の NIC 上でのみサポートされます。\fBdladm show-linkprop -H -p bwshare\fR コマンドは、\fBbwshare\fR プロパティーが特定のリンクでサポートされているかどうかを判断するために使用できます。値の範囲は、1 から 100 です。値は相対的な共有の値で、帯域幅の割合は示していません。有効な値は物理リンク帯域幅の割合として出力されます。これは、競合が発生する場合に、VNIC に対して確保される帯域幅の最小 % です。有効な値は、リンク上のほかの VNIC に応じて変化します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmgroup\fR\fR
.ad
.sp .6
.RS 4n
VXLAN データリンクにのみ適用可能です。このプロパティーは、VXLAN リンクが登録するマルチキャストグループを示します。VXLAN リンクは、このアドレスを使用して、同じ VXLAN セグメント上のほかの VXLAN リンクを検出します。このプロパティーが設定されていない場合は、デフォルトの all-host アドレスが VXLAN リンクによって使用されます。このプロパティーは VXLAN リンクの作成時にのみ設定でき、その後は変更できません。このプロパティーは将来変更される可能性があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpool\fR\fR
.ad
.sp .6
.RS 4n
特定のデータリンクのパケットの処理を、\fBpoolcfg\fR(1M) と \fBpooladm\fR(1M) によって定義および管理されるプロセッサのプールにバインドします。この処理のバインドは、CPU のリストが明示されず、代わりにプール機能によって保持される点を除き、\fBcpus\fR リンクプロパティーで実行される処理と同様です。
.sp
プールが有効になっており、リンクに対してプールが指定されていない場合は、\fBpool_default\fR がパケット処理に使用されます。
.sp
\fBip-type=exclusive\fR が設定されているゾーンで、あるプールが pool zone プロパティーまたは \fBdedicated-cpus\fR 割り当てによって指定されている場合は、そのプールもゾーンに関連付けられているすべてのデータリンクに使用されます。
.sp
\fBcpus\fR リンクプロパティーが設定されているリンクでは \fBpool\fR プロパティーを指定できません。
.sp
プール機能が有効になっており、管理者がデータリンクにプールを割り当てていない場合、プールの有効な値は \fBpool_default\fR になります。
.sp
プール機能が無効になっている場合、有効なプールは存在せず、この値は空になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpriority\fR\fR
.ad
.sp .6
.RS 4n
リンクの相対的な優先度を設定します。この値は、トークン \fBhigh\fR、\fBmedium\fR、\fBlow\fR のいずれかとして指定できます。デフォルトは \fBmedium\fR です。この優先度は、回線上のどのプロトコル優先度フィールドでも反映されませんが、システム内のパケット処理スケジューリングに使用されます。優先度の高いリンクでは、システムリソースの可用性に応じて待機時間が短縮されます。このプロパティーを設定すると、一部のワークロードで CPU 使用率が上がることがあります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrxringsavail\fR\fR
.ad
.sp .6
.RS 4n
受信側で使用可能なリングの数を指定する読み取り専用プロパティー。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrxrings\fR\fR
.ad
.sp .6
.RS 4n
MAC クライアントの受信リングの数を指定します。\fBsw\fR という値は、この MAC クライアントに RX リングが割り当てられず、ソフトウェアベースになることを意味します。\fBhw\fR という値は、この MAC クライアントが RX リング (使用可能な場合) を 1 つ取得でき、そうでなければ、ソフトウェアベースになることを意味します。ゼロ以外の値は、この MAC クライアントに対してその数だけリングを予約し (使用可能な場合)、そうでない場合は失敗することを意味します。このプロパティーを指定しない場合、MAC クライアントは RX リング (使用可能な場合) を 1 つ取得でき、そうでなければソフトウェアベースになります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrxhwclntavail\fR\fR
.ad
.sp .6
.RS 4n
作成可能な追加の RX ハードウェアベースの MAC クライアントの数を指定する読み取り専用プロパティー。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtxringsavail\fR\fR
.ad
.sp .6
.RS 4n
送信側で使用可能なリングの数を指定する読み取り専用プロパティー。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtxrings\fR\fR
.ad
.sp .6
.RS 4n
MAC クライアントの送信リングの数を指定します。\fBsw\fR という値は、この MAC クライアントに TX リングが割り当てられないことを意味します。\fBhw\fR という値は、この MAC クライアントが TX リング (使用可能な場合) を 1 つ取得でき、そうでなければ、ソフトウェアベースになることを意味します。ゼロ以外の値は、この MAC クライアントに対してその数だけリングを予約し (使用可能な場合)、そうでない場合は失敗することを意味します。このプロパティーを指定しない場合、MAC クライアントは TX リング (使用可能な場合) を 1 つ取得でき、そうでなければソフトウェアベースになります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtxhwclntavail\fR\fR
.ad
.sp .6
.RS 4n
作成可能な追加の TX ハードウェアベースの MAC クライアントの数を指定する読み取り専用プロパティー。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstp\fR\fR
.ad
.sp .6
.RS 4n
ブリッジリンク上の Spanning Tree Protocol を有効または無効にします。この値を \fB0\fR に設定すると、スパニングツリーが無効になり、リンクが BPDU 保護の有効な転送モードになります。このモードは、エンドノードにのみ接続されたポイントツーポイントリンクに適しています。このプロパティーは、VLAN および VNIC 以外のタイプのリンクにのみ存在します。デフォルト値は \fB1\fR で、STP が有効になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBforward\fR\fR
.ad
.sp .6
.RS 4n
VLAN の転送を有効または無効にします。この値を \fB0\fR に設定すると、VLAN リンクのブリッジ転送が無効になります。ブリッジ転送を無効にすると、その VLAN がブリッジの「許可されたセット」から削除されます。デフォルト値は \fB1\fR で、構成された VLAN のブリッジ転送が有効になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdefault_tag\fR\fR
.ad
.sp .6
.RS 4n
デフォルトの VLAN ID を、このリンクとの間で送受信されるタグなしパケットとして設定します。このプロパティーは、VLAN および VNIC 以外のタイプのリンクにのみ存在します。この値を \fB0\fR に設定すると、ポートとの間で送受信されるタグなしパケットのブリッジ転送が無効になります。デフォルト値は \fBVLAN ID 1\fR です。有効な値は 0 - 4094 です。デフォルトの VLAN ID は、PVID (Port VLAN Identifier) とも呼ばれます。
.sp
基礎となるリンクのデフォルトの VLAN 値に一致する VLAN ID を持つタグ付き VLAN および VLAN タグ付き VNIC リンクを作成することはできません。リンク上のすべてのタグなしパケットは、すでにデフォルトの VLAN (PVID) に関連付けられています。デフォルトの VLAN 値に等しい VLAN ID を持つタグ付き VLAN または VLAN タグ付き VNIC リンクを正常に作成するには、まず基本となるリンクの \fBdefault_tag\fR プロパティーを別の VLAN 値に変更する必要があります。
.sp
\fBdefault_tag=0\fR に設定すると、リンク上のすべてのタグなしパケットがどの VLAN にも関連付けられなくなります。結果として、1 - 4094 の任意の VLAN ID を持つ VLAN リンクを作成できます。エンドポイントで誤って PVID のタグが付けられた受信パケットはすべてドロップされる可能性があることに注意してください。この状況は、特定のリンク上の一部のエンドポイントが PVID に同意していない場合に発生します。リンク上のエンドポイントはすべて同じ PVID を使用する必要があり、トラフィックに PVID のタグを付けてはいけません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstp_priority\fR\fR
.ad
.sp .6
.RS 4n
STP と RSTP のポート優先度の値を設定します。この値は、ブリッジ上の推奨されるルートポートを決定するために使用されます。数値が小さいほど、優先度は高くなります。デフォルト値は \fB128\fR です。有効な値の範囲は 0 - 255 です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstp_cost\fR\fR
.ad
.sp .6
.RS 4n
リンクを使用するための STP と RSTP のコストを設定します。デフォルト値は \fBauto\fR です。この場合はリンク速度に基づいてコストが設定され、10M ビット/秒に \fB100\fR、100M ビット/秒に \fB19\fR、1G ビット/秒に \fB4\fR、および 10G ビット/秒に \fB2\fR が使用されます。有効な値の範囲は 1 - 65535 です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstp_edge\fR\fR
.ad
.sp .6
.RS 4n
ブリッジのエッジポート検出を有効または無効にします。\fB0\fR (false) に設定されていると、どのタイプのブリッジ PDU も認識されない場合でも、システムはポートがほかのブリッジに接続されているとみなします。デフォルト値は \fB1\fR で、エッジポートが自動的に検出されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstp_p2p\fR\fR
.ad
.sp .6
.RS 4n
ブリッジのポイントツーポイント動作モードを設定します。指定可能な値は、\fBtrue\fR、\fBfalse\fR、および \fBauto\fR です。\fBauto\fR に設定すると、ポイントツーポイント接続が自動的に検出されます。\fBtrue\fR に設定すると、ポートモードで強制的にポイントツーポイントが使用されます。\fBfalse\fR に設定すると、ポートモードで強制的に通常のマルチポイントモードが使用されます。デフォルト値は \fBauto\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstp_mcheck\fR\fR
.ad
.sp .6
.RS 4n
このリンク上で RSTP の \fBForce BPDU Migration Check\fR 手順を実行するようにシステムを起動します。この手順は、このプロパティー値を \fB1\fR に設定することによって開始されます。このプロパティーは、元の \fB0\fR に自動的にリセットされます。この値は、次の条件が満たされないかぎり設定できません。
.RS +4
.TP
.ie t \(bu
.el o
リンクがブリッジされている
.RE
.RS +4
.TP
.ie t \(bu
.el o
ブリッジがスパニングツリーによって保護されている
.RE
.RS +4
.TP
.ie t \(bu
.el o
ブリッジの \fBforce-protocol\fR 値が少なくとも 2 (RSTP) である
.RE
デフォルト値は 0 です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBprotection\fR\fR
.ad
.sp .6
.RS 4n
リンク保護の 1 つ以上のタイプを有効にします。有効な値は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBmac-nospoof\fR\fR
.ad
.sp .6
.RS 4n
MAC アドレスのスプーフィング対策。送信パケットの発信元 MAC アドレスが、そのリンクの構成済み MAC アドレスに一致している必要があります。一致していないパケットはドロップされます。リンクがゾーンに属している場合、\fBmac-nospoof\fR を有効にすると、ゾーンの所有者によってそのリンクの MAC アドレスが変更されることを防止できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBip-nospoof\fR\fR
.ad
.sp .6
.RS 4n
IP アドレスのスプーフィング対策。この保護タイプは、リンクプロパティー \fBallowed-ips\fR と連動します。
.sp
\fBallowed-ips\fR は、IP (IPv4 または IPv6) アドレスを含むリストです。このリストは、デフォルトでは空の状態です。このリストに暗黙的に含まれているアドレスには、RFC 2464 に準拠したリンクローカル IPv6 アドレス (リンクの MAC アドレスから派生)、DHCP 応答から学習された IPv4/IPv6 アドレス、および指定されない (すべて 0 の) IPv4/IPv6 アドレスがあります。
.sp
アウトバウンド IP パケットは、その発信元アドレスが \fBallowed-ips\fR に含まれている場合に通過できます。
.sp
アウトバウンド ARP パケットは、その送信側プロトコルアドレスが \fBallowed-ips\fR に含まれている場合に通過できます。
.sp
\fBallowed-ips\fR を 1 つ以上の IP アドレスのセットに設定することによってデータリンクが保護されている場、このセットに含まれていない IP アドレスを構成しようとしても失敗し、\fBEPERM\fR エラーがユーザーに返されます。さらに、このインタフェースは IP パケットの転送には使用できず、このインタフェース上で \fBipadm\fR(1M) 転送プロパティーを設定しようとすると \fBEPERM\fR エラーが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdhcp-nospoof\fR\fR
.ad
.sp .6
.RS 4n
DHCP クライアント ID (DHCPv6 の DUID) およびハードウェアアドレスのスプーフィング対策。この保護タイプは、リンクプロパティー \fBallowed-dhcp-cids\fR と連動します。
.sp
\fBallowed-dhcp-cids\fR リスト内の項目は、\fB/etc/default/dhcpagent\fR ファイル内の \fBCLIENT_ID\fR フィールドと同じ方法で書式設定するようにしてください。唯一の違いは、DUID を指定するときに \fB,\fR (コンマ) の代わりに \fB\&.\fR (ピリオド) を使用することです。詳細は、\fBdhcpagent\fR(1M) を参照してください。
.sp
送信 DHCP (v4/v6) パケットは、次の条件が満たされた場合にのみ通過できます。
.RS +4
.TP
.ie t \(bu
.el o
\fBallowed-dhcp-cids\fR が構成されておらず、パケットタイプが次の場合。
.RS +4
.TP
.ie t \(bu
.el o
DHCPv4 の場合、クライアント ID フィールドが構成済み MAC アドレスに一致している必要があります。
.RE
.RS +4
.TP
.ie t \(bu
.el o
DHCPv6 の場合、DUID のタイプが 1 または 3 で、DUID のリンクレイヤーアドレス部が構成済み MAC アドレスに一致している必要があります。
.RE
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBallowed-dhcp-cids\fR が構成されていて、パケットタイプが次の場合。
.RS +4
.TP
.ie t \(bu
.el o
DHCPv4 の場合、クライアント ID フィールドが、このリスト上のいずれかの ID または構成済み MAC アドレスに一致している必要があります。
.RE
.RS +4
.TP
.ie t \(bu
.el o
DHCPv6 の場合、DUID フィールドがこのリスト上のいずれかの ID に一致している必要があるか、または DUID のタイプが 1 または 3 で、かつ DUID のリンクレイヤーアドレス部が構成済み MAC アドレスに一致している必要があります。
.RE
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fBrestricted\fR\fR
.ad
.sp .6
.RS 4n
この保護によって、送信パケットのタイプが IPv4、IPv6、および ARP だけに制限されます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBvni\fR\fR
.ad
.sp .6
.RS 4n
VXLAN データリンクにのみ適用可能です。このプロパティーは、VXLAN リンクが属している VXLAN セグメントを指定する、0 - 16777215 の範囲の値を持ちます。このプロパティーは VXLAN リンクの作成時には必須で、その後は変更できません。このプロパティーは将来変更される可能性があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvsi-mgrid\fR\fR
.ad
.sp .6
.RS 4n
IPv6 アドレス。
.sp
VNIC 上で VDP サービスを有効にする場合、3 バイトの VSI タイプ ID および 1 バイトの VSI バージョンを使用して、VNIC のプロパティーがブリッジと交換されます。VSI マネージャーは、{VSI タイプ ID - VSI バージョン} 間のマッピングおよびプロパティーのセットを保持します。{VSI マネージャー ID、VSI タイプ ID、VSI バージョン} の組で、特定のプロパティーセットが識別されます。
.sp
VNIC では、\fBvsi-mgrid\fR を明示的に割り当てることができます。vsi-mgrid を明示的に割り当てない場合、\fBvsi-mgrid\fR はベースとなるリンクの \fBvsi-mgrid\fR 値に設定されます。
.sp
物理リンク上では、\fBvsi-mgrid\fR はそのリンク上のすべての VNIC のデフォルト \fBvsi-manageid\fR を指定します。物理リンク上の \fBvsi-mgrid\fR のデフォルト値は 0 です。
.sp
物理リンク上のデフォルト VSI マネージャー ID は、Oracle VSI マネージャー (\fBoracle_v1\fR) と関連付けられます。Oracle VSI マネージャーは、次のリンクプロパティーを使用して、3 バイトのエンコードで定義されます:
.sp
.in +2
.nf
Bits            Properties
--------------------------------------------------
0-4             Link Bandwidth Limit
                00000-10100 :   0-100% of link speed
                                in increments of 5%
                rest        :   reserved

                5-7             Link Speed
                                000 - Unknown
                                001 - 10 Mbps
                                010 - 100 Mbps
                                011 - 1 Gbps
                                100 - 10 Gbps
                                101 - 40 Gbps
                                110 - 100 Gbps
                                111 - Reserved

                8-12            Reserved

                13-15           Traffic Class (0-7)

                16-17           Link MTU
                                00 - 1500 bytes
                                01 - 9000 bytes
                                10 - Custom
                                11 - Reserved


                18-23           Reserved
.fi
.in -2

.RE

.sp
.ne 2
.mk
.na
\fB\fBvsi-mgrid-enc\fR\fR
.ad
.sp .6
.RS 4n
物理リンクの \fBvsi-mgrid\fR に関連付けられたエンコード。サポートされる値には、\fBoracle_v1\fR および \fBnone\fR が含まれます。このプロパティーが \fBnone\fR に設定されている場合、\fBvsi-mgrid\fR が明示的に設定されていない VNIC では、このリンクに対して \fBvsi-typeid\fR および \fBvsi-vers\fR は自動的に生成されません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvsi-typeid\fR\fR
.ad
.sp .6
.RS 4n
VNIC に関連付けられたプロパティーの識別に使用される 3 バイトの値。\fBvsi-typeid\fR は、\fBvsi-vers\fR および \fBvsi-mgrid\fR とともに、VNIC と関連付けられた実際のプロパティーの取得に使用されます。VNIC 上で \fBvsi-mgrid\fR が明示的に存在しない場合、VNIC のプロパティーと前述のエンコード (\fBoracle_v1\fR) を使用して、\fBvsi-typeid\fR が自動的に生成されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvsi-vers\fR\fR
.ad
.sp .6
.RS 4n
VNIC に関連付けられたプロパティーの識別に使用される 1 バイトの値。\fBvsi-vers\fR は、\fBvsi-typeid\fR および \fBvsi-mgrid\fR とともに、VNIC と関連付けられた実際のプロパティーの取得に使用されます。\fBvsi-mgrid\fR が VNIC 上に明示的に存在しない場合、\fBvsi-vers\fR は 0 に設定されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvswitching\fR\fR
.ad
.sp .6
.RS 4n
このプロパティーは、1 つの物理リンク上の VNIC 間または MAC クライアント間での切り替えが、リンクに関連付けられた仮想スイッチ経由で発生するのか、それとも外部スイッチ上で発生するのかを決定します。このプロパティーは物理リンクとアグリゲーションリンクにのみ適用されます。デフォルトでは、リンクに関連付けられた仮想スイッチ経由で切り替えが発生します。有効な値は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBlocal\fR\fR
.ad
.RS 10n
.rt  
リンク上の MAC クライアント間または VNIC 間の切り替えが、リンクの仮想スイッチ経由で内部的に発生します。これは、Virtual Ethernet Bridge (VEB) と呼ばれます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBremote\fR\fR
.ad
.RS 10n
.rt  
リンク上の MAC クライアント間または VNIC 間の切り替えが、外部スイッチ経由で外部的に発生します。これは、Virtual Ethernet Port Aggregator (VEPA) と呼ばれます。この値を設定する際には、外部スイッチ上でリフレクティブリレーが構成済みであると仮定されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBauto\fR\fR
.ad
.RS 10n
.rt  
Link Layer Discovery Protocol (LLDP) プロトコル経由で切り替えが決定されます。この値を指定した場合、リフレクティブリレーを有効にするために、外部スイッチとの LLDP 交換が開始されます。LLDP によるスイッチのリフレクティブリレーの有効化が成功した場合、実効値は remote となり (つまり、外部スイッチ上で切り替えが発生する)、それ以外の場合は local になります (つまり、ローカルでリンクの仮想スイッチ経由で切り替えが発生する)。
.RE

.RE

.sp
.ne 2
.mk
.na
\fBpvlan-tagmode\fR
.ad
.sp .6
.RS 4n
このプロパティーは、送信パケットがタグ付けされる方法を決定します。このプロパティーは物理リンクに適用されます。有効な値:
.sp
.ne 2
.mk
.na
\fB\fBprimary\fR\fR
.ad
.RS 13n
.rt  
送信パケットは、VNIC のプライマリ VID でタグ付けされます。
.RE

.sp
.ne 2
.mk
.na
\fBsecondary\fR
.ad
.RS 13n
.rt  
送信パケットは、VNIC のセカンダリ VID でタグ付けされます。これがデフォルト値です。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBiov\fR\fR
.ad
.sp .6
.RS 4n
このプロパティーは、それが物理リンクまたは VNIC のどちらで使用されるかに応じて異なる動作をします。
.sp
このリンクプロパティーを物理リンク上に設定すると、ユーザーは SR-IOV モードを有効または無効にできます。物理リンク上で \fBiov\fR に使用可能な値は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBauto\fR\fR
.ad
.RS 8n
.rt  
このリンク上で SR-IOV モードを有効にするかどうかを OS によって決めることができます。これがデフォルト値です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBon\fR\fR
.ad
.RS 8n
.rt  
SR-IOV モードをオンにします。これにより、VF VNICS の作成が可能になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBoff\fR\fR
.ad
.RS 8n
.rt  
SR-IOV モードをオフにします。これにより、VF VNICS を作成する機能が無効になります。
.RE

ユーザーは、\fBshow-linkprop\fR を使用して現在の \fBiov\fR 設定を表示できます。「EFFECTIVE」列には、OS によって決められた値が表示されます。「VALUE」列には、ユーザーが指定した値が表示されます。
.sp
このプロパティーは、VNIC の作成中に \fB-p\fR オプションを使って指定することもできます。このオプションを使用すると、ユーザーは VF VNIC を作成するかどうかを選択できます。この場合、\fBiov\fR に使用可能な値は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBinherit\fR\fR
.ad
.RS 11n
.rt  
「有効」な \fBiov\fR 設定を VNIC のベースとなるリンクから継承します。たとえば、ベースとなるリンクで \fB-iov\fR が on になっている場合、VNIC の作成中に \fBinherit\fR を指定することは、可能なら OS によって VF が割り当てられることを意味します。VF が見つからない場合は、代わりに通常の VNIC を作成します。ベースとなるリンクで iov が \fBoff\fR になっている場合、それは VF が割り当てられないことを意味します。
.sp
\fBcreate-vnic\fR 中に \fB-p\fR \fBiov\fR が指定されない場合は、これが想定されたデフォルト値になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBon\fR\fR
.ad
.RS 11n
.rt  
この VNIC 用の VF を割り当てる必要があります。VF が見つからない場合は、VNIC の作成に失敗します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBoff\fR\fR
.ad
.RS 11n
.rt  
この VNIC 用の VF を割り当てないでください。ベースとなる \fBiov\fR 設定に関係なく、作成された VNIC が常に通常の VNIC になります。
.RE

物理リンクの場合と異なり、\fBset-linkprop\fR によって VNIC の iov プロパティーを変更することはできません。それは \fBcreate-vnic\fR 中にのみ指定できます。\fBshow-linkprop\fR によってこのプロパティーを表示することは可能です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzone\fR\fR
.ad
.sp .6
.RS 4n
リンクが属しているゾーンを指定します。\fBdladm\fR ではこのプロパティーを一時的にしか変更できないため、\fB-t\fR オプションを指定する必要があります。ゾーンの割り当てがリブート後も持続するように変更するには、\fBzonecfg\fR(1M) を使用してください。指定可能な値は、システム上で現在実行されている任意の排他的 IP ゾーンで構成されます。デフォルトでは、ゾーンのバインドは \fBzonecfg\fR(1M) に従います。
.RE

.sp
.ne 2
.mk
.na
\fB\fBallow-autoconf\fR\fR
.ad
.sp .6
.RS 4n
物理リンクを自動的に構成するべきかどうかを指定します。このプロパティーは、システム定義の自動ネットワーク構成プロファイルがアクティブの場合にのみ適用可能です。デフォルト値は 1 で、リンクが自動的に構成されることを意味します。この値が 0 に設定されている場合、リンクは自動的に構成されません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBfw-vers\fR\fR
.ad
.sp .6
.RS 4n
物理データリンクにのみ適用可能です。物理 NIC のファームウェアバージョン情報を指定する読み取り専用プロパティー。このプロパティーが表示されるのは、\fB-p\fR オプションで明示的に要求された場合だけです。その値の形式、意味、および安定性は、個々のドライバによって異なり、ドライバのマニュアルページに記載されている場合もあります。
.RE

.sp
.LP
IPoIB VNIC でサポートされているリンクプロパティーは、\fBautopush\fR、\fBzone\fR、\fBmaxbw\fR、\fBcpus\fR、\fBrxfanout\fR、\fBpool\fR、\fBpriority\fR、\fBprotection\fR、\fBallowed-ips\fR、および \fBallowed-dhcp-cids\fR だけです。
.SS "WiFi リンクのプロパティー"
.sp
.LP
次の \fBWiFi\fR リンクのプロパティーがサポートされています。あるプロパティーを特定の値に設定できるかどうかは、ドライバやハードウェアによって異なることに注意してください。
.sp
.ne 2
.mk
.na
\fB\fBchannel\fR\fR
.ad
.sp .6
.RS 4n
使用するチャネルを指定します。このプロパティーは、\fBIBSS\fR モードにあるときに、特定の \fBWiFi\fR リンクによってのみ変更できます。デフォルト値や、許可される値の範囲は、規定のドメインごとに異なります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpowermode\fR\fR
.ad
.sp .6
.RS 4n
\fBWiFi\fR リンクの電源管理モードを指定します。指定可能な値は、\fBoff\fR (電源管理が無効)、\fBmax\fR (最大限の省電力)、および \fBfast\fR (パフォーマンス依存の電源管理) です。デフォルトは \fBoff\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBradio\fR\fR
.ad
.sp .6
.RS 4n
\fBWiFi\fR リンクの無線モードを指定します。指定可能な値は、\fBon\fR または \fBoff\fR です。デフォルトは \fBon\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBspeed\fR\fR
.ad
.sp .6
.RS 4n
\fBWiFi\fR リンクの固定速度を指定します (Mbps 単位)。設定可能な値のセットは、ドライバやハードウェアによって異なります (ただし、\fBshow-linkprop\fR で表示されます)。一般的な速度は 1、2、11、および 54 です。デフォルトでは、固定速度はありません。 
.RE

.SS "Ethernet リンクのプロパティー"
.sp
.LP
\fBieee802.3\fR(5) に記載されている次の MII プロパティーが、読み取り専用モードでサポートされています。
.RS +4
.TP
.ie t \(bu
.el o
\fBduplex\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBstate\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBadv_autoneg_cap\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBadv_10gfdx_cap\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBadv_1000fdx_cap\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBadv_1000hdx_cap\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBadv_100fdx_cap\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBadv_100hdx_cap\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBadv_10fdx_cap\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBadv_10hdx_cap\fR
.RE
.sp
.LP
各 \fBadv_\fR プロパティー (たとえば \fBadv_10fdx_cap\fR) には、自動ネゴシエーションで使用されるパラメータを制御する、読み取り/書き込み用の対応する \fBen_\fR プロパティー (たとえば \fBen_10fdx_cap\fR) もあります。電源管理が行われていない場合、速度/二重通信の \fBadv\fR* パラメータによって、ネゴシエーション済みで、かつハードウェアで現在有効な値が提供されます。ただし、電源管理が有効になっている場合には、ハードウェアで現在公開されている速度/二重通信機能が、最初のリンクパラメータネゴシエーションで使用されたビットセットのサブセットになっている可能性があります。そのため、MII の \fBadv_\fR* パラメータは読み取り専用としてマークされており、最初のネゴシエーションで速度と二重通信のプロパティーを構成するための \fBen_\fR* パラメータセットが追加されています。
.sp
.LP
\fBadv_autoneg_cap\fR には、対応するプロパティー \fBen_autoneg_cap\fR がないことに注意してください。\fBadv_autoneg_cap\fR は自動ネゴシエーション自体を有効または無効にする 0/1 スイッチであるため、電源管理の影響は受けません。
.sp
.LP
さらに、次の Ethernet プロパティーが報告されます。
.sp
.ne 2
.mk
.na
\fB\fBflowctrl\fR\fR
.ad
.sp .6
.RS 4n
デバイスによって通知されるフロー制御モードを確立します。有効な入力は次のいずれかです。
.sp
.ne 2
.mk
.na
\fB\fBauto\fR\fR
.ad
.sp .6
.RS 4n
デバイス上のフロー制御モードは動的に決められます。デバイスで設定された実際のフロー制御モードを確認するには、\fBflowctrl\fR プロパティーの \fBeffective\fR 値をチェックします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBno\fR\fR
.ad
.sp .6
.RS 4n
有効なフロー制御がありません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrx\fR\fR
.ad
.sp .6
.RS 4n
一時停止フレームを受信し、その受信した一時停止フレームに基づいて動作します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtx\fR\fR
.ad
.sp .6
.RS 4n
輻輳が発生すると相手に一時停止フレームを送信しますが、受信した一時停止フレームは無視します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpfc\fR\fR
.ad
.sp .6
.RS 4n
一時停止されるトラフィックの優先度の値を含む一時停止フレームを送信します。一時停止フレームを受信し、優先度の値がフレーム内に指定されている値であるトラフィックを操作します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBbi\fR\fR
.ad
.sp .6
.RS 4n
双方向のフロー制御。
.RE

この値の実際の設定は、デバイスやリンクパートナーによって許可されている機能により制約を受けることに注意してください。そのため、\fBflowctrl\fR の有効な値が、システムで選択された値を示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBgvrp-timeout\fR\fR
.ad
.sp .6
.RS 4n
VID 通知ブロードキャスト間の待機時間を指定します (ミリ秒単位)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmtu\fR\fR
.ad
.sp .6
.RS 4n
デバイスでサポートされているクライアントの最大 SDU (送信データ単位)。有効な範囲は 68 - 65536 です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntcs\fR\fR
.ad
.sp .6
.RS 4n
デバイスでサポートされているトラフィッククラスの数です。DCB (Data Center Bridging) の拡張機能をサポートしているデバイスは、複数のトラフィッククラスをサポートできます。このプロパティーを使用すると、デバイスが DCB の拡張機能をサポートしているかどうかを判断できます。これは読み取り専用プロパティーです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpfcmap\fR\fR
.ad
.sp .6
.RS 4n
このプロパティーは、PFC (優先度ベースのフロー制御) が有効になっている 802.1p の優先度の値を表すために使用します。これは 8 ビットマスクであり、対応する優先度に対して PFC が有効かどうかを個々のビットで示します。PFC が有効になっている優先度では、輻輳が発生した場合にデバイスはその優先度に対して一時停止フレームを送信します。これが関係しているのは、\fBntcs\fR が 0 より大きく、\fBflowctrl\fR の \fBeffective\fR 値が \fBpfc\fR である場合のみです。
.sp
\fBpfcmap\fR の有効な値は、LLDP DCBx ネゴシエーションに応じて、ユーザーが構成した値または \fBpfcmap-rmt\fR の有効な値のどちらかになります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpfcmap-rmt\fR\fR
.ad
.sp .6
.RS 4n
このプロパティーは、リモートピアの PFC 構成 (通常は隣接するスイッチ) を示すために使用されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBptp\fR\fR
.ad
.sp .6
.RS 4n
(読み取り専用) このプロパティーは、デバイスの PTP ハードウェア支援の可用性を示すために使用されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBspeed\fR\fR
.ad
.sp .6
.RS 4n
(読み取り専用) デバイスの動作速度 (Mbps 単位)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtagmode\fR\fR
.ad
.sp .6
.RS 4n
このリンクプロパティーは、リンク上で送信されているパケットに 802.1Q VLAN タグが挿入される条件を制御します。このプロパティーに割り当てることができるモード値は次の 2 つです。
.sp
.ne 2
.mk
.na
\fB\fBnormal\fR\fR
.ad
.RS 12n
.rt  
次の条件のときに、送信パケットに VLAN タグを挿入します。
.RS +4
.TP
.ie t \(bu
.el o
そのパケットが VLAN に属している。
.RE
.RS +4
.TP
.ie t \(bu
.el o
ユーザーが優先度のタグ付けを要求しました。
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fBvlanonly\fR\fR
.ad
.RS 12n
.rt  
送信パケットが VLAN に属している場合にのみ VLAN タグを挿入します。このモードでタグが挿入されているときにユーザーが 0 以外の優先度も要求した場合は、その優先度が尊重されて VLAN タグに含まれます。
.RE

デフォルト値は \fBvlanonly\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvlan-announce\fR\fR
.ad
.sp .6
.RS 4n
このプロパティーは、VLAN ID の自動通知を制御します。有効になっている場合、デバイス上で構成されているすべての VNIC または VLAN の VID をブロードキャストします。このプロパティーは、物理リンクとアグリゲーションの両方をサポートします。指定可能な値は、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBoff\fR\fR
.ad
.sp .6
.RS 4n
VID 通知は送信されません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBgvrp\fR\fR
.ad
.sp .6
.RS 4n
802.1D で定義されている GVRP プロトコルを使用して通知が送信されます。ブロードキャストの頻度の構成については、\fBgvrp-timeout\fR を参照してください。
.RE

.RE

.SS "InfiniBand リンクのプロパティー"
.sp
.LP
次のプロパティーは、IB パーティションオブジェクトデータリンクと IPoIB VNIC データリンクでのみサポートされています。
.sp
.ne 2
.mk
.na
\fB\fBlinkmode\fR\fR
.ad
.sp .6
.RS 4n
IB パーティションデータリンク上のリンクトランスポートのサービスタイプを設定します。デフォルト値は \fBcm\fR です。有効な値は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBcm\fR\fR
.ad
.sp .6
.RS 4n
接続モード。このモードでは 65520 のデフォルトの MTU を使用し、65535 バイトの最大 MTU をサポートします。リモートノードに対して接続モードが使用できない場合は、代わりに低信頼データグラムモードが自動的に使用されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBud\fR\fR
.ad
.sp .6
.RS 4n
低信頼データグラムモード。このモードでは 2044 のデフォルトの MTU を使用し、4092 バイトの最大 MTU をサポートします。
.RE

.RE

.SS "IP トンネルリンクのプロパティー"
.sp
.LP
次の IP トンネルリンクのプロパティーがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fBhoplimit\fR\fR
.ad
.sp .6
.RS 4n
トンネルリンクのカプセル化している外側の IP ヘッダーの IPv4 TTL または IPv6 ホップ制限を指定します。このプロパティーは、すべてのトンネルタイプに対して存在します。デフォルトの値は 64 です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBencaplimit\fR\fR
.ad
.sp .6
.RS 4n
RFC 2473 で定義されている IPv6 トンネルの IPv6 カプセル化制限を指定します。この値は、特定のトンネルパケットに対するトンネルのネスト制限です。デフォルト値は 4 です。0 の値を指定すると、カプセル化制限が無効になります。
.RE

.SS "アグリゲーションリンクのプロパティー"
.sp
.LP
次のプロパティーは、DLMP モードアグリゲーションでのみサポートされます。
.sp
.ne 2
.mk
.na
\fB\fBprobe-ip\fR\fR
.ad
.sp .6
.RS 4n
このプロパティーは、ICMP プローブのための発信元 IP アドレスとしての使用が許可されている IP アドレスのコンマ区切りリストです。このリストの IP アドレスが (plumb されたプライマリまたは VNIC として) 構成されている場合、ICMP プローブに使用されます。これらの IP アドレスは、通常と同様に、引き続きデータトラフィックを伝送します。そのため、プローブのために排他的な IP アドレスを予約する必要はありません。
.sp
リスト内の各フィールドは、「発信元 IP」とそのあとに続くオプションのターゲット構成情報で構成されています。ターゲット情報 (指定されている場合) は、ターゲット IP アドレスまたは文字列「rt」のどちらかです。後者である場合、\fBin.dlmpd\fR デーモンは、ルーティングテーブルを参照して指定された「発信元 IP」アドレスと同じサブネット上の経路を探し、指定された次のホップをターゲット IP アドレスとして使用します。
.sp
ターゲットが指定されていない場合、DLMP プローブサービスは、ICMP マルチキャストパケットを送信することによって潜在的なターゲット IP アドレスを検出しようとします。
.sp
ターゲット IP アドレスの発信元 (検出されたか、指定されたか、またはルーティングテーブルから取得されたか) には関係なく、ターゲット IP アドレスは、指定された発信元 IP アドレスと同じサブネットワーク内に存在する必要があります。そうしないと、有効になりません。
.sp
次の形式が受け入れられます。「target」はターゲットの IP アドレスまたはホスト名のどちらかになります。
.sp
.ne 2
.mk
.na
\fB<\fIIP address\fR>[/\fBprefixlen \fR][+<\fItarget address\fR>\fR
.ad
.sp .6
.RS 4n
IP アドレスとその接頭辞の長さを明示的に指定します (オプション)。たとえば、\fI10.134.8.0/24+\fR とします。
.RE

.sp
.ne 2
.mk
.na
\fB<\fIaddrobj_name\fR>[+<\fItarget address\fR>\fR
.ad
.sp .6
.RS 4n
特定の \fIaddrobj\fR 名を指定します。これは、\fBipadm show-addr\fR の出力で確認できます。たとえば、\fI vnic1/addr1+169.156.0.1\fR とします。
.RE

.sp
.ne 2
.mk
.na
\fB<\fIinterface_name\fR>[+<\fItarget address\fR>\fR
.ad
.sp .6
.RS 4n
特定のインタフェース名を指定します。アグリゲーションインタフェース自体、またはそのアグリゲーション上に構成された任意の VNIC のどちらの名前でもかまいません。指定されたインタフェース上に構成されたすべての IPv4 アドレスおよび IPv6 アドレスが ICMP プローブに使用されます。ホスト名とインタフェース名とのあいまいさを避けるために、インタフェース名は角括弧で囲まれます。たとえば、[\fIdlmp1\fR]+ とします。 
.RE

.sp
.ne 2
.mk
.na
\fB+[<\fItarget\fR>]\fR
.ad
.sp .6
.RS 4n
発信元 IP アドレスが指定されていない場合は、大域ゾーンのアグリゲーションおよび VNIC 上に構成されたすべての IP アドレスが、ICMP プローブの潜在的な発信元 IP アドレスになります。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBprobe-fdt\fR\fR
.ad
.sp .6
.RS 4n
このリンクプロパティーによって、障害検出時間が定義されます。予測される障害検出時間の値 (秒単位) が構成されます。デフォルト値は 10 秒です。
.RE

.SH 使用例
.LP
\fB例 1 \fRデータリンク構成の表示
.sp
.LP
次のコマンドは、\fBdladm\fR を引数なしで呼び出した場合の効果を示します。

.sp
.in +2
.nf
# \fBdladm\fR
LINK                CLASS     MTU    STATE    OVER
net0                phys      1500   up       --
net1                phys      1500   up       --
net2                phys      1500   unknown  --
net3                phys      1500   up       --
vnic1               vnic      1500   up       net1
vlan1               vlan      1500   up       net1
aggr1               aggr      1500   up       net2 net3
stub1               etherstub 9000   unknown  --
.fi
.in -2
.sp

.LP
\fB例 2 \fRアグリゲーションの構成
.sp
.LP
キー 1 を使用してデバイス \fBbge0\fR (リンク名 \fBnet0\fR) および \fBbge1\fR (リンク名 \fBnet1\fR) のアグリゲーション上にデータリンクを構成するには、次のコマンドを入力します。

.sp
.in +2
.nf
# \fBdladm create-aggr -l net0 -l net1 1\fR
.fi
.in -2
.sp

.sp
.LP
\fBaggr1\fR という名前を持つ、デバイス \fBe1000g1\fR (リンク名 \fBnet0\fR) および \fBe1000g2\fR (リンク名 \fBnet1\fR) の IEEE 802.3ad リンクアグリゲーションを構成するには、次のコマンドを入力します。

.sp
.in +2
.nf
# \fBdladm create-aggr -l net0 -l net1 aggr1\fR
.fi
.in -2
.sp

.sp
.LP
デバイス \fBixgbe1\fR (リンク名 \fBnet2\fR) および \fBixgbe2\fR (リンク名 \fBnet3\fR) のデータリンクマルチパス (\fBdlmp\fR) リンクアグリゲーションを名前 \fBaggr2\fR で構成するには、次のコマンドを入力します:

.sp
.in +2
.nf
# \fBdladm create-aggr -m dlmp -l net2  -l net3 aggr2\fR
.fi
.in -2
.sp

.sp
.LP
アグリゲーションを一覧表示するには、次のコマンドを入力します:

.sp
.in +2
.nf
# \fBdladm show-aggr\fR
LINK              MODE    POLICY   ADDRPOLICY           LACPACTIVITY  LACPTIMER
aggr1             trunk   L4       auto                 off           short
aggr2             dlmp    --       --                   --            --
.fi
.in -2
.sp

.LP
\fB例 3 \fRWiFi リンクへの接続
.sp
.LP
システム上で使用できるセキュリティー保護されていない最適なネットワークに 1 つの \fBWiFi\fR リンクで (\fBconnect-wifi\fR に対して指定された優先順位付け規則に従って) 接続するには、次のコマンドを入力します。

.sp
.in +2
.nf
# \fBdladm connect-wifi\fR
.fi
.in -2
.sp

.LP
\fB例 4 \fRWiFi キーの作成
.sp
.LP
\fBWEP\fR キー \fBmykey\fR を対話形式で作成するには、次のコマンドを入力します。

.sp
.in +2
.nf
# \fBdladm create-secobj -c wep mykey\fR
.fi
.in -2
.sp

.sp
.LP
あるいは、ファイルの内容を使用して \fBWEP\fR キー \fBmykey\fR を非対話形式で作成するには、次のコマンドを入力します。

.sp
.in +2
.nf
# \fBumask 077\fR
 # \fBcat >/tmp/mykey.$$ <<EOF\fR
 \fB12345\fR
 \fBEOF\fR
 # \fBdladm create-secobj -c wep -f /tmp/mykey.$$ mykey\fR
 # \fBrm /tmp/mykey.$$\fR
.fi
.in -2
.sp

.LP
\fB例 5 \fR暗号化された指定の WiFi リンクへの接続
.sp
.LP
キー \fBmykey\fR を使用してリンク \fBath0\fR 上の \fBESSID\fR \fBwlan\fR に接続するには、次のコマンドを入力します。

.sp
.in +2
.nf
# \fBdladm connect-wifi -k mykey -e wlan ath0\fR
.fi
.in -2
.sp

.LP
\fB例 6 \fRリンクのプロパティーの変更
.sp
.LP
リンク \fBpcwl0\fR 上で \fBpowermode\fR を値 \fBfast\fR に設定するには、次のコマンドを入力します。

.sp
.in +2
.nf
# \fBdladm set-linkprop -p powermode=fast pcwl0\fR
.fi
.in -2
.sp

.LP
\fB例 7 \fRWPA で保護された WiFi リンクへの接続
.sp
.LP
WPA キー \fBpsk\fR を作成し、次のコマンドを入力します。

.sp
.in +2
.nf
# \fBdladm create-secobj -c wpa psk\fR
.fi
.in -2
.sp

.sp
.LP
次に、キー \fBpsk\fR を使用してリンク \fBath0\fR 上の ESSID \fBwlan\fR に接続するには、次のコマンドを入力します。

.sp
.in +2
.nf
# \fBdladm connect-wifi -k psk -e wlan ath0\fR
.fi
.in -2
.sp

.LP
\fB例 8 \fRリンクの名前の変更
.sp
.LP
\fBbge0\fR リンクの名前を \fBmgmt0\fR に変更するには、次のコマンドを入力します。

.sp
.in +2
.nf
# \fBdladm rename-link bge0 mgmt0\fR
.fi
.in -2
.sp

.LP
\fB例 9 \fRネットワークカードの交換
.sp
.LP
前の例で示した \fBmgmt0\fR というリンク名の \fBbge0\fR デバイスを、ハードウェア障害のために \fBce0\fR デバイスに交換する必要があるとします。\fBbge0\fR NIC を物理的に取り外し、新しい \fBce0\fR NIC に交換します。新しく追加された \fBce0\fR デバイスを、以前に \fBbge0\fR に関連付けられていた \fBmgmt0\fR 構成に関連付けるには、次のコマンドを入力します。

.sp
.in +2
.nf
# \fBdladm rename-link ce0 mgmt0\fR
.fi
.in -2
.sp

.LP
\fB例 10 \fRネットワークカードの取り外し
.sp
.LP
前の例で、\fBbge0\fR NIC を別の NIC に交換するのではなく、ハードウェアを取り外すだけで交換は行わない場合を考えてみます。この場合、\fBmgmt0\fR のデータリンク構成を、前の例で示したように別の物理デバイスに関連付けるのではなく、削除する必要があります。物理ハードウェア (この場合は \fBbge0\fR) が取り外された \fBmgmt0\fR データリンクに関連付けられたデータリンク構成を削除するには、次のコマンドを入力します。

.sp
.in +2
.nf
# \fBdladm delete-phys mgmt0\fR
.fi
.in -2
.sp

.LP
\fB例 11 \fR解析可能な出力による単一のフィールドの取得
.sp
.LP
次の割り当てによって、リンク \fBnet0\fR の MTU が \fBmtu\fR という名前の変数に保存されます。

.sp
.in +2
.nf
# \fBmtu=`dladm show-link -p -o mtu net0`\fR
.fi
.in -2
.sp

.LP
\fB例 12 \fR解析可能な出力によるリンクの状態表示
.sp
.LP
次のスクリプトは、システム上の各リンクの状態を表示します。

.sp
.in +2
.nf
# \fBdladm show-link -p -o link,state | while IFS=: read link state; do
            print "Link $link is in state $state"
        done\fR
.fi
.in -2
.sp

.LP
\fB例 13 \fRVNIC の構成
.sp
.LP
1 つの物理リンク \fBnet0\fR 上に \fBhello0\fR および \fBtest1\fR という名前の 2 つの VNIC を作成します:

.sp
.in +2
.nf
# \fBdladm create-vnic -l net0 hello0\fR
# \fBdladm create-vnic -l net0 test1\fR
.fi
.in -2
.sp

.LP
\fB例 14 \fRVNIC の構成、および帯域幅と優先度の割り当て
.sp
.LP
1 つの物理リンク \fBnet0\fR 上に \fBhello0\fR および \fBtest1\fR という名前の 2 つの VNIC を作成し、\fBhello0\fR を、ファクトリ MAC アドレスと 50M ビット/秒の最大帯域幅を持つ高優先度の VNIC にします。\fBtest1\fR を、ランダムな MAC アドレスと 100Mbps の最大帯域幅を持つ低優先度の VNIC にします。

.sp
.in +2
.nf
# \fBdladm create-vnic -l net0 -m factory -p maxbw=50,priority=high hello0\fR
# \fBdladm create-vnic -l net0 -m random -p maxbw=100M,priority=low test1\fR
.fi
.in -2
.sp

.LP
\fB例 15 \fRファクトリ MAC アドレスを持つ VNIC の構成
.sp
.LP
最初に、使用可能なファクトリ MAC アドレスを一覧表示し、いずれかのアドレスを選択します。

.sp
.in +2
.nf
# \fBdladm show-phys -m net0\fR
LINK            SLOT         ADDRESS              INUSE    CLIENT
net0            primary      0:e0:81:27:d4:47     yes      net0
net0            1            8:0:20:fe:4e:a5      no
net0            2            8:0:20:fe:4e:a6      no
net0            3            8:0:20:fe:4e:a7      no
.fi
.in -2
.sp

.sp
.LP
\fBhello0\fR という名前の VNIC を作成し、スロット 1 のアドレスを使用します。

.sp
.in +2
.nf
# \fBdladm create-vnic -l net0 -m factory -n 1 hello0\fR
# \fBdladm show-phys -m net0\fR
LINK            SLOT         ADDRESS              INUSE    CLIENT
net0            primary      0:e0:81:27:d4:47     yes      net0
net0            1            8:0:20:fe:4e:a5      yes      hello0
net0            2            8:0:20:fe:4e:a6      no
net0            3            8:0:20:fe:4e:a7      no
.fi
.in -2
.sp

.LP
\fB例 16 \fRユーザー指定の MAC アドレスを持つ VNIC の作成、およびプロセッサのセットへのバインド
.sp
.LP
ユーザー指定の MAC アドレスと \fB0、2、4-6\fR のプロセッサバインドを持つ、VNIC という名前の \fBhello0\fR を作成します。

.sp
.in +2
.nf
# \fBdladm create-vnic -l net0 -m 8:0:20:fe:4e:b8 -p cpus=0,2,4-6 hello0\fR
.fi
.in -2
.sp

.LP
\fB例 17 \fR物理 NIC のない仮想ネットワークの作成
.sp
.LP
最初に、\fBstub1\fR という名前の etherstub を作成します。

.sp
.in +2
.nf
# \fBdladm create-etherstub stub1\fR
.fi
.in -2
.sp

.sp
.LP
etherstub 上に \fBhello0\fR と \fBtest1\fR という名前の 2 つの VNIC を作成します。この操作によって、\fBhello0\fR と \fBtest1\fR を接続する仮想スイッチが暗黙的に作成されます。

.sp
.in +2
.nf
# \fBdladm create-vnic -l stub1 hello0\fR
# \fBdladm create-vnic -l stub1 test1\fR
.fi
.in -2
.sp

.LP
\fB例 18 \fRブリッジ情報の表示
.sp
.LP
次の各コマンドは、オプションを指定しない場合とさまざまなオプションを指定した場合の \fBshow-bridge\fR サブコマンドを使用しています。

.sp
.in +2
.nf
# \fBdladm show-bridge\fR
BRIDGE       PROTECT ADDRESS           PRIORITY DESROOT
foo          stp     32768/8:0:20:bf:f 32768    8192/0:d0:0:76:14:38
bar          stp     32768/8:0:20:e5:8 32768    8192/0:d0:0:76:14:38

# \fBdladm show-bridge -l foo\fR
LINK         STATE        UPTIME   DESROOT
hme0         forwarding   117      8192/0:d0:0:76:14:38
qfe1         forwarding   117      8192/0:d0:0:76:14:38

# \fBdladm show-bridge -s foo\fR
BRIDGE       DROPS        FORWARDS
foo          0            302

# \fBdladm show-bridge -ls foo\fR
LINK         DROPS     RECV      XMIT
hme0         0         360832    31797
qfe1         0         322311    356852

# \fBdladm show-bridge -f foo\fR
DEST              AGE     FLAGS  OUTPUT
8:0:20:bc:a7:dc   10.860  --     hme0
8:0:20:bf:f9:69   --      L      hme0
8:0:20:c0:20:26   17.420  --     hme0
8:0:20:e5:86:11   --      L      qfe1
.fi
.in -2
.sp

.LP
\fB例 19 \fRIPv4 トンネルの作成
.sp
.LP
次の一連のコマンドは、66.1.2.3 と 192.4.5.6 の間に \fBmytunnel0\fR という名前の永続的な IPv4 トンネルリンクを作成してから、そのリンクを表示しています。

.sp
.in +2
.nf
# \fBdladm create-iptun -T ipv4 -a local=66.1.2.3,remote=192.4.5.6 mytunnel0\fR
# \fBdladm show-iptun mytunnel0\fR
LINK            TYPE  FLAGS  SOURCE              DESTINATION
mytunnel0       ipv4  --     66.1.2.3            192.4.5.6
.fi
.in -2
.sp

.sp
.LP
このトンネルリンク上に、ポイントツーポイント IP インタフェースを作成できます。

.sp
.in +2
.nf
# \fBipadm create-ip mytunnel0\fR
# \fBipadm create-addr -T static -a local=10.1.0.1,remote=10.1.0.2 \e\fR
\fBmytunnel0/addr\fR
# \fBipadm show-addr mytunnel0/addr\fR
ADDROBJ           TYPE     STATE        ADDR
mytunnel0/addr    static   ok           10.1.0.1->10.1.0.2
.fi
.in -2
.sp

.LP
\fB例 20 \fR6to4 トンネルの作成
.sp
.LP
次のコマンドは、6to4 トンネルリンクを作成します。6to4 ルーターの IPv4 アドレスは 75.10.11.12 です。

.sp
.in +2
.nf
# \fBdladm create-iptun -T 6to4 -a local=75.10.11.12 sitetunnel0\fR
# \fBdladm show-iptun sitetunnel0\fR
LINK            TYPE  FLAGS  SOURCE              DESTINATION
sitetunnel0     6to4  --     75.10.11.12         --
.fi
.in -2
.sp

.sp
.LP
次のコマンドは、このトンネル上に IPv6 インタフェースを作成します。

.sp
.in +2
.nf
# \fBipadm create-ip sitetunnel0\fR
# \fBipadm show-addr sitetunnel0/_a\fR
ADDROBJ           TYPE     STATE        ADDR
sitetunnel0/_a    static   ok           2002:4b0a:b0c::1/16
.fi
.in -2
.sp

.sp
.LP
システムは 6to4 IP インタフェース上に IPv6 アドレスを自動的に構成することに注意してください。6to4 トンネルリンク上で IPv6 アドレスが構成される方法については、\fBipadm\fR(1M) を参照してください。

.LP
\fB例 21 \fRリンク保護の使用
.sp
.LP
リンク保護を有効にするには:

.sp
.in +2
.nf
# \fBdladm set-linkprop \e\fR
\fB-p protection=mac-nospoof,restricted,ip-nospoof,dhcp-nospoof vnic0\fR
.fi
.in -2
.sp

.sp
.LP
リンク保護を無効にするには: 

.sp
.in +2
.nf
# \fBdladm reset-linkprop -p protection vnic0\fR
.fi
.in -2
.sp

.sp
.LP
\fBallowed-ips\fR リストを変更するには: 

.sp
.in +2
.nf
# \fBdladm set-linkprop -p allowed-ips=10.0.0.1,10.0.0.2 vnic0\fR
.fi
.in -2
.sp

.sp
.LP
\fBallowed-dhcp-cids\fR リストを変更するには: 

.sp
.in +2
.nf
# \fBdladm set-linkprop -p allowed-dhcp-cids=hello vnic0\fR
.fi
.in -2
.sp

.sp
.LP
結果の構成を表示するには: 

.sp
.in +2
.nf
# \fBdladm show-linkprop -p protection,allowed-ips vnic0\fR

LINK  PROPERTY    PERM   VALUE        EFFECTIVE    DEFAULT POSSIBLE
vnic0 protection  rw     mac-nospoof, mac-nospoof, --      mac-nospoof,
                         restricted,  restricted,          restricted,
                         ip-nospoof,  ip-nospoof,          ip-nospoof,
                         dhcp-nospoof dhcp-nospoof         dhcp-nospoof
vnic0 allowed-ips rw     10.0.0.1,    10.0.0.1,    --      --
                         10.0.0.2     10.0.0.2
vnic0 allowed-dhcp-cids rw hello      hello        --      --
.fi
.in -2
.sp

.LP
\fB例 22 \fRIB パーティションの作成
.sp
.LP
次のコマンドは、物理リンク \fBibp0\fR 上にパーティションキー \fB0xffff\fR を持つパーティション \fBffff.ibp0\fR を作成します。

.sp
.in +2
.nf
# \fBdladm create-part -P ffff -l ibp0 ffff.ibp0\fR
.fi
.in -2
.sp

.LP
\fB例 23 \fRIB パーティション情報の表示
.sp
.LP
次のコマンドは、IB パーティション情報を表示します。

.sp
.in +2
.nf
# \fBdladm show-part\fR
LINK         PKEY OVER         STATE    FLAGS
ffff.ibp0    FFFF ibp0         up       ----
.fi
.in -2
.sp

.LP
\fB例 24 \fRIB データリンク情報の表示
.sp
.LP
次のコマンドは、IB データリンク情報を表示します。

.sp
.in +2
.nf
# \fBdladm show-ib\fR
LINK     HCAGUID        PORTGUID       PORT STATE  GWNAME GWPORT  PKEYS
net0     3BA000100CD7C  3BA000100CD7D  1    down   --     --      FFFF
net1     3BA000100CD7C  3BA000100CD7E  2    down   --     --      FFFF
net3     5AD0000033634  5AD0000033636  2    up     --     --      FFFF,8001
net2     5AD0000033634  5AD0000033635  1    up     --     --      FFFF,8001
.fi
.in -2
.sp

.LP
\fB例 25 \fRIB HCA マッピングの表示
.sp
.LP
次のコマンドは、各 IB リンクが実行される \fBibadm\fR(1M) によって管理される IB HCA の名前を表示します。

.sp
.in +2
.nf
# \fBdladm show-ib -o link,hca,port,hcaguid,portguid,pkeys\fR
LINK     HCA            PORT   HCAGUID        PORTGUID       PKEYS
net0     hermon0        1      3BA000100CD7C  3BA000100CD7D  FFFF,8001
net1     hermon0        2      3BA000100CD7C  3BA000100CD7E  FFFF,8001
net3     hermon0.vhca0  2      5AD0000033634  5AD0000033636  FFFF,8001
net2     hermon0.vhca1  1      5AD0000033634  5AD0000033635  FFFF,8001
.fi
.in -2
.sp

.LP
\fB例 26 \fRパーティションの削除
.sp
.LP
次のコマンドは、パーティション \fBffff.ibp0\fR を削除します。

.sp
.in +2
.nf
# \fBdladm delete-part ffff.ibp0\fR
.fi
.in -2
.sp

.LP
\fB例 27 \fR\fBshow-link\fR によるパーティション情報の表示
.sp
.LP
次のコマンドは、\fBshow-link\fR サブコマンドを使用してパーティション情報を表示します。

.sp
.in +2
.nf
# \fBdladm show-link\fR
LINK        CLASS     MTU    STATE    OVER
e1000g0     phys      1500   up       --
e1000g1     phys      1500   unknown  --
net0        phys      65520  down     --
net3        phys      65520  up       --
net2        phys      65520  up       --
net1        phys      65520  down     --
pffff.ibp0  part      2044   down     ibp0
p8001.ibp2  part      65520  unknown  ibp2
.fi
.in -2
.sp

.LP
\fB例 28 \fR大域ゾーンからのすべてのゾーン内のリンクの表示
.sp
.LP
次に示す \fBshow-link\fR コマンドは、大域ゾーンからすべてのゾーン内のデータリンクを表示します。大域ゾーンに含まれないリンクは、ゾーン名の接頭辞のあとにスラッシュ (\fB/\fR) 区切り文字を付けて表示されます。

.sp
.LP
この例では、\fBnet0\fR は大域ゾーン内で作成された VNIC であり、\fBzone1/net0\fR は \fBzone1\fR に対して自動的に作成された VNIC であり、\fBzone2/net0\fR は \fBzone2\fR に対して自動的に作成された VNIC です。

.sp
.in +2
.nf
# \fBdladm show-link\fR
LINK                CLASS     MTU    STATE    OVER
e1000g0             phys      1500   up       --
e1000g1             phys      8170   unknown  --
e1000g2             phys      1500   unknown  --
e1000g3             phys      1500   unknown  --
net0                vnic      1500   up       e1000g0
zone1/net0          vnic      1500   up       e1000g0
zone2/net0          vnic      1500   up       e1000g0
.fi
.in -2
.sp

.LP
\fB例 29 \fR大域ゾーン内のリンクの表示
.sp
.LP
次の \fBshow-link\fR コマンドは、大域ゾーン内のデータリンクのみを表示します。

.sp
.in +2
.nf
# \fBdladm show-link -z global\fR
LINK                CLASS     MTU    STATE    OVER
e1000g0             phys      1500   up       --
e1000g1             phys      8170   unknown  --
e1000g2             phys      1500   unknown  --
e1000g3             phys      1500   unknown  --
net0                vnic      1500   up       e1000g0
.fi
.in -2
.sp

.LP
\fB例 30 \fR指定されたゾーンのリンクの表示
.sp
.LP
次の \fBshow-link\fR コマンドは、特定の非大域ゾーン内のデータリンクを表示します。

.sp
.in +2
.nf
# \fBdladm show-link -z zone1\fR
LINK                CLASS     MTU    STATE    OVER
zone1/net0          vnic      1500   up       e1000g0
.fi
.in -2
.sp

.LP
\fB例 31 \fR大域ゾーンからの指定されたゾーンのリンクの表示
.sp
.LP
次の \fBshow-link\fR コマンドは、特定の非大域ゾーン内のデータリンクを大域ゾーンから表示します。

.sp
.in +2
.nf
# \fBdladm show-link -z zone1\fR
LINK                CLASS     MTU    STATE    OVER
zone1/net0          vnic      1500   up       e1000g0
.fi
.in -2
.sp

.LP
\fB例 32 \fR非大域ゾーン内のリンクの表示
.sp
.LP
次に示す \fBshow-link\fR は、\fBzone1\fR から呼び出され、そのゾーンのデータリンクのみを表示します。

.sp
.LP
\fBshow-link\fR の出力では、\fBzone1/\fR 接頭辞は表示されません。接頭辞が表示されないのは、このコマンドがゾーンの内部から呼び出されたからです。

.sp
.in +2
.nf
# \fBzlogin zone1\fR
# \fBdladm show-link -z zone1\fR
LINK                CLASS     MTU    STATE    OVER
net0                vnic      1500   up       ?
.fi
.in -2
.sp

.LP
\fB例 33 \fR-Z オプションを使用した現在のゾーンの表示
.sp
.LP
下記のコマンドでは、次の条件を前提としています。

.RS +4
.TP
.ie t \(bu
.el o
リンク \fBnet1\fR は現在、\fBzoneA\fR に割り当てられています。エントリ \fBnet1\fR および \fBzoneA/net1\fR は同じリンクを表しています。これらの 2 つのエントリの \fBZONE\fR 列は同じで、リンクが現在割り当てられているゾーンの名前になります。
.RE
.RS +4
.TP
.ie t \(bu
.el o
リンク \fBnet2\fR はどの非大域ゾーンにも割り当てられていません。
.RE
.RS +4
.TP
.ie t \(bu
.el o
リンク \fBzoneB/net2\fR は、\fBzoneB\fR 用に作成された自動 VNIC です。
.RE
.RS +4
.TP
.ie t \(bu
.el o
リンク \fBzoneC/net2\fR は、\fBzoneC\fR 用に作成された自動 VNIC です。
.RE
.RS +4
.TP
.ie t \(bu
.el o
リンク \fBzoneD/net2\fR は、\fBzoneD\fR の内側で作成された IP トンネルです。\fBnet1\fR の場合と異なり、\fBnet2\fR の各エントリは異なるリンクを表します。これらのエントリの \fBZONE\fR 列は異なります。
.RE
.sp
.in +2
.nf
# \fBdladm show-link -Z\fR
LINK        ZONE      CLASS     MTU    STATE    OVER
e1000g0     global    phys      1500   up       --
e1000g1     global    phys      1500   up       --
net1        zoneA     vnic      1500   up       e1000g0
zoneA/net1  zoneA     vnic      1500   up       e1000g0
net2        global    vnic      1500   up       e1000g1
zoneB/net2  zoneB     vnic      1500   up       e1000g1
zoneC/net2  zoneC     vnic      1500   up       e1000g1
zoneD/net2  zoneD     iptun     65515  up       --
.fi
.in -2
.sp

.LP
\fB例 34 \fRVDP 情報の表示
.sp
.LP
次のコマンドは、\fBvnic1\fR の VDP 情報を表示します。

.sp
.in +2
.nf
# \fBdladm show-ether -P vdp vnic1\fR
LINK    VSI     VSIID           VSI-TYPEID      VSI-STATE CMD-PENDING
ixgbe1  vnic1   2:8:20:3:2:b    0x58/0          ASSOC     DEASSOC
.fi
.in -2
.sp

.LP
\fB例 35 \fRECP 情報の表示
.sp
.LP
次のコマンドは、\fBixgbe1\fR の ECP 情報を表示します。

.sp
.in +2
.nf
# \fBdladm show-ether -P ecp  ixgbe1\fR
LINK    SEQNO   ACKNO   LAST-ACK        MAX-RETRIES     TIMEOUTS
ixgbe1  65535   25660   0               3                164
.fi
.in -2
.sp

.LP
\fB例 36 \fRVSI マネージャー ID、VSI タイプ、および VSI バージョンの設定
.sp
.LP
次のコマンドは、\fBvnic1\fR の VSI マネージャー ID、VSI タイプ、および VSI バージョンを設定します。

.sp
.in +2
.nf
# \fBdladm set-linkprop -p vsi-mgrid=fe80::214:4fff:fec2:67c8 vnic1\fR
# \fBdladm set-linkprop -p vsi-typeid=0x64,vsi-vers=1 vnic1\fR
.fi
.in -2
.sp

.LP
\fB例 37 \fRVLAN の移行および VLAN-ID の変更
.sp
.LP
次のコマンドシーケンスは、VLAN を移行する方法およびその VLAN-ID を変更する方法を示します。

.sp
.in +2
.nf
# \fBdladm show-vlan vlan0\fR
LINK		   VID SVID PVLAN-TYPE  FLAGS  OVER
vlan0		   100 --   --          -----  net0
# \fBdladm modify-vlan -l net1 -v 200 vlan0\fR
# \fBdladm show-vlan vlan0\fR
LINK		   VID SVID PVLAN-TYPE  FLAGS  OVER
vlan0		   200 --   --          -----  net1
.fi
.in -2
.sp

.LP
\fB例 38 \fR複数の VNIC の移行
.sp
.LP
次のコマンドシーケンスは、複数の VNIC の移行方法を示します。

.sp
.in +2
.nf
# \fBdladm show-vnic\fR
LINK      OVER     SPEED  MACADDRESS        MACADDRTYPE    IDS
vnic0     net0     1000   2:8:20:ec:c4:1d   random         VID:0
vnic1     net0     1000   2:8:20:ec:c4:1e   random         VID:0
# \fBdladm modify-vnic -l net1 -L net0\fR
# \fBdladm show-vnic\fR
LINK      OVER     SPEED  MACADDRESS        MACADDRTYPE    IDS
vnic0     net1     1000   2:8:20:ec:c4:1d   random         VID:0
vnic1     net1     1000   2:8:20:ec:c4:1e   random         VID:0
.fi
.in -2
.sp

.LP
\fB例 39 \fRVNIC の移行およびその MAC アドレスの変更
.sp
.LP
次のコマンドシーケンスは、VNIC を移行して、その MAC アドレスを変更する方法を示します。

.sp
.in +2
.nf
# \fBdladm show-vnic vnic0\fR
LINK      OVER     SPEED  MACADDRESS        MACADDRTYPE    IDS
vnic0     net0     1000   2:8:20:ec:c4:1d   random         VID:0
# \fBdladm modify-vnic -l net1 -m 2:8:20:00:01:02 vnic0\fR
# \fBdladm show-vnic vnic0\fR
LINK      OVER     SPEED  MACADDRESS        MACADDRTYPE    IDS
vnic0     net1     1000   2:8:20:0:1:2      fixed          VID:0
.fi
.in -2
.sp

.LP
\fB例 40 \fR\fBcos\fR および ETS 帯域幅の構成
.sp
.LP
次の例では、物理リンク \fBnet1\fR 上に名前が \fBvnic1\fR の VNIC を作成して、それに \fBcos\fR 値 3 を割り当てます。

.sp
.in +2
.nf
# \fBdladm create-vnic -p cos=3 -l net1 vnic1\fR
.fi
.in -2
.sp

.sp
.LP
\fBvnic1\fR により転送されるすべてのパケットには、優先度フィールドが 3 に設定された VLAN ヘッダーが付けられます。

.sp
.LP
さらに、ベースとなる物理 NIC に DCB 機能が登録されている場合は、ETS 帯域幅を \fBvnic1\fR に割り当てることができます。次のコマンドでは、LLDP パッケージがインストールされておらず、有効でもないものとします。

.sp
.LP
\fBntcs\fR リンクプロパティーを使用して、ベースとなる NIC に DCB 機能が登録されているかどうかをチェックします。\fBntcs\fR がゼロでない場合、ベースとなる NIC には DCB 機能が登録されています。

.sp
.in +2
.nf
# \fBdladm show-linkprop -p ntcs net1\fR
.fi
.in -2
.sp

.sp
.LP
次のコマンドは、リンクの帯域幅の 10% の ETS 帯域幅を \fBvnic1\fR に割り当てます。

.sp
.in +2
.nf
# \fBdladm set-linkprop -p etsbw_lcl=10 vnic1\fR
.fi
.in -2
.sp

.sp
.LP
\fBmaxbw\fR リンクプロパティーも設定されている場合、トラフィックは \fBmaxbw\fR 値に制限されます。

.sp
.LP
LLDP パッケージ (\fBservice/network/lldp\fR) がインストールされ、有効になっている場合、ETS 帯域幅の構成は IEEE 802.1Qaz 仕様に準拠します。

.sp
.LP
LLDP ETS TLV willing プロパティーは、ローカルとリモートのどちらの構成が適用または使用されるかを判定します。

.sp
.LP
\fBetsbw-lcl-advice\fR リンクプロパティーは、可能な場合にリモートで推奨される値を示します。\fBetsbw-lcl\fR リンクプロパティーの有効な値は、\fBvnic1\fR に割り当てられている実際の ETS 帯域幅を示します。

.sp
.in +2
.nf
# \fBdladm show-linkprop -p etsbw-lcl-advice,etsbw-lcl vnic1\fR
.fi
.in -2
.sp

.sp
.LP
リンクの帯域幅の 10% を vnic1 に割り当てることをピアに提案するには、次のコマンドを使用します。

.sp
.in +2
.nf
# \fBdladm set-linkprop -p etsbw-rmt-advice=10 vnic1\fR
.fi
.in -2
.sp

.LP
\fB例 41 \fREoIB データリンクの構成
.sp
.LP
特定の IB ポート「ibp1」から到達可能なすべてのゲートウェイのリストを検査します。

.sp
.in +2
.nf
# \fBdladm show-ib ibp1\fR
LINK   HCAGUID        PORTGUID       PORT STATE  GWNAME    GWPORT    PKEYS
ibp1   212800013F2F5A 212800013F2F5B 1    up     nm2gw-1   0a-eth-1  FFFF
                                                 nm2gw-1   0a-eth-2
                                                 nm2gw-1   0a-eth-3
                                                 nm2gw-1   0a-eth-4
.fi
.in -2
.sp

.sp
.LP
ホストの IB ポート「ibp1」を EoIB ゲートウェイ「nm2gw-1」上の Ethernet ポート「0a-eth-2」にバインドする EoIB データリンク「elink1」を作成します。

.sp
.in +2
.nf
# \fBdladm create-eoib -l ibp1 -g nm2gw-1 -c 0a-eth-2 elink1\fR
.fi
.in -2
.sp

.sp
.LP
新たに作成された EoIB データリンク「elink1」上で IP インタフェースを作成できることを検証します。

.sp
.in +2
.nf
# \fBipadm create-ip elink1\fR
# \fBipadm create-addr -T static -a local=192.168.99.142/24 elink1/v4\fR
.fi
.in -2
.sp

.sp
.in +2
.nf
# \fBdladm show-eoib\fR
LINK    GWNAME  GWPORT   GWID   FLAGS   SPEED  MACADDRESS     OVER
elink1  nm2gw-1 0a-eth-2 1A8    aHnU--  10000  0:25:8b:60:2:3 ibp1
.fi
.in -2
.sp

.sp
.LP
EoIB データリンク「elink1」が不要となり、削除できる状態になった場合、そのデータリンク上で構築された IP インタフェース (または VNIC) をすべて削除したあと、\fBdelete-eoib\fR サブコマンドを使ってデータリンク自体を削除します。

.sp
.in +2
.nf
# \fBipadm delete-ip elink1\fR
# \fBdladm delete-eoib elink1\fR
# \fBdladm show-eoib\fR
.fi
.in -2
.sp

.LP
\fB例 42 \fR停止状態の IB ポート上の EoIB データリンクの構成
.sp
.in +2
.nf
# \fBdladm show-ib -p -o state ibp2\fR
down

# \fBdladm create-eoib -l ibp2 -g nm2gw-1 -c 0a-eth-1 elink2\fR

# \fBipadm create-ip elink2\fR

# \fBdladm show-link elink2\fR
LINK                CLASS     MTU    STATE    OVER
elink2              eoib      1500   down     ibp2
.fi
.in -2
.sp

.sp
.LP
ここで、\fBibp2\fR の IB ポートを有効にし、データリンクの状態を確認します。

.sp
.in +2
.nf
# \fBdladm show-ib -p -o state ibp2\fR
up

# \fBdladm show-link elink2\fR
LINK                CLASS     MTU    STATE    OVER
elink2              eoib      1500   up       ibp2
.fi
.in -2
.sp

.LP
\fB例 43 \fRIB サブネットマネージャーが停止している場合の EoIB データリンクの構成
.sp
.in +2
.nf
nm2gw-2# \fBdisablesm\fR
Stopping partitiond-daemon. [  OK  ]
Stopping IB Subnet Manager..-. [  OK  ]

ib-host# \fBsminfo\fR
ibwarn: [2488] _do_madrpc: recv failed: Connection timed out
ibwarn: [2488] mad_rpc: _do_madrpc failed; dport (Lid 1)
sminfo: iberror: failed: query

ib-host# \fBdladm create-eoib -l ibp2 -g nm2gw-2 -c 0a-eth-1 elink3\fR

ib-host# \fBipadm create-ip elink3\fR

ib-host# \fBdladm show-link elink3\fR
LINK                CLASS     MTU    STATE    OVER
elink3              eoib      1500   down     ibp2
.fi
.in -2
.sp

.sp
.LP
ここで、ゲートウェイの IB サブネットマネージャーを有効にし、データリンクの状態を再度確認します。

.sp
.in +2
.nf
ib-host# \fBdladm show-link elink3\fR
LINK                CLASS     MTU    STATE    OVER
elink3              eoib      1500   up       ibp2
.fi
.in -2
.sp

.LP
\fB例 44 \fRDLMP モードアグリゲーションのプローブ状態の表示
.sp
.LP
次のコマンドは、DLMP モードアグリゲーションのプローブ状態を表示します。 

.sp
.in +2
.nf
# dladm show-aggr -S aggr1
LINK       PORT   FLAGS  STATE  TARGETS        XTARGETS
aggr1      s1     u--3   active 192.169.0.2    s0
--         s0     u-2-   active --             s1
.fi
.in -2
.sp

.LP
\fB例 45 \fRヘルプの表示
.sp
.LP
次のコマンドは、\fBhelp\fR サブコマンドを引数なしで呼び出す方法を示します。

.sp
.in +2
.nf
# \fBdladm help\fR
The following subcommands are supported:
Bridge subcommands          : add-bridge, create-bridge, 
                              delete-bridge, modify-bridge, 
                              remove-bridge, show-bridge
EoIB subcommands            : create-eoib, delete-eoib,
                              show-eoib
Etherstub subcommands       : create-etherstub, delete-etherstub,
                              show-etherstub
IB subcommands              : create-part, delete-part,
                              show-ib, show-part
IP tunnel subcommands       : create-iptun, delete-iptun,
                              modify-iptun, show-iptun
Link Aggregation subcommands: add-aggr, create-aggr, delete-aggr,
                              modify-aggr, remove-aggr, show-aggr
Link subcommands            : rename-link, reset-linkprop,
                              set-linkprop, show-link, show-linkprop
Secure Object subcommands   : create-secobj, delete-secobj, 
                              show-secobj
VLAN subcommands            : create-vlan, delete-vlan, show-vlan
VNIC subcommands            : create-vnic, delete-vnic, show-vnic
Wifi subcommands            : connect-wifi, disconnect-wifi, 
                              scan-wifi, show-wifi
Miscellaneous subcommands   : delete-phys, show-ether, show-phys,
For more info, run: dladm help \fIsubcommand\fR
.fi
.in -2
.sp

.sp
.LP
次のコマンドは、\fBhelp\fR サブコマンドを特定サブコマンドとともに呼び出す方法を示します。

.sp
.in +2
.nf
# \fBdladm help create-vnic\fR
usage:
          create-vnic     [-t] -l \fIlink\fR [-m \fIvalue\fR | auto |
          {factory [-n \fIslot-id\fR]} | {random [-r \fIprefix\fR]} |
          {vrrp -V \fIvrid\fR -A {inet | inet6}} [-v \fIvid\fR [-f]]
          [-p \fIprop\fR=\fIvalue\fR[,...]] \fIvnic-link\fR

        example:
          # dladm create-vnic -l net0 -m factory -n 2 -p mtu=1200 vnic1
.fi
.in -2
.sp

.LP
\fB例 46 \fR非大域ゾーン内での VNIC の作成
.sp
.LP
次の例では、大域ゾーンから非大域ゾーン zone1 と zone2 内に VNIC v1 を作成します。zone1/net0 と zone2/net0 は、それぞれ zone1 と zone2 に対して自動的に作成された VNIC です。

.sp
.in +2
.nf
# \fBdladm create-vnic -t -l net1 zone1/v1\fR
# \fBdladm create-vnic -t -l net1 zone2/v1\fR
# \fBdladm show-link -Z\fR
LINK                ZONE      CLASS     MTU    STATE    OVER 
net1                global    phys      1500   unknown  -- 
net0                global    phys      1500   up       -- 
zone1/net0          zone1     vnic      1500   up       net0
zone2/net0          zone2     vnic      1500   up       net0
zone1/v1            zone1     vnic      1500   up       net1
zone2/v1            zone2     vnic      1500   up       net1
.fi
.in -2
.sp

.LP
\fB例 47 \fR\fB-m\fR を使用した VNIC の表示
.sp
.LP
次のコマンドは、\fB-m\fR オプションを使用して VNIC を表示する方法を示しています。

.sp
.in +2
.nf
# \fBdladm show-vnic -m\fR
LINK    OVER      SPEED  MACADDRESSES      MACADDRTYPES     IDS 

vnic0   net5      10000  0:14:4f:fb:87:ee  fixed            VID:0 

vnic1   net5      10000  0:14:4f:87:13:7a  fixed            VID:0 

                         0:14:4f:87:13:7e  fixed 

                         0:14:4f:f8:7e:a   fixed 
.fi
.in -2
.sp

.LP
\fB例 48 \fRSR-IOV モードの有効化および VF VNIC の作成
.sp
.LP
次のコマンドは、SR-IOV モードを有効にして、VF VNIC を作成する方法を示しています。

.sp
.in +2
.nf
# \fBdladm set-linkprop -p iov=on net0\fR
# \fBdladm show-linkprop -p iov net0\fR
LINK    PROPERTY  PERM VALUE    EFFECTIVE   DEFAULT   POSSIBLE
net0    iov       rw   auto     on          auto      auto,on,off
.fi
.in -2
.sp

.sp
.in +2
.nf
# \fBdladm create-vnic -lnet0 v1\fR
# \fBdladm show-linkprop -p iov v1\fR
LINK    PROPERTY  PERM VALUE    EFFECTIVE   DEFAULT   POSSIBLE
v1      iov       r-   inherit  on          inherit   inherit,on,off
.fi
.in -2
.sp

.LP
\fB例 49 \fRSR-IOV 情報の表示
.sp
.LP
次のコマンドを使用すると、追加の SR-IOV 情報を表示できます (前の例からの続き)。

.sp
.in +2
.nf
# \fBdladm show-phys -V\fR
LINK    VFS-AVAIL   VFS-INUSE    FLAGS
net0    30          1            -----
.fi
.in -2
.sp

.sp
.in +2
.nf
# \fBdladm show-vnic -V\fR
LINK    VF-ASSIGNED
v1      ixgbevf0
.fi
.in -2
.sp

.sp
.LP
あるいは、\fB-o\fR オプションを使用して上記のフィールドを指定することもできます。

.sp
.in +2
.nf
# \fBdladm show-phys -o LINK,VFS-INUSE\fR
LINK    VFS-INUSE
net0    1
.fi
.in -2
.sp

.sp
.in +2
.nf
# \fBdladm show-vnic -o VF-ASSIGNED\fR
VF-ASSIGNED
ixgbevf0
.fi
.in -2
.sp

.LP
\fB例 50 \fRiov が有効になっている物理リンク上での通常の VNIC の作成
.sp
.LP
次のコマンドを使用すると、iov が on になっているリンク上で通常の VNIC を作成できます。

.sp
.in +2
.nf
# \fBdladm create-vnic -lnet0 -piov=off v1\fR
.fi
.in -2
.sp

.sp
.LP
これらのコマンドを使用すると、VNIC に VF が含まれていないことを確認できます。

.sp
.in +2
.nf
# \fBdladm show-linkprop -p iov v1\fR
LINK    PROPERTY  PERM VALUE    EFFECTIVE   DEFAULT   POSSIBLE
v1      iov       r-   off      off         inherit   inherit,on,off
.fi
.in -2
.sp

.sp
.in +2
.nf
# \fBdladm show-vnic -V\fR
LINK    VF-ASSIGNED
v1      --
.fi
.in -2
.sp

.LP
\fB例 51 \fRエラスティック仮想スイッチ (EVS) に接続することによる VNIC の作成
.sp
.LP
次のコマンドは、EVS に接続することによって VNIC を作成します。

.sp
.in +2
.nf
# \fBdladm create-vnic -t -c HR/vport0 vnic0\fR
# \fBdladm show-vnic -c\fR

LINK   TENANT     EVS    VPORT    OVER     MACADDRESS        IDS
vnic0  sys-global HR     vport0   net2     2:8:20:c1:df:14   VID:100
.fi
.in -2
.sp

.sp
.LP
\fBHR\fR は EVS であり、\fIvnic0\fR の接続先のポート \fIvport0\fR を備えています。\fIvnic0\fR は \fIvport0\fR のすべてのプロパティーを継承します。\fBHR\fR および \fIvport0\fR は、\fBevsadm\fR(1M) によって管理されます。

.LP
\fB例 52 \fRIPoIB VNIC の作成
.sp
.LP
次の例では、ipoib_vnic0 という名前の IPoIB VNIC を、物理リンク net4 上に 0xffff という pkey で作成します。

.sp
.in +2
.nf
# \fBdladm create-vnic -l net4 -P 0xffff ipoib_vnic0\fR
.fi
.in -2
.sp

.sp
.LP
VNIC の情報を表示するには:

.sp
.in +2
.nf
# dladm show-vnic

LINK         OVER    SPEED  MACADDRESS        MACADDRTYPE IDS
ipoib_vnic0  net4    32000  80:0:0:4a:fe:..   fixed       PKEY:0xFFFF

# dladm show-vnic  -o link,macaddress

LINK            MACADDRESS
ipoib_vnic0     80:0:0:4a:fe:80:0:0:0:0:0:0:0:21:28:0:1:a0:a5:8e
.fi
.in -2
.sp

.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.sp
.LP
\fB/usr/sbin\fR
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
インタフェースの安定性確実
.TE

.sp
.LP
\fB/sbin\fR
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
インタフェースの安定性確実
.TE

.sp
.LP
\fB/usr/sbin\fR と \fB/sbin\fR の両方について、\fB-show-aggr\fR、\fB-show-link\fR、および \fBshow-vnic\fR サブコマンドの \fBs\fR オプションと \fBi\fR オプションは「確実/廃止」です。
.sp
.LP
\fB/usr/sbin\fR と \fB/sbin\fR の両方について、\fBvswitching\fR リンクプロパティーはインタフェースの安定性が「流動的」です。
.sp
.LP
前述の \fBdladm\fR サブコマンドで説明されている\fBブリッジ関連\fRのサブコマンドを使用するには \fBpkg://solaris/network/bridging\fR パッケージのインストールが必要です。
.SH 関連項目
.sp
.LP
\fBacctadm\fR(1M)、\fBautopush\fR(1M)、\fBdhcpagent\fR(1M)、\fBdlstat\fR(1M)、\fBifconfig\fR(1M)、\fBipadm\fR(1M)、\fBipsecconf\fR(1M)、\fBlldpadm\fR(1M)、\fBndd\fR(1M)、\fBnetadm\fR(1M)、\fBnetcfg\fR(1M)\fBpooladm\fR(1M)、\fBpoolcfg\fR(1M)、\fBpsrset\fR(1M)、\fBvrrpadm\fR(1M)、\fBwpad\fR(1M)、\fBin.dlmpd\fR(1M)、\fBzonecfg\fR(1M)、\fBattributes\fR(5)、\fBieee802.3\fR(5)、\fBdlpi\fR(7P)、\fBevsadm\fR(1M)
.SH 注意事項
.sp
.LP
アグリゲーションのサブコマンドでアグリゲーションを参照する場合は、リンク名で参照することをお勧めします。整数\fIキー\fRによるアグリゲーションの参照は、下位互換性のためにサポートされていますが、必要ではありません。アグリゲーションを作成するときにリンク名の代わりにキーが指定されている場合は、そのアグリゲーションのリンク名が \fBdladm\fR によって \fBaggr\fR\fIkey\fR として自動的に生成されます。\fI\fR
