Alhadis/Silos/Solaris-11.3/ja_JP.UTF-8/man1m/modload.1m
'\" te
.\" Copyright (c) 1993, 2011, Oracle and/or its affiliates. All rights reserved.
.TH modload 1M "1993 年 12 月 1 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
modload \- カーネルモジュールのロード
.SH 形式
.LP
.nf
\fBmodload\fR [\fB-p\fR] [\fB-e\fR \fIexec_file\fR] \fIfilename\fR
.fi

.SH 機能説明
.sp
.LP
\fBmodload\fR コマンドは、\fIfilename\fR で示すロード可能モジュールを、稼動中のシステムにロードします。 
.sp
.LP
\fIfilename\fR は、\fBld \fR\fB-r\fR で生成されたオブジェクトファイルを示します。\fIfilename\fR が絶対パス名の場合、 その絶対パスが指定するファイルがロードされます。\fIfilename\fR の先頭文字がスラッシュ (\fB/\fR) ではない場合、\fB-p\fR オプションが指定されていないと、現在のディレクトリに相対するパスを使って \fIfilename\fR をロードします。 
.sp
.LP
カーネルのモジュールパス \fBmodpath\fR 変数は、\fB/etc/system\fR ファイルを使って設定できます。この変数のデフォルト値は、オペレーティングシステムをロードした時のパスです。\fB\fR通常は、\fB/kernel /usr/kernel\fR となります。
.sp
.LP
たとえば、次のように入力した場合、カーネルは \fB\&./drv/foo\fR を探します。
.sp
.in +2
.nf
example# \fBmodload drv/foo\fR
.fi
.in -2
.sp

.sp
.LP
また、 次のように入力した場合には、カーネルはまず \fB/kernel/drv/foo\fR を探し、存在しなければ \fB/usr/kernel/drv/foo\fR を探します。 
.sp
.in +2
.nf
example# \fBmodload -p drv/foo\fR
.fi
.in -2
.sp

.SH オプション
.sp
.LP
サポートしているオプションは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fI exec_file\fR\fR
.ad
.RS 16n
.rt  
モジュールのロードが正常に終了した後で実行すべきシェルスクリプトまたは実行可能イメージの名前を指定します。第 1 引数はモジュール ID (10 進数) です。他の引数は、モジュールの種類により異なります。各モジュールの詳細は次のとおりです。 ドライバにはブロックメジャー番号とキャラクタメジャー番号、システムコールにはシステムコール番号、その他のモジュールタイプにはそれぞれにあったカーネルテーブルへのインデックスが渡されます。\fBmodinfo\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.RS 16n
.rt  
モジュールを検索するパスとして、カーネルの内部 modpath 変数を使用します。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
.TE

.SH 関連項目
.sp
.LP
\fBld\fR(1)、\fBadd_drv\fR(1M)、\fBkernel\fR(1M)、\fBmodinfo\fR(1M)、\fBmodunload\fR(1M)、\fBsystem\fR(4)、\fBattributes\fR(5)、\fBmodldrv\fR(9S)、\fBmodlinkage\fR(9S)、\fBmodlstrmod\fR(9S)、\fBmodule_info\fR(9S)
.sp
.LP
\fI『Writing Device Drivers for Oracle Solaris 11.2 』\fR 
.SH 注意事項
.sp
.LP
デバイスドライバを追加するには、\fBmodload\fR ではなく \fBadd_drv\fR(1M) を使います。デバイスドライバを追加する手順については、\fI『Writing Device Drivers for Oracle Solaris 11.2 』\fRを参照してください。
