Alhadis/Silos/Solaris 11.3/man4/alias.4
'\" te
.\"  Copyright (c) 2001, Sun Microsystems, Inc. All Rights Reserved
.TH alias 4 "2 Oct 2001" "SunOS 5.11" "File Formats"
.SH NAME
alias \- alias table file of encoding names
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/iconv/alias\fR
.fi

.SH DESCRIPTION
.sp
.LP
This file contains the alias table of encoding names for \fBiconv_open\fR(3C).
.sp
.LP
The format of the alias table is as follows:
.sp
.in +2
.nf
"%s %s\en", <variant encoding name>, <canonical encoding name>
.fi
.in -2

.sp
.LP
The string specified for the variant encoding name is case-insensitive. A line beginning with '#' is treated as a comment.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes: 
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBiconv\fR(3C), \fBiconv_close\fR(3C), \fBiconv_open\fR(3C), \fBattributes\fR(5)
