Alhadis/Silos/Solaris 11.3/man4/inetd.conf.4
'\" te
.\" Copyright (c) 2004, 2012, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.\"  Copyright (c) 1985 Regents of the University of California. All rights reserved. The Berkeley software License Agreement specifies the terms and conditions for redistribution. 
.TH inetd.conf 4 "15 Jun 2012" "SunOS 5.11" "File Formats"
.SH NAME
inetd.conf \- Internet servers database
.SH SYNOPSIS
.LP
.nf
\fB/etc/inet/inetd.conf\fR
.fi

.LP
.nf
\fB/etc/inetd.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
In the current release of the Solaris operating system, the \fBinetd.conf\fR file is no longer directly used to configure \fBinetd\fR. The Solaris services which were formerly configured using this file are now configured in the Service Management Facility (see \fBsmf\fR(5)) using \fBinetadm\fR(1M). Any records remaining in this file after installation or upgrade, or later created by installing additional software, must be converted to \fBsmf\fR(5) services and imported into the SMF repository using \fBinetconv\fR(1M), otherwise the service will not be available.
.sp
.LP
For Solaris operating system releases prior to the adoption of SMF (such as Solaris 9), the \fBinetd.conf\fR file contains the list of servers that \fBinetd\fR(1M) invokes when it receives an Internet request over a socket. Each server entry is composed of a single line of the form:
.sp
.in +2
.nf
\fIservice-name\fR \fIendpoint-type\fR \fIprotocol\fR \fIwait-status\fR \fIuid\fR \fIserver-program\fR \e
\fIserver-arguments\fR
.fi
.in -2
.sp

.sp
.LP
Fields are separated by either SPACE or TAB characters. A `\fB#\fR' (number sign) indicates the beginning of a comment; characters up to the end of the line are not interpreted by routines that search this file.
.sp
.ne 2
.mk
.na
\fB\fIservice-name\fR\fR
.ad
.sp .6
.RS 4n
The name of a valid service listed in the \fBservices\fR file. For \fBRPC\fR services, the value of the \fIservice-name\fR field consists of the \fBRPC\fR service name or program number, followed by a '\fB/\fR' (slash) and either a version number or a range of version numbers, for example, \fBrstatd/2-4\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fIendpoint-type\fR\fR
.ad
.sp .6
.RS 4n
Can be one of:
.sp
.ne 2
.mk
.na
\fB\fBstream\fR\fR
.ad
.RS 13n
.rt  
for a stream socket
.RE

.sp
.ne 2
.mk
.na
\fB\fBdgram\fR\fR
.ad
.RS 13n
.rt  
for a datagram socket
.RE

.sp
.ne 2
.mk
.na
\fB\fBraw\fR\fR
.ad
.RS 13n
.rt  
for a raw socket
.RE

.sp
.ne 2
.mk
.na
\fB\fBseqpacket\fR\fR
.ad
.RS 13n
.rt  
for a sequenced packet socket
.RE

.sp
.ne 2
.mk
.na
\fB\fBtli\fR\fR
.ad
.RS 13n
.rt  
for all \fBTLI\fR endpoints
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fIprotocol\fR\fR
.ad
.sp .6
.RS 4n
A recognized protocol listed in the file \fB/etc/inet/protocols\fR. For servers capable of supporting \fBTCP\fR and \fBUDP\fR over IPv6, the following protocol types are also recognized:
.RS +4
.TP
.ie t \(bu
.el o
\fBtcp6\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBudp6\fR
.RE
\fB\fR\fBtcp6\fR and \fBudp6\fR are not official protocols; accordingly, they are not listed in the \fB/etc/inet/protocols\fR file. 
.sp
Here the \fBinetd\fR program uses an \fBAF_INET6\fR type socket endpoint. These servers can also handle incoming IPv4 client requests in addition to IPv6 client requests.
.sp
For \fBRPC\fR services, the field consists of the string \fBrpc\fR followed by a '/' (slash) and either a '*' (asterisk), one or more nettypes, one or more netids, or a combination of nettypes and netids. Whatever the value, it is first treated as a nettype. If it is not a valid nettype, then it is treated as a netid. For example, \fBrpc/*\fR for an \fBRPC\fR service using all the transports supported by the system (the list can be found in the \fB/etc/netconfig\fR file), equivalent to saying \fBrpc/visible rpc/ticots\fR for an \fBRPC\fR service using the Connection-Oriented Transport Service.
.RE

.sp
.ne 2
.mk
.na
\fB\fIwait-status\fR\fR
.ad
.sp .6
.RS 4n
This field has values \fBwait\fR or \fBnowait\fR. This entry specifies whether the server that is invoked by \fBinetd\fR will take over the listening socket associated with the service, and whether once launched, \fBinetd\fR will \fBwait\fR for that server to exit, if ever, before it resumes listening for new service requests. The \fIwait-status\fR for datagram servers must be set to \fBwait\fR, as they are always invoked with the orginal datagram socket that will participate in delivering the service bound to the specified service. They do not have separate listening and accepting sockets. Accordingly, do not configure \fBUDP\fR services as \fBnowait\fR. This causes a race condition by which the \fBinetd\fR program selects on the socket and the server program reads from the socket. Many server programs will be forked, and performance will be severely compromised. Connection-oriented services such as \fBTCP\fR stream services can be designed to be either \fBwait\fR or \fBnowait\fR status.
.RE

.sp
.ne 2
.mk
.na
\fB\fIuid\fR\fR
.ad
.sp .6
.RS 4n
The user \fBID\fR under which the server should run. This allows servers to run with access privileges other than those for root.
.RE

.sp
.ne 2
.mk
.na
\fB\fIserver-program\fR\fR
.ad
.sp .6
.RS 4n
Either the pathname of a server program to be invoked by \fBinetd\fR to perform the requested service, or the value \fBinternal\fR if \fBinetd\fR itself provides the service.
.RE

.sp
.ne 2
.mk
.na
\fB\fIserver-arguments\fR\fR
.ad
.sp .6
.RS 4n
If a server must be invoked with command line arguments, the entire command line (including argument 0) must appear in this field (which consists of all remaining words in the entry). If the server expects \fBinetd\fR to pass it the address of its peer, for compatibility with 4.2BSD executable daemons, then the first argument to the command should be specified as \fB%A\fR. No more than 20 arguments are allowed in this field. The \fB%A\fR argument is implemented only for services whose \fIwait-status\fR value is \fBnowait\fR.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/netconfig\fR\fR
.ad
.RS 23n
.rt  
network configuration file
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/inet/protocols\fR\fR
.ad
.RS 23n
.rt  
Internet protocols
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/inet/services\fR\fR
.ad
.RS 23n
.rt  
Internet network services
.RE

.SH SEE ALSO
.sp
.LP
\fBrlogin\fR(1), \fBrsh\fR(1), \fBin.tftpd\fR(1M), \fBinetadm\fR(1M), \fBinetconv\fR(1M), \fBinetd\fR(1M), \fBservices\fR(4), \fBsmf\fR(5)
.SH NOTES
.sp
.LP
\fB/etc/inet/inetd.conf\fR is the official SVR4 name of the \fBinetd.conf\fR file. The symbolic link \fB/etc/inetd.conf\fR exists for \fBBSD\fR compatibility.
.sp
.LP
This manual page describes \fBinetd.conf\fR as it was supported in Solaris operating system releases prior to the adoption of Service Management Facility (see \fBsmf\fR(5)). The services that were configured by means of \fBinetd.conf\fR are now configured in SMF using \fBinetadm\fR(1M).
