Alhadis/Silos/Solaris 11.3/man4/network-diagnostics.4
'\" te
.\" Copyright (c) 2013, Oracle and/or its affiliates. All rights reserved.
.TH network-diagnostics  4 "22 July 2013" "SunOS 5.11" "File Formats"
.SH NAME
network-diagnostics \- properties for network diagnostics
.SH SYNOPSIS
.LP
.nf
svc:/network/diagnostics
.fi

.SH DESCRIPTION
.sp
.LP
Network diagnostics are performed by a module run by the Fault Manager, \fBfmd\fR(1M). The diagnostics that are performed are controlled by property values stored in the \fBsvc:/network/diagnostics\fR service.
.sp
.LP
An authorized user can use the \fBsvccfg\fR(1M) command to set the following property:
.sp
.ne 2
.mk
.na
\fB\fBpolicy/allow_probes\fR\fR
.ad
.RS 23n
.rt  
Determines whether probe packets can be transmitted by diagnostic agents for diagnosing network problems. The valid values are \fBtrue\fR/\fBfalse\fR. The default is \fBtrue\fR.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRDisable Transmission of Diagnostic Probes
.sp
.LP
This example shows how to disable transmission of diagnostic probes.

.sp
.in +2
.nf
% \fBsvccfg -s network/diagnostics setprop policy/allow_probes = boolean: false\fR
.fi
.in -2
.sp

.sp
.in +2
.nf
% \fBsvccfg -s network/diagnostics refresh\fR
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/fault-management
.TE

.SH SEE ALSO
.sp
.LP
\fBfmd\fR(1M), \fBsvccfg\fR(1M), \fBsmf\fR(5), \fBattributes\fR(5)
