Alhadis/Silos/Solaris 11.3/man4/nologin.4
'\" te
.\" Copyright (c) 1998, 2013, Oracle and/or its affiliates. All rights reserved.
.TH nologin 4 "21 Dec 1995" "SunOS 5.11" "File Formats"
.SH NAME
nologin \- message displayed to users attempting to log on in the process of a system shutdown
.SH SYNOPSIS
.LP
.nf
\fB/etc/nologin\fR
.fi

.SH DESCRIPTION
.sp
.LP
The  \fB/etc/nologin\fR file contains the message displayed to users attempting to log on to a  machine in the process of being shutdown.  After displaying the contents of the  \fBnologin\fR file,  the  \fBlogin\fR procedure  terminates, preventing the user from logging onto the machine.
.sp
.LP
This procedure is preferable to terminating a user's session by  \fBshutdown\fR shortly after the user has logged on.
.sp
.LP
Logins by the following users are not affected by this procedure:
.RS +4
.TP
.ie t \(bu
.el o
Super-user
.RE
.RS +4
.TP
.ie t \(bu
.el o
Users assigned with the \fBroot\fR role
.RE
.RS +4
.TP
.ie t \(bu
.el o
Users assigned with the \fBsolaris.system.maintenance\fR authorization
.RE
.sp
.LP
The message contained in the  \fBnologin\fR file is editable by super-user. A typical  \fBnologin\fR file contains a message similar to:
.sp
.LP
\fBNO LOGINS: System going down in 10 minutes.\fR
.SH SEE ALSO
.sp
.LP
\fBlogin\fR(1), \fBrlogin\fR(1), \fBtelnet\fR(1), \fBshutdown\fR(1M)
