Alhadis/Silos/Solaris 11.3/man4/sharetab.4
'\" te
.\" Copyright (c) 1990, 2012, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH sharetab 4 "17 Jul 2012" "SunOS 5.11" "File Formats"
.SH NAME
sharetab \- shared file system table
.SH DESCRIPTION
.sp
.LP
\fB/etc/dfs/sharetab\fR is a read-only file that has a symbolic link to the \fB/system/dfs/sharetab\fR file. The symbolic link enables users to install and use applications. If the symbolic link is removed, the operating system continues to function but the installed applications will not work. To resolve this problem, the symbolic link should be reestablished. Note that the kernel and any tools that manage the operating system refer directly to the \fB/system/dfs/sharetab\fR file.
.sp
.LP
Each line of the file consists of the following fields:
.sp
.LP
\fIpathname resource fstype specific_options description\fR
.sp
.LP
where
.sp
.ne 2
.mk
.na
\fB\fIpathname\fR\fR
.ad
.RS 20n
.rt  
Indicate the path name of the shared resource.
.RE

.sp
.ne 2
.mk
.na
\fB\fIresource\fR\fR
.ad
.RS 20n
.rt  
Indicate the symbolic name by which remote systems can  access the resource.
.RE

.sp
.ne 2
.mk
.na
\fB\fIfstype\fR\fR
.ad
.RS 20n
.rt  
Indicate the file system type of the shared resource.
.RE

.sp
.ne 2
.mk
.na
\fB\fIspecific_options\fR\fR
.ad
.RS 20n
.rt  
Indicate file-system-type-specific options that were given to the \fBshare\fR command when the resource was shared.
.RE

.sp
.ne 2
.mk
.na
\fB\fIdescription\fR\fR
.ad
.RS 20n
.rt  
Describe the shared resource provided by the system administrator when the resource was shared.
.RE

.SH SEE ALSO
.sp
.LP
\fBshare\fR(1M)
