Alhadis/Silos/Solaris 11.3/ja_JP.UTF-8/man5/datasets.5
'\" te
.\" Copyright (c) 2012, 2014, Oracle and/or its affiliates.All rights reserved.
.TH datasets 5 "2014 年 2 月 27 日" "SunOS 5.11" "標準、環境、マクロ"
.SH 名前
datasets \- Oracle Solaris ZFS データセット組織
.SH 機能説明
.sp
.LP
Oracle Solaris は、明確に定義された名前を持つ階層構造の一連の ZFS データセットにインストールされます。ファイルシステムとボリュームの両方から構成される ZFS データセットは、大域ゾーン内のブート可能 ZFS ストレージプールに格納されます。スナップショットも ZFS データセットですが、ここでは説明しません。
.sp
.LP
データセットは、自動インストーラ、テキストインストーラ、または GUI インストーラのいずれかのインストールツールによって自動的に作成されます。非大域ゾーンでは、ゾーンインストール時にゾーンブランド別にデータセットが作成されるため、\fBsolaris\fR(5) ブランドおよび大域ゾーンに適用される、ここで説明する階層とは異なることがあります。
.SS "rpool データセット"
.sp
.LP
\fBrpool\fR はブート可能 ZFS ストレージプール内の最上位レベルデータセットのデフォルトの名前で、\fB/rpool\fR にマウントされます。ブート可能 ZFS ストレージプールには、通常の ZFS ストレージプールよりも特定の制限があります。これらの制限については、Oracle Solaris 11 Information Library の「Oracle Solaris の管理: ZFS ファイルシステム」セクションで説明しています。
.sp
.LP
管理者は最上位レベルデータセットの下の任意の場所にデータセットを作成できますが、「\fBROOT/be-<name>\fR」データセット内に作成されたデータセットは、\fBbeadm\fR(1M) で特別に扱われ、これについては後述します。
.SS "ROOT データセット"
.sp
.LP
これは操作時に Solaris によってマウントされないコンテナデータセットです。それは、各セットが ZFS ブート環境 (BE) を形成する一連の関連データセットを収集します。BE はインストール時に作成されます。追加の BE は \fBpkg\fR(1) によって作成され、\fBbeadm\fR によって変更、作成、または破棄できます。
.sp
.LP
大域ゾーンでは、ROOT データセットはデフォルトで「\fBrpool\fR」というブート可能 ZFS ストレージプール内に格納される必要があります。非大域ゾーンでは、ROOT データセットは、各ゾーンのゾーンパスの下の、リーフ名が「\fBrpool\fR」のデータセットに格納されます。
.sp
.LP
下のリストに、ROOT データセットの下に作成されるデータセットを示します。このリストはデフォルトのストレージプール名を使用します。
.sp
.ne 2
.mk
.na
\fB\fBrpool/ROOT/solaris\fR\fR
.ad
.sp .6
.RS 4n
これは、システムに最初にインストールされるブート環境に対して作成されるデフォルトのデータセットです。それは、ルートファイルシステムを格納し、「/」にマウントされます。
.sp
このデータセットのリーフコンポーネントの名前はそれに関連付けられている BE の名前に対応します。管理者によって「\fBROOT/<be-name>\fR」データセットの子として作成されるすべてのデータセットは、その BE に関連付けられ、\fBbeadm\fR によって BE の一部として、作成、クローン作成、破棄、およびそれらのスナップショットが作成されます。「\fBROOT/<be-name>\fR」の下に作成される新しいデータセットは、該当する場合にデータセットが \fBbeadm\fR によってマウントされるように、zfs プロパティー「\fBcanmount=noauto\fR」を設定してください。
.sp
ブート環境内のイメージの一部であるパッケージされた内容はすべて、ブート環境に属するデータセット内に完全に存在している必要があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrpool/ROOT/solaris/var\fR\fR
.ad
.sp .6
.RS 4n
これは、BE の \fB/var\fR ファイルシステムを格納する各ブート環境に関連付けられたデータセットです。
.RE

.SS "ダンプデータセット"
.sp
.LP
\fBrpool/dump\fR はインストール時に作成される ZFS ボリュームで、システムクラッシュダンプ機能のデフォルトのダンプデバイスとして使用されます。このデータセットはすべての BE 全体で共有されます。クラッシュダンプ機能は \fBdumpadm\fR(1M) によって管理でき、ダンプデバイスは \fBzfs\fR(1M) を使用してサイズを変更できます。\fBrpool/dump \fR データセットは非大域ゾーンに存在しません。その他のデバイスは \fBrpool/dump\fR の代わりに使用できます。
.SS "スワップデータセット"
.sp
.LP
\fBrpool/swap\fR はインストール時に作成される ZFS zvol で、システムのデフォルトのスワップ領域として使用されます。このデータセットはすべての BE 全体で共有されます。\fBswap\fR(1M) を使用して、スワップボリュームを追加または削除します。\fBzfs\fR を使用して、スワップボリュームのサイズを変更します。\fBrpool/swap\fR データセットは非大域ゾーンに存在しません。\fBrpool/swap\fR に加えて、その他のスワップボリュームを代わりに使用できます。
.SS "\fBrpool/VARSHARE\fR"
.sp
.LP
\fBrpool/VARSHARE\fR はインストールまたはアップグレード時に作成されるデータセットで、どの BE にも含まれません。代わりに、すべての BE で共有され、ブート時にその BE によって自動的にマウントされます。それは \fB/var\fR からのパッケージされていない内容を格納します。たとえば、監査情報は \fB/var/audit\fR に格納され、コアファイルは \fB/var/cores\fR に格納され、保存されたクラッシュダンプは \fB/var/crash\fR に格納され、システムメールは \fB/var/mail\fR に格納されます。
.sp
.LP
\fBrpool/VARSHARE\fR は、Oracle Solaris による使用のために予約されています。\fBrpool/VARSHARE\fR の下でのデータセットの作成はサポートされません。
.SS "\fBrpool/VARSHARE/zones\fR"
.sp
.LP
\fBrpool/VARSHARE/zones\fR は、\fB/system/zones\fR にマウントされ、ゾーンパスデータセットのデフォルトの親である各ブート環境に関連付けられたデータセットです。
.SS "\fBrpool/export/home\fR"
.sp
.LP
\fBrpool/export/home\fR は、インストール時に作成されるデータセットで、ユーザーホームディレクトリに使用できます。それは、-d オプションを \fBuseradd\fR(1M) に渡して、別のディレクトリを指定しない場合、ユーザーホームディレクトリのデフォルトの場所です。ユーザーホームディレクトリがまだ存在しておらず、親ディレクトリが ZFS データセットのマウントポイントである (たとえば \fBrpool/export/home\fR) 場合、そのデータセットの子が作成され、指定した場所にマウントされます。これらのデータセットはすべての BE 全体で共有されます。
.SH 関連項目
.sp
.LP
\fBbeadm\fR(1M), \fBdumpadm\fR(1M), \fBswap\fR(1M), \fBuseradd\fR(1M), \fBzfs\fR(1M), \fBzoneadm\fR(1M), \fBzpool\fR(1M), \fBbrands\fR(5), \fBfilesystem\fR(5), \fBpkg\fR(5), \fBsolaris\fR(5)
