Alhadis/Silos/Solaris 11.3/ja_JP.UTF-8/man5/dhcp.5
'\" te
.\" Copyright (c) 2001, 2011, Oracle and/or its affiliates. All rights reserved.
.TH dhcp 5 "2011 年 1 月 23 日" "SunOS 5.11" "標準、環境、マクロ"
.SH 名前
dhcp \- 動的ホスト構成プロトコル
.SH 機能説明
.sp
.LP
動的ホスト構成プロトコル (\fBDHCP\fR) を使用すると、ブート時に \fBTCP/IP\fR ネットワーク上のホストシステムをネットワークに合わせて自動的に構成できます。\fBDHCP\fR では、クライアントサーバーメカニズムが使用されます。サーバーはクライアントの構成情報を格納し、クライアントのリクエストに応じてその構成情報を提供します。この情報には、クライアントの \fBIP\fR アドレスと、クライアントが使用可能なネットワークサービスに関する情報を含めることができます。 
.sp
.LP
このマニュアルページでは、Oracle Solaris の \fBDHCP\fR 実装についてのサマリーを説明します。
.SS "Oracle Solaris DHCP クライアント"
.sp
.LP
Oracle Solaris DHCP クライアントは、バックグラウンドデーモン (\fBdhcpagent\fR(1M)) として実装されます。
.sp
.LP
IPv4 では、\fB/etc\fR に少なくとも 1 つの \fBdhcp.\fR\fIinterface\fR ファイルが存在する場合に、このデーモンがブート中に自動的に開始されます。ブート中に自動的に構成されるのは、対応する \fB\fR\fB/etc/dhcp.\fR\fB\fIinterface\fR\fR ファイルが含まれるインタフェースのみです。 
.sp
.LP
IPv6 では、\fBin.ndpd\fR コマンドが (IPv6 Routing Advertisement メッセージに基づいて) 発行されるときに、このデーモンが自動的に開始されます。\fB/etc/dhcp\fR.\fIinterface\fR ファイルは必要ありませんが、IPv4 DHCP も使用されていれば、このようなファイルを使用してインタフェースを「プライマリ」として指定できます。
.sp
.LP
\fBdhcpinfo\fR(1) コマンドを使用することによって、ブート中のシステム構成で必要なネットワークパラメータが、デーモンで受信された情報から抽出されます。\fB/etc/default/dhcpagent\fR ファイルでチューニング可能値を変更すると、デーモンのデフォルト動作を変更できます。このデーモンは、\fBifconfig\fR(1M) ユーティリティーによって制御されます。\fBnetstat\fR(1M) および \fBifconfig\fR(1M) コマンドを使用して、デーモンのステータスをチェックします。 
.SS "Oracle Solaris DHCP サーバー"
.sp
.LP
Oracle Solaris \fBDHCP\fR サーバーは、バックグラウンドデーモン (\fBin.dhcpd\fR(1M)) として実装されます。このデーモンでは、ネットワーク構成情報を \fBBOOTP\fR または \fBDHCP\fR クライアントに提供できます。Oracle Solaris \fBDHCP\fR サービスは、\fBdhcpmgr\fR(1M) \fBGUI\fR またはコマンド行ユーティリティー \fBdhcpconfig\fR(1M)、\fBdhtadm\fR(1M)、および \fBpntadm\fR(1M) を使用して管理できます。
.sp
.LP
Oracle Solaris DHCP サーバーは廃止されています。代わりに、ISC DHCP サーバーを使用します。\fBusr/share/man/man5/isc-dhcp.5\fR を参照してください
.SS "DHCP 構成テーブル"
.sp
.LP
Oracle Solaris \fBDHCP\fR サーバーでは、次の 2 種類のテーブルにクライアント構成情報が格納されます: 
.sp
.ne 2
.mk
.na
\fB\fBdhcptab\fR テーブル\fR
.ad
.sp .6
.RS 4n
構成情報のパッケージを作成して、各 \fBDHCP\fR クライアントに送信するために使用されるマクロおよびオプション (シンボルとも呼ばれる) が含まれます。\fBDHCP\fR サービスごとに、1 つの \fBdhcptab\fR のみが存在します。\fBdhtadm\fR(1M) コマンドまたは \fBdhcpmgr\fR(1M) グラフィカルユーティリティーを使用すると、\fBdhcptab\fR(4) を表示および変更できます。\fBdhcptab\fR レコードの構文の詳細については、\fBdhcptab\fR(4) を参照してください。\fBDHCP\fR のオプションおよびシンボルの詳細については、\fBdhcp_inittab\fR(4) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDHCP\fR ネットワークテーブル\fR
.ad
.sp .6
.RS 4n
\fBDHCP\fR ネットワークテーブルには、クライアント \fBID\fR と \fBIP\fR アドレスおよびこれらのアドレスに関連付けられたパラメータのマッピングが含まれています。ネットワークテーブルは、名前にネットワークの \fBIP\fR アドレスが含まれ、\fBpntadm\fR コマンドまたは \fBdhcpmgr\fR グラフィカルユーティリティーを使用して編集、表示、および変更できます。ネットワークテーブルの詳細については、\fBdhcp_network\fR(4) を参照してください。
.RE

.SH 関連項目
.sp
.LP
\fBdhcpinfo\fR(1)、\fBdhcpagent\fR(1M)、\fBdhcpconfig\fR(1M)、\fBdhcpmgr\fR(1M)、\fBdhtadm\fR(1M)、\fBifconfig\fR(1M)、\fBin.dhcpd\fR(1M)、\fBin.ndpd\fR(1M)、\fBnetstat\fR(1M)、\fBpntadm\fR(1M)、\fBsyslog\fR(3C)、\fBdhcp_network\fR(4)、\fBdhcptab\fR(4)、\fBdhcpsvc.conf\fR(4)、\fBdhcp_inittab\fR(4)、\fBndpd.conf\fR(4)、\fBdhcp_modules\fR(5)
.sp
.LP
\fBusr/share/man/man5/isc-dhcp.5\fR
.sp
.LP
\fI『Working With DHCP in Oracle Solaris 11.3 』\fR
.sp
.LP
Alexander、S.、および R。Droms. \fIRFC 2132, DHCP Options and BOOTP Vendor Extensions\fR. Silicon Graphics, Inc. Bucknell University. 1997 年 3 月
.sp
.LP
Droms, R. \fIRFC 1534, Interoperation Between DHCP and BOOTP\fR. Bucknell University. 1993 年 10 月
.sp
.LP
Droms, R. \fIRFC 2131, Dynamic Host Configuration Protocol\fR. Bucknell University. 1997 年 3 月
.sp
.LP
Wimer, W. \fIRFC 1542, Clarifications and Extensions for the Bootstrap Protocol\fR. Carnegie Mellon University. 1993 年 10 月
.sp
.LP
Lemon, T. and B. Sommerfeld. \fIRFC 4361, Node-specific Client Identifiers for Dynamic Host Configuration Protocol Version Four (DHCPv4)\fR. Nominum and Sun Microsystems. February 2006. 
.sp
.LP
Droms, R. \fIRFC 3315, Dynamic Host Configuration Protocol for IPv6 (DHCPv6)\fR. Cisco Systems. July 2003. 
