Alhadis/Silos/Solaris 11.3/ja_JP.UTF-8/man5/filesystem.5
'\" te
.\" Copyright 1989 AT&T
.\" Portions Copyright (c) 2008, 2015, Oracle and/or its affiliates.All rights reserved.
.TH filesystem 5 "2015 年 3 月 11 日" "SunOS 5.11" "標準、環境、マクロ"
.SH 名前
filesystem \- ファイルシステム組織
.SH 形式
.LP
.nf
/
.fi

.SH 機能説明
.sp
.LP
ファイルシステムは、Oracle Solaris OS のシステム関連コンポーネントとバイナリのほか、非システム関連コンポーネントとホームディレクトリを編成するために使用される子孫ファイルシステムとディレクトリの階層構造です。デフォルトで、ルートファイルシステムは、ZFS ルートプール内にインストールされ、具体的には、システム関連コンポーネントの個別のディレクトリ (\fBetc\fR、\fBusr\fR、\fBvar\fR など) を含む ZFS ファイルシステムであり、システムが正常に機能するために使用可能である必要があります。システムのインストール後、Solaris ファイルシステムのルートがマウントされます。これは、ファイルおよびディレクトリにアクセスできることを意味します。
.sp
.LP
ルートファイルシステムのすべてのサブディレクトリのうち、Oracle Solaris OS の一部となっているもの (\fB/var\fR を除く) は、ルートファイルと同じファイルシステムに含まれている必要があります。さらに、すべてのパッケージされたソフトウェアは、スワップおよびダンプデバイスを除いて、ルートプールに存在する必要があります。システムのインストール時に、デフォルトのスワップデバイスとダンプデバイスが、ルートプール内に ZFS ボリュームとして自動的に作成されます。 
.sp
.LP
次のファイルシステムの内容の説明では、プラットフォーム、プラットフォーム依存、プラットフォーム非依存、およびプラットフォーム固有という用語を使用しています。プラットフォームとは、\fBuname -i\fR コマンドによって返される、システムの命令セットアーキテクチャーまたはプロセッサタイプを示します。プラットフォーム依存とは、すべてのプラットフォームにインストールされ、その内容がプラットフォームによって異なるファイルを示します。プラットフォーム依存ファイルと同様に、プラットフォーム非依存ファイルもすべてのプラットフォームにインストールされます。ただし、後者のタイプの内容はすべてのプラットフォームで同じになります。プラットフォーム依存ファイルの例は、コンパイル済みの実行可能プログラムです。プラットフォーム非依存ファイルの例は、\fB/etc/hosts\fR などの標準構成ファイルです。プラットフォーム依存ファイルやプラットフォーム非依存ファイルと異なり、プラットフォーム固有ファイルは、サポートされる一部のプラットフォームにのみインストールされます。ほとんどのプラットフォーム固有ファイルは \fB/platform\fR および \fB/usr/platform\fR の下に集められます。
.SS "ルートファイルシステム"
.sp
.LP
ルートファイルシステムには、カーネル、デバイスドライバ、システムのブートに使用されるプログラムなど、システムの処理に欠かせないファイルとディレクトリが含まれています。それらのコンポーネントについて次に説明します。ルート (\fB/\fR) ディレクトリにはマウントポイントディレクトリも含まれ、そこでローカルおよびリモートファイルシステムをファイルシステム階層に接続できます。
.sp
.ne 2
.mk
.na
\fB\fB/\fR\fR
.ad
.sp .6
.RS 4n
ファイルシステム名前空間全体のルートディレクトリ。これはシステムブート時にカーネルによってマウントされる特殊なファイルシステムです。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/boot\fR\fR
.ad
.sp .6
.RS 4n
システムのブートに必要なファイルと実行可能ファイルを格納するディレクトリ。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/bin\fR\fR
.ad
.sp .6
.RS 4n
システム実行可能ファイルとスクリプトを格納する \fB/usr/bin\fR ディレクトリへのシンボリックリンク。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev\fR\fR
.ad
.sp .6
.RS 4n
特殊なデバイスファイルを格納するディレクトリ。一般に、デバイスファイルはシステムのカーネルとハードウェア構成を一致させるために構築されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/devices\fR\fR
.ad
.sp .6
.RS 4n
デバイスの名前空間を管理する \fBdevfs\fR ファイルシステムのマウントポイントディレクトリ。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc\fR\fR
.ad
.sp .6
.RS 4n
システム間で共有されないプラットフォーム依存の管理および構成ファイルとデータベースを格納するディレクトリ。このディレクトリはシステムの識別情報を定義します。バンドルされた Solaris ソフトウェアの承認済みのインストールの場所。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/export/home\fR または \fB/home\fR\fR
.ad
.sp .6
.RS 4n
ユーザーファイルを格納するディレクトリまたはユーザーホームディレクトリのファイルシステムマウントポイント。デフォルトでは、\fB/home\fR ディレクトリは自動マウントされるファイルシステムです。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel\fR\fR
.ad
.sp .6
.RS 4n
ブートプロセスの一部として必要なプラットフォーム依存のロード可能カーネルモジュールのディレクトリ。プラットフォーム非依存のコアカーネルの汎用部分 \fB/kernel/genunix\fR を含みます。\fBkernel\fR(1M) を参照してください。バンドルされた Oracle Solaris ソフトウェアおよびアドオンシステムソフトウェアの承認済みのインストール場所。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/lib\fR\fR
.ad
.sp .6
.RS 4n
コアシステムライブラリを格納するディレクトリ。これまでは、このディレクトリにはシステム起動用の必須ライブラリコンポーネントが格納されていました。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/media\fR\fR
.ad
.sp .6
.RS 4n
自動的にマウントされるリムーバブルメディアにアクセスするためのディレクトリ。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/mnt\fR\fR
.ad
.sp .6
.RS 4n
ファイルシステムのデフォルトの一時マウントポイントディレクトリ。この空のディレクトリはファイルシステムを一時的にマウントするために使われます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/net\fR\fR
.ad
.sp .6
.RS 4n
オートマウンタによってマウントされるファイルシステムの一時マウントポイントディレクトリ。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/opt\fR\fR
.ad
.sp .6
.RS 4n
アンバンドルのアプリケーションパッケージ用のディレクトリ。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/platform\fR\fR
.ad
.sp .6
.RS 4n
ルートファイルシステムに存在する必要があるプラットフォーム固有オブジェクトのディレクトリ。サポートされるプラットフォームあたり 1 つずつ、一連のディレクトリを格納します。一連のディレクトリのセマンティクスは \fB/\fR (ルート) と同等です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/proc\fR\fR
.ad
.sp .6
.RS 4n
プロセスファイルシステムのマウントポイントディレクトリ。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/root\fR\fR
.ad
.sp .6
.RS 4n
ルートユーザーのホームディレクトリ。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/rpool\fR\fR
.ad
.sp .6
.RS 4n
ZFS ブート関連コンポーネントのマウントポイントディレクトリ。デフォルトで、ルートプールはインストール時に \fBrpool\fR という名前が付けられます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/sbin\fR\fR
.ad
.sp .6
.RS 4n
\fB/usr/sbin\fR ディレクトリへのシンボリックリンク。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/system\fR\fR
.ad
.sp .6
.RS 4n
契約 (\fBCTFS\fR) およびオブジェクト (\fBOBJFS\fR) ファイルシステムのマウントポイントディレクトリ。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/system/zones\fR\fR
.ad
.sp .6
.RS 4n
複数のブート環境で共有され、ブート環境を格納するzpoolの下の個別のデータセットに存在するディレクトリ。これはゾーンパスのデフォルトの親です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/tmp\fR\fR
.ad
.sp .6
.RS 4n
ブート処理時に削除される一時ファイルを格納するディレクトリ。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr\fR\fR
.ad
.sp .6
.RS 4n
プラットフォーム依存およびプラットフォーム非依存バイナリおよびファイルを格納するディレクトリ。\fB/usr/share\fR サブディレクトリにはプラットフォーム非依存ファイルが格納されます。残りの \fB/usr\fR ディレクトリにはプラットフォーム依存ファイルが格納されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/bin\fR\fR
.ad
.sp .6
.RS 4n
プラットフォーム依存のユーザー呼び出し実行可能ファイルを格納するディレクトリ。これらはユーザーが通常の \fB$PATH\fR の一部として実行されることを期待するコマンドです。バンドルされた Oracle Solaris ソフトウェアの承認済みのインストールの場所。アンバンドルのシステムソフトウェアまたはアプリケーションの類似の場所は \fB/opt/packagename/bin\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/sunos\fR\fR
.ad
.sp .6
.RS 4n
以前のリリースの Solaris との互換性のために保持されていた \fB/usr/bin\fR コマンドのバージョン。実行可能ファイルは \fB/usr/sunos/bin\fR 内にあります。これは、旧バージョンが推奨される場合は \fB$PATH\fR 内の \fB/usr/bin\fR の前に配置できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/gnu\fR\fR
.ad
.sp .6
.RS 4n
デフォルトの Solaris 実装としては使用されないが、ほかのプラットフォームとの互換性のために提供されている GNU バージョンのコマンド。実行可能ファイルは \fB/usr/gnu/bin\fR 内にあります。これは、GNU バージョンが推奨される場合は \fB$PATH\fR 内の \fB/usr/bin\fR の前に配置できます。さらに、このディレクトリツリー内のすべてのコマンドは、接頭辞として \fB\&'g'\fR という文字が付いたコマンド名であるシンボリックリンクによって、\fB/usr/bin\fR からアクセス可能になります。例: 
.sp
.in +2
.nf
/usr/bin/ggrep -> ../gnu/bin/grep.
.fi
.in -2
.sp

GNU 互換性ファセットを無効にすると、すべての \fBg*\fR シンボリックリンクが \fB/usr/bin\fR から削除されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib\fR\fR
.ad
.sp .6
.RS 4n
追加のシステムライブラリ、および実行時にプログラムによって必要とされるその他のサポートファイルによって \fB/lib\fR の内容を拡張するディレクトリ。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/java\fR\fR
.ad
.sp .6
.RS 4n
Java ファイルと実行可能ファイルを格納するディレクトリ。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/sbin\fR\fR
.ad
.sp .6
.RS 4n
ブートプロセスと手動のシステムリカバリで使用される必須の実行可能ファイルを格納します。これまで、このディレクトリは \fB/usr\fR ファイルシステムがマウントされる前にシステムを復元するために必要でした。この Oracle Solaris リリースでは、\fB/usr\fR はディレクトリで、個別のファイルシステムではなく、ルートファイルシステムのマウント時に使用できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var\fR\fR
.ad
.sp .6
.RS 4n
システムに一意だが、任意または可変サイズに拡張する可能性のある多様なファイルを格納するディレクトリまたはファイルシステム。例はログファイルです。バンドルされた Oracle Solaris ソフトウェアの承認済みのインストールの場所。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/share\fR\fR
.ad
.sp .6
.RS 4n
複数のブート環境で共有され、ブート環境を格納する \fBzpool\fR の下の個別のデータセットに存在するディレクトリ。特定のブート環境内のパッケージメタデータは \fB/var/share\fR の現在の内容を反映していないことがあるため、パッケージはここに内容を配布すべきではありません。
.sp
パッケージは \fB/var/.migrate\fR にディレクトリを配布できます。これはブート時に \fB/var/share\fR の下に自動的に作成されます。ブート環境間でデータを共有する方法については、\fBpkg\fR(5) および IPS の開発ガイドを参照してください。
.sp
デフォルトで、次のディレクトリが共有されます。
.sp
.in +2
.nf
/var/share/audit
/var/share/cores
/var/share/crash
/var/share/mail
.fi
.in -2

各共有ディレクトリを指すために、シンボリックリンクが \fB/var\fR に提供されます。
.sp
既存のデータセットがそれらのいずれかのシンボリックリンクにマウントしようとすると (たとえば、通常 \fB/var/mail\fR にマウントする既存のデータセットがあるユーザー)、ファイルシステムのマウントはシンボリックリンクを移動するため、それらのデータセットが \fB/var/share\fR の下にマウントされます。データセットは引き続き元のマウントポイントからアクセス可能です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/tmp\fR\fR
.ad
.sp .6
.RS 4n
サイズがさまざまであるか、通常のシステム処理時に存在するファイルを格納するディレクトリ。このディレクトリの内容はブート処理時に削除されません。\fBrmtmpfiles\fR サービスの \fBclean_vartmp\fR プロパティー値を設定することによって、エディタ一時ファイルを除くすべてのファイルをクリアするように、\fB/var/tmp\fR のデフォルトの動作を変更することができます。これは次のコマンドによって実行します。 
.sp
.in +2
.nf
# svccfg -s svc:/system/rmtmpfiles setprop\e
            options/clean_vartmp = "true"
# svcadm refresh svc:/system/rmtmpfiles:default
.fi
.in -2
.sp

このプロパティーを変更するには、\fBsolaris.smf.value.rmtmpfiles\fR 承認が必要です。
.RE

.SH 関連項目
.sp
.LP
\fBisainfo\fR(1), \fBsvcs\fR(1), \fBuname\fR(1), \fBautomount\fR(1M), \fBautomountd\fR(1M), \fBboot\fR(1M), \fBinit\fR(1M), \fBkernel\fR(1M), \fBmount\fR(1M), \fBsvcadm\fR(1M), \fBsvccfg\fR(1M), \fBzfs\fR(1M), \fBzpool\fR(1M), \fBmount\fR(2), \fBIntro\fR(4), \fBproc\fR(4), \fBterminfo\fR(4), \fBpkg\fR(5), \fBctfs\fR(7FS), \fBdevfs\fR(7FS), \fBobjfs\fR(7FS), 
