Alhadis/Silos/Solaris 11.3/ja_JP.UTF-8/man5/hal.5
'\" te
.\"  Copyright (c) 2006, 2011, Oracle and/or its affiliates. All rights reserved.
.TH hal 5 "2011 年 11 月 30 日" "SunOS 5.11" "標準、環境、マクロ"
.SH 名前
hal \- ハードウェア抽象化レイヤーの概要
.SH 機能説明
.sp
.LP
ハードウェア抽象化レイヤー (HAL) は、システムに接続されている各種ハードウェアのビューを提供します。このビューは、ハードウェア構成に変化があると、ホットプラグなどのメカニズムを通じて動的に更新されます。HAL は、ハードウェアの断片をデバイスオブジェクトとして表します。デバイスオブジェクトは、一意の識別子によって識別され、デバイスプロパティーと呼ばれる一連のキーと値のペアを保持します。プロパティーには、実際のハードウェアから取得されるもの、デバイス情報ファイル (\fB\&.fdi\fR ファイル) からマージされるもの、実際のデバイス構成に関連しているものがあります。
.sp
.LP
HAL は、D-Bus を通して使いやすい API を提供します。D-Bus はさまざまな機能を持つ IPC フレームワークであり、特に、アプリケーション間のやりとりを可能にするシステム全体のメッセージバスを提供します。具体的には、D-Bus は非同期の通知を提供するため、デバイスの追加と削除、およびデバイスのプロパティーの変更が行われたときに、HAL はメッセージバス上のほかの相手に通知できます。
.sp
.LP
Solaris オペレーティングシステムでは、HAL は \fBhald\fR(1M) デーモン、およびデバイスの追加と削除およびそのプロパティーの変更を行う一連のユーティリティーでサポートされています。
.SH 関連項目
.sp
.LP
\fBhald\fR(1M), \fBhal-device\fR(1M), \fBhal-fdi-validate\fR(1M), \fBhal-find\fR(1M), \fBhal-find-by-capability\fR(1M), \fBhal-find-by-property\fR(1M), \fBhal-get-property\fR(1M), \fBhal-set-property\fR(1M), \fBfdi\fR(4)
.sp
.LP
http://freedesktop.org。
