Alhadis/Silos/Solaris 11.3/ja_JP.UTF-8/man5/smf_restarter.5
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.TH smf_restarter 5 "2008 年 5 月 23 日" "SunOS 5.11" "標準、環境、マクロ"
.SH 名前
smf_restarter \- サービス管理機能のリスタータ規約
.SH 機能説明
.sp
.LP
サービス管理機能のすべてのサービスインスタンスは、リスタータによって管理される必要があります。このマニュアルページでは、フレームワークのすべてのリスタータに共通する構成、機能、およびレポートの特徴について説明します。特定のリスタータに固有の特徴については、そのリスタータのマニュアルページを参照してください。
.sp
.LP
各管理対象サービスについて、リスタータはサービスインスタンスのプロパティーを取得することによって構成を判定します。リスタータは一連のプロパティーグループを利用して、サービスの現在の配置を \fBsvcs\fR(1) などの表示ツールに伝達します。
.SS "サービスの構成"
.sp
.LP
すべてのサービスに共通するリスタータの構成は \fBgeneral\fR プロパティーグループにまとめられています。このグループには、次に示す必須プロパティーおよびオプションプロパティーの設定が含まれています。
.sp
.ne 2
.mk
.na
\fB\fBenabled\fR\fR
.ad
.RS 19n
.rt  
これは必須プロパティーです。これが設定されている場合、インスタンスのリスタータはサービスを使用可能な状態に維持しようとします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrestarter\fR\fR
.ad
.RS 19n
.rt  
これはオプションプロパティーで、サービスインスタンスを管理する代替リスタータを指定できます。restarter プロパティーが空または省略されている場合、リスタータはデフォルトとして \fBsvc.startd\fR(1M) になります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsingle_instance\fR\fR
.ad
.RS 19n
.rt  
これはオプションプロパティーです。これが設定されている場合、オンラインステータスまたは機能低下ステータスに移行できるサービスインスタンスは一度に 1 つだけです。
.RE

.SS "サービスの報告機能"
.sp
.LP
すべてのリスタータが \fBrestarter\fR プロパティーグループを使用してステータスを報告します。このグループには次のプロパティーが含まれています。
.sp
.ne 2
.mk
.na
\fB\fBnext_state\fR\fR
.ad
.RS 19n
.rt  
これらのプロパティーに保存されているインスタンスの現在の状態および次の状態 (移行中の場合)。取り得る状態については、\fBsmf\fR(5) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBauxiliary_state\fR\fR
.ad
.RS 19n
.rt  
リスタータの state プロパティーとの組み合わせで完全なリスタータ固有の状態を表す明確な語句を含んだastring。スペースは含まれません。この補助状態は常に設定できるわけではなく、どの状態からでも移行時に必ずクリアされます。リスタータごとに、使用する補助状態の正確なリストを定義する必要があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstate_timestamp\fR\fR
.ad
.RS 19n
.rt  
現在の状態に到達した時間。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcontract\fR\fR
.ad
.RS 19n
.rt  
サービスインスタンスを実行しているプライマリプロセス契約 ID (存在する場合)。
.RE

.SH 関連項目
.sp
.LP
\fBsvcs\fR(1), \fBsvc.startd\fR(1M), \fBservice_bundle\fR(4), \fBsmf\fR(5), \fBsmf_method\fR(5)
