Alhadis/Silos/Solaris 11.3/ja_JP.UTF-8/man5/solaris-kz.5
'\" te
.\" Copyright (c) 2009, 2015, Oracle and/or its affiliates.All rights reserved.
.TH solaris-kz 5 "2015 年 7 月 14 日" "SunOS 5.11" "標準、環境、マクロ"
.SH 名前
solaris-kz \- solaris カーネルゾーン
.SH 機能説明
.sp
.LP
\fBsolaris-kz\fR ブランドは \fBbrands\fR(5) で説明しているブランドゾーンフレームワークを使用して、大域ゾーンで使用されているものと別のカーネルおよび OS インストールでゾーンを実行します。
.SS "インストールと更新"
.sp
.LP
\fBsolaris-kz\fR インストールは大域ゾーンのインストールから独立しており、\fBpkg\fR(5) でリンクされたイメージではなく、大域ゾーンの内容に関係なく、変更できます。\fBsolaris-kz\fR ゾーンは、大域ゾーンから直接、または下記のようにブートメディア経由で、ほかのブランドと同じ方法でインストールできます。
.sp
.LP
インストールのマニフェストを指定する場合、使用するマニフェストは大域ゾーンのインストールに適したものにすべきです。カーネルゾーンは常にルートプールの既知の場所にインストールされるため、インストールターゲットディスクは指定できません。
.sp
.LP
ブート環境 (BE) 管理は大域ゾーンから独立しています。大域ゾーン内の BE の作成では、ゾーン内に新しい BE を作成しません。\fBbeadm\fR(1M) を参照してください。
.SS "プロセスの管理と可視性"
.sp
.LP
ほかのブランドと異なり、\fBsolaris-kz\fR ゾーンは個別のカーネルを実行するため、大域ゾーンからゾーンを調べた場合にいくつかの違いが見られます。
.sp
.LP
\fBsolaris-kz\fR ゾーンで実行しているプロセスは、大域ゾーンから直接アクセスできません。たとえば、\fBkz-zone\fR というカーネルゾーンのプロセスのリストを表示するには、\fB-z\fR \fB kz-zone\fR オプションを付けて \fBps\fR コマンドを使用するのではなく、次のコマンドを使用する必要があります。
.sp
.in +2
.nf
# \fBzlogin kz-zone ps -e\fR
.fi
.in -2
.sp

.sp
.LP
大域ゾーンと各カーネルゾーンはそれぞれ独自のプロセス ID 空間を管理します。そのため、\fBprocess 1234\fR が大域ゾーンおよび 1 つ以上のカーネルゾーン内に存在することがあります。それらは一意のプロセスです。大域ゾーンの管理者が \fBkz-zone\fR 内の \fBprocess 1234\fR を強制終了したいと考える場合、次のコマンドまたは同等のコマンドで実行してください。
.sp
.in +2
.nf
# \fBzlogin kz-zone kill 1234\fR
.fi
.in -2
.sp

.sp
.LP
大域ゾーンから実行される \fBps\fR(1) および同様のツールは、\fBkzhost\fR や \fBzlogin-kz\fR などの \fBsolaris-kz\fR ゾーンインスタンスの管理に関連付けられたプロセスを表示します。これはデバッグに役立ちますが、それ以外はプライベート実装の詳細です。
.sp
.LP
同様に、リソース管理機能が異なります。たとえば、\fBmax-processes\fR などのリソース制御は、単一のカーネルインスタンスを共有する場合にのみ意味があるため、\fBsolaris-kz\fR ゾーンを構成する場合に使用できません。つまり、カーネルが独立しているため、\fBsolaris-kz\fR ゾーン内で実行中のプロセスは大域ゾーンのプロセステーブルスロットを占有できません。
.sp
.LP
\fBzonestat\fR ユーティリティーはゾーンのリソース使用量を表示します。この出力は一般に正しいですが、ホスト値を反映していることがあります。たとえば、\fBlwps\fR などのリソース制御値は、ゾーン内で使用されているものではなく、ホストで使用されている \fBlwps\fR を示します。
.sp
.LP
\fBsolaris-kz\fR ブランドで使用される一部のハードウェア機能は、古いシステムや仮想化環境では利用できないこともあります。システムが \fBsolaris-kz brand\fR をサポートするかどうかを検出するには、\fBbrand-solaris-kz\fR パッケージをインストールし、\fBvirtinfo\fR コマンドを実行します。
.sp
.in +2
.nf
# virtinfo -c supported list kernel-zone
.fi
.in -2
.sp

.sp
.LP
サポートされるリストに \fBkernel-zone\fR が表示されない場合、\fBsyslog\fR を表示して詳細を確認できます。カーネルゾーンに関連するメッセージには、文字列 \fBkernel-zone\fR が含まれています。
.sp
.LP
\fBmpstat\fR(1M)、\fBiostat\fR(1M)、\fBvmstat\fR(1M) やその他のユーティリティーによって報告される横取りされた時間には、ホストが CPU リソースをほかの目的に使用しているためにカーネルゾーンを実行できなかった時間が直接反映されます。
.SS "ストレージアクセス"
.sp
.LP
\fBsolaris-kz\fR ブランドゾーンは 1 つ以上のデバイスに存在する必要があります。構成がインストール前にカスタマイズされない場合、大域ゾーンのルート \fBzpool\fR にデフォルトの \fBzfs\fR(1M) ボリュームが作成されます。ゾーンのインストール先のデバイスは、任意の正の整数値に設定された \fBbootpri\fR プロパティーを持つデバイスリソースで指定されます。デバイスをブートデバイスとして使用しない場合、\fBbootpri\fR プロパティーを設定しないでください。\fBbootpri\fR の設定を解除するには、デバイスのリソース範囲で \fBbootpri\fR のクリアを使用します。ブート可能な複数のデバイスがインストール中に存在する場合、これらのデバイスはゾーン内のミラー化ルート ZFS プールで使用されます。デフォルトのブート順は、最初に \fBbootpri\fR でデバイスをソートし、複数のデバイスが同じ \fBbootpri\fR を持つ場合は、次に \fBid\fR でソートして決定されます。
.sp
.LP
\fBzonepath\fR をカーネルゾーンに対して設定することはできません。実装の詳細として、これは \fBtmpfs\fR(7FS) を使用して、固定の場所に設定されます。これは、永続的データも、ユーザーが運用可能なその他のデータも含みません。ゾーンルートは、ルート ZFS ボリュームに含まれるため、従来のゾーンと異なり、大域ゾーン内のゾーンパス下にマウントされません。ゾーンルートへのアクセスは、\fBzlogin\fR など、ゾーン自体から実行できます。
.sp
.LP
\fBsolaris-kz\fR ゾーンは、ZFS データセットやファイルシステムマウントなどの共有カーネル機能を直接利用できません。代わりに、raw ディスク、ZFS ボリューム、\fBlofi\fR デバイスなどのブロックデバイス経由でゾーンからストレージを使用できます。
.sp
.LP
\fBsolaris-kz\fR ゾーンのルートは常にアクセス可能です。ストレージは \fBzonecfg\fR で \fBadd device\fR を使用して追加できます。指定するデバイスパスは raw デバイスである必要があり、ZFS ボリュームか、raw ディスクか、\fBlofi\fR デバイスである必要があります。指定するデバイスはディスク全体か LUN である必要があります。パーティション/スライス接尾辞なしで、デバイスパスを使用します。例:
.sp
.in +2
.nf
# \fBzonecfg -z myzone\fR
zonecfg:myzone> \fBadd device\fR
zonecfg:myzone:device> \fBset match=/dev/rdsk/c4t9d0\fR
zonecfg:myzone:device> \fBset id=4\fR
zonecfg:myzone:device> \fBset bootpri=1\fR
.fi
.in -2
.sp

.sp
.LP
\fBid\fR を指定して、ゾーン内のディスクアドレスを修正できます。指定しない場合、自動的に割り当てられます。
.sp
.LP
\fBzonecfg\fR(1M) で説明されているように、デバイスリソースでは、ゾーンの構成をほかのホストシステムに移植できるようにするために、ストレージ URI を構成することもできます。\fBsuri\fR(5) を参照してください。
.sp
.LP
例: 
.sp
.in +2
.nf
# \fBzonecfg -z \fImyzone\fR\fR
zonecfg:myzone> \fBadd device\fR
zonecfg:myzone:device> \fBset storage=\fInfs://user1:staff@host1/export/file1\fR\fR
zonecfg:myzone:device> \fBset create-size=\fI4g\fR\fR
.fi
.in -2
.sp

.sp
.LP
デバイスリソースの現在の構成についての情報を参照するには、\fBinfo\fR サブコマンドを使用してください。例: 
.sp
.in +2
.nf
# \fBzonecfg -z \fImyzone\fR info device\fR
device:
    match not specified
    storage: dev:/dev/zvol/dsk/rpool/VARSHARE/zones/myzone/disk0
    id: 0
    bootpri: 0
device:
    match not specified
    storage: nfs://user1:staff@host1/export/file1
    create-size: 4g
    id: 1
    bootpri not specified
.fi
.in -2
.sp

.sp
.LP
\fBid\fR を指定して出力を短くすることもできます。
.sp
.in +2
.nf
# \fBzonecfg -z \fImyzone\fR info device id=\fI1\fR\fR
device:
    match not specified
    storage: nfs://user1:staff@host1/export/file1
    create-size: 4g
    id: 1
    bootpri not specified
.fi
.in -2
.sp

.sp
.LP
ゾーンを iSCSI 論理ユニットなどのデフォルト以外の場所にインストールするには、ルートディスクのデバイスリソースを変更する必要があります。例: 
.sp
.in +2
.nf
# \fBzonecfg -z myzone\fR
zonecfg:myzone> \fBselect device id=0\fR
zonecfg:myzone:device> \fBset storage=iscsi://host/luname.naa.0000abcd\fR
.fi
.in -2
.sp

.sp
.LP
デバイスがブート可能であることを示すために、少なくとも 1 つのデバイスで \fBbootpri\fR が正の整数に設定される必要があります。カーネルゾーン内では、ルート ZFS プールのミラーまたはスペアとして機能するすべてのデバイスが、ブート可能である必要があります。
.sp
.LP
ストレージデバイスは、\fBsolaris-kz\fR ブランドの \fBadd device\fR によってのみサポートされています。
.SS "ネットワークアクセス"
.sp
.LP
カーネルゾーンは\fB排他的スタック\fRである必要があります。ネットワークアクセスは、Ethernet データリンクに \fBnet\fR または \fBanet\fR リソースを追加し、IPoIB データリンクに \fBanet\fR を追加することによって提供されます。これらのリソースによって指定されたデータリンクは、ゾーンに表示されるデータリンクのバックエンドとして使用されます。IPoIB と Ethernet の両方のネットワークリソースを指定でき、ゾーンに表示されるデータリンクが対応するメディアタイプになります。ストレージデバイスと同様に、ゾーン内の仮想 NIC アドレスを識別するために ID を指定できます。\fBnet\fR リソースによる InfiniBand ネットワークリンクの追加はサポートされていません。
.sp
.LP
カーネルゾーンはそれ自体ホストゾーンになることがあります (その場合、それらのゾーンの大域ゾーンの役割を持ちます)。ホストされているゾーンへのネットワークアクセスは Ethernet データリンク経由でのみ提供され、IPoIB データリンク経由では提供されません。ただし、カーネルゾーンのネットワーク構成はそのゾーン構成によって部分的に定義されるため、MAC アドレスを使用できるホストされているゾーンは制限されます。ランダムまたは特定の MAC アドレスの \fBmac-address\fR 設定でゾーンをブートしようとすることは許可されません。
.sp
.LP
カーネルゾーンに追加の MAC アドレスを提供するには、それらを関連リソースの \fBmac-address\fR プロパティーに追加します。\fBzonecfg\fR(1M) を参照してください。これにより、その \fBmac-address\fR をカーネルゾーン内の\fB出荷時\fRアドレスとして使用できるようになります。
.sp
.LP
それにより、ホストされるゾーンでその MAC アドレス自体を使用できます。これを実行するには、ホストされているゾーンの \fBmac-address\fR プロパティーを、構成済みの明示的な MAC アドレスとして構成する (\fBmac-address\fR プロパティーを使用) か、または \fBauto\fR を指定します。これらの設定の詳細については、\fBzonecfg\fR(1M) を参照してください。
.SS "メモリー構成"
.sp
.LP
ホスト RAM の修正済みの量がカーネルゾーンに割り当てられる必要があります。これは、\fBzonecfg\fR(1M) の \fBcapped-memory\fR リソースの \fBphysical\fR プロパティーによって構成します。指定した値はサポートされるプラットフォーム値に丸められることがあります。割り当てられたメモリーがロックされるため、スワップデバイスにページングできません。
.SS "一時停止、再開、およびウォーム移行"
.sp
.LP
カーネルゾーンは、\fBzoneadm suspend\fR コマンドによって、ディスクに対して一時停止できます。ゾーンの実行状態がディスクに書き込まれます。これにはゾーンによって使用される RAM 全体が含まれるため、大量の時間と領域をとることがあります。
.sp
.LP
カーネルゾーンの構成に一時停止リソースがある場合のみ、カーネルゾーンの一時停止および再開がサポートされます。一時停止リソース内では、パスまたはストレージ (両方ではない) を指定する必要があります。\fBpath\fR プロパティーは、一時停止イメージを格納するファイルの名前を指定します。ファイルを格納するディレクトリが存在し、\fBroot\fR ユーザーによってディレクトリに書き込み可能である必要があります。\fBsvc:/system/zones:default\fR の開始より前にマウントされるすべてのファイルシステムを使用できます。\fBstorage\fR プロパティーには、一時停止イメージを格納するディスクデバイスのストレージ URI (\fBsuri\fR(5) を参照) が指定されます。デバイス全体が使用されます。このデバイスは、ほかのものと共有できません。
.sp
.LP
一時停止イメージは、書き込み前に圧縮されます。したがって、一時停止イメージのサイズはゾーンの RAM のサイズよりも一般的に著しく小さくなっています。一時停止中に、一時停止イメージのサイズを示すメッセージが出力されてコンソールログに記録されます。
.sp
.LP
圧縮の後、一時停止イメージは AES-128-CCM を使用して暗号化されます。暗号化鍵は \fB/dev/random\fR (\fBrandom\fR(7D) を参照) によって自動的に生成され、keysource リソースの raw プロパティーに保管されます。
.sp
.LP
ゾーンが一時停止されている場合、\fBzoneadm boot\fR コマンドによって再開します。再開を希望しない場合は、\fBboot \fB-R\fR\fR オプションを使用して、最初からブートすることができます。
.sp
.LP
一時停止イメージおよびゾーンのストレージの残りの部分が複数のホストからアクセス可能である場合 (通常は \fBsuspend:storage\fR および \fBdevice:storage\fR プロパティーの使用による)、一時停止イメージは、\fBzoneadm detach\fR または \fBzoneadm attach\fR による通常のゾーンのコールド移行の後にウォーム移行をサポートするために使用できますが、最初の段階として、\fBzoneadm shutdown\fR の代わりに \fBzoneadm suspend\fR を使用します。これにより、再開にかかる時間を除き、目的のホストでのすべてのゾーン起動コストを回避します。
.sp
.LP
ソースと目的のホストは同じプラットフォームである必要があります。x86 では、ベンダー (AMD/Intel) や CPU モデル名が一致している必要があります。SPARC では、ハードウェアプラットフォームが同じである必要があります。たとえば、T4 ホストから T5 ホストにウォーム移行することはできません。異なるハードウェアプラットフォーム間で移行する場合、cpu-arch プロパティーで移行クラスを適切に指定する必要があります。
.sp
.LP
再開時は、ゾーンの現在の構成を使用して、ブートおよび新規構成の指定が許可されます。ただし、再開するゾーンによって特定の設定が求められるため、制限事項があります。何らかの非互換性があると、ブートは失敗します。たとえば、ブートプロセスは次の場合に失敗することがあります。
.RS +4
.TP
.ie t \(bu
.el o
CPU が異なる機能をサポートする (たとえば、\fBcpuid\fR(7D) を参照)
.RE
.RS +4
.TP
.ie t \(bu
.el o
構成の capped-memory 値が異なる
.RE
.RS +4
.TP
.ie t \(bu
.el o
構成で定義される仮想 CPU の数が異なる
.RE
.RS +4
.TP
.ie t \(bu
.el o
ディスクが存在しない (適切な \fBid\fR プロパティーを持つ \fBdevice\fR リソースがない)
.RE
.RS +4
.TP
.ie t \(bu
.el o
仮想 NIC が存在しない (適切な \fBid\fR プロパティーを持つ \fBnet\fR または \fBanet\fR リソースがない)
.RE
.sp
.LP
ストレージの識別のための固有のチェックは実行されません。特定の ID の下に一覧表示されるデバイスを、ゾーンで表示が必要なデバイスにするのは管理者の責任です。
.SS "ライブ移行"
.sp
.LP
\fBzoneadm\fR(1M) で説明されているように、\fBzoneadm migrate\fR コマンドを使用してカーネルゾーンを互換性のあるホストにライブ移行できます。
.sp
.LP
ライブ移行には、上の「一時停止、再開、およびウォーム移行」セクションで説明されているのと同じ互換性の制限があります。
.SS "補助状態"
.sp
.LP
このブランドには、次の補助状態 (\fBzoneadm list -is\fR によって示される) が定義されています。
.sp
.ne 2
.mk
.na
\fB\fBsuspended\fR\fR
.ad
.RS 17n
.rt  
ゾーンは一時停止されており、次のブート時に再開されます。この状態を表示できるようにするには、ゾーンに接続している必要があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdebugging\fR\fR
.ad
.RS 17n
.rt  
ゾーンは \fBrunning\fR 状態ですが、カーネルデバッガはゾーン内で実行しているため、ネットワークリクエストなどにサービスできません。ゾーンコンソールに接続して、デバッガと対話処理を行なってください (\fBkmdb\fR)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpanicked\fR\fR
.ad
.RS 17n
.rt  
ゾーンは \fBrunning\fR 状態ですが、ゾーンはパニックを起こしており、ホストは影響を受けません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmigrating-out\fR\fR
.ad
.RS 17n
.rt  
このゾーンは完全に実行されていますが、別のホストに移行されています。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmigrating-in\fR\fR
.ad
.RS 17n
.rt  
このゾーンはホスト上でブートされ、移行イメージを受信しているため、移行が完了するまではまだ完全に実行されていません。
.RE

.SS "ホストデータ"
.sp
.LP
カーネルゾーンのブート可能な各デバイスには、ホストデータとして知られる状態情報が含まれています。このデータは、ゾーンが使用中の場所や、一時停止されているかどうか、およびその他の状態情報を追跡します。ホストデータは、一時停止イメージに使用されるのと同じ暗号化鍵を使用して、AES-128-CCM で暗号化および認証されます。
.sp
.LP
カーネルゾーンの準備ができたかブートされた場合、ホストデータが読み取られて、カーネルゾーンのブートストレージがほかのシステムで使用中かどうかが判別されます。別のシステムによって使用中の場合、カーネルゾーンは使用不可の状態に移行し、エラーメッセージによって、カーネルゾーンを使用中のシステムが示されます。ストレージがほかのシステムで使用中でないことがたしかな場合、カーネルゾーンは \fBzoneadm attach\fR の \fB-x force-takeover extended\fR オプションを使用して修復できます。このコマンドを実行する前に、次の警告を参照してください。
.sp
.LP
暗号化鍵にアクセスできない場合、ホストデータとすべての一時停止イメージを読み取ることはできません。そのような状況では、ゾーンを準備またはブートするすべての試行によって、ゾーンが使用不可状態に移行します。暗号化鍵を復元できない場合、\fBzoneadm attach\fR サブコマンドの \fB-x initialize-hostdata extended\fR オプションを使用して、新しい暗号化鍵およびホストデータを生成できます。このコマンドを実行する前に、次の警告を参照してください。
.LP
注 - 
.sp
.RS 2
警告: ホストデータの引き継ぎまたは再初期化を強制すると、ゾーンがほかのシステムで使用中かどうかの検出が不可能になります。同じストレージを参照するゾーンの複数インスタンスを実行すると、ゾーンのファイルシステムの修復不能な破壊につながることがあります。
.RE
.sp
.LP
ウォーム移行またはコールド移行中の暗号化鍵の損失を防ぐには、ソースシステム上で \fBzonecfg export\fR を使用して、宛先システム上で使用するコマンドファイルを生成します。例: 
.sp
.in +2
.nf
  root@host1# \fBzonecfg -z myzone export -f /net/.../myzone.cfg\fR
  root@host2# \fBzonecfg -z myzone -f /net/.../myzone.cfg\fR
.fi
.in -2
.sp

.sp
.LP
この例の myzone.cfg には暗号化鍵が含まれているため、内容を開示しないように保護することが重要です。
.SS "構成"
.sp
.LP
\fBsolaris-kz\fR ブランドゾーンは \fBSYSsolaris-kz\fR テンプレートを使用して構成できます。
.sp
.LP
次の \fBzonecfg\fR(1M) リソースとプロパティーはこのブランドでサポートされていません。
.sp
.in +2
.nf
anet:address
capped-memory:locked
capped-memory:swap
dataset
device:allow-partition
device:allow-raw-io
fs
file-mac-profile
fs-allowed
ip-type
limitpriv
global-time
max-lwps
max-msg-ids
max-processes
max-sem-ids
max-shm-memory
rctl:zone.max-lofi
rctl:zone.max-swap
rctl:zone.max-locked-memory
rctl:zone.max-shm-memory
rctl:zone.max-shm-ids
rctl:zone.max-sem-ids
rctl:zone.max-msg-ids
rctl:zone.max-processes
rctl:zone.max-lwps
rootzpool
zpool
.fi
.in -2

.sp
.LP
次の \fBzonecfg\fR(1M) リソースおよびプロパティーは、このブランドのライブゾーン再構成でサポートされています。
.sp
.in +2
.nf
anet (with exceptions stated below)
device
net (with exceptions stated below)
.fi
.in -2

.sp
.LP
次の \fBzonecfg\fR(1M) リソースおよびプロパティーは、このブランドのライブゾーン再構成でサポートされていません。
.sp
.in +2
.nf
anet:allowed-address
anet:configure-allowed-address
anet:defrouter
capped-cpu (zone.cpu-cap)
capped-memory
cpu-shares (zone.cpu-shares)
dedicated-cpu
hostid
ib-vhca
ib-vhca:port
cpu-arch
keysource
net:allowed-address
net:configure-allowed-address
net:defrouter
pool
rctl
scheduling-class
tenant
virtual-cpu
.fi
.in -2

.sp
.LP
永続的な構成に一覧表示されているサポートされないリソースおよびプロパティーが、実行中のゾーンに適用された場合、そのリソースおよびプロパティーに加えたあらゆる変更は、ライブゾーン再構成によって無視されます。
.sp
.LP
ライブ構成に一覧表示されているサポートされないリソースおよびプロパティーを変更するあらゆる試行は拒否されます。
.sp
.LP
\fBsolaris-kz\fR ブランドでサポートされている \fBanet\fR および \fBnet\fR プロパティーは、同じメディアタイプに対して変更する必要があります。
.sp
.LP
次に一覧表示されているように、\fBsolaris-kz\fR ブランドについてサポートされているプロパティーの固有のデフォルト値があります。
.sp
.in +2
.nf
Resource                Property                    Default Value
global                  zonepath                    /system/zones/%{zonename}
                        autoboot                    false
                        ip-type                     exclusive
                        auto-shutdown               shutdown
net                     configure-allowed-address   true
anet                    mac-address                 auto
                        lower-link                  auto
                        link-protection             mac-nospoof
                        linkmode                    cm
anet:mac                mac-address                 auto
ib-vhca:port            pkey                        auto
.fi
.in -2

.SH サブコマンド
.sp
.LP
\fBzoneadm\fR(1M) でサポートされている \fBsolaris-kz\fR ブランド固有サブコマンドのオプションは次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fBattach [-x force-takeover | initialize-hostdata]\fR\fR
.ad
.sp .6
.RS 4n
指定された \fBsolaris-kz\fR ブランドゾーンイメージをゾーンにアタッチします。ゾーンのブート可能デバイスは、すでに正しく入力されているものとします。
.sp
拡張オプション \fB-x force-takeover\fR は、ゾーンが別のシステム上にインストールされているか、または実行中であることを示す状態情報をクリアします。このオプションは注意して使用してください。同一のストレージがゾーンの 2 つのインスタンスによって同時に使用される場合、ファイルシステムが破壊されます。
.sp
拡張オプション \fB-x initialize-hostdata\fR は、暗号化鍵およびホストデータを再初期化します。\fB-x force-takeover\fR と同様、このオプションを使用する前に、ゾーンが別のシステムで使用されていないことを確認してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBboot [-R] -- [-L | -Z \fIbootenv\fR] \fR\fR
.ad
.sp .6
.RS 4n
ゾーンが一時停止されている場合、\fB-R\fR オプションは、一時停止されたイメージを無視し (次に削除される)、新規にブートするために使用できます。
.sp
\fB-L\fR オプションはブートローダーに使用可能なブート環境を一覧表示するように伝えます。ブートする BE は対話的に選択できます。
.sp
\fB-Z\fR オプションは、ブートローダーに特定の BE をブートするように伝えます。例: 
.sp
.in +2
.nf
# \fBzoneadm -z myzone \\fR 
.fi
.in -2
.sp

.sp
.in +2
.nf
\fBboot -- -Z rpool/ROOT/solaris\fR
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fBclone [-c config_profile.xml | dir]\fR\fR
.ad
.sp .6
.RS 4n
リポジトリからのインストール後に適用するプロファイルまたはプロファイルのディレクトリを指定します。
.sp
すべてのプロファイルは、\fB\&.xml\fR 拡張子を持つ必要があります。
.sp
\fBzoneadm clone\fR について、ストレージが自動的に作成される場合、ストレージはソースゾーンのディスクと同じサイズで作成されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBinstall\fR [\fB-v\fR] [\fB-a\fR \fIarchive\fR [\fB-x\fR no-auto-shutdown] | \fB-m\fR \fImanifest\fR\fB\&.xml\fR] [\fB-c\fR \fIconfig_profile\fR\fB\&.xml\fR | \fIdir\fR] [\fB-C\fR \fIinstall_profile\fR\fB\&.xml\fR | \fIdir\fR] [\fB-S\fR \fIrootsize\fR] [\fB-b\fR \fI/path/to/media.iso\fR [\fB-x\fR no-auto-shutdown]] [\fB-z\fR \fIarchived_zone\fR]\fR
.ad
.br
.na
\fB[\fB-x\fR <\fBcert|cacert|key \fR>=\fIpath\fR] ...\fR
.ad
.sp .6
.RS 4n
カーネルゾーンは、大域ゾーンのパブリッシャーとデフォルトの AI マニフェスト、カスタム AI マニフェスト、Solaris インストールメディアの ISO イメージ、または統合アーカイブを使用してインストールできます。
.sp
\fB-a\fR、\fB-b\fR、または \fB-m\fR オプションを使用しない場合、デフォルトの AI マニフェスト (\fB/usr/share/auto_install/manifest/default.xml\fR) および大域ゾーンの \fBpkg\fR(5) パブリッシャーが、インストールを実行するために使用されます。サポートされるメディアのタイプは、テキストインストーラおよび自動インストーラです。これによりサポートされる任意の Oracle Solaris バージョンをインストールできます。Solaris 11.2 はカーネルゾーンでサポートされる最初の Solaris のバージョンです。
.sp
AI マニフェストを \fB-m\fR オプションとともに指定した場合、AI マニフェストの内容に基づいて、IPS または統合アーカイブのインストールが実行されます。\fBai_manifest\fR(4) を参照してください。
.sp
ブート可能な Solaris インストールメディアの ISO イメージが \fB-b\fR オプションとともに指定された場合、カーネルゾーンはインストールメディアからブートされ、インストールプログラムはゾーンのコンソールで実行されます。インストール中にコンソールのログインセッションが確立され、インストールプログラムの操作および監視を行うことができます。
.sp
統合アーカイブが \fB-a\fR オプションとともに指定された場合、インストールは統合アーカイブから実行されます。統合アーカイブに複数のゾーンが含まれている (\fBarchiveadm info\fR の出力の配備可能システム) 場合は、インストールするアーカイブゾーンを指定するために、\fB-z\fR オプションを使用します。統合アーカイブは \fBarchiveadm\fR(1M) を使用して作成します。
.sp
.ne 2
.mk
.na
\fB\fB-a archive\fR\fR
.ad
.sp .6
.RS 4n
指定された統合アーカイブからインストールします。\fIarchived_zone\fR には、大域ゾーン、カーネルゾーン、または solaris ブランドゾーンを指定できます。アーカイブされたゾーンが solaris ブランドゾーンである場合は、非大域から大域への \fBpkg\fR(5) のイメージ変換が実行されます。変換を正常に実行するには、すべての \fBpkg\fR(5) パブリッシャーにアクセスできるように、ゾーンのインストール環境に十分なネットワークアクセス権限がある必要があります。これをもっとも簡単に実現するには、カーネルゾーンのネットワークを DHCP を使用して構成することを許可します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-b /path/to/media.iso\fR\fR
.ad
.sp .6
.RS 4n
指定されたメディアからブートし、インストールします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c config_profile.xml | dir\fR\fR
.ad
.sp .6
.RS 4n
リポジトリからのインストール後に適用するプロファイルまたはプロファイルのディレクトリを指定します。
.sp
すべてのプロファイルは、\fB\&.xml\fR 拡張子を持つ必要があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C install_profile.xml | dir\fR\fR
.ad
.sp .6
.RS 4n
インストールを実行する AI メディアでブートするときに、適用するプロファイルまたはプロファイルのディレクトリをインストール環境に提供します。
.sp
すべてのプロファイルは、\fB\&.xml\fR 拡張子を持つ必要があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m manifest.xml\fR\fR
.ad
.sp .6
.RS 4n
Automated Installer に対して指定されるマニフェストファイル。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x install-size\fR\fR
.ad
.sp .6
.RS 4n
ルートファイルシステムのサイズを明示的に設定します (デフォルトは \fB16g\fR)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x no-auto-shutdown\fR\fR
.ad
.sp .6
.RS 4n
インストール後にカーネルゾーンをコンソールにログインしたままにして、インストールシステムとの対話を可能にします。このオプションは、\fB-a\fR または \fB-b\fR オプションとともに使用した場合にのみ有効です。
.RE

.sp
.ne 2
.mk
.na
\fB-x cert=\fBpath\fR\fR
.ad
.br
.na
\fB-x cacert=\fBpath\fR\fR
.ad
.br
.na
\fB-x key=\fBpath\fR\fR
.ad
.sp .6
.RS 4n
https URI にある統合アーカイブからインストールする場合に、指定された証明書、CA 証明書、または鍵を使用します。\fB-a\fR オプションでのみ有効です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
インストールプロセスの詳細情報を出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z archived_zone\fR\fR
.ad
.sp .6
.RS 4n
統合アーカイブから \fIarchived_zone\fR を使用してゾーンをインストールします。特定の統合アーカイブで有効な値のリストについては、\fBarchiveadm\fR(1M) info コマンドの出力の Deployable Systems を参照してください。\fB-a\fR オプションでのみ有効です。
.RE

.RE

.SH 関連項目
.sp
.LP
\fBarchiveadm\fR(1M), \fBai_manifest\fR(4), \fBpkg\fR(5)
.SH 注意事項
.sp
.LP
VirtualBox はカーネルゾーンと同じホストで使用できますが、適切に構成されている必要があります。詳細は VirtualBox のドキュメントを参照してください。カーネルゾーンは別の Solaris カーネル環境で実行されているため、クラッシュして、ベアメタルで実行されている大域ゾーン内のカーネルの場合と同じコアをダンプする可能性があります。このような場合、ダンプはカーネルゾーンのストレージに保存され、\fBdumpadm\fR(1M) によって構成されたクラッシュダンプパラメータに従って、Solaris クラッシュダンプがある場所と同じ場所で見つかります。カーネルゾーンにはまた、\fBzoneadm savecore\fR サブコマンドを使用して、ホスト環境からコアダンプが生成されるようにする機能もあります。さらに、カーネルゾーンがクラッシュし、コアイメージをダンプしようとしたが、コアをカーネルゾーンのストレージ内に正常に保存できない場合は、\fBzoneadm savecore\fR サブコマンドが発行されたかのように、ホストにコアイメージの保存を試みるよう要求します。コアは \fBcoreadm\fR(1M) で指定された場所に保存されます。これは、\fBcoreadm\fR(1M) で場所を構成していて、カーネルゾーンのコアダンプが有効になっている場合にのみ成功します。
