Alhadis/Silos/Solaris 11.3/ja_JP.UTF-8/man5/solaris10.5
'\" te
.\" Copyright (c) 2009, 2015, Oracle and/or its affiliates.All rights reserved.
.TH solaris10 5 "2015 年 7 月 14 日" "SunOS 5.11" "標準、環境、マクロ"
.SH 名前
solaris10 \- Solaris 10 ブランドゾーン
.SH 機能説明
.sp
.LP
\fBsolaris10\fR ブランドは、\fBbrands\fR(5) で説明されているブランドゾーンフレームワークを使用して、Solaris 10 バイナリアプリケーションを変更することなく、最新の Solaris オペレーティングシステムカーネルを備えたマシン上で実行できるようにします。
.sp
.LP
Oracle Solaris 10 ゾーンは、Oracle Solaris 11 カーネルで動作する x86 および SPARC Solaris 10 9/10 (またはそれ以降にリリースされた Oracle Solaris 10 update) ユーザー環境をホストする solaris10 ブランドゾーンです。
.sp
.LP
元のシステムで最初にカーネルパッチ 142909-17 (SPARC) または 142910-17 (x86/x64)、あるいはそれ以降のバージョンをインストールした場合は、以前の Oracle Solaris 10 リリースを使用できます。
.sp
.LP
\fBsolaris10\fR ブランドには、Solaris 10 システムイメージを非大域ゾーンにインストールするために必要なツールが含まれています。Solaris 10 ネイティブゾーンを \fBsolaris10\fR ブランドゾーンに移行するために必要なツールもサポートされています。このブランドでは、最新の Solaris オペレーティングシステムが稼働している SPARC または x86 マシンのいずれかでの、32 ビットおよび 64 ビットの Solaris 10 アプリケーションの実行をサポートしています。
.SS "構成と管理"
.sp
.LP
\fBsolaris10\fR ブランドは完全ルート非大域ゾーンモデルをサポートします。Solaris 10 ソフトウェアの必須パッケージおよび追加パッケージのすべてが、ゾーン固有のファイルシステムにインストールされます。 
.sp
.LP
ゾーンは固有の \fBzfs\fR(1M) データセット上に構築される必要があり、ZFS だけがサポートされています。ZFS データセットは、ゾーンのインストール時または接続時に自動的に作成されます。ZFS データセットを作成できない場合、ゾーンのインストールや接続は行われません。 
.sp
.LP
\fBzonecfg\fR(1M) ユーティリティーは、\fBsolaris10\fR ブランドゾーンを構成するために使用されます。ゾーンの作成時に \fBSYSsolaris10\fR テンプレートを使用することも、構成を手動で設定することもできます。ブランドゾーンのインストールが完了したあとは、そのゾーンのブランドの変更や削除を行うことはできません。\fBzoneadm\fR(1M) ユーティリティーは、ゾーンのブランドタイプを報告したり、ゾーンを管理したりするために使用されます。\fBzlogin\fR(1) ユーティリティーは、ゾーンにログインするために使用されます。
.sp
.LP
現在、委任された ZFS データセット構成のサポートは実験的なもので、まだテストされていません。\fB/dev/sound\fR デバイスをブランドゾーンに構成することはできません。さらに、\fBmdb\fR(1) および \fBdtrace\fR(1M) は、\fBsolaris10\fR ブランドゾーン内で実行されているプロセスを検査するために大域ゾーンで使用される場合、完全には機能しません。
.sp
.LP
次の \fBzoneadm\fR(1M) リソースとプロパティーはこのブランドでサポートされていません。
.sp
.in +2
.nf
autoshutdown=suspend
anet:id
device:id
net:id
virtual-cpu
anet:mac
ib-vhca
ib-vhca:port
.fi
.in -2

.sp
.LP
次の \fBzoneadm\fR(1M) リソースおよびプロパティーは、\fBsolaris\fR ブランドのライブゾーン再構成でサポートされています。
.sp
.in +2
.nf
anet (with exceptions stated below)
capped-memory
dedicated-cpu
device
fs
net (with exceptions stated below)
pool
scheduling-class
zone.* rctls
.fi
.in -2

.sp
.LP
次の \fBzoneadm\fR(1M) リソースおよびプロパティーは、\fBsolaris\fR ブランドのライブゾーン再構成でサポートされていません。
.sp
.in +2
.nf
anet:allowed-address
anet:configure-allowed-address
anet:defrouter
dataset
file-mac-profile
fs-allowed
hostid
limitpriv
global-time
net:allowed-address
net:configure-allowed-address
net:defrouter
npiv
tenant
zpool
.fi
.in -2

.sp
.LP
永続的な構成に一覧表示されているサポートされないリソースおよびプロパティーが、実行中のゾーンに適用された場合、そのリソースおよびプロパティーに加えたあらゆる変更は、ライブゾーン再構成によって無視されます。
.sp
.LP
ライブ構成にリストされているサポートされないリソースおよびプロパティーを変更するあらゆる試行は拒否されます。
.sp
.LP
\fBsolaris10\fR ブランドのインストーラでは、インストール済み Solaris 10 システムのイメージからのゾーンのインストールをサポートしています。これには、完全な \fBcpio\fR(1) または \fBpax\fR(1) \fBxustar\fR アーカイブを使用できます。\fBcpio\fR アーカイブは \fBgzip(1)\fR または \fBbzip2(1)\fR で圧縮することもできます。このイメージとしては、レベル 0 \fBufsdump\fR(1M)、または Solaris 10 システムのルートディレクトリツリーの最上位パスも使用できます。標準の Solaris 10 配布メディアからゾーンをインストールすることはできません。 
.sp
.LP
Solaris 10 を移行するときに、ゾーンが「疎ルート」ゾーンとして構成されている場合があります。\fB\fRこの場合、アーカイブを作成する前に、ホスト上でゾーンを準備するようにしてください。これにより、継承されたディレクトリがアーカイブに含まれることが保証されます。
.sp
.LP
次の \fBzonecfg\fR(1M) リソースとプロパティーはこのブランドでサポートされていません。
.sp
.in +2
.nf
autoshutdown
anet:evs
anet:vport
device:id
file-mac-profile
net:id
tenant
virtual-cpu
anet:mac
.fi
.in -2

.sp
.LP
次にリストされているように、\fBsolaris10\fR ブランドについてサポートされているプロパティーの固有のデフォルト値があります。
.sp
.in +2
.nf
Resource                Property                    Default Value
global                  zonepath                    /system/zones/%{zonename}
                        autoboot                    false
                        global-time                 false
                        ip-type                     exclusive
                        auto-shutdown               shutdown
net                     configure-allowed-address   true
anet                    mac-address                 auto
                        lower-link                  auto
                        link-protection             mac-nospoof
.fi
.in -2

.sp
.LP
ZFS データセットの \fBcom.oracle.zones.solaris10:activebe\fR ユーザープロパティーは、Solaris 10 ブランドゾーンの複数のブート環境をサポートするために存在します。ブート環境をアクティブにするには、ユーザーは、次に示すようにゾーンの ROOT データセットに \fBcom.oracle.zones.solaris10:activebe\fR プロパティーを設定する必要があります。
.sp
.in +2
.nf
# \fBzfs set com.oracle.zones.solaris10:activebe=\
\fIboot environment name\fR \fIzone's ROOT dataset\fR\fR
.fi
.in -2
.sp

.sp
.LP
複数のブート環境が存在するインストール済み Solaris 10 ゾーンでは、\fBactivebe\fR プロパティーが設定されている必要があります。このプロパティーが設定されていないか、または存在しないブート環境名や無効なブート環境名に設定されている場合、ゾーンは次のゾーンまたはシステムブートで使用不可の状態に移行します。これを解決するには、activebe プロパティーを修正し、\fBzoneadm attach\fR を使用してゾーンを接続する必要があります。詳細は、例 4 および 5 を参照してください。
.SH サブコマンド
.sp
.LP
サポートされている \fBzoneadm\fR(1M) ブランド固有サブコマンドの引数は次のとおりです。 
.sp
.ne 2
.mk
.na
\fB\fBattach\fR [\fB-c\fR \fI sysidcfg\fR]\fR
.ad
.sp .6
.RS 4n
指定された Solaris 10 ネイティブゾーンイメージをブランドゾーンに接続します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBclone\fR [\fB-c\fR \fB sysidcfg\fR]\fR
.ad
.sp .6
.RS 4n
既存のインストール済みゾーンをコピーすることでゾーンのインストールを行います。このサブコマンドは、ゾーンをインストールするための代替手段となります。
.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fBsysidcfg\fR\fR
.ad
.RS 15n
.rt  
複製されたゾーンの構成解除後に適用する \fIsysidcfg\fR ファイルを指定します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBinstall\fR [\fB-a\fR \fI archive\fR] [\fB-d\fR \fIpath\fR] [\fB-p\fR] [\fB-s\fR] [\fB-u\fR] [\fB-v \fR] \\fR
.ad
.br
.na
\fB[\fB-c\fR \fBsysidcfg\fR] \fR
.ad
.sp .6
.RS 4n
指定された Solaris 10 システムイメージをゾーンにインストールします。\fB-u\fR または \fB-p\fR オプションのどちらかが必要で、\fBかつ\fR \fB-a\fR または \fB-d\fR オプションのどちらかが必要です。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fIarchive\fR\fR
.ad
.sp .6
.RS 4n
インストール済み Solaris 10 システム、インストール済み Solaris 10 ネイティブゾーン、または solaris10 ブランドゾーンの統合されたアーカイブ、\fBcpio\fR(1)、\fBpax\fR(1) \fBxustar\fR、\fBzfs\fR アーカイブ、またはレベル \fB0\fR の \fBufsdump\fR(1M) へのパス。\fBcpio\fR および \fBzfs\fR アーカイブは、\fBgzip\fR または \fBbzip2\fR を使用して圧縮できます。 
.sp
\fBarchiveadm\fR(1M) は Solaris 10 には存在しません。solaris10 ブランドゾーンを含む統合されたアーカイブは、大域ゾーンから作成する必要があります。統合されたアーカイブは、パス、あるいはファイル、http、または https URI に存在する可能性があります。https が使用される場合は、\fB-x\fR オプションを使用して https セキュリティーパラメータを指定できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIsysidcfg\fR\fR
.ad
.sp .6
.RS 4n
インストール後に適用する \fIsysidcfg\fR ファイルを指定します。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIpath\fR\fR
.ad
.sp .6
.RS 4n
インストール済み Solaris 10 システムのルートディレクトリのパス。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
ゾーンのインストール後にシステム構成を維持します。統合されたアーカイブからインストールする場合、そのアーカイブが復旧用のアーカイブであれば、\fB-p\fR が暗黙に使用されますが、\fB-u\fR でそれをオーバーライドすることはできません。
.sp
.in +2
.nf
-x cert=\fB/path/cert\fR.pem
-x cacert=\fB/path/cacert\fR.pem
-x key=\fB/path/key\fR.pem
.fi
.in -2

指定された証明書、CA 証明書、および鍵 (あるいはそのいずれか) を、統合されたアーカイブへの https アクセスに使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.sp .6
.RS 4n
サイレントインストールします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.sp .6
.RS 4n
ゾーンのインストール後にゾーンに対して \fBsys-unconfig\fR を実行します。統合されたアーカイブからインストールする場合で、そのアーカイブが復旧用のアーカイブでなければ、\fB-u\fR が暗黙に使用されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
インストールプロセスの詳細情報を出力します。
.RE

.RE

.SS "アプリケーションのサポート"
.sp
.LP
\fBsolaris10\fR ゾーンはユーザーレベルの Solaris 10 アプリケーションだけをサポートします。Solaris 10 デバイスドライバや Solaris 10 カーネルモジュールを \fBsolaris10\fR ゾーン内から使用することはできません。ただし、カーネルモジュールによっては、最新バージョンの Solaris カーネルモジュールをユーザーレベルの Solaris 10 アプリケーションに使用できる場合があります。
.SH 使用例
.LP
\fB例 1 \fRインストール用の ZFS フラッシュアーカイブを作成する
.sp
.LP
次の例は、物理から仮想 (P2V) 移行用のアーカイブを作成する方法を示しています。これは、Solaris 10 が動作しているシステムの大域ゾーンで実行されます。Solaris 10 システムに、構成済み、インストール済み、または稼働中の非大域ゾーンがあってはいけません。Solaris 10 システムでは、そのルートファイルシステムとして ZFS または UFS を使用できます。

.sp
.in +2
.nf
# flarcreate -n s10box -c /net/somehost/p2v/s10box.flar
.fi
.in -2
.sp

.LP
\fB例 2 \fRフラッシュアーカイブを使用して \fBsolaris10\fR ブランドゾーンをインストールする
.sp
.LP
次の例では、例 1 からのアーカイブを使用してゾーンをインストールします。このゾーンは \fBzonecfg\fR(1M) を使用して構成済みであり、brand プロパティーが \fBsolaris10\fR に設定されているものと想定します。

.sp
.in +2
.nf
# zoneadm -z s10p2v install -a /net/somehost/p2v/s10box.flar -p
.fi
.in -2
.sp

.LP
\fB例 3 \fRインストール用の ZFS アーカイブを作成する
.sp
.LP
次の例は、仮想から仮想 (V2V) 移行用のアーカイブを作成する方法を示しています。\fBsolaris10\fR ブランドゾーンの \fBzonepath\fR は \fB/zones/v2vzone\fR であると想定します。

.sp
.LP
まず、\fBzonepath dataset\fR の名前を決定します。

.sp
.in +2
.nf
# dataset=$(zfs list -H -o name /zones/v2vzone)
.fi
.in -2
.sp

.sp
.LP
次に、ゾーンのデータセットのスナップショットを作成します。

.sp
.in +2
.nf
# zfs snapshot -r $dataset@v2v
.fi
.in -2
.sp

.sp
.LP
最後に、\fBbzip2\fR で圧縮された ZFS 内蔵式の再帰的ストリームを生成します。

.sp
.in +2
.nf
# zfs send -rc $dataset@v2v | bzip2 > /net/somehost/v2v/v2v.zfs.bz2
.fi
.in -2
.sp

.LP
\fB例 4 \fRZFS アーカイブを使用してゾーンをインストールする
.sp
.LP
次の例では、ZFS アーカイブを使用してゾーンをインストールします。このゾーンは \fBzonecfg\fR(1M) を使用して構成済みであり、brand プロパティーが \fBsolaris10\fR に設定されているものと想定します。

.sp
.in +2
.nf
# zoneadm -z v2vzone install -a /net/somehost/v2v/v2v.zfs.bz2
.fi
.in -2
.sp

.LP
\fB例 5 \fR大域ゾーンからのゾーンのアクティブなブート環境の設定
.sp
.in +2
.nf
# \fBzfs set com.oracle.zones.solaris10:activebe=zbe-1 \\fR
    \fBrpool/export/zones/branded_zones/S10_zone/rpool/ROOT\fR
.fi
.in -2
.sp

.LP
\fB例 6 \fRSolaris10 ブランドゾーンからの新しいブート環境の作成
.sp
.LP
次の例では、Solaris10 ブランドゾーンから新しいブート環境を作成します。また、この例では、新しいブート環境にパッチを適用したり、その環境をアクティブにしたり、その環境をブートしたりする方法も示します。

.RS +4
.TP
1.
新しいブート環境を作成します。
.sp
.in +2
.nf
# \fBzfs snapshot rpool/ROOT/zbe-0@snap\fR
.fi
.in -2
.sp

.sp
.in +2
.nf
# \fBzfs clone -o mountpoint=/ -o canmount=noauto \
    rpool/ROOT/zbe-0@snap rpool/ROOT/zbe-1\fR
.fi
.in -2
.sp

.sp
.in +2
.nf
# \fBzfs promote rpool/ROOT/zbe-1\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
2.
ブート環境にパッチを適用します。
.sp
.in +2
.nf
# \fBzfs mount -o mountpoint=/mnt rpool/ROOT/zbe-1\fR
.fi
.in -2
.sp

.sp
.in +2
.nf
# \fBpatchadd -R /mnt -d /var/tmp/999999-01\fR
.fi
.in -2
.sp

.sp
.in +2
.nf
# \fBzfs unmount rpool/ROOT/zbe-1\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
3.
新しいブート環境をアクティブにし、その環境をブートします。
.sp
.in +2
.nf
# \fBzfs set com.oracle.zones.solaris10:activebe=zbe-1 rpool/ROOT\fR
.fi
.in -2
.sp

.sp
.in +2
.nf
# \fBshutdown -y -g 0 -r\fR
.fi
.in -2
.sp

.RE
.SH 属性
.sp
.LP
次の属性については、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/zones/brand/brand-solaris10
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBcpio\fR(1), \fBmdb\fR(1), \fBpax\fR(1), \fBzlogin\fR(1), \fBdtrace\fR(1M), \fBufsdump\fR(1M), \fBzfs\fR(1M), \fBzoneadm\fR(1M), \fBzonecfg\fR(1M), \fBattributes\fR(5), \fBbrands\fR(5), \fBzones\fR(5)
