Alhadis/Silos/Solaris-11.3/man1m/htable.1m
'\" te
.\"  Copyright 1989 AT&T Copyright 
.\" Portions Copyright (c) 1997, 2014, Oracle and/or its affiliates. All rights reserved.
.TH htable 1M "13 Feb 2014" "SunOS 5.11" "System Administration Commands"
.SH NAME
htable \- convert DoD Internet format host table
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/htable\fR \fIfilename\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBhtable\fR converts a host table in the format specified by \fBRFC\fR 952 to the format used by the network library routines.  Three files are created as a result of running \fBhtable\fR: \fBhosts\fR, \fBnetworks\fR, and \fBgateways\fR. The \fBhosts\fR file is used by the \fBgethostbyname\fR(3NSL) routines in mapping host names to addresses.  The \fBnetworks\fR file is used by the \fBgetnetbyname\fR(3SOCKET) routines in mapping network names to numbers. The \fBgateways\fR file is used by the routing daemon to identify "passive" Internet gateways.
.sp
.LP
If any of the files \fBlocalhosts\fR, \fBlocalnetworks\fR, or \fBlocalgateways\fR are present in the current directory, the file's contents is prepended to the output file without interpretation.  This allows sites to maintain local aliases and entries which are not normally present in the master database.
.sp
.LP
\fBhtable\fR is best used in conjunction with the \fBgettable\fR(1M) program which retrieves the DoD Internet host table from a host.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fBlocalhosts\fR\fR
.ad
.RS 17n
.rt  

.RE

.sp
.ne 2
.mk
.na
\fB\fBlocalnetworks\fR\fR
.ad
.RS 17n
.rt  

.RE

.sp
.ne 2
.mk
.na
\fB\fBlocalgateways\fR\fR
.ad
.RS 17n
.rt  

.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/network/nis
.TE

.SH SEE ALSO
.sp
.LP
\fBgettable\fR(1M), \fBgethostbyname\fR(3NSL), \fBgetnetbyname\fR(3SOCKET), \fBattributes\fR(5) Harrenstien, Ken, Mary Stahl, and Elizabeth Feinler, \fIDoD Internet Host Table Specification\fR, \fBRFC\fR 952, Network Information Center, \fBSRI\fR International, Menlo Park, California, October 1985.
.SH NOTES
.sp
.LP
\fBhtable\fR does not properly calculate the \fBgateways\fR file.
.sp
.LP
This command is obsolete and will be removed in a future release of Oracle Solaris.
