Alhadis/Silos/Solaris-11.3/man1m/ibportstate.1m
'\" te
.TH IBPORTSTATE 1m "Jan 13, 2010" "OpenIB" "OpenIB Diagnostics"

.SH NAME
ibportstate \- handle port (physical) state and link speed of an InfiniBand port

.SH SYNOPSIS
.B ibportstate
[\-d(ebug)] [\-e(rr_show)] [\-v(erbose)] [\-D(irect)] [\-G(uid)]
[\-s smlid] [\-V(ersion)] [\-C ca_name] [\-P ca_port]
[\-t(imeout) timeout_ms] [\-h(elp)] <dest dr_path|lid|guid> <portnum> [<op>]

.SH DESCRIPTION
.PP
ibportstate allows the port state and port physical state of an IB port
to be queried (in addition to link width and speed being validated
relative to the peer port when the port queried is a switch port),
or a switch port to be disabled, enabled, or reset. It
also allows the link speed/width enabled on any IB port to be adjusted.

.SH OPTIONS

.PP
.TP
op
Port operations allowed
 supported ops: enable, disable, reset, speed, width, query,
		down, arm, active, vls, mtu, lid, smlid, lmc
 Default is query
.PP
 ops enable, disable, and reset are only allowed on switch ports
 (An error is indicated if attempted on CA or router ports)
 speed and width ops are allowed on any port
 speed values are legal values for PortInfo:LinkSpeedEnabled
 (An error is indicated if PortInfo:LinkSpeedSupported does not support
  this setting)
 width values are legal values for PortInfo:LinkWidthEnabled
 (An error is indicated if PortInfo:LinkWidthSupported does not support
  this setting)
 (NOTE: Speed and width changes are not effected until the port goes through
  link renegotiation)
 query also validates port characteristics (link width and speed)
  based on the peer port. This checking is done when the port
  queried is a switch port as it relies on combined routing
  (an initial LID route with directed routing to the peer) which
  can only be done on a switch. This peer port validation feature
  of query op requires LID routing to be functioning in the subnet.


.SH COMMON OPTIONS

Most OpenIB diagnostics take the following common flags. The exact list of
supported flags per utility can be found in the usage message and can be shown
using the util_name -h syntax.

# Debugging flags
.PP
\-d      raise the IB debugging level.
        May be used several times (-ddd or -d -d -d).
.PP
\-e      show send and receive errors (timeouts and others)
.PP
\-h      show the usage message
.PP
\-v      increase the application verbosity level.
        May be used several times (-vv or -v -v -v)
.PP
\-V      show the version info.

# Addressing flags
.PP
\-D      use directed path address arguments. The path
        is a comma separated list of out ports.
        Examples:
        "0"             # self port
        "0,1,2,1,4"     # out via port 1, then 2, ...
.PP
\-G      use GUID address argument. In most cases, it is the Port GUID.
        Example:
        "0x08f1040023"
.PP
\-s <smlid>      use 'smlid' as the target lid for SM/SA queries.

# Other common flags:
.PP
\-C <ca_name>    use the specified ca_name.
.PP
\-P <ca_port>    use the specified ca_port.
.PP
\-t <timeout_ms> override the default timeout for the solicited mads.

Multiple CA/Multiple Port Support

When no IB device or port is specified, the port to use is selected
by the following criteria:
.PP
1. the first port that is ACTIVE.
.PP
2. if not found, the first port that is UP (physical link up).

If a port and/or CA name is specified, the user request is
attempted to be fulfilled, and will fail if it is not possible.

.SH EXAMPLES

.PP
ibportstate 3 1 disable                 # by lid
.PP
ibportstate -G 0x2C9000100D051 1 enable # by guid
.PP
ibportstate -D 0 1                      # (query) by direct route
.PP
ibportstate 3 1 reset				# by lid
.PP
ibportstate 3 1 speed 1				# by lid
.PP
ibportstate 3 1 width 1				# by lid
.PP
ibportstate -D 0 1 lid 0x1234 arm		# by direct route

.SH AUTHOR
.TP
Hal Rosenstock
.RI < hal.rosenstock@gmail.com >


.\" Oracle has added the ARC stability level to this manual page
.SH ATTRIBUTES
See
.BR attributes (5)
for descriptions of the following attributes:
.sp
.TS
box;
cbp-1 | cbp-1
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE 
=
Availability	network/open-fabrics
=
Stability	Volatile
.TE 
.PP

.SH NOTES

.\" Oracle has added source availability information to this manual page
This software was built from source available at https://java.net/projects/solaris-userland.  The original community source was downloaded from  ['http://www.openfabrics.org/downloads/ibutils/ibutils-1.5.7.tar.gz', 'http://www.openfabrics.org/downloads/libibverbs/libibverbs-1.1.4-1.22.g7257cd3.tar.gz', 'http://www.openfabrics.org/downloads/libmlx4/libmlx4-1.0.1-1.18.gb810a27.tar.gz', 'http://www.openfabrics.org/downloads/libsdp/libsdp-1.1.108-0.15.gd7fdb72.tar.gz', 'http://www.openfabrics.org/downloads/management/infiniband-diags-1.5.8.tar.gz', 'http://www.openfabrics.org/downloads/management/libibmad-1.3.7.tar.gz', 'http://www.openfabrics.org/downloads/management/libibumad-1.3.7.tar.gz', 'http://www.openfabrics.org/downloads/management/opensm-3.3.9.tar.gz', 'http://www.openfabrics.org/downloads/perftest/perftest-1.3.0-0.42.gf350d3d.tar.gz', 'http://www.openfabrics.org/downloads/qperf/qperf-0.4.6-0.1.gb81434e.tar.gz', 'http://www.openfabrics.org/downloads/rdmacm/librdmacm-1.0.14.1.tar.gz', 'http://www.openfabrics.org/downloads/rds-tools/rds-tools-2.0.4.tar.gz']

Further information about this software can be found on the open source community website at http://www.openfabrics.org/.
