Alhadis/Silos/Solaris-11.3/man1m/ktkt_warnd.1m
'\" te
.\" Copyright 1987, 1989 by the Student Information Processing Board of the Massachusetts Institute of Technology. For copying and distribution information, please see the file kerberosv5/mit-sipb-copyright.h.
.\" Portions Copyright (c) 2004, 2013, Oracle and/or its affiliates. All rights reserved.
.TH ktkt_warnd 1M "20 Nov 2013" "SunOS 5.11" "System Administration Commands"
.SH NAME
ktkt_warnd \- Kerberos warning daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/krb5/ktkt_warnd\fR 
.fi

.SH DESCRIPTION
.sp
.LP
\fBktkt_warnd\fR is a daemon on Kerberos clients that can warn users when their Kerberos tickets are about to expire or renew the tickets before they expire. It is invoked by \fBinetd\fR when a ticket-granting ticket (TGT) is obtained for the first time, such as after using the \fBkinit\fR command. \fBktkt_warnd\fR can be configured through per user and system configuration files on the client. In the configuration files, you can specify that you be supplied notice of ticket expiration\(emthrough terminal, mail, or \fBsyslog\fR\(emor to renew the TGT.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/krb5/warn.conf\fR\fR
.ad
.sp .6
.RS 4n
Kerberos warning configuration file
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/user/$USER/krb-warn.conf\fR\fR
.ad
.sp .6
.RS 4n
Per-user Kerberos warning configuration file
.RE

.sp
.LP
If the user's configuration file does not exist, \fB/etc/krb5/warn.conf\fR will be used.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBinetadm\fR(1M), \fBinetd\fR(1M), \fBsvcadm\fR(1M), \fBwarn.conf\fR(4), \fBattributes\fR(5), \fBkerberos\fR(5), \fBsmf\fR(5)
.sp
.LP
\fIManaging Kerberos and Other Authentication Services in Oracle Solaris 11.3\fR
.SH NOTES
.sp
.LP
The \fBktkt_warnd\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/network/security/ktkt_warn:default
.fi
.in -2
.sp

.sp
.LP
\fBktkt_warnd\fR is off by default, and can be turned on by administrator. Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). Responsibility for initiating and restarting this service is delegated to \fBinetd\fR(1M). Use \fBinetadm\fR(1M) to make configuration changes and to view configuration information for this service. The service's status can be queried using the \fBsvcs\fR(1) command.
