Alhadis/Silos/Solaris-11.3/man1m/netcfgd.1m
'\" te
.\" Copyright (c) 2010, 2012, Oracle and/or its affiliates. All rights reserved.
.TH netcfgd 1M "1 Jun 2012" "SunOS 5.11" "System Administration Commands"
.SH NAME
netcfgd \- network configuration management daemon
.SH SYNOPSIS
.LP
.nf
\fB/lib/inet/netcfgd\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBnetcfgd\fR is a system daemon to manage network configuration. This daemon is started automatically by svc:/network/netcfg:default and should not be invoked directly. It does not constitute a programming interface.
.sp
.LP
\fBnetcfgd\fR manages access to a network configuration repository, insuring that readers and writers have the appropriate authorizations. The required authorizations vary, depending on the portion of the database being accessed.
.sp

.sp
.TS
tab();
cw(.56i) cw(1.01i) cw(3.93i) 
lw(.56i) lw(1.01i) lw(3.93i) 
.
ToolRead/WriteAuthorization (or Privilege)
_
dladmwritesys_dl_config privilege
ipadmwritesolaris.network.interface.config
netcfgreadsolaris.network.autoconf.read
netcfgwritesolaris.network.autoconf.write
netcfgr/w wlanssolaris.network.autoconf.wlan
netadmenable/disable profilesT{
solaris.network.autoconf.read solaris.network.autoconf.select
T}
.TE

.sp
.LP
The \fBsolaris.network.interface.config\fR authorization and the \fBsys_dl_config\fR privilege are obtained by means of the Network Management security profile. The \fBsolaris.network.autoconf.read\fR authorization is part of the Basic Solaris User profile. The \fBsolaris.network.autoconf.wlan\fR and \fB\&.select\fR authorizations are obtained by means of the Network Autoconf User profile, and the \fBautoconf.write\fR authorization, plus those included in the Network Autoconf User profile, are obtained by means of the Network Autoconf Admin profile.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBdladm\fR(1M), \fBipadm\fR(1M), \fBnetcfg\fR(1M), \fBnwamd\fR(1M), \fBsvcadm\fR(1M), \fBauth_attr\fR(4), \fBexec_attr\fR(4), \fBprof_attr\fR(4), \fBattributes\fR(5), \fBsmf\fR(5)
.sp
.LP
See also \fBnwam-manager(1M)\fR, available in the JDS/GNOME man page collection.
