Alhadis/Silos/Solaris-11.3/man1m/rcapd.1m
'\" te
.\" Copyright (c) 2004, 2015, Oracle and/or its affiliates. All rights             reserved.
.TH rcapd 1M "20 Mar 2015" "SunOS 5.11" "System Administration Commands"
.SH NAME
rcapd \- resource cap enforcement daemon
.SH SYNOPSIS
.LP
.nf
\fBrcapd\fR [\fB-d\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBrcapd\fR daemon enforces resource caps on collections of processes. Per-project and per-zone physical memory caps are supported. For information about projects, see \fBproject\fR(4). For zones information, see \fBzones\fR(5)
.sp
.LP
When the resident set size (RSS) of a collection of processes exceeds its cap, \fBrcapd\fR takes action and reduces the RSS of the collection.
.sp
.LP
The virtual memory system divides physical memory into segments known as pages. To read data from a file into memory, the virtual memory system reads in individual pages. To reduce resource consumption, the daemon can page out, or relocate, infrequently used pages to an area outside of physical memory.
.sp
.LP
In the \fBproject\fR file, caps are defined for projects that have positive values for the following project attribute: 
.sp
.ne 2
.mk
.na
\fB\fBrcap.max-rss\fR\fR
.ad
.RS 16n
.rt  
The total amount of physical memory, in bytes, that is available to the project's member processes
.RE

.sp
.LP
See \fBproject\fR(4) for a description of project attributes.
.sp
.LP
For a system with one or more zones, you can dynamically set the \fBrcap.max-rss\fR value for a zone with \fBrcapadm\fR(1M). To set a persistent cap on memory usage within a zone, you use \fBzonecfg\fR(1M).
.sp
.LP
You configure \fBrcapd\fR through the use of \fBrcapadm\fR(1M). The daemon can be monitored with \fBrcapstat\fR(1). Configuration changes are incorporated into \fBrcapd\fR by sending it \fBSIGHUP\fR (see \fBkill\fR(1)), or according to the configuration interval (see \fBrcapadm\fR(1M)).
.SH OPTIONS
.sp
.LP
The following option is supported:
.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 6n
.rt  
Enable debug mode. Messages are displayed on the invoking user's terminal.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRSetting Resident Set Size Cap Attribute
.sp
.LP
The following line in the \fB/etc/project\fR database sets an RSS cap of 1073741824 bytes for a project named \fBfoo\fR.

.sp
.in +2
.nf
foo:100::foo,root::rcap.max-rss=10737418240
.fi
.in -2

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.RS 5n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB1\fR
.ad
.RS 5n
.rt  
An error occurred.
.RE

.sp
.ne 2
.mk
.na
\fB2\fR
.ad
.RS 5n
.rt  
Invalid command-line options were specified.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/project\fR\fR
.ad
.RS 16n
.rt  
Project database.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/resource-mgmt/resource-caps
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBrcapstat\fR(1), \fBsvcs\fR(1), \fBrcapadm\fR(1M), \fBzonecfg\fR(1M), \fBsvcadm\fR(1M), \fBproject\fR(4), \fBattributes\fR(5), \fBsmf\fR(5), \fBzones\fR(5)
.sp
.LP
"Physical Memory Control Using the Resource Capping Daemon" in \fISystem Administration Guide: Solaris Containers-Resource Management, and Solaris Zones\fR
.SH NOTES
.sp
.LP
If any signal interrupts \fBrcapd\fR, all running scans are stopped immediately and \fBrcapd\fR exits cleanly.
.sp
.LP
A collection's RSS can exceed its cap for some time before the cap is enforced, even if sufficient pageable memory is available. This period of time can be reduced by shortening the RSS sampling interval with \fBrcapadm\fR.
.sp
.LP
If a collection exceeds its rss cap for a long time, \fBrcapd\fR may stop enforcing caps on that collection and log a message suggesting setting appropriate caps. Later, \fBrcapd\fR may resume to enforce caps on this collection.
.sp
.LP
To force \fBrcapd\fR to resume enforcing caps, set appropriate cap for the collection and/or look for misbehaving processes and restart \fBrcapd\fR.
.sp
.LP
The \fBrcapd\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/system/rcap:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command.
