Alhadis/Silos/Solaris-11.3/man1m/rctladm.1m
'\" te
.\" Copyright (c) 2003, 2015, Oracle and/or its affiliates. All rights    reserved.
.TH rctladm 1M "21 May 2015" "SunOS 5.11" "System Administration Commands"
.SH NAME
rctladm \- display or modify global state of system resource controls
.SH SYNOPSIS
.LP
.nf
\fBrctladm\fR [\fB-lu\fR] [\fB-e\fR \fIaction\fR] [\fB-d\fR \fIaction\fR] [\fIname\fR...]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBrctladm\fR command allows the examination and modification of active resource controls on the running system. An instance of a resource control is referred to as an \fBrctl\fR. See \fBsetrctl\fR(2) for a description of an \fBrctl\fR; see \fBresource-controls \fR(5) for a list of the \fBrctl\fRs supported in the current release of the Solaris operating system. Logging of \fBrctl\fR violations can be activated or deactivated system-wide and active \fBrctl\fRs (and their state) can be listed.
.sp
.LP
An \fBrctladm\fR command without options is the equivalent of an \fBrctladm\fR with the \fB-l\fR option. See the description of \fB-l\fR below.
.SH OPTIONS
.sp
.LP
The following options are supported: 
.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIaction\fR\fR
.ad
.br
.na
\fB\fB-e\fR \fIaction\fR\fR
.ad
.sp .6
.RS 4n
Disable (\fB-d\fR) or enable (\fB-e\fR) the global action on the specified \fBrctl\fRs. If no \fBrctl\fR is specified, no action is taken and an error status is returned. You can use the special token \fBall\fR with the disable option to deactivate all global actions on a resource control.
.sp
You can set the \fBsyslog\fR action to a specific degree by assigning a severity level. To do this, specify \fBsyslog=\fIlevel\fR\fR, where \fIlevel\fR is one of the string tokens given as valid severity levels in \fBsyslog\fR(3C). You can omit the common \fBLOG_\fR prefix on the severity level. Note that not all \fBrctl\fRs support the \fBsyslog\fR action. See \fBresource-controls \fR(5).
.sp
If the enabling of the \fBsyslog\fR action for an rctl results in a continuous stream of logged messages, log output will be restricted to one message every five seconds. In such a circumstance, some messages will be dropped. No corrective action need to be taken.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
List information about \fBrctl\fRs. The name, global event actions and statuses, and global flags are displayed. If one or more name operands are specified, only those \fBrctl\fRs matching the names are displayed.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.sp .6
.RS 4n
Configure resource controls based on the contents of \fB/etc/rctladm.conf\fR. Any name operands are ignored.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIname\fR\fR
.ad
.sp .6
.RS 4n
The name of the \fBrctl\fR to operate on. Multiple \fBrctl\fR names can be specified. If no names are specified, and the list action has been specified, then all \fBrctl\fRs are listed. If the enable or disable action is specified, one or more \fBrctl\fR names must be specified.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRActivating System Logging for Specific Violations
.sp
.LP
The following command activates system logging of all violations of \fBtask.max-lwps\fR.

.sp
.in +2
.nf
# rctladm -e syslog task.max-lwps
#
.fi
.in -2
.sp

.LP
\fBExample 2 \fRExamining the Current Status of a Specific Resource
.sp
.LP
The following command examines the current status of the \fBtask.max-lwps\fR resource.

.sp
.in +2
.nf
$ rctladm -l task.max-lwps
task.max-lwps               syslog=DEBUG
$
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.sp .6
.RS 4n
A fatal error occurred. A message is written to standard error to indicate each resource control for which the operation failed. The operation was successful for any other resource controls specified as operands. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.sp .6
.RS 4n
Invalid command line options were specified.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/rctladm.conf\fR\fR
.ad
.sp .6
.RS 4n
Each time \fBrctladm\fR is executed, it updates the contents of \fBrctladm.conf\fR with the current configuration.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBsetrctl\fR(2), \fBgetrctl\fR(2), \fBprctl\fR(1), \fBrctlblk_get_global_flags\fR(3C), \fBrctlblk_get_global_action\fR(3C), \fBattributes\fR(5), \fBresource-controls \fR(5)
.SH NOTES
.sp
.LP
By default, there is no global logging of \fBrctl\fR violations.
