Alhadis/Silos/Solaris-11.3/man1m/rtc.1m
'\" te
.\" Copyright (c) 2003, 2015, Oracle and/or its affiliates. All rights             reserved.
.TH rtc 1M "25 Mar 2015" "SunOS 5.11" "System Administration Commands"
.SH NAME
rtc \- provide all real-time clock and UTC-lag management
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/rtc\fR [\fB-c\fR] [[\fB-z\fR \fIzone-name\fR] [-w]]
.fi

.SH DESCRIPTION
.sp
.LP
The real-time clock is a hardware based time counter. It is used by the operating system to calculate the current time after optionally applying a time zone and daylight savings time adjustment. Some operating systems use a convention of storing a time-zone adjusted value in the real-time clock. Oracle Solaris generally stores a GMT value in the real-time clock.
.sp
.LP
On x86 systems, the \fBrtc\fR command reconciles the difference in the way that time is established between UNIX and MS-DOS systems. UNIX systems utilize Universal Coordinated Time (\fBUTC\fR), while \fBMS-DOS\fR systems utilize local time. 
.sp
.LP
Without arguments, \fBrtc\fR displays the currently configured time zone string. The currently configured time zone string is based on what was last recorded by \fBrtc\fR\fB-z\fR \fIzone-name\fR.
.sp
.LP
The \fBrtc\fR command is not normally run from a shell prompt; it is generally invoked by the system. Commands such as \fBdate\fR(1) and \fBrdate\fR(1M), which are used to set the time on a system, invoke \fB/usr/sbin/rtc\fR \fB-c\fR to ensure that daylight savings time (\fBDST\fR) is corrected for properly.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 16n
.rt  
This option checks for \fBDST\fR and makes corrections if necessary. It is normally run once a day by a \fBcron\fR job.
.sp
If there is no \fBRTC\fR time zone or \fB/etc/rtc_config\fR file, this option will do nothing.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone-name\fR\fR
.ad
.RS 16n
.rt  
This option, which is normally run by the system at software installation time, is used to specify the time zone in which the \fBRTC\fR is to be maintained. It updates the configuration file \fB/etc/rtc_config\fR with the name of the specified zone and the current \fBUTC\fR lag for that zone. If there is an existing \fBrtc_config\fR file, this command will update it. If not, this command will create it.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-w\fR\fR
.ad
.RS 16n
.rt  
Only valid with the \fB-z\fR option; when this option is given, it is assumed that the real-time clock has the proper time and warps the system's time. By default, the system time is assumed to be correct and the real-time clock is modified instead.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/rtc_config\fR\fR
.ad
.RS 19n
.rt  
The data file used to record the time zone and \fBUTC\fR lag. This file is completely managed by \fB/usr/sbin/rtc\fR, and it is read by the kernel.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBdate\fR(1), \fBrdate\fR(1M), \fBattributes\fR(5)
