Alhadis/Silos/Solaris-11.3/man1m/zpool.1m
'\" te
.\" Copyright (c) 2004, 2015, Oracle and/or its affiliates. All rights       reserved.
.TH zpool 1M "25 Mar 2015" "SunOS 5.11" "System Administration Commands"
.SH NAME
zpool \- configures ZFS storage pools
.SH SYNOPSIS
.LP
.nf
\fBzpool\fR [\fB-?\fR]
.fi

.LP
.nf
\fBzpool help\fR \fIcommand\fR | help | \fIproperty\fR \fIproperty-name\fR
.fi

.LP
.nf
\fBzpool\fR \fBhelp\fR \fB-l\fR \fBproperties\fR
.fi

.LP
.nf
\fBzpool add\fR [\fB-f\fR] [\fB-n\fR [\fB-l\fR]] \fIpool\fR \fIvdev\fR ...
.fi

.LP
.nf
\fBzpool attach\fR [\fB-f\fR] \fIpool\fR \fIdevice\fR \fInew_device\fR
.fi

.LP
.nf
\fBzpool clear\fR [\fB-nF\fR [\fB-f\fR]] \fIpool\fR [\fIdevice\fR]
.fi

.LP
.nf
\fBzpool create\fR [\fB-f\fR] [\fB-n\fR [\fB-l\fR]] [\fB-B\fR] [\fB-N\fR] [\fB-o\fR \fIproperty=value\fR] ...
     [\fB-O\fR \fIfile-system-property=value\fR] ... [\fB-m\fR \fImountpoint\fR]
     [\fB-R\fR \fIroot\fR] [\fB-t\fR \fItmppool\fR] \fIpool\fR \fIvdev\fR ...
.fi

.LP
.nf
\fBzpool destroy\fR [\fB-f\fR] \fIpool\fR
.fi

.LP
.nf
\fBzpool detach\fR \fIpool\fR \fIdevice\fR
.fi

.LP
.nf
\fBzpool export\fR [\fB-f\fR] \fIpool\fR ...
.fi

.LP
.nf
\fBzpool get\fR \fBall\fR | \fIproperty\fR[,...] \fIpool\fR ...
.fi

.LP
.nf
\fBzpool history\fR [\fB-il\fR] [\fIpool\fR] ...
.fi

.LP
.nf
\fBzpool import\fR [\fB-d\fR \fIpath\fR ...] [\fB-D\fR] [-l]
.fi

.LP
.nf
\fBzpool import\fR [\fB-d\fR \fIpath\fR ... | \fB-c\fR \fIcachefile\fR][\fB-F\fR [\fB-n\fR <\fIpool\fR | \fIid\fR>
.fi

.LP
.nf
\fBzpool import\fR [\fB-o \fImntopts\fR\fR] [\fB-o\fR \fIproperty=value\fR] ... [\fB-d\fR \fIpath\fR ... |
     \fB-c\fR \fIcachefile\fR] [\fB-D\fR] [\fB-f\fR] [\fB-m\fR] [\fB-N\fR] [\fB-R\fR \fIroot\fR] [\fB-F\fR [\fB-n\fR]] \fB-a\fR
     \fIpool\fR | \fIid\fR [\fInewpool\fR]
.fi

.LP
.nf
\fBzpool import\fR [\fB-o \fImntopts\fR\fR] [\fB-o\fR \fIproperty=value\fR] ... [\fB-d\fR \fIpath\fR ... |
     \fB-c\fR \fIcachefile\fR] [\fB-D\fR] [\fB-f\fR] [\fB-m\fR] [\fB-N\fR] [\fB-R\fR \fIroot\fR] [\fB-F\fR [\fB-n\fR]] 
     [\fB-t\fR \fBtmppool\fR] \fIpool\fR | \fIid\fR [\fInewpool\fR]
.fi

.LP
.nf
\fBzpool iostat\fR [\fB-T\fR d|u ] [\fB-v\fR [\fB-l\fR]] [\fIpool\fR] ... [\fIinterval\fR[\fIcount\fR]]
.fi

.LP
.nf
\fBzpool list\fR [\fB-H\fR] [\fB-o\fR \fIproperty\fR[,...]] [\fB-T\fR d|u ] [\fIpool\fR] ... [\fIinterval\fR[\fIcount\fR]]
.fi

.LP
.nf
\fBzpool offline\fR [\fB-t\fR] \fIpool\fR \fIdevice\fR ...
.fi

.LP
.nf
\fBzpool online\fR [\fB-e\fR] \fIpool\fR \fIdevice\fR ...
.fi

.LP
.nf
\fBzpool remove\fR \fIpool\fR \fIdevice\fR ...
.fi

.LP
.nf
\fBzpool replace\fR [\fB-f\fR] \fIpool\fR \fIdevice\fR [\fInew_device\fR]
.fi

.LP
.nf
\fBzpool scrub\fR [\fB-s\fR] \fIpool\fR ...
.fi

.LP
.nf
\fBzpool set\fR \fIproperty\fR=\fIvalue\fR \fIpool\fR
.fi

.LP
.nf
\fBzpool split\fR [\fB-n\fR [\fB-l\fR]] [\fB-R\fR \fIaltroot\fR]  [\fB-o\fR \fImntopts\fR] [\fB-o\fR \fIproperty\fR=\fIvalue\fR] \fIpool\fR
     \fInewpool\fR [\fIdevice\fR ...]
.fi

.LP
.nf
\fBzpool status\fR [\fB-l\fR] [\fB-v\fR] [\fB-x\fR] [\fB-T\fR d|u ] [\fIpool\fR] ... [\fIinterval\fR[\fIcount\fR]]
.fi

.LP
.nf
\fBzpool upgrade\fR 
.fi

.LP
.nf
\fBzpool upgrade\fR \fB-v\fR
.fi

.LP
.nf
\fBzpool upgrade\fR [\fB-V\fR \fIversion\fR] \fB-a\fR | \fIpool\fR ...
.fi

.LP
.nf
\fBzpool monitor\fR -t provider [-T d|u] [[-p] -o \fIfield\fR[,. . .]] [\fIpool\fR] . . .
         [\fIinterval\fR [\fIcount\fR]]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBzpool\fR command configures \fBZFS\fR storage pools. A storage pool is a collection of devices that provides physical storage and data replication for \fBZFS\fR datasets.
.sp
.LP
All datasets within a storage pool share the same space. See \fBzfs\fR(1M) for information on managing datasets.
.SS "Virtual Devices (vdevs)"
.sp
.LP
A \fBvirtual device\fR describes a single device or a collection of devices organized according to certain performance and fault characteristics. The following virtual devices are supported:
.sp
.ne 2
.mk
.na
\fB\fBdisk\fR\fR
.ad
.sp .6
.RS 4n
A block device, typically located under \fB/dev/dsk\fR. \fBZFS\fR can use individual slices or partitions, though the recommended mode of operation is to use whole disks. A disk can be specified by a full path, or it can be a shorthand name (the relative portion of the path under \fB/dev/dsk\fR). A whole disk can be specified by omitting the slice or partition designation. Alternatively, whole disks can be specified using the \fB/dev/chassis/.../disk\fR path that describes the disk's current location. When given a whole disk, \fBZFS\fR automatically labels the disk, if necessary.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfile\fR\fR
.ad
.sp .6
.RS 4n
A regular file. The use of files as a backing store is strongly discouraged. It is designed primarily for experimental purposes, as the fault tolerance of a file is only as good as the file system of which it is a part. A file must be specified by a full path.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmirror\fR\fR
.ad
.sp .6
.RS 4n
A mirror of two or more devices. Data is replicated in an identical fashion across all components of a mirror. A mirror with \fIN\fR disks of size \fIX\fR can hold \fIX\fR bytes and can withstand (\fIN-1\fR) devices failing before data integrity is compromised.
.RE

.sp
.ne 2
.mk
.na
\fB\fBraidz\fR\fR
.ad
.br
.na
\fB\fBraidz1\fR\fR
.ad
.br
.na
\fB\fBraidz2\fR\fR
.ad
.br
.na
\fB\fBraidz3\fR\fR
.ad
.sp .6
.RS 4n
A variation on \fBRAID-5\fR that allows for better distribution of parity and eliminates the "\fBRAID-5\fR write hole" (in which data and parity become inconsistent after a power loss). Data and parity is striped across all disks within a \fBraidz\fR group.
.sp
A \fBraidz\fR group can have single-, double- , or triple parity, meaning that the \fBraidz\fR group can sustain one, two, or three failures, respectively, without losing any data. The \fBraidz1\fR \fBvdev\fR type specifies a single-parity \fBraidz\fR group; the \fBraidz2\fR \fBvdev\fR type specifies a double-parity \fBraidz\fR group; and the \fBraidz3\fR \fBvdev\fR type specifies a triple-parity \fBraidz\fR group. The \fBraidz\fR \fBvdev\fR type is an alias for \fBraidz1\fR.
.sp
A \fBraidz\fR group with \fIN\fR disks of size \fIX\fR with \fIP\fR parity disks can hold approximately (\fIN-P\fR)*\fIX\fR bytes and can withstand \fIP\fR device(s) failing before data integrity is compromised. The minimum number of devices in a \fBraidz\fR group is one more than the number of parity disks. The recommended number is between 3 and 9 to help increase performance.
.RE

.sp
.ne 2
.mk
.na
\fB\fBspare\fR\fR
.ad
.sp .6
.RS 4n
A special pseudo-vdev which keeps track of available hot spares for a pool. For more information, see the "Hot Spares" section.
.RE

.sp
.ne 2
.mk
.na
\fB\fBlog\fR\fR
.ad
.sp .6
.RS 4n
A separate-intent log device. If more than one log device is specified, then writes are load-balanced between devices. Log devices can be mirrored. However, \fBraidz\fR \fBvdev\fR types are not supported for the intent log. For more information, see the "Intent Log" section.
.RE

.sp
.ne 2
.mk
.na
\fB\fBcache\fR\fR
.ad
.sp .6
.RS 4n
A device used to cache storage pool data. A cache device cannot be configured as a mirror or \fBraidz\fR group. For more information, see the "Cache Devices" section.
.RE

.sp
.LP
Virtual devices cannot be nested, so a mirror or \fBraidz\fR virtual device can only contain files or disks. Mirrors of mirrors (or other combinations) are not allowed.
.sp
.LP
A pool can have any number of virtual devices at the top of the configuration (known as \fBroot vdevs\fR). Data is dynamically distributed across all top-level devices to balance data among devices. As new virtual devices are added, \fBZFS\fR automatically places data on the newly available devices.
.sp
.LP
Virtual devices are specified one at a time on the command line, separated by whitespace. The keywords \fBmirror\fR and \fBraidz\fR are used to distinguish where a group ends and another begins. For example, the following creates two root vdevs, each a mirror of two disks:
.sp
.in +2
.nf
# \fBzpool create mypool mirror c0t0d0 c0t1d0 mirror c1t0d0 c1t1d0\fR
.fi
.in -2
.sp

.sp
.LP
Alternatively, the following command could be used:
.sp
.in +2
.nf
# \fBzpool create tank \e
mirror \e
    /dev/chassis/RACK29.U01-04/DISK_00/disk \e
    /dev/chassis/RACK29.U05-08/DISK_00/disk \e
mirror \e
    /dev/chassis/RACK29.U01-04/DISK_01/disk \e
    /dev/chassis/RACK29.U05-08/DISK_01/disk\fR
.fi
.in -2
.sp

.SS "Pool or Device Failure and Recovery"
.sp
.LP
\fBZFS\fR supports a rich set of mechanisms for handling device failure and data corruption. All metadata and data is checksummed, and \fBZFS\fR automatically repairs bad data from a good copy when corruption is detected.
.sp
.LP
In order to take advantage of these features, a pool must make use of some form of redundancy, using either mirrored or \fBraidz\fR groups. While \fBZFS\fR supports running in a non-redundant configuration, where each root vdev is simply a disk or file, this is strongly discouraged. A single case of bit corruption can render some or all of your data unavailable.
.sp
.LP
A pool's health status is described by one of four states: 
.sp
.ne 2
.mk
.na
\fB\fBDEGRADED\fR\fR
.ad
.sp .6
.RS 4n
A pool with one or more failed devices, but the data is still available due to a redundant configuration.
.RE

.sp
.ne 2
.mk
.na
\fB\fBONLINE\fR\fR
.ad
.sp .6
.RS 4n
A pool that has all devices operating normally.
.RE

.sp
.ne 2
.mk
.na
\fB\fBSUSPENDED\fR\fR
.ad
.sp .6
.RS 4n
A pool that is waiting for device connectivity to be restored. A suspended pool remains in the wait state until the device issue is resolved.
.RE

.sp
.ne 2
.mk
.na
\fB\fBUNAVAIL\fR\fR
.ad
.sp .6
.RS 4n
A pool with corrupted metadata, or one or more unavailable devices and insufficient replicas to continue functioning. 
.RE

.sp
.LP
The health of the top-level vdev, such as mirror or \fBraidz\fR device, is potentially impacted by the state of its associated vdevs, or component devices. A top-level vdev or component device is in one of the following states:
.sp
.ne 2
.mk
.na
\fB\fBDEGRADED\fR\fR
.ad
.sp .6
.RS 4n
One or more top-level vdevs is in the degraded state because one or more component devices are offline. Sufficient replicas exist to continue functioning.
.sp
One or more component devices is in the degraded or faulted state, but sufficient replicas exist to continue functioning. The underlying conditions are as follows:
.RS +4
.TP
.ie t \(bu
.el o
The number of checksum errors exceeds acceptable levels and the device is degraded as an indication that something may be wrong. \fBZFS\fR continues to use the device as necessary.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The number of I/O errors exceeds acceptable levels. The device could not be marked as faulted because there are insufficient replicas to continue functioning.
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fBOFFLINE\fR\fR
.ad
.sp .6
.RS 4n
The device was explicitly taken offline by the \fBzpool offline\fR command.
.RE

.sp
.ne 2
.mk
.na
\fB\fBONLINE\fR\fR
.ad
.sp .6
.RS 4n
The device is online and functioning.
.RE

.sp
.ne 2
.mk
.na
\fB\fBREMOVED\fR\fR
.ad
.sp .6
.RS 4n
The device was physically removed while the system was running. Device removal detection is hardware-dependent and may not be supported on all platforms.
.RE

.sp
.ne 2
.mk
.na
\fB\fBUNAVAIL\fR\fR
.ad
.sp .6
.RS 4n
The device could not be opened. If a pool is imported when a device was unavailable, then the device will be identified by a unique identifier instead of its path since the path was never correct in the first place.
.RE

.sp
.LP
If a device is removed and later reattached to the system, \fBZFS\fR attempts to put the device online automatically. Device attach detection is hardware-dependent and might not be supported on all platforms.
.SS "Hot Spares"
.sp
.LP
\fBZFS\fR allows devices to be associated with pools as \fBhot spares\fR. These devices are not actively used in the pool, but when an active device fails, it is automatically replaced by a hot spare. To create a pool with hot spares, specify a \fBspare\fR vdev with any number of devices. For example, 
.sp
.in +2
.nf
# \fBzpool create pool mirror c0d0 c1d0 spare c2d0 c3d0\fR
.fi
.in -2
.sp

.sp
.LP
Spares can be added with the \fBzpool add\fR command and removed with the \fBzpool remove\fR command. Once a spare replacement is initiated, a new spare vdev is created within the configuration that will remain there until the original device is replaced. At this point, the hot spare becomes available again if another device fails.
.sp
.LP
An in-progress spare replacement can be cancelled by detaching the hot spare. If the original faulted device is detached, then the hot spare assumes its place in the configuration, and is removed from the spare list of all active pools.
.sp
.LP
If the original failed device is physically replaced, brought back online, or the errors are cleared, either through an FMA event or by using the \fBzpool online\fR or \fBzpool clear\fR commands, and the state of the original device becomes healthy, the \fBINUSE\fR spare device will become \fBAVAIL\fR again.
.sp
.LP
Spares cannot replace log devices.
.SS "Intent Log"
.sp
.LP
The \fBZFS\fR Intent Log (\fBZIL\fR) satisfies \fBPOSIX\fR requirements for synchronous transactions. For instance, databases often require their transactions to be on stable storage devices when returning from a system call. \fBNFS\fR and other applications can also use \fBfsync\fR() to ensure data stability. By default, the intent log is allocated from blocks within the main pool. However, it might be possible to get better performance using separate intent log devices such as \fBNVRAM\fR or a dedicated disk. For example:
.sp
.in +2
.nf
# \fBzpool create pool c0d0 c1d0 log c2d0\fR
.fi
.in -2
.sp

.sp
.LP
Multiple log devices can also be specified, and they can be mirrored. See the EXAMPLES section for an example of mirroring multiple log devices.
.sp
.LP
Log devices can be added, replaced, attached, detached, and imported, and exported as part of the larger pool. Mirrored log devices can be removed by specifying the top-level mirror for the log.
.SS "Cache Devices"
.sp
.LP
Devices can be added to a storage pool as \fBcache devices\fR. These devices provide an additional layer of caching between main memory and disk. For read-heavy workloads, where the working set size is much larger than what can be cached in main memory, using cache devices allow much more of this working set to be served from low latency media. Using cache devices provides the greatest performance improvement for random read-workloads of mostly static content.
.sp
.LP
To create a pool with cache devices, specify a \fBcache\fR \fIvdev\fR with any number of devices. For example:
.sp
.in +2
.nf
# \fBzpool create pool c0d0 c1d0 cache c2d0 c3d0\fR
.fi
.in -2
.sp

.sp
.LP
Cache devices cannot be mirrored or part of a \fBraidz\fR configuration. If a read error is encountered on a cache device, that read \fBI/O\fR is reissued to the original storage pool device, which might be part of a mirrored or \fBraidz\fR configuration.
.sp
.LP
The content of the cache devices is considered volatile, as is the case with other system caches.
.SS "Processes"
.sp
.LP
Each imported pool has an associated process, named \fBzpool-\fR\fIpoolname\fR. The threads in this process are the pool's I/O processing threads, which handle the compression, checksumming, and other tasks for all I/O associated with the pool. This process exists to provides visibility into the CPU utilization of the system's storage pools. The existence of this process is an unstable interface.
.SS "Properties"
.sp
.LP
Each pool has several properties associated with it. Some properties are read-only statistics while others are configurable and change the behavior of the pool. The following are read-only properties:
.sp
.ne 2
.mk
.na
\fB\fBallocated\fR\fR
.ad
.sp .6
.RS 4n
Amount of storage space within the pool that has been physically allocated. This property can also be referred to by its shortened column name, \fBalloc\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBcapacity\fR\fR
.ad
.sp .6
.RS 4n
Percentage of pool space used. This property can also be referred to by its shortened column name, \fBcap\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdedupratio\fR\fR
.ad
.sp .6
.RS 4n
The deduplication ratio specified for a pool, expressed as a multiplier. This value is expressed as a single decimal number. For example, a \fBdedupratio\fR value of \fB1.76\fR indicates that 1.76 units of data were stored but only 1 unit of disk space was actually consumed. This property can also be referred to by its shortened column name, \fBdedup\fR.
.sp
Deduplication can be enabled as follows:
.sp
.in +2
.nf
# \fBzfs set dedup=on \fIpool\fR/\fIdataset\fR\fR
.fi
.in -2
.sp

The default value is \fBoff\fR.
.sp
See \fBzfs\fR(1M) for a description of the deduplication feature.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfree\fR\fR
.ad
.sp .6
.RS 4n
Number of blocks within the pool that are not allocated. 
.RE

.sp
.ne 2
.mk
.na
\fB\fBguid\fR\fR
.ad
.sp .6
.RS 4n
A unique identifier for the pool.
.RE

.sp
.ne 2
.mk
.na
\fB\fBhealth\fR\fR
.ad
.sp .6
.RS 4n
The current health of the pool. Health can be \fBONLINE\fR, \fBDEGRADED\fR, \fBUNAVAIL\fR, or \fBSUSPENDED\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBsize\fR\fR
.ad
.sp .6
.RS 4n
Total size of the storage pool.
.RE

.sp
.LP
These space usage properties report actual physical space available to the storage pool. The physical space can be different from the total amount of space that any contained datasets can actually use. The amount of space used in a \fBraidz\fR configuration depends on the characteristics of the data being written. In addition, \fBZFS\fR reserves some space for internal accounting that the \fBzfs\fR(1M) command takes into account, but the \fBzpool\fR command does not. For non-full pools of a reasonable size, these effects should be invisible. For small pools, or pools that are close to being completely full, these discrepancies may become more noticeable.
.sp
.LP
The following property can be set at creation time and import time:
.sp
.ne 2
.mk
.na
\fB\fBaltroot\fR\fR
.ad
.sp .6
.RS 4n
Alternate root directory. If set, this directory is prepended to any mount points within the pool. This can be used when examining an unknown pool where the mount points cannot be trusted, or in an alternate boot environment, where the typical paths are not valid. \fBaltroot\fR is not a persistent property. It is valid only while the system is up. Setting \fBaltroot\fR defaults to using \fBcachefile=none\fR, though this may be overridden using an explicit setting.
.RE

.sp
.LP
The following property can be set at import time:
.sp
.ne 2
.mk
.na
\fB\fBreadonly\fR=\fBon\fR | \fBoff\fR\fR
.ad
.sp .6
.RS 4n
Controls whether the pool can be modified. When enabled, any synchronous data that exists only in the intent log is not accessible until the pool is imported in read-write mode.
.sp
Importing a pool in read-only mode has the following limitations:
.RS +4
.TP
.ie t \(bu
.el o
Attempts to set additional pool properties during the import are ignored.
.RE
.RS +4
.TP
.ie t \(bu
.el o
All file system mounts are converted to include the read-only (\fBro\fR) mount option.
.RE
A pool that has been imported in read-only mode can be restored to read-write mode by exporting and importing the pool.
.RE

.sp
.LP
The following properties can be set at creation time and import time, and later changed with the \fBzpool set\fR command:
.sp
.ne 2
.mk
.na
\fB\fBautoexpand\fR=\fBon\fR | \fBoff\fR\fR
.ad
.sp .6
.RS 4n
Controls automatic pool expansion when the underlying LUN is grown. If set to \fBon\fR, the pool will be resized according to the size of the expanded device. If the device is part of a mirror or \fBraidz\fR then all devices within that mirror/\fBraidz\fR group must be expanded before the new space is made available to the pool. The default behavior is \fBoff\fR. This property can also be referred to by its shortened column name, \fBexpand\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBautoreplace\fR=\fBon\fR | \fBoff\fR\fR
.ad
.sp .6
.RS 4n
Controls automatic device replacement. If set to \fBoff\fR, device replacement must be initiated by the administrator by using the \fBzpool replace\fR command. If set to \fBon\fR, any new device, found in the same physical location as a device that previously belonged to the pool, is automatically formatted and replaced. The default behavior is \fBoff\fR. This property can also be referred to by its shortened column name, \fBreplace\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBbootfs\fR=\fIpool\fR/\fIdataset\fR\fR
.ad
.sp .6
.RS 4n
Identifies the default bootable dataset for the root pool. This property is expected to be set mainly by the installation and upgrade programs.
.RE

.sp
.ne 2
.mk
.na
\fB\fBcachefile\fR=\fIpath\fR | \fBnone\fR\fR
.ad
.sp .6
.RS 4n
Controls the location of where the pool configuration is cached. Discovering all pools on system startup requires a cached copy of the configuration data that is stored on the root file system. All pools in this cache are automatically imported when the system boots. Some environments, such as install and clustering, need to cache this information in a different location so that pools are not automatically imported. Setting this property caches the pool configuration in a different location that can later be imported with \fBzpool import -c\fR. Setting it to the special value \fBnone\fR creates a temporary pool that is never cached, and the special value \fB\&''\fR (empty string) uses the default location. 
.sp
Multiple pools can share the same cache file. Because the kernel destroys and recreates this file when pools are added and removed, care should be taken when attempting to access this file. When the last pool using a \fBcachefile\fR is exported or destroyed, the file is removed.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdedupditto\fR=\fInumber\fR\fR
.ad
.sp .6
.RS 4n
Sets a threshold for number of copies. If the reference count for a deduplicated block goes above this threshold, another ditto copy of the block is stored automatically. The default value is \fB0\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdelegation\fR=\fBon\fR | \fBoff\fR\fR
.ad
.sp .6
.RS 4n
Controls whether a non-privileged user is granted access based on the dataset permissions defined on the dataset. The default value is \fBon\fR. See \fBzfs\fR(1M) for more information on \fBZFS\fR delegated administration.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfailmode\fR=\fBwait\fR | \fBcontinue\fR | \fBpanic\fR\fR
.ad
.sp .6
.RS 4n
Controls the system behavior in the event of catastrophic pool failure. This condition is typically a result of a loss of connectivity to the underlying storage device(s) or a failure of all devices within the pool. The behavior of such an event is determined as follows:
.sp
.ne 2
.mk
.na
\fB\fBwait\fR\fR
.ad
.sp .6
.RS 4n
Blocks all \fBI/O\fR access to the pool until the device connectivity is recovered and the errors are cleared. A pool remains in the wait state until the device issue is resolved. This is the default behavior.
.RE

.sp
.ne 2
.mk
.na
\fB\fBcontinue\fR\fR
.ad
.sp .6
.RS 4n
Returns \fBEIO\fR to any new write \fBI/O\fR requests but allows reads to any of the remaining healthy devices. Any write requests that have yet to be committed to disk would be blocked.
.RE

.sp
.ne 2
.mk
.na
\fB\fBpanic\fR\fR
.ad
.sp .6
.RS 4n
Prints out a message to the console and generates a system crash dump.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBlistshares\fR=on | off\fR
.ad
.sp .6
.RS 4n
Controls whether share information in this pool is displayed with the \fBzfs list\fR command. The default value is \fBoff\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBlistsnapshots\fR=on | off\fR
.ad
.sp .6
.RS 4n
Controls whether information about snapshots associated with this pool is output when \fBzfs list\fR is run without the \fB-t\fR option. The default value is \fBoff\fR. This property can also be referred to by its shortened column name, \fBlistsnaps\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBversion\fR=\fIversion\fR\fR
.ad
.sp .6
.RS 4n
The current on-disk version of the pool. This can be increased, but never decreased. The preferred method of updating pools is with the \fBzpool upgrade\fR command, though this property can be used when a specific version is needed for backwards compatibility. This property can be any number between 1 and the current version reported by \fBzpool upgrade -v\fR.
.RE

.SS "Subcommands"
.sp
.LP
All subcommands that modify state are logged persistently to the pool in their original form.
.sp
.LP
The \fBzpool\fR command provides subcommands to create and destroy storage pools, add capacity to storage pools, and provide information about the storage pools. The following subcommands are supported:
.sp
.ne 2
.mk
.na
\fB\fBzpool\fR \fB-?\fR\fR
.ad
.sp .6
.RS 4n
Displays a help message.
.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool help\fR \fIcommand\fR | \fBhelp\fR | \fIproperty\fR \fIproperty-name\fR\fR
.ad
.sp .6
.RS 4n
Displays \fBzpool\fR command usage. You can display help for a specific command or property. If you display help for a specific command or property, the command syntax or available property values are displayed. Using \fBzpool help\fR without any arguments displays a complete list of \fBzpool\fR commands.
.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool help\fR \fB-l\fR \fBproperties\fR\fR
.ad
.sp .6
.RS 4n
Displays \fBzpool\fR property information, including whether the property value is editable and their possible values. If you display help for a specific subcommand or property, the command syntax or property value is displayed. Using \fBzpool help\fR without any arguments displays a complete list of \fBzpool\fR subcommands.
.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool add\fR [\fB-f\fR] [\fB-n\fR [\fB-l\fR]]\fIpool\fR \fIvdev\fR ...\fR
.ad
.sp .6
.RS 4n
Adds the specified virtual devices to the given pool. The \fIvdev\fR specification is described in the "Virtual Devices" section. The behavior of the \fB-f\fR option, and the device checks performed are described in the \fBzpool create\fR subcommand.
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
Forces use of vdevs, even if they appear in use or specify a conflicting replication level. Not all devices can be overridden in this manner.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
Displays the configuration that would be used without actually adding the vdevs. The actual pool creation can still fail due to insufficient privileges or device sharing.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
If possible, have \fB-n\fR display the configuration in current \fB/dev/chassis\fR location form.
.RE

Do not add a disk that is currently configured as a quorum device to a ZFS storage pool. After a disk is in the pool, that disk can then be configured as a quorum device.
.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool attach\fR [\fB-f\fR] \fIpool\fR \fIdevice\fR \fInew_device\fR\fR
.ad
.sp .6
.RS 4n
Attaches \fInew_device\fR to an existing \fBzpool\fR device. The existing device cannot be part of a \fBraidz\fR configuration. If \fIdevice\fR is not currently part of a mirrored configuration, \fIdevice\fR automatically transforms into a two-way mirror of \fIdevice\fR and \fInew_device\fR. If \fIdevice\fR is part of a two-way mirror, attaching \fInew_device\fR creates a three-way mirror, and so on. In either case, \fInew_device\fR begins to resilver immediately.
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
Forces use of \fInew_device\fR, even if its appears to be in use. Not all devices can be overridden in this manner.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool clear\fR [\fB-nF\fR [\fB-f\fR]] \fIpool\fR [\fIdevice\fR] ...\fR
.ad
.sp .6
.RS 4n
Clears device errors in a pool. If no arguments are specified, all device errors within the pool are cleared. If one or more devices is specified, only those errors associated with the specified device or devices are cleared.
.sp
.ne 2
.mk
.na
\fB\fB-F\fR\fR
.ad
.sp .6
.RS 4n
Initiates recovery mode for an unopenable pool. Attempts to discard the last few transactions in the pool to return it to an openable state. Not all damaged pools can be recovered by using this option. If successful, the data from the discarded transactions is irretrievably lost.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
Used in combination with the \fB-F\fR flag. Check whether discarding transactions would make the pool openable, but do not actually discard any transactions.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
This is a special pool recovery option that can be used if the \fBfmadm acquit\fR or \fBfmadm repair\fR commands fail to clear a pool's faults. If the system reboots, FMA replays the pool faults so you will need to resolve the FMA faults after the pool is recovered.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool create\fR [\fB-f\fR] [\fB-n\fR [\fB-l\fR]] [\fB-B\fR] [\fB-N\fR] [\fB-o\fR \fIproperty=value\fR] ... [\fB-O\fR \fIfile-system-property=value\fR] ... [\fB-m\fR \fImountpoint\fR] [\fB-R\fR \fIroot\fR] [\fB-t\fR \fItmppool\fR] \fIpool\fR \fIvdev\fR ...\fR
.ad
.sp .6
.RS 4n
Creates a new storage pool containing the virtual devices specified on the command line. The pool name must begin with a letter, and can contain alphanumeric characters, as well as underscore (_), dash (-), colon (:), space ( ),  and period (.). The pool names \fBmirror\fR, \fBraidz\fR, \fBspare\fR, and \fBlog\fR are reserved, as are names beginning with the pattern \fBc\fR[\fB0-9\fR]. The vdev specification is described in the "Virtual Devices" section.
.sp
The command verifies that each device specified is accessible and not currently in use by another subsystem. There are some uses, such as being currently mounted, or specified as the dedicated dump device, that prevents a device from ever being used by \fBZFS\fR. Other uses, such as having a preexisting \fBUFS\fR file system, can be overridden with the \fB-f\fR option.
.sp
The command also checks that the replication strategy for the pool is consistent. An attempt to combine redundant and non-redundant storage in a single pool, or to mix disks and files, results in an error unless \fB-f\fR is specified. The use of differently sized devices within a single \fBraidz\fR or mirror group is also flagged as an error unless \fB-f\fR is specified.
.sp
Unless the \fB-R\fR option is specified, the default mount point is /\fIpool\fR. The mount point must not exist or must be empty, or else the root dataset cannot be mounted. This can be overridden with the \fB-m\fR option.
.sp
.ne 2
.mk
.na
\fB\fB-B\fR\fR
.ad
.sp .6
.RS 4n
When operating on a whole disk device, creates the boot partition, if one is required to boot from EFI (GPT) labeled disks on the platform. The \fB-B\fR option has no effect on devices that are not whole disks.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
Forces use of vdevs, even if they appear in use or specify a conflicting replication level. Not all devices can be overridden in this manner.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
If possible, have \fB-n\fR display the configuration in current \fB/dev/chassis\fR location form.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
Displays the configuration that would be used without actually creating the pool. The actual pool creation can still fail due to insufficient privileges or if a device is currently in use.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-N\fR\fR
.ad
.sp .6
.RS 4n
Creates the pool without mounting or sharing the newly created root file system of the pool.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIproperty=value\fR [\fB-o\fR \fIproperty=value\fR] ...\fR
.ad
.sp .6
.RS 4n
Sets the given pool properties. See the "Properties" section for a list of valid properties that can be set.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-O\fR \fIfile-system-property=value\fR\fR
.ad
.br
.na
\fB[\fB-O\fR \fIfile-system-property=value\fR] ...\fR
.ad
.sp .6
.RS 4n
Sets the given properties for the pool's top-level file system. See the "Properties" section of \fBzfs\fR(1M) for a list of valid properties that can be set.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot\fR\fR
.ad
.sp .6
.RS 4n
Equivalent to \fB-o cachefile=none,altroot=\fR\fIroot\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fImountpoint\fR\fR
.ad
.sp .6
.RS 4n
Sets the mount point for the pool's top-level file system. The default mount point is /\fIpool\fR or \fBaltroot\fR/\fIpool\fR if \fBaltroot\fR is specified. The mount point must be an absolute path, \fBlegacy\fR, or \fBnone\fR. For more information on dataset mount points, see \fBzfs\fR(1M).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fItmppool\fR\fR
.ad
.sp .6
.RS 4n
Use the specified temporary pool name for the initial import. Implies \fB-o\fR \fIcachefile\fR=\fBnone\fR.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool destroy\fR [\fB-f\fR] \fIpool\fR\fR
.ad
.sp .6
.RS 4n
Destroys the given pool, freeing up any devices for other use. This command tries to unmount any active datasets before destroying the pool.
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
Forces any active datasets contained within the pool to be unmounted.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool detach\fR \fIpool\fR \fIdevice\fR\fR
.ad
.sp .6
.RS 4n
Detaches a \fIdevice\fR or a spare from a mirrored storage pool. A spare  can also be detached from a RAID-Z storage pool if an existing device  was physically replaced. Or, you can detach an existing device in a  RAID-Z storage pool if it was replaced by a spare. The operation is  refused if there are no other valid replicas of the data.
.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool export\fR [\fB-f\fR] \fIpool\fR ...\fR
.ad
.sp .6
.RS 4n
Exports the given pools from the system. All devices are marked as exported, but are still considered in use by other subsystems. The devices can be moved between systems (even those of different endianness) and imported as long as a sufficient number of devices are present.
.sp
Before exporting the pool, all datasets within the pool are unmounted.
.sp
For pools to be portable, you must give the \fBzpool\fR command whole disks, not just slices, so that \fBZFS\fR can label the disks with portable \fBEFI\fR labels. Otherwise, disk drivers on platforms of different endianness will not recognize the disks.
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
Forcefully unmount all datasets, using the \fBunmount -f\fR command.
.sp
This command will forcefully export the pool.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool get\fR all | \fIproperty\fR[,...] \fIpool\fR ...\fR
.ad
.sp .6
.RS 4n
Retrieves the given list of properties (or all properties if \fBall\fR is used) for the specified storage pool(s). These properties are displayed with the following fields:
.sp
.in +2
.nf
       name          Name of storage pool
        property      Property name
        value         Property value
        source        Property source, either 'default' or 'local'.
.fi
.in -2
.sp

See the "Properties" section for more information on the available pool properties.
.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool history\fR [\fB-il\fR] [\fIpool\fR] ...\fR
.ad
.sp .6
.RS 4n
Displays the command history of the specified pools or all pools if no pool is specified.
.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.sp .6
.RS 4n
Displays internally logged \fBZFS\fR events in addition to user initiated events.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
Displays log records in long format, which in addition to standard format includes, the user name, the hostname, and the zone in which the operation was performed.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool import\fR [\fB-d\fR \fIpath\fR ... ] [\fB-D\fR]\fR
.ad
.br
.na
\fB\fBzpool import\fR [\fB-d\fR \fIpath\fR ... | \fB-c\fR \fIcachefile\fR] [\fB-F\fR [\fB-n\fR]] \fIpool\fR | \fIid\fR\fR
.ad
.sp .6
.RS 4n
Lists pools available to import. If the \fB-d\fR option is not specified, this command searches for devices in \fB/dev/dsk\fR. The \fB-d\fR option can be specified multiple times, and all directories and device paths are searched. If the device appears to be part of an exported pool, this command displays a summary of the pool with the name of the pool, a numeric identifier, as well as the \fIvdev\fR layout and current health of the device for each device or file. Pools that were previously destroyed with the \fBzpool destroy\fR command, are not listed unless the \fB-D\fR option is specified. 
.sp
The numeric identifier is unique, and can be used instead of the pool name when multiple exported pools of the same name are available.
.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIcachefile\fR\fR
.ad
.sp .6
.RS 4n
Reads configuration from the given \fBcachefile\fR that was created with the "\fBcachefile\fR" pool property. This \fBcachefile\fR is used instead of searching for devices.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIpath\fR\fR
.ad
.sp .6
.RS 4n
Searches for devices or files in \fIpath\fR, where \fIpath\fR where \fIpath\fR can be a directory or a device path. The \fB-d\fR option can be specified multiple times.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR\fR
.ad
.sp .6
.RS 4n
Lists destroyed pools only.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool import\fR [\fB-o\fR \fImntopts\fR] [ \fB-o\fR \fIproperty\fR=\fIvalue\fR] ... [\fB-d\fR \fIpath\fR ... | \fB-c\fR \fIcachefile\fR] [\fB-D\fR] [\fB-f\fR] [\fB-m\fR] [\fB-N\fR] [\fB-R\fR \fIroot\fR] [\fB-F\fR [\fB-n\fR [\fB-l\fR]]] \fB-a\fR\fR
.ad
.sp .6
.RS 4n
Imports all pools found in the search directories or device paths. Identical to the previous command, except that all pools with a sufficient number of devices available are imported. Pools that were previously destroyed with the \fBzpool destroy\fR command, are not imported unless the \fB-D\fR option is specified.
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fImntopts\fR\fR
.ad
.sp .6
.RS 4n
Comma-separated list of mount options to use when mounting datasets within the pool. See \fBzfs\fR(1M) for a description of dataset properties and mount options.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIproperty=value\fR\fR
.ad
.sp .6
.RS 4n
Sets the specified property on the imported pool. See the "Properties" section for more information on the available pool properties.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIcachefile\fR\fR
.ad
.sp .6
.RS 4n
Reads configuration from the given \fBcachefile\fR that was created with the "\fBcachefile\fR" pool property. This \fBcachefile\fR is used instead of searching for devices.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIpath\fR\fR
.ad
.sp .6
.RS 4n
Searches for devices or files in \fIpath\fR. The \fB-d\fR option can be specified multiple times. This option is incompatible with the \fB-c\fR option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR\fR
.ad
.sp .6
.RS 4n
Imports destroyed pools only. The \fB-f\fR option is also required.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
Forces import, even if the pool appears to be potentially active.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR\fR
.ad
.sp .6
.RS 4n
Recovery mode for a non-importable pool. Attempt to return the pool to an importable state by discarding the last few transactions. Not all damaged pools can be recovered by using this option. If successful, the data from the discarded transactions is irretrievably lost. This option is ignored if the pool is importable or already imported.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
Searches for and imports all pools found.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.sp .6
.RS 4n
Allows a pool to import when a log device is missing.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot\fR\fR
.ad
.sp .6
.RS 4n
Sets the \fBcachefile\fR property to \fBnone\fR and the \fIaltroot\fR property to \fIroot\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-N\fR\fR
.ad
.sp .6
.RS 4n
Imports the pool without mounting or sharing any file systems.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
Used with the \fB-F\fR recovery option. Determines whether a non-importable pool can be made importable again, but does not actually perform the pool recovery. For more details about pool recovery mode, see the \fB-F\fR option, above.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
If possible, have \fB-n\fR display information in current \fB/dev/chassis\fR location form.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool import\fR [\fB-o\fR \fImntopts\fR] [ \fB-o\fR \fIproperty\fR=\fIvalue\fR] ... [\fB-d\fR \fIpath\fR ... | \fB-c\fR \fIcachefile\fR] [\fB-D\fR] [\fB-f\fR] [\fB-m\fR] [\fB-N\fR] [\fB-R\fR \fIroot\fR] [\fB-F\fR [\fB-n\fR [\fB-l\fR]]] [\fB-t\fR \fItmppool\fR] \fIpool\fR | \fIid\fR [\fInewpool\fR]\fR
.ad
.sp .6
.RS 4n
Imports a specific pool. A pool can be identified by its name or the numeric identifier. If \fInewpool\fR is specified, the pool is imported using the persistent name \fInewpool\fR. Otherwise, it is imported with the same name as its exported name. Do not import a root pool with a new name. Otherwise, the system might not boot.
.sp
If a device is removed from a system without running \fBzpool export\fR first, the device appears as potentially active. It cannot be determined if this was a failed export, or whether the device is really in use from another host. To import a pool in this state, the \fB-f\fR option is required.
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fImntopts\fR\fR
.ad
.sp .6
.RS 4n
Comma-separated list of mount options to use when mounting datasets within the pool. See \fBzfs\fR(1M) for a description of dataset properties and mount options.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIproperty=value\fR\fR
.ad
.sp .6
.RS 4n
Sets the specified property on the imported pool. See the "Properties" section for more information on the available pool properties.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIcachefile\fR\fR
.ad
.sp .6
.RS 4n
Reads configuration from the given \fBcachefile\fR that was created with the \fBcachefile\fR pool property. This \fBcachefile\fR is used instead of searching for devices.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIpath\fR\fR
.ad
.sp .6
.RS 4n
Searches for devices or files in \fIpath\fR. The \fB-d\fR option can be specified multiple times. This option is incompatible with the \fB-c\fR option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR\fR
.ad
.sp .6
.RS 4n
Imports destroyed pool. The \fB-f\fR option is also required.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
Forces import, even if the pool appears to be potentially active.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR\fR
.ad
.sp .6
.RS 4n
Recovery mode for a non-importable pool. Attempt to return the pool to an importable state by discarding the last few transactions. Not all damaged pools can be recovered by using this option. If successful, the data from the discarded transactions is irretrievably lost. This option is ignored if the pool is importable or already imported.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot\fR\fR
.ad
.sp .6
.RS 4n
Sets the \fBcachefile\fR property to \fBnone\fR and the \fIaltroot\fR property to \fIroot\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-N\fR\fR
.ad
.sp .6
.RS 4n
Imports the pool without mounting any file systems.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
Used with the \fB-F\fR recovery option. Determines whether a non-importable pool can be made importable again, but does not actually perform the pool recovery. For more details about pool recovery mode, see the \fB-F\fR option, above.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
If possible, have \fB-n\fR display information in current \fB/dev/chassis\fR location form.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.sp .6
.RS 4n
Allows a pool to import when a log device is missing.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fItmppool\fR\fR
.ad
.sp .6
.RS 4n
Use the specified temporary pool name for the initial import. Implies \fB-o\fR \fIcachefile\fR=\fBnone\fR.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool iostat\fR [\fB-T\fR \fBd\fR|\fBu\fR] [\fB-v\fR [\fB-l\fR]] [\fIpool\fR] ... [\fIinterval\fR[\fIcount\fR]]\fR
.ad
.sp .6
.RS 4n
Displays \fBI/O\fR statistics for the given pools. When given an interval, the statistics are printed every \fIinterval\fR seconds until \fBCtrl-C\fR is pressed. If no \fIpools\fR are specified, statistics for every pool in the system is shown. If \fIcount\fR is specified, the command exits after \fIcount\fR reports are printed.
.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fBd\fR|\fBu\fR\fR
.ad
.sp .6
.RS 4n
Display a time stamp.
.sp
Specify \fBd\fR for standard date format. See \fBdate\fR(1). Specify \fBu\fR for a printed representation of the internal representation of time. See \fBtime\fR(2). 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
Verbose statistics. Reports usage statistics for individual \fIvdevs\fR within the pool, in addition to the pool-wide statistics.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
If possible, have \fB-v\fR display \fBvdev\fR statistics in current \fB/dev/chassis\fR location form.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool list\fR [\fB-H\fR] [\fB-o\fR \fIprops\fR[,...]] [\fB-T\fR \fBd\fR|\fBu\fR] [\fIpool\fR] ...\fR
.ad
.sp .6
.RS 4n
Lists the given pools along with a health status and space usage. When given no arguments, all pools in the system are listed.
.sp
When given an interval, the status and space usage are displayed every \fIinterval\fR seconds until Ctrl-C is entered. If \fIcount\fR is specified, the command exits after \fIcount\fR reports are displayed.
.sp
.ne 2
.mk
.na
\fB\fB-H\fR\fR
.ad
.sp .6
.RS 4n
Scripted mode. Do not display headers, and separate fields by a single tab instead of arbitrary space.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIprops\fR\fR
.ad
.sp .6
.RS 4n
Comma-separated list of properties to display. See the "Properties" section for a list of valid properties. The default list is \fBname\fR, \fBsize\fR, \fBallocated\fR, \fBfree\fR, \fBcapacity\fR, \fBhealth\fR, \fBaltroot\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fBd\fR|\fBu\fR\fR
.ad
.sp .6
.RS 4n
Display a time stamp.
.sp
Specify \fBd\fR for standard date format. See \fBdate\fR(1). Specify \fBu\fR for a printed representation of the internal representation of time. See \fBtime\fR(2). 
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool offline\fR [\fB-t\fR] \fIpool\fR \fIdevice\fR ...\fR
.ad
.sp .6
.RS 4n
Takes the specified physical device offline. While the \fIdevice\fR is offline, no attempt is made to read or write to the device.
.sp
This command is not applicable to spares or cache devices.
.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.sp .6
.RS 4n
Temporary. Upon reboot, the specified physical device reverts to its previous state.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool online\fR [\fB-e\fR] \fIpool\fR \fIdevice\fR...\fR
.ad
.sp .6
.RS 4n
Brings the specified physical device online.
.sp
This command is not applicable to spares or cache devices.
.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.sp .6
.RS 4n
Expand the device to use all available space. If the device is part of a mirror or \fBraidz\fR then all devices must be expanded before the new space will become available to the pool.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool remove\fR \fIpool\fR \fIdevice\fR ...\fR
.ad
.sp .6
.RS 4n
Removes the specified device from the pool. This command currently only supports removing hot spares, cache, and log devices. A mirrored log device can be removed by specifying the top-level mirror for the log. Non-log devices that are part of a mirrored configuration can be removed using the \fBzpool detach\fR command. Non-redundant and \fBraidz\fR devices cannot be removed from a pool.
.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool replace\fR [\fB-f\fR] \fIpool\fR \fIold_device\fR [\fInew_device\fR]\fR
.ad
.sp .6
.RS 4n
Replaces \fIold_device\fR with \fInew_device\fR. This is equivalent to attaching \fInew_device\fR, waiting for it to resilver, and then detaching \fIold_device\fR.
.sp
The size of \fInew_device\fR must be greater than or equal to the minimum size of all the devices in a mirror or \fBraidz\fR configuration.
.sp
\fInew_device\fR is required if the pool is not redundant. If \fInew_device\fR is not specified, it defaults to \fIold_device\fR. This form of replacement is useful after an existing disk has failed and has been physically replaced. In this case, the new disk may have the same \fB/dev/dsk\fR path as the old device, even though it is actually a different disk. \fBZFS\fR recognizes this.
.sp
In \fBzpool status\fR output, the \fIold_device\fR is shown under the word \fBreplacing\fR with the string \fB/old\fR appended to it. Once the resilver completes, both the \fBreplacing\fR and the \fIold_device\fR are automatically removed. If the new device fails before the resilver completes and a third device is installed in its place, then both failed devices will show up with \fB/old\fR appended, and the resilver starts over again. After the resilver completes, both \fB/old\fR devices are removed along with the word \fBreplacing\fR.
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
Forces use of \fInew_device\fR, even if its appears to be in use. Not all devices can be overridden in this manner.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool scrub\fR [\fB-s\fR] \fIpool\fR ...\fR
.ad
.sp .6
.RS 4n
Begins a scrub. The scrub examines all data in the specified pools to verify that it checksums correctly. For replicated (mirror or \fBraidz\fR) devices, \fBZFS\fR automatically repairs any damage discovered during the scrub. The \fBzpool status\fR command reports the progress of the scrub and summarizes the results of the scrub upon completion.
.sp
Scrubbing and resilvering are very similar operations. The difference is that resilvering only examines data that \fBZFS\fR knows to be out of date (for example, when attaching a new device to a mirror or replacing an existing device), whereas scrubbing examines all data to discover silent errors due to hardware faults or disk failure.
.sp
Because scrubbing and resilvering are \fBI/O\fR-intensive operations, \fBZFS\fR allows only one at a time. If a scrub is already in progress, a subsequent \fBzpool scrub\fR returns an error, with the advice to use \fBzpool scrub\fR \fB-s\fR to cancel the current scrub. If a resilver is in progress, \fBZFS\fR does not allow a scrub to be started until the resilver completes.
.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.sp .6
.RS 4n
Stop scrubbing.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool set\fR \fIproperty\fR=\fIvalue\fR \fIpool\fR\fR
.ad
.sp .6
.RS 4n
Sets the given property on the specified pool. See the "Properties" section for more information on what properties can be set and acceptable values.
.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool split\fR [\fB-n\fR [\fB-l\fR]] [\fB-R\fR \fIaltroot\fR] [\fB-o\fR \fImntopts\fR] [\fB-o\fR \fIproperty\fR=\fIvalue\fR] \fIpool\fR \fInewpool\fR [\fIdevice\fR ...]\fR
.ad
.sp .6
.RS 4n
Splits off one disk from each mirrored top-level vdev in a pool and creates a new pool from the split-off disks. The original pool must be made up of one or more mirrors and must not be in the process of resilvering. The \fBsplit\fR subcommand chooses the last device in each mirror vdev unless overridden by a device specification on the command line.
.sp
When using a \fIdevice\fR argument, \fBsplit\fR includes the specified device(s) in a new pool and, should any devices remain unspecified, assigns the last device in each mirror vdev to that pool, as it does normally. If you are uncertain about the outcome of a \fBsplit\fR command, use the \fB-n\fR ("dry-run") option to ensure your command will have the effect you intend.
.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
Displays the configuration that would be created without actually splitting the pool. The actual pool split could still fail due to insufficient privileges or device status.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
If possible, have \fB-n\fR display the configuration in current \fB/dev/chassis\fR location form.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIaltroot\fR\fR
.ad
.sp .6
.RS 4n
Automatically import the newly created pool after splitting, using the specified \fIaltroot\fR parameter for the new pool's alternate root. See the \fBaltroot\fR description in the "Properties" section, above.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fImntopts\fR\fR
.ad
.sp .6
.RS 4n
Comma-separated list of mount options to use when mounting datasets within the pool. See \fBzfs\fR(1M) for a description of dataset properties and mount options. Valid only in conjunction with the \fB-R\fR option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIproperty\fR=\fIvalue\fR\fR
.ad
.sp .6
.RS 4n
Sets the specified property on the new pool. See the "Properties" section, above, for more information on the available pool properties.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool status\fR [\fB-l\fR] [\fB-v\fR] [\fB-x\fR] [\fB-T\fR \fBd\fR|\fBu\fR] [\fIpool\fR] ...  [\fIinterval\fR[\fIcount\fR]]\fR
.ad
.sp .6
.RS 4n
Displays the detailed health status for the given pools. If no \fIpool\fR is specified, then the status of each pool in the system is displayed. For more information on pool and device health, see the "Device Failure and Recovery" section.
.sp
When given an interval, the status and space usage are displayed every \fIinterval\fR seconds until Ctrl-C is entered. If \fIcount\fR is specified, the command exits after \fIcount\fR reports are displayed.
.sp
If a scrub or resilver is in progress, this command reports the percentage done and the estimated time to completion. Both of these are only approximate, because the amount of data in the pool and the other workloads on the system can change.
.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
If possible, display vdev status in current \fB/dev/chassis\fR location form.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.sp .6
.RS 4n
Display status only for pools that are exhibiting errors or are otherwise unavailable.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
Displays verbose data error information, printing out a complete list of all data errors since the last complete pool scrub.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fBd\fR|\fBu\fR\fR
.ad
.sp .6
.RS 4n
Display a time stamp.
.sp
Specify \fBd\fR for standard date format. See \fBdate\fR(1). Specify \fBu\fR for a printed representation of the internal representation of time. See \fBtime\fR(2). 
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool upgrade\fR\fR
.ad
.sp .6
.RS 4n
Identifies a pool's on-disk version, which determines available pool features in the currently running software release. You can continue to use older pool versions, but some features might not be available. A pool can be upgraded by using the \fBzpool upgrade\fR \fB-a\fR command. You will not be able to access a pool of a later version on a system that runs an earlier software version.
.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool upgrade\fR \fB-v\fR\fR
.ad
.sp .6
.RS 4n
Displays \fBZFS\fR pool versions supported by the current software. The current \fBZFS\fR pool versions and all previous supported versions are displayed, along with an explanation of the features provided with each version.
.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool upgrade\fR [\fB-V\fR \fIversion\fR] \fB-a\fR | \fIpool\fR ...\fR
.ad
.sp .6
.RS 4n
Upgrades the specified pool to the latest on-disk version. If this command reveals that a pool is out-of-date, the pool can subsequently be upgraded using the \fBzpool upgrade\fR \fB-a\fR command. A pool that is upgraded will not be accessible on a system that runs an earlier software release.
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
Upgrades all pools.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR \fIversion\fR\fR
.ad
.sp .6
.RS 4n
Upgrade to the specified version, which must be higher than the current version. If the \fB-V\fR flag is not specified, the pool is upgraded to the most recent version.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBzpool monitor\fR \fB-t\fR \fIprovider\fR [\fB-T\fR \fBd|u\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,. . .]] [\fIpool\fR] . . . [\fIinterval\fR [\fIcount\fR]]\fR
.ad
.sp .6
.RS 4n
Displays status or progress information for the given pools. If no pool is entered, information for all pools is displayed. When given an interval, the information is printed every \fIinterval\fR seconds until \fBCtrl\fR-\fBC\fR is pressed. If \fIcount\fR is specified, the command exits after count reports are printed.
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,. . .]\fR
.ad
.RS 20n
.rt  
Display only selected field(s).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fIprovider\fR\fR
.ad
.RS 20n
.rt  
Display data from the listed providers. Current providers are send, receive (or recv), destroy, scrub, and resilver. An up-to-date list of providers is available from '\fBzpool help monitor\fR'.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fBd|u\fR\fR
.ad
.RS 20n
.rt  
Display a time stamp. Specify \fBd\fR for standard date format. See \fBdate\fR(1). Specify \fBu\fR for a printed representation of the internal representation of time. See \fBtime\fR(2).
.RE

.RE

.SS "Display Fields"
.sp
.LP
The fields are different for different providers. If a field is selected that is not supported by a provider an error is returned.
.sp
.ne 2
.mk
.na
\fB\fBDONE\fR\fR
.ad
.RS 12n
.rt  
Amount of data completed or processed so far.
.RE

.sp
.ne 2
.mk
.na
\fB\fBOTHER\fR\fR
.ad
.RS 12n
.rt  
Provider dependent. Provides extra information such as the current item being processed or the current state of the task. For example, in a zfs send operation this value might reflect the individual dataset or snapshot currently being sent. The specific values reported as \fBOTHER\fR are not an interface and may change without notice.
.RE

.sp
.ne 2
.mk
.na
\fB\fBPCTDONE\fR\fR
.ad
.RS 12n
.rt  
Percentage of data processed.
.RE

.sp
.ne 2
.mk
.na
\fB\fBPOOL\fR\fR
.ad
.RS 12n
.rt  
Pool information was retrieved from.
.RE

.sp
.ne 2
.mk
.na
\fB\fBPROVIDER\fR\fR
.ad
.RS 12n
.rt  
Task providing the information. One of send, receive, destroy, scrub, or resilver.
.RE

.sp
.ne 2
.mk
.na
\fB\fBSPEED\fR\fR
.ad
.RS 12n
.rt  
Units per second. Usually bytes, but is dependent on what unit the data provider uses.
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTRTTIME\fR\fR
.ad
.RS 12n
.rt  
Time the provider started on the displayed task.
.RE

.sp
.ne 2
.mk
.na
\fB\fBTAG\fR\fR
.ad
.RS 12n
.rt  
A TAG disambiguates whole operations. It is unique at any one time, but values can repeat in subsequent operations. For instance, two simultaneous sends would have different TAGs even if sending the same dataset.
.RE

.sp
.ne 2
.mk
.na
\fB\fBTIMELEFT\fR\fR
.ad
.RS 12n
.rt  
A relative time that this task will be completed. It is calculated off of rate the data is being processed.
.RE

.sp
.ne 2
.mk
.na
\fB\fBTIMESTMP\fR\fR
.ad
.RS 12n
.rt  
Time the monitored data snapshot was taken.
.RE

.sp
.ne 2
.mk
.na
\fB\fBTOTAL\fR\fR
.ad
.RS 12n
.rt  
Estimate of total amount of data to be processed.
.RE

.SS "Parseable Output Format"
.sp
.LP
The "\fBzpool monitor\fR" command provides a \fB-p\fR option that displays output in a machine-parsable format. The output format is one or more lines of colon (:) delimited fields. Output includes only those fields requested by means of the \fB-o\fR option, in the order requested. Note that the \fB-o\fR \fBall\fR option, which displays all the fields cannot be used with parsable output option.
.sp
.LP
When you request multiple fields, any literal colon characters are escaped by a backslash (\) before being output. Similarly, literal backslash characters are also escaped (\\). This escape format is parseable by using shell \fBread\fR(1) functions with the environment variable set as \fBIFS=:\fR. Note that escaping is not done when you request only a single field.
.SH EXAMPLES
.LP
\fBExample 1 \fRCreating a RAID-Z Storage Pool
.sp
.LP
The following command creates a pool with a single \fBraidz\fR root \fIvdev\fR that consists of six disks.

.sp
.in +2
.nf
# \fBzpool create tank raidz c0t0d0 c0t1d0 c0t2d0 c0t3d0 c0t4d0 c0t5d0\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fRCreating a Mirrored Storage Pool
.sp
.LP
The following command creates a pool with two mirrors, where each mirror contains two disks.

.sp
.in +2
.nf
# \fBzpool create tank mirror c0t0d0 c0t1d0 mirror c0t2d0 c0t3d0\fR
.fi
.in -2
.sp

.sp
.LP
Alternatively, whole disks can be specified using \fB/dev/chassis\fR paths describing the disk's current location.

.sp
.in +2
.nf
# \fBzpool create tank \e
    mirror \e
        /dev/chassis/RACK29.U01-04/DISK_00/disk \e
        /dev/chassis/RACK29.U05-08/DISK_00/disk \e
    mirror \e
        /dev/chassis/RACK29.U01-04/DISK_01/disk \e
        /dev/chassis/RACK29.U05-08/DISK_01/disk\fR
.fi
.in -2
.sp

.LP
\fBExample 3 \fRAdding a Mirror to a ZFS Storage Pool
.sp
.LP
The following command adds two mirrored disks to the pool \fBtank\fR, assuming the pool is already made up of two-way mirrors. The additional space is immediately available to any datasets within the pool.

.sp
.in +2
.nf
# \fBzpool add tank mirror c1t0d0 c1t1d0\fR
.fi
.in -2
.sp

.LP
\fBExample 4 \fRListing Available ZFS Storage Pools
.sp
.LP
The following command lists all available pools on the system.

.sp
.in +2
.nf
# \fBzpool list\fR
NAME   SIZE  ALLOC  FREE  CAP  DEDUP  HEALTH  ALTROOT
pool   278G  4.19G  274G   1%  1.00x  ONLINE  -
rpool  278G  78.2G  200G  28%  1.00x  ONLINE  -
.fi
.in -2
.sp

.LP
\fBExample 5 \fRListing All Properties for a Pool
.sp
.LP
The following command lists all the properties for a pool.

.sp
.in +2
.nf
% \fBzpool get all pool\fR
NAME  PROPERTY       VALUE                SOURCE
pool  allocated      4.19G                -
pool  altroot        -                    default
pool  autoexpand     off                  default
pool  autoreplace    off                  default
pool  bootfs         -                    default
pool  cachefile      -                    default
pool  capacity       1%                   -
pool  dedupditto     0                    default
pool  dedupratio     1.00x                -
pool  delegation     on                   default
pool  failmode       wait                 default
pool  free           274G                 -
pool  guid           1907687796174423256  -
pool  health         ONLINE               -
pool  listshares     off                  local
pool  listsnapshots  off                  default
pool  readonly       off                  -
pool  size           278G                 -
pool  version        34                   default
.fi
.in -2
.sp

.LP
\fBExample 6 \fRDestroying a ZFS Storage Pool
.sp
.LP
The following command destroys the pool "\fItank\fR" and any datasets contained within.

.sp
.in +2
.nf
# \fBzpool destroy -f tank\fR
.fi
.in -2
.sp

.LP
\fBExample 7 \fRExporting a ZFS Storage Pool
.sp
.LP
The following command exports the devices in pool \fItank\fR so that they can be relocated or later imported.

.sp
.in +2
.nf
# \fBzpool export tank\fR
.fi
.in -2
.sp

.LP
\fBExample 8 \fRImporting a ZFS Storage Pool
.sp
.LP
The following command displays available pools, and then imports the pool "tank" for use on the system.

.sp
.LP
The results from this command are similar to the following:

.sp
.in +2
.nf
# \fBzpool import\fR
  pool: tank
    id: 7678868315469843843
 state: ONLINE
action: The pool can be imported using its name or numeric identifier.
config:

              tank  ONLINE
          mirror-0  ONLINE
            c1t2d0  ONLINE
            c1t3d0  ONLINE

# \fBzpool import tank\fR
.fi
.in -2
.sp

.LP
\fBExample 9 \fRUpgrading All ZFS Storage Pools to the Current Version
.sp
.LP
The following command upgrades all ZFS Storage pools to the current version of the software.

.sp
.in +2
.nf
# \fBzpool upgrade -a\fR
This system is currently running ZFS pool version 22.

All pools are formatted using this version.
.fi
.in -2
.sp

.LP
\fBExample 10 \fRManaging Hot Spares
.sp
.LP
The following command creates a new pool with an available hot spare:

.sp
.in +2
.nf
# \fBzpool create tank mirror c0t0d0 c0t1d0 spare c0t2d0\fR
.fi
.in -2
.sp

.sp
.LP
If one of the disks were to fail, the pool would be reduced to the degraded state. The failed device can be replaced using the following command:

.sp
.in +2
.nf
# \fBzpool replace tank c0t0d0 c0t3d0\fR
.fi
.in -2
.sp

.sp
.LP
After the device has been resilvered, the spare is automatically detached and is made available should another device fail. The hot spare can be permanently removed from the pool using the following command:

.sp
.in +2
.nf
# \fBzpool remove tank c0t2d0\fR
.fi
.in -2
.sp

.LP
\fBExample 11 \fRCreating a ZFS Pool with Separate Mirrored Log Devices
.sp
.LP
The following command creates a ZFS storage pool consisting of two, two-way mirrors and mirrored log devices:

.sp
.in +2
.nf
# \fBzpool create pool mirror c0d0 c1d0 mirror c2d0 c3d0 log mirror \e
   c4d0 c5d0\fR
.fi
.in -2
.sp

.LP
\fBExample 12 \fRAdding Cache Devices to a ZFS Pool
.sp
.LP
The following command adds two disks for use as cache devices to a ZFS storage pool:

.sp
.in +2
.nf
# \fBzpool add pool cache c2d0 c3d0\fR
.fi
.in -2
.sp

.sp
.LP
Once added, the cache devices gradually fill with content from main memory. Depending on the size of your cache devices, it could take over an hour for them to fill. Capacity and reads can be monitored using the \fBiostat\fR option as follows: 

.sp
.in +2
.nf
# \fBzpool iostat -v pool 5\fR
.fi
.in -2
.sp

.LP
\fBExample 13 \fRRemoving a Mirrored Log Device
.sp
.LP
Given the configuration shown immediately below, the following command removes the mirrored log device \fBmirror-2\fR in the pool \fBtank\fR.

.sp
.in +2
.nf
   pool: tank
  state: ONLINE
  scrub: none requested
config:

         NAME        STATE     READ WRITE CKSUM
         tank        ONLINE       0     0     0
           mirror-0  ONLINE       0     0     0
             c6t0d0  ONLINE       0     0     0
             c6t1d0  ONLINE       0     0     0
           mirror-1  ONLINE       0     0     0
             c6t2d0  ONLINE       0     0     0
             c6t3d0  ONLINE       0     0     0
         logs
           mirror-2  ONLINE       0     0     0
             c4t0d0  ONLINE       0     0     0
             c4t1d0  ONLINE       0     0     0
.fi
.in -2
.sp

.sp
.in +2
.nf
# \fBzpool remove tank mirror-2\fR
.fi
.in -2
.sp

.LP
\fBExample 14 \fRRecovering a Faulted ZFS Pool
.sp
.LP
If a pool is faulted but recoverable, a message indicating this state is provided by \fBzpool status\fR if the pool was cached (see \fBcachefile\fR above), or as part of the error output from a failed \fBzpool import\fR of the pool.

.sp
.LP
Recover a cached pool with the \fBzpool clear\fR command:

.sp
.in +2
.nf
# \fBzpool clear -F data\fR
Pool data returned to its state as of Thu Jun 07 10:50:35 2012.
Discarded approximately 29 seconds of transactions.
.fi
.in -2
.sp

.sp
.LP
If the pool configuration was not cached, use \fBzpool import\fR with the recovery mode flag:

.sp
.in +2
.nf
# \fBzpool import -F data\fR
Pool data returned to its state as of Thu Jun 07 10:50:35 2012.
Discarded approximately 29 seconds of transactions.
.fi
.in -2
.sp

.LP
\fBExample 15 \fRImporting a ZFS Pool with a Missing Log Device
.sp
.LP
The following examples illustrate attempts to import a pool with a missing log device. The \fB-m\fR option is used to complete the import operation.

.sp
.LP
Additional devices are known to be part of this pool, though their exact configuration cannot be determined.

.sp
.in +2
.nf
# \fBzpool import tank\fR
The devices below are missing, use '-m' to import the pool anyway:
             c5t0d0 [log]

cannot import 'tank': one or more devices is currently unavailable

# \fBzpool import -m tank\fR
# \fBzpool status tank\fR
   pool: tank
  state: DEGRADED
status: One or more devices could not be opened.  Sufficient replicas
exist for
         the pool to continue functioning in a degraded state.
action: Attach the missing device and online it using 'zpool online'.
    see: http://www.support.oracle.com/msg/ZFS-8000-2Q
   scan: none requested
config:

         NAME                   STATE     READ WRITE CKSUM
         tank                   DEGRADED     0     0     0
           c7t0d0               ONLINE       0     0     0
         logs
           1693927398582730352  UNAVAIL      0     0     0  was 
/dev/dsk/c5t0d0

errors: No known data errors
.fi
.in -2
.sp

.sp
.LP
The following example shows how to import a pool with a missing \fBmirrored\fR log device.

.sp
.in +2
.nf
# \fBzpool import tank\fR
The devices below are missing, use ?-m? to import the pool anyway:
mirror-1 [log]
c5t0d0
c5t1d0

# \fBzpool import -m tank\fR

# \fBzpool status tank\fR
   pool: tank
  state: DEGRADED
status: One or more devices could not be opened.  Sufficient replicas
exist for the pool to continue functioning in a degraded state.
action: Attach the missing device and online it using 'zpool online'.
    see: http://www.support.oracle.com/msg/ZFS-8000-2Q
    scan: none requested
config:

         NAME                      STATE     READ WRITE CKSUM
         tank                      DEGRADED     0     0     0
           c7t0d0                  ONLINE       0     0     0
         logs
           mirror-1                UNAVAIL      0     0     0
insufficient replicas
             46385995713041169     UNAVAIL      0     0     0  was
/dev/dsk/c5t0d0
             13821442324672734438  UNAVAIL      0     0     0  was
/dev/dsk/c5t1d0

errors: No known data errors
.fi
.in -2
.sp

.LP
\fBExample 16 \fRImporting a Pool By a Specific Path
.sp
.LP
The following command imports the pool \fBtank\fR by identifying the pool's specific device paths, \fB/dev/dsk/c9t9d9\fR and \fB/dev/dsk/c9t9d8\fR, in this example.

.sp
.in +2
.nf
# \fBzpool import -d /dev/dsk/c9t9d9s0 /dev/dsk/c9t9d8s0 tank\fR
.fi
.in -2
.sp

.sp
.LP
An existing limitation is that even though this pool is comprised of whole disks, the command must include the specific device's slice identifier.

.LP
\fBExample 17 \fRObtaining Parseable Output
.sp
.LP
The following command is used to obtain parseable output and will provide one interval.

.sp
.in +2
.nf
# \fBzpool monitor -p -o pool,pctdone,other -t send poolA poolC\fR
poolA:20.4:poolA/fs2/team2@fs2_all
poolA:0.0:poolA/fs2/team2@all
poolA:28.6:poolA/fs\:1/team3@fs1_all
poolC:33.3:poolC/fs1/team2@fs1_all
poolC:50.0:poolC/fs2/team1@fs2_all
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
Successful completion. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.sp .6
.RS 4n
An error occurred.
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.sp .6
.RS 4n
Invalid command line options were specified.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/file-system/zfs
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBps\fR(1), \fBzfs\fR(1M), \fBattributes\fR(5), \fBSDC\fR(7)
.SH NOTES
.sp
.LP
Each ZFS storage pool has an associated process, \fBzpool-\fR\fIpoolname\fR, visible in such tools as \fBps\fR(1). A user has no interaction with these processes. See \fBSDC\fR(7).
