Alhadis/Silos/Solaris-11.3/zh_CN.UTF-8/man1m/dladm.1m
'\" te
.\" Copyright (c) 2012, 2015, Oracle and/or its affiliates.All rights reserved.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation.In the following statement, the phrase "this text" refers to portions of the system documentation.Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group.In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document.The original Standard can be obtained online at http://www.opengroup.org/unix/online.html.This notice shall appear on any product containing this material. 
.TH dladm 1M "2015 年 4 月 6 日" "SunOS 5.11" "系统管理命令"
.SH 名称
dladm \- 管理数据链路
.SH 用法概要
.LP
.nf
\fBdladm\fR
.fi

.LP
.nf
\fBdladm show-link\fR [\fB-PZ\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]
\fBdladm rename-link\fR [\fB-R\fR \fIroot-dir\fR] \fIlink\fR \fInew-link\fR
.fi

.LP
.nf
\fBdladm delete-phys\fR \fIphys-link\fR
\fBdladm show-phys\fR [\fB-PZ\fR] [\fB-Lm\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-H\fR]
     [\fB-z\fR \fIzone\fR[,...]] [\fB-D\fR [\fIdcb-feature\fR]] [\fB-lr\fR]] [\fIphys-link\fR]
.fi

.LP
.nf
\fBdladm create-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-m\fR \fImode\fR] [\fB-P\fR \fIpolicy\fR] [\fB-L\fR \fIlacpmode\fR] 
     [\fB-T\fR \fItime\fR] [\fB-u\fR \fIaddress\fR] \fB-l\fR \fIether-link1\fR [\fB-l\fR \fIether-link2\fR...] \fIaggr-link\fR
\fBdladm modify-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-m\fR \fImode\fR] [\fB-P\fR \fIpolicy\fR] [\fB-L\fR \fIlacpmode\fR] 
     [\fB-T\fR \fItime\fR] [\fB-u\fR \fIaddress\fR] \fIaggr-link\fR
\fBdladm delete-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIaggr-link\fR
\fBdladm add-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fIether-link1\fR [\fB-l\fR \fIether-link2\fR...] 
     \fIaggr-link\fR
\fBdladm remove-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fIether-link1\fR [\fB-l\fR \fIether-link2\fR...]
     \fIaggr-link\fR
\fBdladm show-aggr\fR [\fB-PLxZS\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIaggr-link\fR]
.fi

.LP
.nf
\fBdladm create-bridge\fR [\fB-P\fR \fIprotect\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-p\fR \fIpriority\fR]
     [\fB-m\fR \fImax-age\fR] [\fB-h\fR \fIhello-time\fR] [\fB-d\fR \fIforward-delay\fR] [\fB-f\fR \fIforce-protocol\fR]
     [\fB-l\fR \fIlink\fR...] \fIbridge-name\fR
\fBdladm modify-bridge\fR [\fB-P\fR \fIprotect\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-p\fR \fIpriority\fR]
     [\fB-m\fR \fImax-age\fR] [\fB-h\fR \fIhello-time\fR] [\fB-d\fR \fIforward-delay\fR] [\fB-f\fR \fIforce-protocol\fR]
     \fIbridge-name\fR
\fBdladm delete-bridge\fR [\fB-R\fR \fIroot-dir\fR] \fIbridge-name\fR
\fBdladm add-bridge\fR [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fIlink\fR [\fB-l\fR \fIlink\fR...]\fIbridge-name\fR
\fBdladm remove-bridge\fR [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fIlink\fR [\fB-l\fR \fIlink\fR...] \fIbridge-name\fR
\fBdladm show-bridge\fR [\fB-flt\fR] [\fB-s\fR [\fB-i\fR \fIinterval\fR]] [[\fB-p\fR] \fB-o\fR \fIfield\fR,...]
     [\fIbridge-name\fR]
.fi

.LP
.nf
dladm create-vlan [-ft] [-R \fIroot-dir\fR] -l \fIether-link\fR -v
          vid[,\fIpvlan-svid\fR[,\fIpvlan-type\fR]] [\fIvlan-link\fR]
dladm modify-vlan [-t] [-R \fIroot-dir\fR] [-l \fIether-link\fR] [-v
          vid[,\fIpvlan-svid\fR[,\fIpvlan-type\fR]] [-f]]
 	  {\fIvlan-link\fR,[\fIvlan-link\fR,...] | -L \fIether-link\fR}
\fBdladm delete-vlan\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIvlan-link\fR
\fBdladm show-vlan\fR [\fB-PZ\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIvlan-link\fR]
.fi

.LP
.nf
\fBdladm scan-wifi\fR [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fIwifi-link\fR]
\fBdladm connect-wifi\fR [\fB-e\fR \fIessid\fR] [\fB-i\fR \fIbssid\fR] [\fB-k\fR \fIkey\fR,...]
     [\fB-s\fR none | wep | wpa ] [\fB-a\fR open | shared] [\fB-b\fR bss | ibss] [\fB-c\fR]
     [\fB-m\fR a | b | g | n ] [\fB-T\fR \fItime\fR] [\fIwifi-link\fR]
\fBdladm disconnect-wifi\fR [\fB-a\fR] [\fIwifi-link\fR]
\fBdladm show-wifi\fR [\fB-Z\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIwifi-link\fR]
.fi

.LP
.nf
\fBdladm show-ether\fR [\fB-xZ\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]]
     [\fB-P\fR \fIprotocol\fR] [\fIether-link\fR]
.fi

.LP
.nf
\fBdladm set-linkprop\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-p\fR \fIprop\fR=\fIvalue\fR[,...] \fIlink\fR
\fBdladm reset-linkprop\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-p\fR \fIprop\fR[,...]] \fIlink\fR
\fBdladm show-linkprop\fR [\fB-HPZ\fR] [[\fB-c\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-p\fR \fIprop\fR[,...]]
     [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR]
.fi

.LP
.nf
\fBdladm create-secobj\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-f\fR \fIfile\fR] \fB-c\fR \fIclass\fR \fIsecobj\fR
\fBdladm delete-secobj\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIsecobj\fR[,...]
\fBdladm show-secobj\fR [\fB-P\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fIsecobj\fR,...]
.fi

.LP
.nf
dladm create-vnic [-t] [-f] -l \fIlink\fR [-R \fIroot-dir\fR] [-m value | auto |
          {factory [-n \fIslot-identifier\fR]} | {vrrp -A {inet | inet6} -V \fIvrid\fR}
          | {random [-r \fIprefix\fR]}] [-v \fIvlan-id\fR] 
          [-P \fIpkey\fR] [-p prop=value[,...]] \fIvnic-link\fR
\fBdladm create-vnic\fR \fB-t -c\fR <\fIevsname\fR>[/<\fIvportname\fR>] [\fB-T\fR <\fItenant\fR>] <\fIvnic-link\fR>
\fBdladm modify-vnic\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-l\fR \fIlink\fR]  [\fB-m\fR \fIvalue\fR | auto | 
     {factory [\fB-n\fR \fIslot-identifier\fR]} | {vrrp \fB-A\fR {inet | inet6} \fB-V\fR \fIvrid\fR}
     | {random [\fB-r\fR \fIprefix\fR]}] [\fB-v\fR \fIvlan-id\fR[,\fIpvlan-svid\fR[,\fIpvlan-type\fR]]]
     {\fIvnic-link\fR,[\fIvnic-link\fR,...] | \fB-L\fR \fIlink\fR}
\fBdladm delete-vnic\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIvnic-link\fR
\fBdladm show-vnic\fR [-P | {-z zone[,..]}] [[-p] -o \fIfield\fR[,..]] [-l \fIlink\fR] 
[\fIvnic-link\fR]
\fBdladm show-vnic\fR [-Zmv] [-l \fIlink\fR] [\fIvnic-link\fR]
.fi

.LP
.nf
\fBdladm create-etherstub\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIetherstub\fR
\fBdladm delete-etherstub\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIetherstub\fR
\fBdladm show-etherstub\fR [\fB-Z\fR] [\fB-z\fR \fIzone\fR[,...]] [\fIetherstub\fR]
.fi

.LP
.nf
\fBdladm create-iptun\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-T\fR \fItype\fR [\fB-a\fR {local|remote}=\fIaddr\fR,...]
     \fIiptun-link\fR
\fBdladm modify-iptun\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-a\fR {local|remote}=\fIaddr\fR,...
     \fIiptun-link\fR
\fBdladm delete-iptun\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIiptun-link\fR
\fBdladm show-iptun\fR [\fB-PZ\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIiptun-link\fR]
.fi

.LP
.nf
\fBdladm create-part\fR [\fB-t\fR] [\fB-f\fR] \fB-l\fR \fIib-link\fR [\fB-R\fR \fIroot-dir\fR] \fB-P\fR \fIpkey\fR
     [\fB-p\fR prop=\fIvalue\fR[,...]] \fIpart-link\fR
\fBdladm delete-part\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIpart-link\fR
\fBdladm show-part\fR [\fB-pP\fR] [\fB-o\fR \fIfield\fR[,...]] [\fB-l\fR \fIib-link\fR]  [\fIpart-link\fR]
.fi

.LP
.nf
\fBdladm show-ib\fR [\fB-pP\fR] [\fB-o\fR \fIfield\fR[,...]] [\fIib-link\fR]
.fi

.LP
.nf
\fBdladm create-eoib\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fIib-link\fR \fB-g\fR \fIgw-system-name\fR
     \fB-c\fR \fIgw-eth-port\fR \fIeoib-link\fR
\fBdladm delete-eoib\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIeoib-link\fR
\fBdladm show-eoib\fR [\fB-PZ\fR] [\fB-g\fR \fIgw-system-name\fR] [\fB-l\fR \fIib-link\fR] [[\fB-p\fR]
     \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR [,...]] [\fIeoib-link\fR]
\fBdladm show-ib\fR [\fB-pP\fR] [\fB-o\fR \fIfield\fR[,...]] [\fIib-link\fR]
.fi

.LP
.nf
\fBdladm create-vxlan\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-p\fR \fIvni\fR=<\fIvxlan id\fR>,\fBaddr\fR=<\fIip_address\fR>[,\fIprop=value\fR[,...]]
          \fIvxlan-link\fR
\fBdladm create-vxlan\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-p\fR \fIvni\fR=<\fIvxlan id\fR>,\fBinterface\fR=<\fIinterface_name\fR>[,\fIprop=value\fR[,...]]
          \fIvxlan-link\fR
\fBdladm show-vxlan\fR [\fB-pP\fR] [\fB-o\fR \fIfield\fR[,...]] [\fIvxlan-link\fR]
\fBdladm delete-vxlan\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIvxlan-link\fR
.fi

.LP
.nf
\fBdladm create-cap\fR  [-t] [-R \fIroot-dir\fR] \fIcap-link\fR 
\fBdladm show-cap\fR [-pP] [-o  field[,...]] [\fIcap-link\fR] 
\fBdladm delete-cap\fR  [-t] [-R \fIroot-dir\fR] \fIcap-link\fR
.fi

.LP
.nf
\fBdladm help\fR [\fIsubcommand-name\fR]
.fi

.SH 描述
.sp
.LP
\fBdladm\fR 命令用于管理数据链路。数据链路在系统中表示为 \fBSTREAMS DLPI\fR (v2) 接口，可在 \fBTCP/IP\fR 等协议栈下检测到此接口。各数据链路依赖于一台网络设备或设备聚合来向网络发送包或从网络接收包。
.sp
.LP
所有链路配置都位于网络配置文件 (Network Configuration Profile, NCP) 中。可以在一个系统上定义任意数量的 NCP，但是始终只能有一个活动 NCP。使用 \fBdladm\fR 命令所做的更改将应用于当前活动 NCP。
.sp
.LP
NCP 可以是“固定的”或“反应性的”。有一个固定 NCP，名为 DefaultFixed。此 NCP 一旦激活即会立即应用其所有配置，而系统不会进行任何更改，不管配置的各部分是成功还是失败。可以有任意数量的反应性 NCP；这些 NCP 将基于构成配置文件的附加策略规则进行应用，并且会基于 NCP 的策略规则自动更改系统配置以响应网络情况的变化。可以使用 \fBnetcfg\fR(1M) 命令来创建反应性 NCP 的策略规则。
.sp
.LP
每个 \fBdladm\fR 子命令都在以下某个对象中运行：
.sp
.ne 2
.mk
.na
\fB\fBlink\fR\fR
.ad
.sp .6
.RS 4n
数据链路，通过名称标识。名称最多可包含 30 个字符，开头必须为字母字符，结尾必须为介于 0 和 4294967294 之间的数字（含）。不允许使用带前导零的数字。名称的其余部分可以使用字母数字字符以及 '.' 和 '_' 的任意组合。此外，数据链路名称还可以包含特殊分隔符 '/' 和 '-'，如下所示。 
.sp
从全局区域查看时，区域内的数据链路将具有前缀（标识该区域），后跟 '/' 和传统数据链路名称。因此，从全局区域查看时，区域 "myzone" 内的数据链路 "net0" 将显示为 "myzone/net0"。这样可以确保数据链路名称始终唯一。
.sp
在外部创建到 dladm 的数据链路将包含前缀（标识创建者），后跟 '-' 和传统数据链路名称（例如 \fBldoms-vsw1.port2\fR）。这样可以确保在外部创建的数据链路将不会有命名冲突。相应地，dladm 无法用于创建包含 '-' 的数据链路。 
.sp
某些子命令仅在特定类型或种类的数据链路上运行。在这些情况下，请使用以下对象名称：
.sp
.ne 2
.mk
.na
\fB\fBaggr-link\fR\fR
.ad
.sp .6
.RS 4n
聚合数据链路（或键；请参见“附注”部分）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBether-link\fR\fR
.ad
.sp .6
.RS 4n
物理以太网数据链路。
.RE

.sp
.ne 2
.mk
.na
\fB\fBeoib-link\fR\fR
.ad
.sp .6
.RS 4n
Ethernet-over-InfiniBand (EoIB) 数据链路。
.RE

.sp
.ne 2
.mk
.na
\fB\fBiptun-link\fR\fR
.ad
.sp .6
.RS 4n
IP 隧道链路。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpart-link\fR\fR
.ad
.sp .6
.RS 4n
InfiniBand (IB) 分区数据链路。
.RE

.sp
.ne 2
.mk
.na
\fB\fBphys-link\fR\fR
.ad
.sp .6
.RS 4n
物理数据链路。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvlan-link\fR\fR
.ad
.sp .6
.RS 4n
VLAN 数据链路。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvnic-link\fR\fR
.ad
.sp .6
.RS 4n
在链路或 \fBetherstub\fR 上创建的虚拟网络接口。伪设备可以计算机上的网络接口卡的方式处理。
.RE

.sp
.ne 2
.mk
.na
\fB\fBwifi-link\fR\fR
.ad
.sp .6
.RS 4n
WiFi 数据链路。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBbridge\fR\fR
.ad
.sp .6
.RS 4n
网桥实例，通过以管理方式选择的名称标识。此名称可使用任何字母数字字符或下划线 \fB_\fR，但必须以字母字符开头和结尾。网桥名称最多可包含 31 个字符。保留名称 \fBdefault\fR，同时保留所有以 \fBSUNW\fR 开头的名称。
.sp
请注意，在网桥名称后附加零 (\fB0\fR) 可生成一个用于监测的有效链路名称。
.sp
另请注意，随下面的 \fBdladm\fR 子命令一起介绍的与网桥相关的子命令要求安装 \fBpkg://solaris/network/bridging\fR 软件包。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdev\fR\fR
.ad
.sp .6
.RS 4n
网络设备，通过串联驱动程序名称和实例编号标识。
.RE

.sp
.ne 2
.mk
.na
\fB\fBetherstub\fR\fR
.ad
.sp .6
.RS 4n
创建 VNIC 时，可以使用以太网桩模块（而非物理 NIC）。基于 \fBetherstub\fR 创建的 VNIC 将显示为通过虚拟交换机进行连接，并允许在没有物理硬件的情况下构建完整的虚拟网络。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpart\fR\fR
.ad
.sp .6
.RS 4n
在 IB 物理链路上创建的 IB 分区链路。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsecobj\fR\fR
.ad
.sp .6
.RS 4n
安全对象，通过以管理方式选择的名称标识。此名称可使用任何字母数字字符、下划线 (\fB_\fR)、句点 (\fB\&.\fR) 和连字符 (\fB-\fR)。安全对象名称最多可包含 32 个字符。
.RE

.sp
.LP
\fBdladm\fR 是作为一组具有相应选项的子命令实现的。选项在每个子命令的上下文中进行了说明。许多子命令都具有以下共同选项：
.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
指定应当应用创建、删除或重命名等操作的备用根目录。
.RE

.sp
.LP
\fBdladm\fR 还支持无参数的命令格式。当以此方式调用时，\fBdladm\fR 会显示系统上所有数据链路的基本配置信息。请参见\fB\fR“示例”部分。
.SS "子命令"
.sp
.LP
支持以下子命令：
.sp
.ne 2
.mk
.na
\fB\fBdladm show-link\fR [\fB-PZ\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIlink\fR] \fR
.ad
.sp .6
.RS 4n
显示所有数据链路或指定链路的链路配置信息。缺省情况下，对于每个已知的网络设备，系统都会配置一个数据链路。输出链路统计信息的选项已移至 \fBdlstat\fR(1M)。
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...], \fB- –output\fR=\fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
要显示的输出字段的列表，这些字段不区分大小写，并且由逗号分隔。字段名称必须是下面列出的某个字段，或者是可以显示所有字段的特殊值 \fBall\fR。缺省情况下（无 \fB-o\fR），\fBshow-link\fR 会显示所有字段。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
数据链路的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBZONE\fR\fR
.ad
.sp .6
.RS 4n
数据链路的当前区域。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCLASS\fR\fR
.ad
.sp .6
.RS 4n
数据链路的类。\fBdladm\fR 可区分下列类：
.sp
.ne 2
.mk
.na
\fB\fBaggr\fR\fR
.ad
.sp .6
.RS 4n
链路聚合，作为数据链路多路径 (\fBdlmp\fR) 或 IEEE 802.3ad \fBtrunk\fR。\fBshow-aggr\fR 子命令显示此类数据链路的更多详细信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fBbridge\fR\fR
.ad
.sp .6
.RS 4n
网桥实例，通过以管理方式选择的名称标识。
.RE

.sp
.ne 2
.mk
.na
\fB\fBeoib\fR\fR
.ad
.sp .6
.RS 4n
EoIB 接口。\fBshow-eoib\fR 子命令显示此类数据链路的更多详细信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fBetherstub\fR\fR
.ad
.sp .6
.RS 4n
etherstub 的实例。创建 VNIC 时，可以使用以太网桩模块（而非物理 NIC）。基于 \fBetherstub\fR 创建的 VNIC 将显示为通过虚拟交换机进行连接，并允许在没有物理硬件的情况下构建完整的虚拟网络。
.RE

.sp
.ne 2
.mk
.na
\fB\fBiptun\fR\fR
.ad
.sp .6
.RS 4n
IP 隧道链路的实例。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpart\fR\fR
.ad
.sp .6
.RS 4n
IP-over-IB 接口。\fBshow-part\fR 子命令显示此类数据链路的更多详细信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fBphys\fR\fR
.ad
.sp .6
.RS 4n
物理数据链路。\fBshow-phys\fR 子命令显示此类数据链路的更多详细信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvlan\fR\fR
.ad
.sp .6
.RS 4n
VLAN 数据链路。\fBshow-vlan\fR 子命令显示此类数据链路的更多详细信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvnic\fR\fR
.ad
.sp .6
.RS 4n
虚拟网络接口。\fBshow-vnic\fR 子命令显示此类数据链路的更多详细信息。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBMTU\fR\fR
.ad
.sp .6
.RS 4n
显示的数据链路的最大传输单元大小。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
数据链路的虚拟链路状态。此状态可以为 up、down 或 unknown。当将一个 NIC 分割为多个虚拟 NIC (virtual NIC, VNIC) 时，会在内部创建一个虚拟交换机，以便允许 VNIC 与处于同一 VLAN 中的主数据链路通信。这些数据链路可以相互通话，即使物理数据链路没有与外部网络连接。这形成了该数据链路的虚拟链路状态。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBRIDGE\fR\fR
.ad
.sp .6
.RS 4n
分配了此链路的网桥的名称（如果有）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOVER\fR\fR
.ad
.sp .6
.RS 4n
运行此数据链路所基于的物理数据链路。这适用于数据链路的 \fBaggr\fR、\fBbridge\fR、\fBeoib\fR、\fBvlan\fR 和 \fBpart\fR 类。VLAN、IB 分区或 EoIB 数据链路在一个物理数据链路上创建，网桥具有多个附加链路，而聚合则包括一个或多个物理数据链路。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
使用稳定的可供计算机解析的格式显示。\fB-o\fR 选项需要与 \fB-p\fR 一起使用。请参见下文的“可解析的输出格式”。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR、\fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
显示持久性链路配置。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
在输出中显示 \fBZONE\fR 列。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
显示指定区域的链路。缺省情况下，当 \fBdladm\fR 从全局区域运行时，将显示所有区域中的链路。其他区域中的链路的显示方式是：以相应区域名称作为其前缀，后跟斜杠 (\fB/\fR) 分隔符。例如，\fBzone1/net0\fR
.sp
从非全局区域运行时，该子命令仅显示该区域中的链路。非全局区域无法看到其他区域中的链路。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm rename-link\fR [\fB-R\fR \fI root-dir\fR] \fIlink\fR \fInew-link\fR\fR
.ad
.sp .6
.RS 4n
将 \fIlink\fR 重命名为 \fInew-link\fR。此选项用于为链路指定一个有意义的名称，或者将现有链路配置（例如，已删除设备的链路属性）与新设备相关联。有关如何使用此子命令的具体示例，请参见\fB\fR“示例”部分。
.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-phys\fR \fIphys-link\fR\fR
.ad
.sp .6
.RS 4n
此命令用于删除与物理硬件（已从系统中删除）相关联的链路的持久性配置。
.sp
应当使用 \fBipadm delete\fR 命令手动删除第 3 层组件（例如 IP 接口）。请参见\fB\fR“示例”部分。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-phys\fR [\fB-PZ\fR] [\fB-Lm\fR] [[\fB-p\fR] \fB-o\fR \fIfield \fR[,...]] [\fB-H\fR] [\fB-z\fR \fIzone\fR[,...]] [\fB-D\fR [\fIdcb-feature\fR] [\fB-lr\fR]] [\fB-V\fR] [\fIphys-link\fR]\fR
.ad
.sp .6
.RS 4n
显示所有物理链路或指定物理链路的物理设备和属性。如果没有 \fB-P\fR，则仅显示正在运行的系统上的可用物理链路。
.sp
.ne 2
.mk
.na
\fB\fB-D\fR [\fIdcb-feature\fR]\fR
.ad
.sp .6
.RS 4n
显示物理链路上与 DCB（Data Center Bridging，数据中心桥接）有关的配置信息。受支持的 \fIdcb-feature\fR 包括 \fBets\fR（Enhanced Transmission Selection，增强的传输选择，IEEE 802.1Qaz）和 \fBpfc\fR（Priority-based Flow Control，基于优先级的流控制，IEEE 802.1Qbb）。\fBdcb-feature\fR 的输出不稳定。
.sp
\fB-D\fR \fBets\fR 的输出显示 ETS DCB 功能的下列元素：
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
数据链路的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCOS\fR\fR
.ad
.sp .6
.RS 4n
802.1p 优先级值。
.RE

.sp
.ne 2
.mk
.na
\fB\fBETSBW_LCL_EFFECT\fR\fR
.ad
.sp .6
.RS 4n
有效 ETS BW，以 CoS（802.1p 优先级）值的百分比表示。
.RE

.sp
.ne 2
.mk
.na
\fB\fBETSBW_RMT_EFFECT\fR\fR
.ad
.sp .6
.RS 4n
有效 ETS BW，以对等方上的 CoS（802.1p 优先级）值的百分比表示。
.RE

.sp
.ne 2
.mk
.na
\fB\fBETSBW_LCL_SOURCE\fR\fR
.ad
.sp .6
.RS 4n
指示 \fBETSBW_LCL_EFFECT\fR 值的源。这可以是本地（配置的）或远程（建议的）值。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCLIENTS\fR\fR
.ad
.sp .6
.RS 4n
使用 CoS 值的 MAC 客户机。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
对于 ETS DCB 功能，这将显示其他本地信息：
.sp
.ne 2
.mk
.na
\fB\fBETSBW_LCL\fR\fR
.ad
.RS 21n
.rt  
配置的 ETS BW，以 CoS（802.1p 优先级）值的百分比表示。
.RE

.sp
.ne 2
.mk
.na
\fB\fBETSBW_LCL_EFFECT\fR\fR
.ad
.RS 21n
.rt  
有效 ETS BW，以 CoS（802.1p 优先级）值的百分比表示。
.RE

.sp
.ne 2
.mk
.na
\fB\fBETSBW_LCL_ADVICE:\fR\fR
.ad
.RS 21n
.rt  
ETS BW，以对等方建议的 CoS（802.1p 优先级）值的百分比表示。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
对于 ETS DCB 功能，这将显示其他远程信息：
.sp
.ne 2
.mk
.na
\fB\fBETSBW_RMT_EFFECT\fR\fR
.ad
.RS 20n
.rt  
有效 ETS BW，以对等方上的 CoS（802.1p 优先级）值的百分比表示。
.RE

.sp
.ne 2
.mk
.na
\fB\fBETSBW_RMT_ADVICE:\fR\fR
.ad
.RS 21n
.rt  
ETS BW，以建议给对等方的 CoS（802.1p 优先级）值的百分比表示。
.RE

\fB-D\fR \fBpfc\fR 的输出显示 \fBLINK\fR、\fBCOS\fR 和 \fBCLIENTS\fR 字段，与 \fB-D\fR \fBets\fR 的输出相同。此外，\fB-D\fR \fBpfc\fR 显示特定于 PFC DCB 功能的下列元素：
.sp
.ne 2
.mk
.na
\fB\fBPFC\fR\fR
.ad
.sp .6
.RS 4n
如果为 CoS（802.1p 优先级）值启用了所配置的 PFC。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPFC_EFFECT\fR\fR
.ad
.sp .6
.RS 4n
如果为 CoS（802.1p 优先级）值启用了有效 PFC。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR\fR
.ad
.sp .6
.RS 4n
显示 NIC 驱动程序返回的硬件资源使用情况。\fB-H\fR 输出显示下列元素：
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
数据链路的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBRINGTYPE\fR\fR
.ad
.sp .6
.RS 4n
环类型（RX 或 TX）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBRINGS\fR\fR
.ad
.sp .6
.RS 4n
环索引。环是通常映射到 DMA 通道的可针对特殊用途进行编程的硬件资源。例如，可对 RX 环进行编程，使之仅接收隶属于特定 MAC 地址的包。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCLIENTS\fR\fR
.ad
.sp .6
.RS 4n
使用环的 MAC 客户机。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fR
.ad
.sp .6
.RS 4n
显示物理设备/链路的位置信息。按照位置顺序显示输出（即，板载设备位于扩展槽前面），如果可用，则提供位置信息（例如，PCIexp 插槽 2，MB）。\fB-L\fR 的输出支持以下元素：
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
与 NIC 驱动程序对应的物理设备。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDEVICE\fR\fR
.ad
.sp .6
.RS 4n
此链路下的物理设备的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLOC\fR\fR
.ad
.sp .6
.RS 4n
物理位置说明字符串（如果可用）。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.sp .6
.RS 4n
显示出厂 MAC 地址及其插槽标识符和可用性的列表。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR\fR
.ad
.sp .6
.RS 4n
显示物理链路的 SR-IOV 信息。输出显示如下：
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.RS 13n
.rt  
物理链路名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBVFS-AVAIL\fR\fR
.ad
.RS 13n
.rt  
此物理链路上可用的 VF 数目。
.RE

.sp
.ne 2
.mk
.na
\fB\fBVFS-INUSE\fR\fR
.ad
.RS 13n
.rt  
此物理链路上使用的 VF 数目。
.RE

.sp
.ne 2
.mk
.na
\fBFLAGS\fR
.ad
.RS 13n
.rt  
唯一可能的标志是 l，代表由 LDOMs 管理。如果设置了此标志，\fBdladm\fR 将无法在此物理链路上创建 VF VNIC。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR、\fB- -output\fR=\fIfield\fR\fR
.ad
.sp .6
.RS 4n
要显示的输出字段的列表，这些字段不区分大小写，并且由逗号分隔。字段名称必须是下面列出的某个字段，或者是可以显示所有字段的特殊值 \fBall\fR。对于每个链路，可显示下列字段：
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
数据链路的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMEDIA\fR\fR
.ad
.sp .6
.RS 4n
物理数据链路提供的介质类型。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
数据链路的物理链路状态。此状态可以为 up、down 或 unknown。物理链路状态指明物理设备是否连接到外部网络（如果插入了电缆，并且电缆另一端的端口的状态为 "up"，则为连接到外部网络）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSPEED\fR\fR
.ad
.sp .6
.RS 4n
链路的当前速度（以兆位/秒为单位）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDUPLEX\fR\fR
.ad
.sp .6
.RS 4n
对于以太网链路，如果链路状态为 \fBup\fR，则会显示此链路的全/半双工状态。在其他所有情况下，双工显示为 \fBunknown\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDEVICE\fR\fR
.ad
.sp .6
.RS 4n
此链路下的物理设备的名称。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
使用稳定的可供计算机解析的格式显示。\fB-o\fR 选项需要与 \fB-p\fR 一起使用。请参见下文的“可解析的输出格式”。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR、\fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
此选项显示所有链路（包括已从系统中删除的链路）的持久性配置。此输出提供了一个 \fBFLAGS\fR 列，在此列中，\fBr\fR 标志表示与物理链路相关联的物理设备已移除。对于此类链路，使用 \fBdelete-phys\fR 可从系统中清除链路的配置。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
在输出中显示 \fBZONE\fR 列。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
请参见上面 \fBdladm show-link\fR 下 \fB-z\fR 选项的说明。
.RE

缺省情况下，Solaris 会指定以 \fBnet\fR 作为前缀的链路名称。在安装 Solaris 之前，您可以通过修改 \fBsvc:/network/datalink-management:default\fR 服务的 \fBlinkname-policy/phys-prefix\fR SMF 属性的值来更改此缺省设置。在使用自动化安装 (Automated Install, AI) 程序的系统配置清单中为此属性指定一个新值。有关详细信息，请参见Chapter 2, \fI"Administering Datalink Configuration in Oracle Solaris,"\fR in \fI《Configuring and Managing Network Components in Oracle Solaris 11.3》\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-m\fR \fI mode\fR] [\fB-P\fR \fIpolicy\fR] [\fB-L\fR \fIlcapmode\fR] [\fB-T\fR \fI time\fR] [\fB-u\fR \fIaddress\fR] \fB- l\fR \fIether-link1\fR [\fB-l\fR \fI ether-link2\fR...] \fIaggr-link\fR\fR
.ad
.sp .6
.RS 4n
将一组链路组合为一个名为 \fIaggr-link\fR 的链路聚合。聚合可以是数据链路多路径 (Datalink Multipathing, dlmp) 或符合 IEEE 802.3ad。此外，还支持使用整数 \fIkey\fR 生成聚合链路名称，以便实现向后兼容。下面的许多 \fB*\fR\fB -aggr\fR 子命令还支持使用 \fIkey\fR 来引用一个给定的聚合，但建议使用聚合链路名称。有关键的更多信息，请参见\fB\fR“附注”部分。
.sp
\fBdladm\fR 支持针对端口聚合的多种端口选择策略。（请参见下文的 \fB-P\fR 选项的说明。）如果未指定策略，\fBcreate-aggr\fR 将使用 \fB-P\fR 选项下介绍的缺省 L4 策略。
.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIether-link\fR、\fB- -link\fR=\fIether-link\fR\fR
.ad
.sp .6
.RS 4n
使用 \fB-l\fR 选项（后跟要包含在聚合中的链路的名称），可以指定聚合中的每个以太网链路（或端口）。通过指定多个 \fB-l\fR 选项，聚合可以包括多个链路。为了与 Solaris 的早期版本实现向后兼容，\fBdladm\fR 命令还支持使用带有设备名称的 \fB-d\fR 选项（或 \fB--dev\fR），根据链路的底层设备名称来指定链路。采用 \fB-l\fR 选项的其他 \fB*\fR\fB-aggr\fR 子命令还接受 \fB-d\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
指定聚合为临时聚合。临时聚合将持续到下一次重新引导。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fImode\fR\fR
.ad
.sp .6
.RS 4n
必须将 mode 设置为以下模式之一：
.sp
.ne 2
.mk
.na
\fB\fBtrunk\fR\fR
.ad
.sp .6
.RS 4n
符合 IEEE 802.3ad 标准的链路聚合。如果未指定，则 \fImode\fR 为 \fBtrunk\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdlmp\fR\fR
.ad
.sp .6
.RS 4n
数据链路多路径模式。可在多个交换机之间提供故障转移且无需进行交换机配置的层 2 高可用性技术。\fBdlmp\fR 链路聚合还可以聚合连接到同一个交换机的端口。但是，它不能用在背对背设置中。
.sp
\fBdlmp\fR 链路聚合的负荷分配能力有限：在激活的 \fBdlmp\fR \fBaggr\fR 上配置的 MAC 客户机可以分布到所有 \fBaggr\fR 端口，但单个 MAC 客户机不能在多个端口间分配负荷。
.sp
此模式不符合 IEEE 802.3ad 标准。在此模式中，设置 \fBpolicy\fR、\fBlacpmode\fR、\fBtime\fR 或 MAC 地址均将无效。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fIpolicy\fR、\fB- -policy\fR=\fIpolicy\fR\fR
.ad
.br
.na
\fB\fR
.ad
.sp .6
.RS 4n
指定用于外发通信的负荷分配的端口选择策略。此策略指定用于发送包的 \fIdev\fR 对象。策略是以逗号分隔的一个或多个层说明符的列表。层说明符为下列项之一：
.sp
.ne 2
.mk
.na
\fB\fBL2\fR\fR
.ad
.sp .6
.RS 4n
根据包的源和目标 \fBMAC\fR 地址选择外发设备。
.RE

.sp
.ne 2
.mk
.na
\fB\fBL3\fR\fR
.ad
.sp .6
.RS 4n
根据包的源和目标 \fBIP\fR 地址选择外发设备。
.RE

.sp
.ne 2
.mk
.na
\fB\fBL4\fR\fR
.ad
.sp .6
.RS 4n
根据包中包含的上层协议信息选择外发设备。对于 \fBTCP\fR 和 \fBUDP\fR，这包括源和目标端口。对于 IPsec，这包括 \fBSPI\fR（Security Parameters Index，安全参数索引）。
.RE

例如，要使用上层协议信息，可使用以下策略：
.sp
.in +2
.nf
-P L4
.fi
.in -2
.sp

请注意，策略 L4 为缺省值。
.sp
要使用源和目标 \fBMAC\fR 地址以及源和目标 \fBIP\fR 地址，可使用以下策略：
.sp
.in +2
.nf
-P L2,L3
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR \fIlacpmode\fR、\fB- -lacp-mode\fR=\fImode\fR\fR
.ad
.sp .6
.RS 4n
指定是否应使用 \fBLACP\fR，以及使用的话应采用何种运行模式。支持的值包括 \fBoff\fR、\fBactive\fR 或 \fBpassive\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fItime\fR、\fB--lacp-timer \fR=\fItime\fR\fR
.ad
.br
.na
\fB\fR
.ad
.sp .6
.RS 4n
指定 \fBLACP\fR 计时器值。支持的值包括 \fBshort\fR 或 \fBlong\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR \fIaddress\fR、\fB- -unicast\fR=\fIaddress\fR\fR
.ad
.sp .6
.RS 4n
指定用于聚合的固定单点传送硬件地址。如果未指定此选项，则会从组件设备的地址集中自动选择一个地址。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm modify-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-m\fR \fI mode\fR] [\fB-P\fR \fIpolicy\fR] [\fB-L\fR \fIlacpmode\fR] [\fB-T\fR \fI time\fR] [\fB-u\fR \fIaddress\fR] \fI aggr-link\fR\fR
.ad
.sp .6
.RS 4n
修改指定聚合的参数。 
.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
指定修改为临时修改。临时聚合将持续到下一次重新引导。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fImode\fR\fR
.ad
.sp .6
.RS 4n
请参见上文中 \fBcreate-aggr\fR 子命令下 \fB-m\fR \fImode\fR 选项的说明。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fIpolicy\fR、\fB- -policy\fR=\fIpolicy\fR\fR
.ad
.sp .6
.RS 4n
指定用于外发通信的负荷分配的端口选择策略。有关有效策略值的说明，请参见 \fBdladm create-aggr\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR \fIlacpmode\fR、\fB- -lacp-mode\fR=\fImode\fR\fR
.ad
.sp .6
.RS 4n
指定是否应使用 \fBLACP\fR，以及使用的话应采用何种运行模式。支持的值包括 \fBoff\fR、\fBactive\fR 或 \fBpassive\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fItime\fR、\fB--lacp-timer \fR=\fItime\fR\fR
.ad
.br
.na
\fB\fR
.ad
.sp .6
.RS 4n
指定 \fBLACP\fR 计时器值。支持的值包括 \fBshort\fR 或 \fBlong\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR \fIaddress\fR、\fB- -unicast\fR=\fIaddress\fR\fR
.ad
.sp .6
.RS 4n
指定用于聚合的固定单点传送硬件地址。如果未指定此选项，则会从组件设备的地址集中自动选择一个地址。
.sp
（请注意，修改固定的单点传送硬件地址时，将覆盖以前为聚合定义的所有已定义 \fBmac-address\fR 链路属性。请参见“常规链路属性”。）
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIaggr-link\fR\fR
.ad
.sp .6
.RS 4n
删除指定的聚合。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
指定删除为临时删除。临时删除将持续到下一次重新引导。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm add-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fI ether-link1\fR [\fB--link\fR=\fIether-link2\fR...] \fI aggr-link\fR\fR
.ad
.sp .6
.RS 4n
向指定聚合添加链路。
.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIether-link\fR、\fB- -link\fR=\fIether-link\fR\fR
.ad
.sp .6
.RS 4n
指定要添加到聚合的以太网链路。通过提供多个 \fB-l\fR 选项，可以添加多个链路。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
指定添加为临时添加。临时添加将持续到下一次重新引导。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm remove-aggr\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fI ether-link1\fR [\fB--l\fR=\fIether-link2\fR...] \fI aggr-link\fR\fR
.ad
.sp .6
.RS 4n
从指定聚合中删除链路。
.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIether-link\fR、\fB- -link\fR=\fIether-link\fR\fR
.ad
.sp .6
.RS 4n
指定要从聚合中删除的以太网链路。通过提供多个 \fB-l\fR 选项，可以添加多个链路。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
指定删除为临时删除。临时删除将持续到下一次重新引导。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-aggr\fR [\fB-PLxZS\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIaggr-link \fR]\fR
.ad
.sp .6
.RS 4n
显示所有聚合或指定聚合的聚合配置（缺省值）、LACP 信息或基于 DLMP 探测器的故障/恢复检测状态。
.sp
缺省情况下（无任何选项），可显示下列字段：
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
聚合链路的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMODE\fR\fR
.ad
.sp .6
.RS 4n
聚合模式，可以为 \fBtrunk\fR 或 \fBdlmp\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPOLICY\fR\fR
.ad
.sp .6
.RS 4n
聚合的 LACP 策略。有关可能的值的说明，请参见 \fBcreate-aggr\fR \fB-P\fR 选项。
.RE

.sp
.ne 2
.mk
.na
\fB\fBADDRPOLICY\fR\fR
.ad
.sp .6
.RS 4n
如果将聚合配置为自动配置其单点传送 MAC 地址（未使用 \fB-u\fR 选项创建或修改聚合时的缺省值），则为 \fBauto\fR；如果已使用 \fB-u\fR 设置固定 MAC 地址，则为 \fBfixed\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLACPACTIVITY\fR\fR
.ad
.sp .6
.RS 4n
聚合的 LACP 模式。可能的值包括 \fBoff\fR、\fBactive\fR 或 \fBpassive\fR，这些值使用 \fBcreate-aggr\fR 或 \fBmodify-aggr\fR 的 \fB-l\fR 选项进行设置。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLACPTIMER\fR\fR
.ad
.sp .6
.RS 4n
使用 \fBcreate-aggr\fR 或 \fBmodify-aggr\fR 的 \fB-T\fR 选项设置的聚合的 LACP 计时器值。
.RE

以下字段不是缺省输出的一部分，但可以使用 \fB-o\fR 进行查询。
.sp
.ne 2
.mk
.na
\fB\fBFLAGS\fR\fR
.ad
.sp .6
.RS 4n
与聚合相关联的一组状态标志。可能的唯一标志为 \fBf\fR，该标志在管理员强制使用 \fBcreate-aggr\fR 的 \fB-f\fR 选项创建聚合时显示。将来可定义其他标志。
.RE

\fBshow-aggr\fR 命令接受下列选项：
.sp
.ne 2
.mk
.na
\fB\fB-L\fR、\fB--lacp\fR\fR
.ad
.sp .6
.RS 4n
显示聚合链路和各底层端口的详细 \fBLACP\fR 信息。此选项显示的大部分状态信息都由 IEEE 802.3 定义。使用该选项，可以显示下列字段：
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
聚合链路的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPORT\fR\fR
.ad
.sp .6
.RS 4n
某个底层聚合端口的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBAGGREGATABLE\fR\fR
.ad
.sp .6
.RS 4n
是否可以将端口添加到聚合中。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSYNC\fR\fR
.ad
.sp .6
.RS 4n
如果为 \fByes\fR，则系统会考虑要同步的端口及部分聚合。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCOLL\fR\fR
.ad
.sp .6
.RS 4n
如果为 \fByes\fR，将支持在关联的端口上收集传入帧。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDIST\fR\fR
.ad
.sp .6
.RS 4n
如果为 \fByes\fR，将支持在关联的端口上分发传出帧。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDEFAULTED\fR\fR
.ad
.sp .6
.RS 4n
如果为 \fByes\fR，则表示端口使用的是缺省合作伙伴信息（即，尚未从 LACP 合作伙伴处收到 LACP 数据）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBEXPIRED\fR\fR
.ad
.sp .6
.RS 4n
如果为 \fByes\fR，则表示端口的接收状态为 \fBEXPIRED\fR 状态。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR, \fB--extended\fR\fR
.ad
.sp .6
.RS 4n
显示其他聚合信息，其中包括有关各底层端口的详细信息。使用 \fB-x\fR，可以显示下列字段：
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
聚合链路的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPORT\fR\fR
.ad
.sp .6
.RS 4n
某个底层聚合端口的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSPEED\fR\fR
.ad
.sp .6
.RS 4n
链路或端口的速度（以兆位/秒为单位）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDUPLEX\fR\fR
.ad
.sp .6
.RS 4n
如果链路状态为 \fBup\fR，则会显示链路或端口的全/半双工状态。在其他所有情况下，双工状态显示为 \fBunknown\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
链路状态。此状态可以为 \fBup\fR、\fBdown\fR 或 \fBunknown\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBADDRESS\fR\fR
.ad
.sp .6
.RS 4n
链路或端口的 MAC 地址。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPORTSTATE\fR\fR
.ad
.sp .6
.RS 4n
此选项指示各聚合端口是处于 \fBstandby\fR 状态还是 \fBattached\fR 状态。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR\fR
.ad
.sp .6
.RS 4n
显示给定 DLMP 聚合链路和各底层端口的详细探测器信息。使用 \fB-S\fR，可以显示下列字段：
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.RS 12n
.rt  
聚合链路的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPORT\fR\fR
.ad
.RS 12n
.rt  
某个底层聚合端口的名称。
.RE

.sp
.ne 2
.mk
.na
\fBFLAGS\fR
.ad
.RS 12n
.rt  
\fBFLAGS\fR 字段的四个字母代表： 
.sp
.ne 2
.mk
.na
\fB链路状态\fR
.ad
.RS 19n
.rt  
\&'u' 表示链路连通，'d' 表示链路断开，'-' 表示链路状态未知。
.RE

.sp
.ne 2
.mk
.na
\fB探测器状态\fR
.ad
.RS 19n
.rt  
\&'p' 表示选择了 ICMP 探测器（如果所有端口都出现故障）。
.RE

.sp
.ne 2
.mk
.na
\fBL2 状态\fR
.ad
.RS 19n
.rt  
\&'2' 表示“L2 处于活动状态”。
.RE

.sp
.ne 2
.mk
.na
\fBICMP 状态\fR
.ad
.RS 19n
.rt  
\&'3' 表示“ICMP 处于活动状态”。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.RS 12n
.rt  
端口的状态。可能的值为 "active"、"failed" 或 "unknown"。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTARGETS\fR\fR
.ad
.RS 12n
.rt  
此端口的活动 ICMP 目标。
.RE

.sp
.ne 2
.mk
.na
\fB\fBXTARGETS\fR\fR
.ad
.RS 12n
.rt  
此端口的活动传递式探测器。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...], \fB- -output\fR=\fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
要显示的输出字段的列表，这些字段不区分大小写，并且由逗号分隔。字段名称必须是上面列出的某个字段，或者是可以显示所有字段的特殊值 \fBall\fR。适用于 \fB-o\fR 选项的字段仅限于在每种输出模式下列出的字段。例如，如果使用 \fB-L\fR，只有在上面的 \fB-L\fR 下列出的字段才能与 \fB-o\fR 配合使用。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
使用稳定的可供计算机解析的格式显示。\fB-o\fR 选项需要与 \fB-p\fR 一起使用。请参见下文的“可解析的输出格式”。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR、\fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
显示持久性聚合配置（而非正在运行的系统的状态）。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
在输出中显示 \fBZONE\fR 列。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
请参见上面 \fBdladm show-link\fR 下 \fB-z\fR 选项的说明。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-bridge\fR [ \fB-P\fR \fI protect\fR] [\fB-R\fR \fIroot-dir\fR] [ \fB-p\fR \fIpriority\fR] [ \fB-m\fR \fI max-age\fR] [ \fB-h\fR \fIhello-time\fR] [ \fB-d\fR \fIforward-delay\fR] [ \fB-f\fR \fI force-protocol\fR] [\fB-l\fR \fIlink\fR...] \fI bridge-name\fR\fR
.ad
.sp .6
.RS 4n
创建一个 802.1D 网桥实例，并将一个或多个网络链路分配给新网桥（可选）。缺省情况下，系统上不存在任何网桥实例。
.sp
为了在链路之间进行桥接，必须至少创建一个网桥实例。每个网桥实例都是独立的，并且网桥之间没有任何转发连接。
.sp
请注意，与网桥相关的子命令（其中包括 \fBcreate-bridge\fR）要求安装 \fBpkg://solaris/network/bridging\fR 软件包。
.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fIprotect\fR、\fB- -protect\fR=\fIprotect\fR\fR
.ad
.sp .6
.RS 4n
指定保护方法。定义的保护方法包括表示跨树协议的 \fBstp\fR 和表示 \fBTRILL\fR 的 trill（在 RBridge 上使用）。缺省值为 \fBstp\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIpriority\fR、\fB- -priority\fR=\fIpriority\fR\fR
.ad
.sp .6
.RS 4n
指定网桥优先级。这会设置用于确定网络中的根网桥节点的 IEEE STP 优先级值。缺省值为 \fB32768\fR。有效值介于 \fB0\fR（最高优先级）和 \fB61440\fR（最低优先级）之间，并以 4096 为增量。
.sp
如果使用了不能被 4096 除尽的值，系统会以无提示方式向下舍入到可被 4096 除尽的下一较小值。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fImax-age\fR、\fB- -max-age\fR=\fImax-age\fR\fR
.ad
.sp .6
.RS 4n
指定配置信息的最长使用寿命（以秒为单位）。这会设置 STP 网桥最长使用寿命参数。如果此节点为根网桥，则会将此值用于网络中的所有节点。将放弃在此时间之前的网桥链路信息。此值缺省为 20 秒。有效值介于 6 至 40 秒之间。有关其他约束，请参见 \fB-d\fR \fIforward-delay\fR 参数。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR \fIhello-time\fR、\fB- -hello-time\fR=\fIhello-time\fR\fR
.ad
.sp .6
.RS 4n
指定 STP 网桥 Hello 时间参数。如果此节点为根节点，则会按此时间间隔在整个网络中发送配置 BPDU。缺省值为 2 秒。有效值介于 1 至 10 秒之间。有关其他约束，请参见 \fB-d\fR \fIforward-delay\fR 参数。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIforward-delay\fR、\fB- -forward-delay\fR=\fIforward-delay\fR\fR
.ad
.sp .6
.RS 4n
指定 STP 网桥转发延迟参数。如果此节点为根节点，当启用端口时，网络中的所有网桥都会使用此计时器确定链路状态的顺序。缺省值为 15 秒。有效值介于 4 至 30 秒之间。
.sp
网桥必须遵循下列两个约束：
.sp
.in +2
.nf
2 * (\fIforward-delay\fR - 1.0) >= \fImax-age\fR

\fImax-age\fR >= 2 * (\fIhello-time\fR + 1.0)
.fi
.in -2
.sp

任何违反这些约束的参数设置都将视为错误，并且会导致命令失败，同时出现诊断消息。此消息提供了所提供的值的有效备用项。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIforce-protocol\fR、\fB- -force-protocol\fR=\fIforce-protocol\fR\fR
.ad
.sp .6
.RS 4n
指定 MSTP 强制最大支持协议。缺省值为 3。有效值为非负整数。当前实现不支持 RSTP 或 MSTP，因此目前这不起作用。但是，为了防止在将来使用 MSTP，此参数可设置为 \fB0\fR（仅限 STP）或 \fB2\fR（适用于 STP 和 RSTP）。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIlink\fR、\fB--link \fR=\fIlink\fR\fR
.ad
.sp .6
.RS 4n
指定要添加到新创建的网桥的一个或多个链路。这与使用 \fBadd-bridge\fR 子命令创建网桥并添加一个或多个链路相似。但是，如果无法添加任何链路，整个命令将失败，并且无法创建新网桥自身。要在同一命令行中添加多个链路，请对每个链路重复此选项。允许创建没有链路的网桥。有关链路分配的更多信息，请参见 \fBadd-bridge\fR 子命令。
.RE

创建网桥和分配链路需要 \fBPRIV_SYS_DL_CONFIG\fR 特权。如果未在系统上安装可选网桥功能，网桥创建可能失败。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm modify-bridge\fR [ \fB-P\fR \fI protect\fR] [\fB-R\fR \fIroot-dir\fR] [ \fB-p\fR \fIpriority\fR] [ \fB-m\fR \fI max-age\fR] [ \fB-h\fR \fIhello-time\fR] [ \fB-d\fR \fIforward-delay\fR] [ \fB-f\fR \fI force-protocol\fR] [\fB-l\fR \fIlink\fR...] \fI bridge-name\fR\fR
.ad
.sp .6
.RS 4n
修改现有网桥的操作参数。这些选项与 \fBcreate-bridge\fR 子命令的选项相同，但不允许 \fB-l\fR 选项。要向现有网桥添加链路，请使用 \fBadd-bridge\fR 子命令。
.sp
修改网桥参数需要 \fBPRIV_SYS_DL_CONFIG\fR 特权。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-bridge\fR [\fB-R\fR \fI root-dir\fR] \fIbridge-name\fR\fR
.ad
.sp .6
.RS 4n
删除网桥实例。删除的网桥不能有任何附加链路。在删除网桥之前，请使用 \fBremove-bridge\fR 子命令停用链路。
.sp
删除网桥需要 \fBPRIV_SYS_DL_CONFIG\fR 特权。
.sp
\fB-R\fR (\fB--root-dir\fR) 选项与 \fBcreate-bridge\fR 子命令的选项相同。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm add-bridge\fR [\fB-R\fR \fI root-dir\fR] \fB-l\fR \fIlink\fR [\fB- l\fR \fIlink\fR...] \fIbridge-name\fR\fR
.ad
.sp .6
.RS 4n
向现有网桥添加一个或多个链路。如果指定了多个链路，并且添加其中任何一个链路导致错误，该命令将失败，并且不会对系统进行任何更改。
.sp
向网桥添加链路需要 \fBPRIV_SYS_DL_CONFIG\fR 特权。
.sp
链路最多只能是一个网桥的成员。尝试添加已属于另一个网桥的链路时将出错。要将链路从一个网桥实例移至另一个网桥实例，请将其从当前网桥中删除，然后再添加到新的网桥实例中。
.sp
此外，分配给网桥的链路还不能是 VLAN、VNIC 或隧道。只允许将物理以太网数据链路、聚合数据链路和以太网桩模块分配给网桥。
.sp
分配给网桥的所有链路必须具有相同的 MTU。当分配链路时，将对此进行检查。如果链路不是网桥中的第一个链路，并且具有不同的 MTU，则会以停用形式将此链路添加到网桥中。
.sp
请注意，使用网桥的系统不能将 \fBeeprom\fR(1M) \fBlocal-mac-address?\fR 变量设置为 false。
.sp
这些选项与 \fBcreate-bridge\fR 子命令的选项相同。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm remove-bridge\fR [\fB-R\fR \fI root-dir\fR] \fB-l\fR \fIlink\fR [\fB- l\fR \fIlink\fR...] \fIbridge-name\fR\fR
.ad
.sp .6
.RS 4n
从网桥实例中删除一个或多个链路。如果指定了多个链路，并且删除其中的任何一个链路会导致错误，该命令将失败，并且不会删除任何链路。
.sp
从网桥删除链路需要 \fBPRIV_SYS_DL_CONFIG\fR 特权。
.sp
这些选项与 \fBcreate-bridge\fR 子命令的选项相同。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-bridge\fR [\fB-flt\fR] [\fB-s\fR [\fB-i\fR \fIinterval\fR]] [[\fB-p\fR] \fB-o\fR \fIfield\fR,...] [\fIbridge-name\fR]\fR
.ad
.sp .6
.RS 4n
显示网桥的运行状态和配置、其附加链路、识别的转发条目以及 \fBTRILL\fR 昵称数据库。显示整个网桥状态和配置时，可以省略网桥名称以显示所有网桥。其他形式需要指定的网桥。
.sp
show-bridge 子命令接受下列选项：
.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fIinterval\fR、\fB- -interval\fR=\fIinterval\fR\fR
.ad
.sp .6
.RS 4n
与 \fB-s\fR 选项配合使用，用于指定应显示统计信息的时间间隔（以秒为单位）。如果未指定此选项，则仅显示一次统计信息。此选项已过时，已由 \fBdlstat\fR(1M) 中的 \fBshow-bridge\fR 子命令取代。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR、\fB--statistics\fR\fR
.ad
.sp .6
.RS 4n
显示指定网桥或给定网桥的附加链路的统计信息。此选项不能与 \fB-f\fR 选项以及 \fB-t\fR 选项一起使用。此选项已过时，已由 \fBdlstat\fR(1M) 中的 \fBshow-bridge\fR 子命令取代。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
使用稳定的可供计算机解析的格式显示。请参见下文的“可解析的输出格式”。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...], \fB- -output\fR=\fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
要显示的输出字段的列表，这些字段不区分大小写，并且由逗号分隔。下面介绍的是字段名称。特殊值 all 将显示所有字段。如果未指定 \fB-o\fR，每组字段都有各自要显示的缺省集。
.RE

缺省情况下，\fBshow-bridge\fR 子命令显示网桥配置。可显示下列字段：
.sp
.ne 2
.mk
.na
\fB\fBBRIDGE\fR\fR
.ad
.sp .6
.RS 4n
网桥的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBADDRESS\fR\fR
.ad
.sp .6
.RS 4n
网桥唯一标识符值（MAC 地址）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPRIORITY\fR\fR
.ad
.sp .6
.RS 4n
配置的优先级值；使用 \fB-p\fR 以及 \fBcreate-bridge\fR 和 \fBmodify-bridge\fR 进行设置。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBMAXAGE\fR\fR
.ad
.sp .6
.RS 4n
配置的网桥最长使用寿命；使用 \fB-m\fR 以及 \fBcreate-bridge\fR 和 \fBmodify-bridge\fR 进行设置。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBHELLOTIME\fR\fR
.ad
.sp .6
.RS 4n
配置的网桥招呼时间；使用 \fB-h\fR 以及 \fBcreate-bridge\fR 和 \fBmodify-bridge\fR 进行设置。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBFWDDELAY\fR\fR
.ad
.sp .6
.RS 4n
配置的转发延迟；使用 \fB-d\fR 以及 \fBcreate-bridge\fR 和 \fBmodify-bridge\fR 进行设置。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFORCEPROTO\fR\fR
.ad
.sp .6
.RS 4n
配置的强制最大协议；使用 \fB-f\fR 以及 \fBcreate-bridge\fR 和 \fBmodify-bridge\fR 进行设置。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTCTIME\fR\fR
.ad
.sp .6
.RS 4n
自上次更改拓扑以来所经过的时间（以秒为单位）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTCCOUNT\fR\fR
.ad
.sp .6
.RS 4n
拓扑更改的计数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTCHANGE\fR\fR
.ad
.sp .6
.RS 4n
此字段表示已检测到拓扑更改。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDESROOT\fR\fR
.ad
.sp .6
.RS 4n
根节点的网桥标识符。
.RE

.sp
.ne 2
.mk
.na
\fB\fBROOTCOST\fR\fR
.ad
.sp .6
.RS 4n
到根节点的路径的成本。
.RE

.sp
.ne 2
.mk
.na
\fB\fBROOTPORT\fR\fR
.ad
.sp .6
.RS 4n
用于访问根节点的端口号。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMAXAGE\fR\fR
.ad
.sp .6
.RS 4n
根节点的最长使用寿命值。
.RE

.sp
.ne 2
.mk
.na
\fB\fBHELLOTIME\fR\fR
.ad
.sp .6
.RS 4n
根节点的招呼时间值。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFWDDELAY\fR\fR
.ad
.sp .6
.RS 4n
根节点的转发延迟值。
.RE

.sp
.ne 2
.mk
.na
\fB\fBHOLDTIME\fR\fR
.ad
.sp .6
.RS 4n
最长 BPDU 时间间隔。
.RE

缺省情况下，如果未指定 \fB-o\fR 选项，则仅显示 \fBBRIDGE\fR、\fBADDRESS\fR、\fBPRIORITY\fR 和 \fBDESROOT\fR 字段。
.sp
如果指定了 \fB-s\fR 选项，\fBshow-bridge\fR 子命令将显示网桥统计信息。可显示下列字段：
.sp
.ne 2
.mk
.na
\fB\fBBRIDGE\fR\fR
.ad
.sp .6
.RS 4n
网桥名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDROPS\fR\fR
.ad
.sp .6
.RS 4n
因资源问题而删除的包的数目。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFORWARDS\fR\fR
.ad
.sp .6
.RS 4n
从一个链路转发到另一个链路的包的数目。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMBCAST\fR\fR
.ad
.sp .6
.RS 4n
网桥处理的多播和广播包的数目。
.RE

.sp
.ne 2
.mk
.na
\fB\fBRECV\fR\fR
.ad
.sp .6
.RS 4n
在所有附加链路上收到的包的数目。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSENT\fR\fR
.ad
.sp .6
.RS 4n
在所有附加链路上发送的包的数目。
.RE

.sp
.ne 2
.mk
.na
\fB\fBUNKNOWN\fR\fR
.ad
.sp .6
.RS 4n
处理的具有未知目标的包的数目。此类包将发送到所有链路。
.RE

缺省情况下，如果未指定 \fB-o\fR 选项，则仅显示 \fBBRIDGE\fR、\fBDROPS\fR 和 \fBFORWARDS\fR 字段。
.sp
\fBshow-bridge\fR 子命令还接受下列选项：
.sp
.ne 2
.mk
.na
\fB\fB-l\fR、\fB--link\fR\fR
.ad
.sp .6
.RS 4n
显示附加到某个网桥实例的所有链路的链路相关状态和统计信息。通过使用此选项而不使用 \fB-s\fR 选项，将显示每个链路的下列字段：
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
链路名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBINDEX\fR\fR
.ad
.sp .6
.RS 4n
网桥上的端口（链路）索引编号。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
链路的状态。此状态可以为 \fBdisabled\fR、\fBdiscarding\fR、\fBlearning\fR、\fBforwarding\fR、\fBnon-stp\fR 或 \fBbad-mtu\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBUPTIME\fR\fR
.ad
.sp .6
.RS 4n
自上次重置或初始化以来所经过的秒数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOPERCOST\fR\fR
.ad
.sp .6
.RS 4n
实际使用成本 (1-65535)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOPERP2P\fR\fR
.ad
.sp .6
.RS 4n
此选项指示是否已检测到点对点 (\fBP2P\fR) 模式。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOPEREDGE\fR\fR
.ad
.sp .6
.RS 4n
此选项指示是否已检测到边缘模式。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDESROOT\fR\fR
.ad
.sp .6
.RS 4n
此端口上显示的根网桥标识符。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDESCOST\fR\fR
.ad
.sp .6
.RS 4n
通过指定端口到达网络根节点的路径成本。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDESBRIDGE\fR\fR
.ad
.sp .6
.RS 4n
此端口的网桥标识符。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDESPORT\fR\fR
.ad
.sp .6
.RS 4n
端口的 ID 和优先级，用于传送该端口的配置消息。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTCACK\fR\fR
.ad
.sp .6
.RS 4n
此选项指示是否显示拓扑更改确认。
.RE

如果指定了 \fB-l\fR 选项，而未指定 \fB-o\fR 选项，则仅显示 \fBLINK\fR、\fBSTATE\fR、\fBUPTIME\fR 和 \fBDESROOT\fR 字段。
.sp
如果指定了 \fB-l\fR 选项，\fB-s\fR 选项可用于显示各链路的下列字段：
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
链路名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCFGBPDU\fR\fR
.ad
.sp .6
.RS 4n
收到的配置 BPDU 的数目。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTCNBPDU\fR\fR
.ad
.sp .6
.RS 4n
收到的拓扑更改 BPDU 的数目。
.RE

.sp
.ne 2
.mk
.na
\fB\fBRSTPBPDU\fR\fR
.ad
.sp .6
.RS 4n
收到的快速跨树 BPDU 的数目。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTXBPDU\fR\fR
.ad
.sp .6
.RS 4n
传送的 BPDU 的数目。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDROPS\fR\fR
.ad
.sp .6
.RS 4n
因资源问题而删除的包的数目。
.RE

.sp
.ne 2
.mk
.na
\fB\fBRECV\fR\fR
.ad
.sp .6
.RS 4n
网桥接收的包的数目。
.RE

.sp
.ne 2
.mk
.na
\fB\fBXMIT\fR\fR
.ad
.sp .6
.RS 4n
网桥发送的包的数目。
.RE

如果未指定 \fB-o\fR 选项，则仅显示 \fBLINK\fR、\fBDROPS\fR、\fBRECV\fR 和 \fBXMIT\fR 字段。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR、\fB--forwarding\fR\fR
.ad
.sp .6
.RS 4n
显示某个网桥实例的转发条目。使用此选项，可针对每个转发条目显示下列字段：
.sp
.ne 2
.mk
.na
\fB\fBDEST\fR\fR
.ad
.sp .6
.RS 4n
目标 MAC 地址。
.RE

.sp
.ne 2
.mk
.na
\fB\fBAGE\fR\fR
.ad
.sp .6
.RS 4n
条目使用寿命（以秒和毫秒为单位）。对于本地条目，则省略此字段。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFLAGS\fR\fR
.ad
.sp .6
.RS 4n
如果 MAC 地址属于附加链路或某个附加链路上的 VNIC，则会显示 \fBL\fR（本地）标志。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOUTPUT\fR（输出）\fR
.ad
.sp .6
.RS 4n
对于本地条目，这是具有 MAC 地址的附加链路的名称。否则，对于使用跨树协议的网桥，此字段即为输出接口名称。对于 RBridge，此字段为输出 \fBTRILL\fR 昵称。
.RE

如果未指定 \fB-o\fR 选项，则会显示 \fBDEST\fR、\fBAGE\fR、\fBFLAGS\fR 和 \fBOUTPUT\fR 字段。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB--trill\fR\fR
.ad
.sp .6
.RS 4n
显示某个网桥实例的 \fBTRILL\fR 昵称条目。使用此选项，可针对每个 \fBTRILL\fR 昵称条目显示下列字段：
.sp
.ne 2
.mk
.na
\fB\fBNICK\fR\fR
.ad
.sp .6
.RS 4n
此 RBridge 的 \fBTRILL\fR 昵称，该昵称是介于 1 至 65535 之间的某个数字。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFLAGS\fR\fR
.ad
.sp .6
.RS 4n
如果昵称标识本地系统，则会显示 \fBL\fR 标志。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
将消息发送到此 RBridge 时要输出的链路名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBNEXTHOP\fR\fR
.ad
.sp .6
.RS 4n
用于访问具有此昵称的 RBridge 的下一中继 RBridge 的 MAC 地址。
.RE

如果未指定 \fB-o\fR 选项，则会显示 \fBNICK\fR、\fBFLAGS\fR、\fBLINK\fR 和 \fBNEXTHOP\fR 字段。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-vlan\fR [\fB-ft\fR] [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fI ether-link\fR \fB-v\fR \fIvid\fR[,\fIpvlan-svid\fR[,\fIpvlan-type\fR]] [\fIvlan-link\fR]\fR
.ad
.sp .6
.RS 4n
使用 ID \fIvid\fR 通过以太网链路 \fIether-link\fR 创建带有标记的 VLAN 链路。此 VLAN 链路的名称可指定为 \fIvlan\fR-\fIlink\fR。该名称可以指定为区域名称/链路名称，其将在给定区域的名称空间中创建 VLAN。如果未指定此名称，则会自动生成名称（假定 \fIether-link\fR 为 \fIname\fR\fIPPA\fR）：
.sp
.in +2
.nf
<\fIname\fR><1000 * \fIvlan-tag\fR + \fIPPA\fR>
.fi
.in -2
.sp

例如，如果 \fIether-link\fR 为 \fBbge1\fR，并且 \fIvid\fR 为 2，则生成的名称为 \fBbge2001\fR。
.sp
.ne 2
.mk
.na
\fB\fB-f\fR、\fB-–force\fR\fR
.ad
.sp .6
.RS 4n
强制创建 VLAN 链路。某些设备允许的帧不过大，以致无法包括 VLAN 头。当通过此类设备创建 VLAN 链路时，需要使用 \fB-f\fR 选项，并且生成的 VLAN 上的 IP 接口的 MTU 必须设置为 1496，而不是 1500。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIether-link\fR\fR
.ad
.sp .6
.RS 4n
指定创建 VLAN 所基于的以太网链路。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
指定 VLAN 链路为临时链路。临时 VLAN 链路将持续到下一次重新引导。如果在非全局区域的名称空间中创建 VLAN，必须指定 \fB-t\fR 选项。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm modify-vlan\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-l\fR \fIether-link\fR] [\fB-v\fR \fIvid\fR[,\fIpvlan-svid\fR[,\fIpvlan-type\fR]] [\fB-f\fR]] {\fIvlan-link\fR,[\fIvlan-link\fR,...] | \fB-L\fR \fIsource-ether-link\fR}\fR
.ad
.sp .6
.RS 4n
修改指定的 VLAN 链路的底层链路和/或 VLAN-ID。VLAN 链路可以指定为逗号分隔的列表，也可以指定为 \fB-L\fR \fIsource-ether-link\fR 表示“\fIsource-ether-link\fR 上的所有 VLAN”。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
指定 VLAN 修改为临时修改。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIether-link\fR\fR
.ad
.sp .6
.RS 4n
指定要将 VLAN 移动到的以太网链路。以太网链路必须与 VLAN 当前正在使用的链路不同。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR \fIvid\fR, [\fIpvlan-svid\fR,[\fIpvlan-type\fR]] [\fB-f\fR] \fR
.ad
.sp .6
.RS 4n
指定要使用的 VLAN-ID。只有指定了单个 VLAN 链路时，才能使用此选项。\fB-f\fR 选项的用途与其在上文中的 \fBcreate-vlan\fR 中的用途相同。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-vlan\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIvlan-link \fR\fR
.ad
.sp .6
.RS 4n
删除指定的 VLAN 链路。
.sp
\fBdelete-vlan\fR 子命令接受下列选项：
.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
指定删除为临时删除。临时删除将持续到下一次重新引导。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-vlan\fR [\fB-PZ\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIvlan-link \fR]\fR
.ad
.sp .6
.RS 4n
显示所有 VLAN 链路或指定 VLAN 链路的 VLAN 配置。
.sp
\fBshow-vlan\fR 子命令接受下列选项：
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...], \fB- -output\fR=\fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
要显示的输出字段的列表，这些字段不区分大小写，并且由逗号分隔。字段名称必须是下面列出的某个字段，或者是可以显示所有字段的特殊值 \fBall\fR。对于每个 VLAN 链路，可显示下列字段：
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
VLAN 链路的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBVID\fR\fR
.ad
.sp .6
.RS 4n
与 VLAN 关联的 ID。或与 PVLAN 关联的主 VID。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSVID\fR\fR
.ad
.sp .6
.RS 4n
与 VNIC 关联的 PVLAN 辅助 VLAN ID。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPVLAN-TYPE\fR\fR
.ad
.sp .6
.RS 4n
与 VNIC 关联的 PVLAN 类型。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOVER\fR\fR
.ad
.sp .6
.RS 4n
配置此 VLAN 所基于的物理链路的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFLAGS\fR\fR
.ad
.sp .6
.RS 4n
一组与 VLAN 链路相关联的标志。可能的标志包括：
.sp
.ne 2
.mk
.na
\fB\fBf\fR\fR
.ad
.sp .6
.RS 4n
VLAN 是使用 \fBcreate-vlan\fR 的 \fB-f\fR 选项创建的。
.RE

.sp
.ne 2
.mk
.na
\fB\fBi\fR\fR
.ad
.sp .6
.RS 4n
VLAN 是在打开 DLPI 链路时隐式创建的。在最终关闭 DLPI 链路时（例如，当未检测到与 VLAN 链路关联的 IP 接口时），这些 VLAN 链路将自动删除。
.RE

将来可定义其他标志。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
使用稳定的可供计算机解析的格式显示。\fB-o\fR 选项需要与 \fB-p\fR 一起使用。请参见下文的“可解析的输出格式”。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR、\fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
显示持久性 VLAN 配置（而非正在运行的系统的状态）。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
在输出中显示 \fBZONE\fR 列。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
请参见上面 \fBdladm show-link\fR 下 \fB-z\fR 选项的说明。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm scan-wifi\fR [[\fB-p\fR] \fB- o\fR \fIfield\fR[,...]] [\fIwifi-link\fR] \fR
.ad
.sp .6
.RS 4n
在所有 \fBWiFi\fR 链路上或仅在指定 \fIwifi-link\fR 上扫描 \fBWiFi\fR 网络。
.sp
缺省情况下，当前将显示除 \fBBSSTYPE\fR 以外的所有字段。
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...], \fB- -output\fR=\fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
要显示的输出字段的列表，这些字段不区分大小写，并且由逗号分隔。字段名称必须是下面列出的某个字段，或者是可以显示所有字段的特殊值 \fBall\fR。对于找到的每个 \fBWiFi\fR 网络，可显示下列字段：
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
\fBWiFi\fR 网络所在的链路的名称。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBESSID\fR\fR
.ad
.sp .6
.RS 4n
\fBWiFi\fR 网络的 \fBESSID\fR（名称）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBSSID\fR\fR
.ad
.sp .6
.RS 4n
此字段的值为 \fBWiFi\fR 网络访问点的硬件地址（适用于 \fBBSS\fR 网络）或 \fBWiFi\fR 网络随机生成的唯一标记（适用于 \fBIBSS\fR 网络）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSEC\fR\fR
.ad
.sp .6
.RS 4n
此字段的值为 \fBnone\fR（适用于未采用任何安全机制的 \fBWiFi\fR 网络）、\fBwep\fR（适用于需要 WEP（Wired Equivalent Privacy，有线对等保密）的 \fBWiFi\fR 网络）或 \fBwpa\fR（适用于需要 WPA（Wi-Fi Protected Access，Wi-Fi 保护访问）的 WiFi 网络）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMODE\fR\fR
.ad
.sp .6
.RS 4n
支持的连接模式：\fBa\fR、\fBb\fR、\fBg\fR 或 \fBn\fR 中的一个或多个。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTRENGTH\fR\fR
.ad
.sp .6
.RS 4n
信号强度：\fBexcellent\fR、\fBvery good\fR、\fBgood\fR、\fBweak\fR 或 \fBvery weak\fR 之一。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSPEED\fR\fR
.ad
.sp .6
.RS 4n
\fBWiFi\fR 网络的最大速度（以兆位/秒为单位）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBSSTYPE\fR\fR
.ad
.sp .6
.RS 4n
此字段的值为 \fBbss\fR（适用于 \fBBSS\fR（基础结构）网络）或 \fBibss\fR（适用于 \fBIBSS\fR（即席）网络）。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
使用稳定的可供计算机解析的格式显示。\fB-o\fR 选项需要与 \fB-p\fR 一起使用。请参见下文的“可解析的输出格式”。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm connect-wifi\fR [\fB-e\fR \fI essid\fR] [\fB-i\fR \fIbssid\fR] [\fB-k\fR \fIkey\fR,...] [\fB-s\fR \fB none\fR | \fBwep\fR | \fBwpa\fR] [\fB-a\fR \fB open\fR|\fBshared\fR] [\fB-b\fR \fBbss\fR|\fB ibss\fR] [\fB-c\fR] [\fB-m\fR \fBa\fR|\fB b\fR|\fBg\fR|\fBn\fR] [\fB-T\fR \fI time\fR] [\fIwifi-link\fR]\fR
.ad
.sp .6
.RS 4n
连接到 \fBWiFi\fR 网络。这包括四个步骤：\fI搜索\fR、\fI过滤\fR、\fI区分优先级\fR和\fI关联\fR。但是，要启用到非广播 \fBWiFi\fR 网络的连接并提高性能，如果使用 \fB-e\fR 或 \fB-i\fR 选项指定 \fBBSSID\fR 或 \fBESSID\fR，则会跳过前三个步骤，并且 \fBconnect-wifi\fR 将立即尝试与符合提供的其余参数的 \fBBSSID\fR 或 \fBESSID\fR 关联。如果此关联失败，但可能存在与指定条件相符的其他网络，则会按照如下所述开始传统的搜索过程。 
.sp
搜索步骤可用于查找指定 WiFi 链路上的所有可用 \fBWiFi\fR 网络，这些网络必须处于未连接状态。为了便于管理，如果系统中只有一个 \fBWiFi\fR 链路，则可以省略 \fIwifi-link\fR。
.sp
搜索完成后，将根据下列选项的值过滤网络列表： 
.sp
.ne 2
.mk
.na
\fB\fB-e\fR \fIessid,\fR \fB- -essid\fR=\fIessid\fR\fR
.ad
.sp .6
.RS 4n
系统将过滤出没有相同 \fIessid\fR 的网络。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-b\fR \fBbss\fR|\fBibss\fR、\fB- -bsstype\fR=\fBbss\fR|\fBibss\fR\fR
.ad
.sp .6
.RS 4n
系统将过滤出没有相同 \fBbsstype\fR 的网络。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fBa\fR|\fBb\fR|\fB g\fR、\fB--mode\fR=\fBa\fR|\fBb\fR|\fB g\fR|\fBn\fR\fR
.ad
.sp .6
.RS 4n
系统将过滤出不适用于指定 802.11 模式的网络。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR \fIkey,...\fR、\fB- -key\fR=\fIkey, ...\fR\fR
.ad
.sp .6
.RS 4n
使用按键名指定的 \fBsecobj\fR 连接到网络。系统将过滤出不适用于指定键的网络。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fBnone\fR|\fBwep\fR|\fB wpa\fR、\fB--sec\fR=\fBnone\fR|\fBwep\fR|\fB wpa\fR\fR
.ad
.sp .6
.RS 4n
系统将过滤出不适用于指定安全模式的网络。
.RE

接着，系统先后根据信号强度和最大速度区分剩余网络的优先级。最后，依次尝试与列表中的每个网络关联，直到某个关联成功或没有其他剩余网络为止。 
.sp
除上面介绍的选项以外，下列选项也可以用于控制 \fBconnect-wifi\fR 的行为：
.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fBopen\fR|\fBshared\fR、\fB- -auth\fR=\fBopen\fR|\fBshared\fR\fR
.ad
.sp .6
.RS 4n
使用指定验证模式进行连接。缺省情况下，将依次尝试执行 \fBopen\fR 和 \fBshared\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR、\fB--create-ibss\fR\fR
.ad
.sp .6
.RS 4n
如果找不到与指定 \fBESSID\fR 匹配的网络，则配合使用此选项和 \fB-b ibss\fR 以创建新的即席网络。如果未指定 \fBESSID\fR，\fB-c -b ibss\fR 将始终触发系统创建新的即席网络。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fItime\fR、\fB--timeout \fR=\fItime\fR\fR
.ad
.sp .6
.RS 4n
指定关联成功需要等待的秒数。如果 \fItime\fR 为 \fBforever\fR，关联将需要无限等待。当前缺省值为 10 秒，但可能会在以后进行更改。超时短于缺省值时，可能无法确保成功。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR \fIkey,...\fR、\fB- -key\fR=\fIkey,...\fR\fR
.ad
.sp .6
.RS 4n
除上面介绍的过滤操作以外，还将使用指定键来确保关联的安全。使用的安全模式将基于键类；如果明确指定了安全模式，该模式必须与键类兼容。所有键必须属于同一类。 
.sp
对于支持多个键插槽的安全模式，放置键的插槽将由后跟有索引的冒号指定。因此，\fB-k mykey:3\fR 会将 \fBmykey\fR 放置到插槽 3 中。缺省情况下，将采用插槽 1。对于支持多个键的安全模式，可以指定以逗号分隔的列表，并将第一个键作为活动键。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm disconnect-wifi\fR [\fB-a\fR] [\fIwifi-link\fR]\fR
.ad
.sp .6
.RS 4n
断开与一个或多个 \fBWiFi\fR 网络的连接。如果 \fIwifi-link\fR 指定了已连接的 \fBWiFi\fR 链路，则会断开与此链路的连接。为了便于管理，如果仅连接一个 \fBWiFi\fR 链路，则可以省略 \fIwifi-link\fR。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR、\fB--all-links\fR\fR
.ad
.sp .6
.RS 4n
断开与连接的所有链路的连接。这主要供脚本使用。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-wifi\fR [\fB-Z\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR,...] [\fB-z\fR \fIzone\fR[,...]] [\fIwifi-link \fR]\fR
.ad
.sp .6
.RS 4n
显示所有 \fBWiFi\fR 链路或指定链路 \fIwifi-link\fR 的 \fBWiFi\fR 配置信息。
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield,...\fR、\fB- -output\fR=\fIfield\fR\fR
.ad
.sp .6
.RS 4n
要显示的输出字段的列表，这些字段不区分大小写，并且由逗号分隔。字段名称必须是下面列出的某个字段，或者是可以显示所有字段的特殊值 \fBall\fR。对于每个 \fBWiFi\fR 链路，可显示下列字段：
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
显示的链路的名称。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATUS\fR\fR
.ad
.sp .6
.RS 4n
如果链路已连接，则为 \fBconnected\fR，如果未连接，则为 \fBdisconnected\fR。如果链路已断开连接，所有其余字段的值均为 \fB--\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBESSID\fR\fR
.ad
.sp .6
.RS 4n
连接的 \fBWiFi\fR 网络的 \fBESSID\fR（名称）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBSSID\fR\fR
.ad
.sp .6
.RS 4n
此字段的值为 \fBWiFi\fR 网络访问点的硬件地址（适用于 \fBBSS\fR 网络）或 \fBWiFi\fR 网络随机生成的唯一标记（适用于 \fBIBSS\fR 网络）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSEC\fR\fR
.ad
.sp .6
.RS 4n
此字段的值为 \fBnone\fR（适用于未采用任何安全机制的 \fBWiFi\fR 网络）、\fBwep\fR（适用于需要 WEP 的 \fBWiFi\fR 网络）或 \fBwpa\fR（适用于需要 WPA 的 WiFi 网络）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMODE\fR\fR
.ad
.sp .6
.RS 4n
支持的连接模式：\fBa\fR、\fBb\fR、\fBg\fR 或 \fBn\fR 中的一个或多个。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTRENGTH\fR\fR
.ad
.sp .6
.RS 4n
连接强度：\fBexcellent\fR、\fBvery good\fR、\fBgood\fR、\fBweak\fR 或 \fBvery weak\fR 之一。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSPEED\fR\fR
.ad
.sp .6
.RS 4n
连接速度（以兆位/秒为单位）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBAUTH\fR\fR
.ad
.sp .6
.RS 4n
此字段的值为 \fBopen\fR 或 \fBshared\fR（请参见 \fBconnect-wifi\fR）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBSSTYPE\fR\fR
.ad
.sp .6
.RS 4n
此字段的值为 \fBbss\fR（适用于 \fBBSS\fR（基础结构）网络）或 \fBibss\fR（适用于 \fBIBSS\fR（即席）网络）。
.RE

缺省情况下，当前将显示除 \fBAUTH\fR、\fBBSSID\fR 和 \fBBSSTYPE\fR 以外的所有字段。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
使用稳定的可供计算机解析的格式显示。\fB-o\fR 选项需要与 \fB-p\fR 一起使用。请参见下文的“可解析的输出格式”。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
在输出中显示 \fBZONE\fR 列。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
请参见上面 \fBdladm show-link\fR 下 \fB-z\fR 选项的说明。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-ether\fR [\fB-xZ\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR,...] [\fB-z\fR \fIzone\fR[,...]] [\fB-P\fR \fI protocol\fR] [\fIether-link\fR]\fR
.ad
.sp .6
.RS 4n
显示所有物理以太网链路或指定物理以太网链路的状态信息。
.sp
\fBshow-ether\fR 子命令接受下列选项：
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR,..., \fB- -output\fR=\fIfield\fR\fR
.ad
.sp .6
.RS 4n
要显示的输出字段的列表，这些字段不区分大小写，并且由逗号分隔。字段名称必须是下面列出的某个字段，或者是可以显示所有字段的特殊值 \fBall\fR。对于每个链路，可显示下列字段：
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
显示的链路的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPTYPE\fR\fR
.ad
.sp .6
.RS 4n
参数类型，其中 \fBcurrent\fR 表示链路的协商状态，\fBcapable\fR 表示受设备支持的功能，\fBadv\fR 表示声明的功能，\fBpeeradv\fR 表示链路合作伙伴声明的功能。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
数据链路的物理链路状态。此状态可以为 up、down 或 unknown。物理链路状态指明物理设备是否连接到外部网络（如果插入了电缆，并且电缆另一端的端口的状态为 "up"，则为连接到外部网络）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBAUTO\fR\fR
.ad
.sp .6
.RS 4n
值为 \fByes\fR/\fBno\fR，指示是否声明自动协商。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSPEED-DUPLEX\fR\fR
.ad
.sp .6
.RS 4n
可用的速度和双工值的组合。速度单位使用结尾后缀 \fBG\fR (GB/s) 或 \fBM\fR (Mb/s) 进行编码。双工值以 \fBf\fR（全双工）或 \fBh\fR（半双工）的形式进行编码。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPAUSE\fR\fR
.ad
.sp .6
.RS 4n
流量控制信息。可以为 \fBno\fR（表示流量控制不可用）、\fBtx\fR（表示端点可传送暂停帧，但忽略收到的任何暂停帧）、\fBrx\fR（表示端点接收暂停帧，并根据收到的暂停帧进行操作）或 \fBbi\fR（表示双向流量控制）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBREM_FAULT\fR\fR
.ad
.sp .6
.RS 4n
故障检测信息。有效值为 \fBnone\fR 或 \fBfault\fR。
.RE

缺省情况下，将针对“current”\fBPTYPE\fR 显示除 \fBREM_FAULT\fR 以外的所有字段。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
使用稳定的可供计算机解析的格式显示。\fB-o\fR 选项需要与 \fB-p\fR 一起使用。请参见下文的“可解析的输出格式”。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fIprotocol\fR\fR
.ad
.sp .6
.RS 4n
显示有关受支持的以太网协议的信息。受支持的协议包括 \fBvdp\fR（VSI Discovery and Configuration protocol，VSI 发现和配置协议）和 \fBecp\fR（Edge Control Protocol，边界控制协议）。
.sp
VDP 信息特定于 VNIC。因此，如果 link 参数是 \fBphys-link\fR，则会显示 \fBphys-link\fR 上的所有 VNIC 的 VDP 信息。
.sp
ECP 信息特定于 \fBphys-link\fR。
.sp
对于 VDP，将显示以下信息：
.sp
.ne 2
.mk
.na
\fB\fBVSI\fR\fR
.ad
.sp .6
.RS 4n
虚拟工作站接口 (Virtual Station Interface, VSI) 或 VNIC 的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
配置此 VNIC 所基于的物理链路的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBVSI-STATE\fR\fR
.ad
.sp .6
.RS 4n
VNIC 的 VDP 协议状态机的状态。受支持的状态包括 \fBASSOC\fR、\fBDEASSOC\fR 或 \fBTIMEDOUT\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBVSIID\fR\fR
.ad
.sp .6
.RS 4n
VSI 或 VNIC 的标识符。网桥使用此标识符将属性与 VNIC 相关联。受支持的 VSIID 格式是 MAC 地址。因此，VNIC 的 VSIID 就是其 MAC 地址。
.RE

.sp
.ne 2
.mk
.na
\fB\fBVSI-TYPEID\fR\fR
.ad
.sp .6
.RS 4n
这是与 VNIC 关联的 VSI 类型 ID 和版本，其格式为“VSI 类型 ID/版本”。VSI 类型标识与 VNIC 关联的属性。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCMD-PENDING\fR\fR
.ad
.sp .6
.RS 4n
当前正在进行的 VDP 命令。受支持的命令有：\fBASSOC\fR、\fBDEASSOC\fR。\fBASSOC\fR 命令请求网桥将属性与 VSI（由 VSIID 予以标识）相关联，而 \fBDEASSOC\fR 请求网桥取消属性与给定 VSIID 的关联。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFILTER-INFO\fR\fR
.ad
.sp .6
.RS 4n
交换机用来为给定 VNIC 过滤包的信息。受支持的过滤器信息格式包括 MAC/VLAN ID 组合。因此，VNIC 的 \fBFilterInfo\fR 就是其 MAC 地址和 VLAN ID（如果有）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBKEEPALIVE-INTERVAL\fR\fR
.ad
.sp .6
.RS 4n
要为现有关联传输的 Keep Alive 消息的时间间隔（以秒为单位）。缺省值是 11.6 秒。
.RE

.sp
.ne 2
.mk
.na
\fB\fBRESP-TIMEOUT\fR\fR
.ad
.sp .6
.RS 4n
在请求超时之前等待来自网桥的响应的时间（以秒为单位）。
.RE

对于 ECP，将显示以下信息：
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
ECP 实例的物理链路的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMAC-RETRIES\fR\fR
.ad
.sp .6
.RS 4n
未收到来自对等方的确认时的最大传输重试次数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTIMEOUT\fR\fR
.ad
.sp .6
.RS 4n
等待来自对等方的确认的时间间隔（以毫秒为单位）。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR, \fB--extended\fR\fR
.ad
.sp .6
.RS 4n
针对 \fBPTYPE\fR 值 \fBcurrent\fR、\fBcapable\fR、\fBadv\fR 和 \fBpeeradv\fR 显示扩展输出。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
在输出中显示 \fBZONE\fR 列。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
请参见上面 \fBdladm show-link\fR 下 \fB-z\fR 选项的说明。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm set-linkprop\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-p\fR \fI prop\fR=\fIvalue\fR[,...] \fIlink\fR\fR
.ad
.sp .6
.RS 4n
在指定链路上设置一个或多个属性的值。属性及其可能的值的列表取决于链路类型、网络设备驱动程序和联网硬件。这些属性可使用 \fBshow-linkprop\fR 进行检索。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
指定更改为临时更改。临时更改将持续到下一次重新引导。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIprop\fR=\fI value\fR[,...], \fB--prop\fR \fIprop\fR=\fI value\fR[,...]\fR
.ad
.br
.na
\fB\fR
.ad
.sp .6
.RS 4n
要设置为指定值的属性的逗号分隔列表。
.RE

请注意，如果设置了持久性值，临时值将更改为相同值。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm reset-linkprop\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-p\fR \fI prop\fR,...] \fIlink\fR\fR
.ad
.sp .6
.RS 4n
在指定链路上将一个或多个属性重置为其相应值。这些属性将重置为启动时所设置的值。如果未指定属性，则重置所有属性。有关属性说明，请参见 \fBshow-linkprop\fR。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
指定重置为临时重置。将值重置为缺省值。临时重置将持续到下一次重新引导。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIprop, ...\fR、\fB- –prop\fR=\fIprop, ...\fR\fR
.ad
.sp .6
.RS 4n
要重置的属性的逗号分隔列表。
.RE

请注意，如果重置了持久性值，临时值将更改为相同值。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-linkprop\fR [\fB-HPZ\fR] [[\fB-c\fR] \fB-o\fR \fIfield\fR[,...]][\fB- p\fR \fIprop\fR[,...]] [\fB-z\fR \fI zone\fR[,...]] [\fIlink\fR]\fR
.ad
.sp .6
.RS 4n
显示所有数据链路或指定链路的一个或多个属性的当前值或持久性值。缺省情况下，将显示当前值。如果未指定任何属性，则显示所有可用的链路属性。对于每个属性，将显示下列字段：
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...], \fB- -output\fR=\fIfield\fR\fR
.ad
.sp .6
.RS 4n
要显示的输出字段的列表，这些字段不区分大小写，并且由逗号分隔。字段名称必须是下面列出的某个字段，或者是可以显示所有字段的特殊值 \fBall\fR。对于每个链路，可显示下列字段：
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
数据链路的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPROPERTY\fR\fR
.ad
.sp .6
.RS 4n
属性的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPERM\fR\fR
.ad
.sp .6
.RS 4n
属性的读/写权限。显示的值为 \fBro\fR 或 \fBrw\fR 之一。
.RE

.sp
.ne 2
.mk
.na
\fB\fBVALUE\fR\fR
.ad
.sp .6
.RS 4n
当前（或持久性）属性值。如果未设置此值，此值将显示为 \fB--\fR。在未知情况下，此值将显示为 \fB?\fR。尚未设置或尚未重置的持久性值将显示为 \fB--\fR，并且将使用系统的 \fBDEFAULT\fR 值（如果有）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBEFFECTIVE\fR\fR
.ad
.sp .6
.RS 4n
系统选择的属性值。对于某些属性，系统选择的值可能与用户配置的值不同。这是因为属性值受资源可用性、底层物理数据链路功能或者（某些情况下）数据链路合作伙伴的限制。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDEFAULT\fR\fR
.ad
.sp .6
.RS 4n
属性的缺省值。如果属性没有缺省值，则显示 \fB--\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPOSSIBLE\fR\fR
.ad
.sp .6
.RS 4n
属性可具有的值的逗号分隔列表。如果这些值在某个数字范围中，则可以显示简写形式 \fImin\fR - \fImax\fR。如果可能的值未知或无限制，则显示 \fB--\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBHWPOSSIBLE\fR\fR
.ad
.sp .6
.RS 4n
如果存在硬件支持则显示值。这说明物理 NIC 支持该属性。值为 \fB--\fR 表示不支持。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSWPOSSIBLE\fR\fR
.ad
.sp .6
.RS 4n
如果属性的网络栈中存在软件支持，则显示值。值为 \fB--\fR 表示不支持。
.sp
对于 \fBHWPOSSIBLE\fR 和 \fBSWPOSSIBLE\fR，值的任何粒度要求（步长值）显示在数字范围后，后跟 \fB:\fR。当前，仅 \fBmaxbw\fR 属性显示步长值的值。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMODE\fR\fR
.ad
.sp .6
.RS 4n
显示用于数据链路以实现属性的当前模式。可能值或 \fBsw\fR 表示仅软件、\fBhw\fR 表示仅硬件、\fBnone\fR 表示不支持该链路。请注意，即使存在硬件或软件支持，\fBMODE\fR 也可以是 \fBnone\fR。
.RE

\fBHWFLAGS\fR 和 \fBSWFLAGS\fR 当前显示标志 \fBo\fR（表示传出）、\fBi\fR（表示传入）以及 \fBoi\fR（表示传入和传出）。当前，它仅显示 \fBSLA properties\fR、\fBmaxbw\fR、\fBbwshare\fR 和 \fBpriority\fR 的值。
.sp
属性列表取决于链路类型和网络设备驱动程序，其他给定属性的可用值取决于底层网络硬件及其状态。“常规链路属性”部分中记录了一些常规链路属性。但是，以“\fB_\fR”（下条）开头的链路属性特定于给定链路或其底层网络设备，并可进行更改或删除操作。有关详细信息，请参见相应的网络设备驱动程序手册页。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR、\fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
使用稳定的可供计算机解析的格式显示。\fB-o\fR 选项需要与此选项一起使用。请参见下文的“可解析的输出格式”。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR\fR
.ad
.sp .6
.RS 4n
Show-linkprop \fB-H\fR 显示有关支持该属性的底层物理链路能力和网络栈软件能力的信息。同时，显示当前用于数据链路的模式。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR、\fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
显示持久性链路属性信息
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIprop, ...\fR、\fB- -prop\fR=\fIprop, ...\fR\fR
.ad
.sp .6
.RS 4n
要显示的属性的逗号分隔列表。请参见子命令说明后面的链路属性部分。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
在输出中显示 \fBZONE\fR 列。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
请参见上面 \fBdladm show-link\fR 下 \fB-z\fR 选项的说明。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-secobj\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-f\fR \fI file\fR] \fB-c\fR \fIclass\fR \fI secobj\fR\fR
.ad
.sp .6
.RS 4n
在指定 \fIclass\fR 中创建一个名为 \fIsecobj\fR 的安全对象，以便在稍后连接到加密网络时用作 WEP 或 WPA 密钥。安全对象的值可以通过交互方式提供，也可以从文件中读取。交互式提示的序列及文件格式取决于安全对象的类。 
.sp
目前支持 \fBwep\fR 和 \fBwpa\fR 类。\fBWEP\fR（Wired Equivalent Privacy，有线对等保密）密钥的长度可以为 5 或 13 个字节。它可以作为 \fBASCII\fR 或十六进制字符串提供，因此，\fB12345\fR 和 \fB0x3132333435\fR 是等效的 5 字节密钥（可以省略 \fB0x\fR 前缀）。含有 \fBWEP\fR 密钥的文件必须包括一个使用 \fBWEP\fR 密钥格式的行。WPA（Wi-Fi Protected Access，Wi-Fi 保护访问）密钥必须作为 ASCII 字符串提供，并且其长度介于 8 至 63 个字节之间。
.sp
此子命令只能由“网络链路安全”\fBRBAC\fR 配置文件包含的用户或角色使用。
.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIclass\fR、\fB- -class\fR=\fIclass\fR\fR
.ad
.sp .6
.RS 4n
\fIclass\fR 可以为 \fBwep\fR 或 \fBwpa\fR。请参见前面的讨论。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
指定创建为临时创建。临时创建将持续到下一次重新引导。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIfile\fR、\fB--file \fR=\fIfile\fR\fR
.ad
.sp .6
.RS 4n
指定应当用于获取安全对象的值的文件。此文件的格式取决于安全对象类。有关使用此选项设置 \fBWEP\fR 密钥的示例，请参见\fB\fR“示例”部分。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-secobj\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIsecobj\fR[,...] \fR
.ad
.sp .6
.RS 4n
删除一个或多个指定的安全对象。此子命令只能由“网络链路安全”\fBRBAC\fR 配置文件包含的用户或角色使用。 
.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
指定删除为临时删除。临时删除将持续到下一次重新引导。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-secobj\fR [\fB-P\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fIsecobj\fR,...]\fR
.ad
.sp .6
.RS 4n
显示当前或持久性安全对象信息。如果指定了一个或多个安全对象，则会显示每个安全对象的信息，否则显示所有当前或持久性安全对象。
.sp
缺省情况下将显示当前安全对象，所有这些安全对象都是以持久方式创建的不会临时删除的对象，或者是临时创建的对象。
.sp
出于安全原因，无法显示安全对象的值。 
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...]、\fB--output\fR=\fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
要显示的输出字段的列表，这些字段不区分大小写，并且由逗号分隔。字段名称必须为下面列出的字段之一。对于显示的安全对象，可以显示下列字段：
.sp
.ne 2
.mk
.na
\fB\fBOBJECT\fR\fR
.ad
.sp .6
.RS 4n
安全对象的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBCLASS\fR\fR
.ad
.sp .6
.RS 4n
安全对象的类。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
使用稳定的可供计算机解析的格式显示。\fB-o\fR 选项需要与 \fB-p\fR 一起使用。请参见下文的“可解析的输出格式”。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR、\fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
显示持久性安全对象信息
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-vnic\fR [\fB-t\fR] [\fB-f\fR] \fB- l\fR \fIlink\fR [\fB-R\fR \fIroot-dir \fR] [\fB-m\fR \fIvalue\fR | auto | {factory [\fB-n\fR \fIslot-identifier\fR]} | {vrrp \fB-A\fR {inet | inet6} \fB-V\fR \fIvrid\fR} | {random [\fB-r\fR \fIprefix\fR]}] [\fB-v\fR \fI vlan-id\fR] [\fB-P\fR \fIpkey\fR] [\fB-p\fR prop=value[,...]] \fIvnic-link\fR\fR
.ad
.sp .6
.RS 4n
在指定链路上创建名为 \fIvnic-link\fR 的 VNIC。\fIvnic-link\fR 可以指定为区域名称/链路名称，其将在给定区域的名称空间中创建 VNIC。 
.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB-–temporary\fR\fR
.ad
.sp .6
.RS 4n
指定 VNIC 为临时 VNIC。临时 VNIC 将持续到下一次重新引导。如果在非全局区域的名称空间中创建 VNIC，必须指定 \fB-t\fR 选项。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR、\fB--force\fR\fR
.ad
.sp .6
.RS 4n
如果 VNIC 是一个 IPoIB VNIC，则会强制创建 VNIC，即使端口上缺少 \fIpkey\fR、缺少多播组或此端口已关闭也是如此。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- –root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIlink\fR、\fB-–link \fR=\fIlink\fR\fR
.ad
.sp .6
.RS 4n
\fIlink\fR 可以为物理链接、\fBetherstub\fR 或聚合链接 (\fIaggr-link\fR)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fIvalue\fR | \fI keyword\fR、\fB-–mac-address\fR=\fIvalue\fR | \fI keyword\fR\fR
.ad
.sp .6
.RS 4n
此选项仅适用于以太网 VNIC。
.sp
根据指定值或关键字设置 VNIC 的 MAC 地址。如果 \fIvalue\fR 不是关键字，则将其解释为单点传送 MAC 地址，该地址必须对底层 NIC 有效。用户指定的 MAC 地址必须位于由“全局唯一”和“本地管理”类型的 MAC 地址指定的范围内。
.sp
可使用下列特殊关键字：
.sp
.ne 2
.mk
.na
\fBfactory [\fB-n\fR \fIslot-identifier\fR]、\fR
.ad
.br
.na
\fBfactory [\fB-–slot\fR=\fIslot-identifier\fR]\fR
.ad
.sp .6
.RS 4n
为 VNIC 分配出厂 MAC 地址。当请求出厂 MAC 地址时，可以配合使用 \fB-m\fR 和 \fB-n\fR 选项，以便指定要使用的 MAC 地址插槽。如果未指定 \fB-n\fR，系统将选择下一个可用的出厂 MAC 地址。\fBshow-phys\fR 子命令的 \fB-m\fR 选项可用于显示出厂 MAC 地址及其插槽标识符和可用性的列表。
.RE

.sp
.ne 2
.mk
.na
\fB\fR
.ad
.br
.na
\fB\fBrandom\fR [\fB-r\fR \fIprefix\fR]、\fR
.ad
.br
.na
\fBrandom [\fB-–mac-prefix\fR=\fIprefix\fR]\fR
.ad
.sp .6
.RS 4n
为 VNIC 分配随机 MAC 地址。将使用缺省前缀，该前缀包含有效 IEEE OUI，并设置了本地位。该前缀可使用 \fB-r\fR 选项进行覆盖。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvrrp\fR \fB-A\fR {\fBinet\fR | \fB inet6\fR} \fB-V\fR \fIvrid\fR\fR
.ad
.sp .6
.RS 4n
根据指定的地址族和 \fIvrid\fR 为 VNIC 分配 VRRP 虚拟 MAC 地址。
.RE

.sp
.ne 2
.mk
.na
\fB\fBauto\fR\fR
.ad
.sp .6
.RS 4n
首先尝试并使用出厂 MAC 地址。如果该地址不可用，则分配随机 MAC 地址。如果未指定 \fB-m\fR 选项，则缺省操作为 \fBauto\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR \fIvlan-id\fR\fR
.ad
.sp .6
.RS 4n
此选项仅适用于以太网 VNIC。
.sp
针对此 VNIC 启用 VLAN 标记。VLAN 标记的 ID 将为 \fIvlan-id\fR。
.LP
注 - 
.sp
.RS 2
如果恰好在 Infiniband 网关交换机的 \fBdisallowhostconfig\fR 或 \fBallowhostconfig\fR 命令后执行，则在创建基于 EoIB (Ethernet-over-Infiniband) 的 vNIC 数据链路时，\fBdladm create-vnic\fR 可能会失败。这些命令将重新启动网关上的网桥管理器，在网关与主机之间触发一系列异步事件。需要花费一些时间才能完成这些事件，主机过早生成的 vNIC 创建请求会被拒绝。
.LP
为避免此情况，请等待 \fBdisallowhostconfig\fR 或 \fBallowhostconfig\fR 命令返回，然后再执行 \fBcreate-vnic\fR 命令。
.RE
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR、\fB--pkey=pkey\fR\fR
.ad
.sp .6
.RS 4n
要使用的分区键。此选项对于 IPoIB VNIC 是强制性的，并且不适用于其他类型的链路。指定的 \fIpkey\fR 始终会被视为十六进制，无论它是否具有 0x 前缀。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIprop\fR=\fI value\fR,..., \fB-–prop\fR \fIprop\fR=\fI value\fR,...\fR
.ad
.sp .6
.RS 4n
要设置为指定值的属性的逗号分隔列表。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fR
.ad
.br
.na
\fB\fBdladm create-vnic\fR \fB-t\fR \fB-c\fR <\fIevsname\fR>[/<\fIvportname\fR>] [\fB-T\fR <\fItenant\fR>] <\fIvnic-link\fR>\fR
.ad
.sp .6
.RS 4n
.LP
注 - 
.sp
.RS 2
必须安装弹性虚拟交换机 (Elastic Virtual Switch, EVS) IPS 软件包，才能使用此格式的 \fBcreate-vnic\fR，然后配置 EVS 控制器，如 \fBevsadm\fR(1M) 手册页和\fI《Managing Network Virtualization and Network Resources in Oracle Solaris 11.3》\fR中所述。 
.RE
通过连接到位于提供的虚拟端口 (Virtual Port, VPort) \fIvportname\fR（可选）的 EVS \fIevsname\fR，创建名为 \fIvnic-link\fR 的 VNIC。如果提供了 \fItenantname\fR，则会在 tenant 的名称空间中搜索 EVS。如果指定了 VPort，则 VNIC 会继承 VPort 的 SLA 属性（\fBmaxbw\fR、\fBcos\fR 和 \fBpriority\fR）、IP 地址以及 MAC 地址。如果未指定 VPort，则 EVS 控制器会生成一个系统 VPort（该端口具有 EVS 的 IP 地址、MAC 地址和缺省 SLA 属性），然后将 VNIC 连接到此系统 VPort。
.sp
连接到 EVS 时 VNIC 具有以下限制（\fBdladm\fR 可以对其进行的管理）：
.RS +4
.TP
.ie t \(bu
.el o
不能通过 \fBdladm rename-link\fR 对其进行重命名
.RE
.RS +4
.TP
.ie t \(bu
.el o
不能使用 \fBdladm set-linkrop\fR 或 \fBdladm reset-linkprop\fR 更改其属性
.RE
.RS +4
.TP
.ie t \(bu
.el o
不能使用 \fBdladm modify-vnic\fR 对其进行修改
.RE
有关 EVS、VPort 和 tenant 的更多信息，请参见 \fBevsadm\fR(1M) 手册页。
.sp
创建的 VNIC 是临时的，下次重新引导时即会丢失。有关示例用法，请参见下文的“示例”部分。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
指定 VNIC 为临时 VNIC。此选项是必需的。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR <\fItenantname\fR>, \fB--tenant\fR <\fItenantname\fR>\fR
.ad
.sp .6
.RS 4n
指定拥有 EVS 的 tenant 的名称。如果未提供，将采用缺省的 tenant \fBsys-global\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR <\fIevsname\fR>[/<\fIvportname\fR>], \fB--connect\fR <\fIevsname\fR>[/\fIvportname\fR]\fR
.ad
.sp .6
.RS 4n
指定必须要将 VNIC 连接到的 EVS 的名称。如果提供了 \fIvportname\fR，则会将 VNIC 连接到该 vport。如果未提供 \fIvportname\fR，将自动生成一个 vport 并将其分配给 VNIC。
.sp
将 VNIC 连接到 EVS 的操作会导致 VNIC 继承 EVS 或提供的 vport 中的属性。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fR
.ad
.br
.na
\fB\fBdladm modify-vnic\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] [\fB-l\fR \fI link\fR] [\fB-m\fR \fIvalue\fR | auto | {factory [\fB-n\fR \fIslot-identifier\fR]} | {vrrp \fB-A\fR {inet | inet6} \fB-V\fR \fIvrid\fR} | {random [\fB-r\fR \fIprefix\fR]}] [\fB-v\fR \fI vlan-id\fR] {\fIvnic-link\fR,[\fIvnic-link \fR,...] | \fB-L\fR \fIsource-link\fR}\fR
.ad
.sp .6
.RS 4n
修改指定 VNIC 链路的底层链路和/或 MAC 地址/VLAN-ID。VNIC 链路可以指定为逗号分隔的列表，或者指定为 \fB-L\fR \fIsource-link\fR 表示“source-link 上的所有 VNIC”。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
指定 VNIC 修改为临时修改。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIlink\fR、\fB-link \fR=\fIlink\fR\fR
.ad
.sp .6
.RS 4n
指定要将 VNIC 转移到的链路。\fIlink\fR 可以是 \fBcreate-vnic\fR 支持的任何链路类型。\fIlink\fR 必须与 VNIC 当前正在使用的链路不同。如果 VNIC 使用的是出厂 MAC 地址且未指定 \fB-m\fR，则会在目标链路上分配新的 MAC 地址（使用 \fB-m\fR \fIauto\fR 方案）并将其分配到 VNIC。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fIvalue\fR | \fI keyword\fR、\fB--mac-address\fR=\fIvalue\fR | \fI keyword\fR\fR
.ad
.sp .6
.RS 4n
此选项仅适用于以太网 VNIC。
.sp
有关受支持选项的信息，请参见上文中的 \fBcreate-vnic\fR。如果指定了多个 VNIC，则只有 \fBauto\fR、\fBrandom\fR 和 \fBfactory\fR（没有 \fB-n\fR）地址分配方案受支持。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-vnic\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIvnic-link\fR\fR
.ad
.sp .6
.RS 4n
删除指定 VNIC。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB-–temporary\fR\fR
.ad
.sp .6
.RS 4n
指定删除为临时删除。临时删除将持续到下一次重新引导。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- –root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-vnic\fR [\fB-P\fR | {\fB-z\fR \fIzone\fR[,..]}] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,..]] [\fB-l\fR \fIlink\fR] [\fIvnic-link\fR]\fR
.ad
.br
.na
\fB\fBshow-vnic\fR [\fB-Zmv\fR] [\fB-l\fR \fIlink\fR] [\fIvnic-link\fR]\fR
.ad
.sp .6
.RS 4n
显示所有 VNIC 或某个链路上的所有 VNIC 的 VNIC 配置信息，或者仅显示指定 \fIvnic-link\fR 的 VNIC 配置信息。
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...]、\fB--output\fR=\fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
要显示的输出字段的列表，这些字段不区分大小写，并且由逗号分隔。字段名称必须是下面列出的某个字段，或者是可以显示所有字段的特殊值 \fBall\fR。缺省情况下（无 \fB-o\fR），\fBshow-vnic\fR 会显示所有字段。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
VNIC 的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOVER\fR\fR
.ad
.sp .6
.RS 4n
配置此 VNIC 所基于的物理链路的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSPEED\fR\fR
.ad
.sp .6
.RS 4n
VNIC 的最大速度（以兆位/秒为单位）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMACADDRESS\fR\fR
.ad
.sp .6
.RS 4n
VNIC 的 MAC 地址。
.sp
对于 IPoIB VNIC，缺省情况下（不使用 \fB-o\fR 时）将显示 MAC 地址的前五个字节，在第六个字节的位置中将显示 ".."。要显示完整的 MAC 地址，请使用 \fB-o\fR 选项。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMACADDRESSES\fR\fR
.ad
.sp .6
.RS 4n
如果 VNIC 关联了多个 MAC 地址，则此列会显示 VNIC 的所有 MAC 地址。
.sp
对于 IPoIB VNIC，缺省情况下（不使用 \fB-o\fR 时）将显示 MAC 地址的前五个字节，在第六个字节的位置中将显示 ".."。要显示完整的 MAC 地址，请使用 \fB-o\fR 选项。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMACADDRTYPE\fR\fR
.ad
.sp .6
.RS 4n
VNIC 的 MAC 地址类型。\fBdladm\fR 可区分下列 MAC 地址类型：
.sp
.ne 2
.mk
.na
\fB\fBrandom（随机）\fR\fR
.ad
.sp .6
.RS 4n
为 VNIC 分配的随机地址。
.RE

.sp
.ne 2
.mk
.na
\fB\fBfactory（出厂）\fR\fR
.ad
.sp .6
.RS 4n
VNIC 使用的出厂 MAC 地址。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBMACADDRTYPES\fR\fR
.ad
.sp .6
.RS 4n
如果 VNIC 关联了多个 MAC 地址，则此列会显示每个 MAC 地址的 MAC 地址类型。
.RE

.sp
.ne 2
.mk
.na
\fB\fBVID\fR\fR
.ad
.sp .6
.RS 4n
与 VNIC 关联的 VLAN ID。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSVID\fR\fR
.ad
.sp .6
.RS 4n
与 VNIC 关联的辅助 VLAN ID。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPVLAN-TYPE\fR\fR
.ad
.sp .6
.RS 4n
与 VNIC 关联的 PVLAN 类型。
.RE

.sp
.ne 2
.mk
.na
\fB\fBVIDS\fR\fR
.ad
.sp .6
.RS 4n
如果 VNIC 关联了多个 VLAN ID，则此列会显示所有 VLAN ID。
.RE

.sp
.ne 2
.mk
.na
\fB\fBEVS\fR\fR
.ad
.sp .6
.RS 4n
要将 VNIC 连接到的 EVS 的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBVPORT\fR\fR
.ad
.sp .6
.RS 4n
要将 VNIC 连接到并继承其属性的 vport 的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTENANT\fR\fR
.ad
.sp .6
.RS 4n
拥有 EVS 的 tenant 的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPKEY\fR\fR
.ad
.sp .6
.RS 4n
与 VNIC 关联的 IB 分区键。仅适用于 IPoIB 数据链路。
.RE

.sp
.ne 2
.mk
.na
\fB\fBIDS\fR\fR
.ad
.sp .6
.RS 4n
分别以 "VID:<value>" 和 "PKEY:<value>" 格式显示以太网数据链路的 VIDS 和 IPoIB 数据链路的 PKEY。
.RE

有关 \fBEVS\fR、\fBVPORT\fR 和 \fBTENANT\fR 的更多信息，请参见上文的 \fBcreate-vnic\fR 部分。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
使用稳定的可供计算机解析的格式显示。\fB-o\fR 选项需要与 \fB-p\fR 一起使用。请参见下文的“可解析的输出格式”。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR、\fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
显示持久性 VNIC 配置。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIlink\fR、\fB-–link \fR=\fIlink\fR\fR
.ad
.sp .6
.RS 4n
显示指定链路上的所有 VNIC 的信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
在输出中显示 \fBZONE\fR 列。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR\fR
.ad
.sp .6
.RS 4n
显示 VNIC 的 SR-IOV 信息。输出显示如下：
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.RS 15n
.rt  
VNIC 的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBVF_ASSIGNED\fR\fR
.ad
.RS 15n
.rt  
当前分配给 VNIC 的 VF 设备实例的名称。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
请参见上面 \fBdladm show-link\fR 下 \fB-z\fR 选项的说明。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.sp .6
.RS 4n
显示给定 VNIC 的 EVS 信息。这是以下字段的快捷方式：\fBLINK\fR、\fBTENANT\fR、\fBEVS\fR、\fBVPORT\fR、\fBOVER\fR、\fBMACADDRESS\fR、\fBVIDS\fR。
.sp
有关更多信息，请参见上文的 \fBcreate-vnic\fR 部分。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.sp .6
.RS 4n
显示与 VNIC 关联的所有 MAC 地址、MAC 地址类型和 VLAN ID。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
显示与 VNIC 关联的所有 VLAN 信息。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-part\fR [\fB-t\fR] [\fB-f\fR] [\fB-R\fR \fIroot-dir\fR] \fB- l\fR \fIib-link\fR [\fB-p\fR \fIprop \fR=\fIvalue\fR[,..]] \fB-P\fR \fI pkey\fR \fIpart-link\fR\fR
.ad
.sp .6
.RS 4n
在指定链路上创建名为 \fIpart-link\fR 的 IP-over-IB 链路。仅在 InfiniBand 物理链路上支持此子命令。\fIpart-link\fR 可以指定为区域名称/链路名称，其将在给定区域的名称空间中创建分区链路。 
.sp
.ne 2
.mk
.na
\fB\fB-f\fR、\fB--force\fR\fR
.ad
.sp .6
.RS 4n
强制创建分区链路，即使端口上缺少 \fIpkey\fR、缺少多播组或此端口已关闭。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIib-link\fR、\fB- -link\fR=\fIib-link\fR\fR
.ad
.sp .6
.RS 4n
IP-over-IB 物理链路名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR、\fB--pkey\fR=\fIpkey\fR\fR
.ad
.sp .6
.RS 4n
用于创建分区链路的分区密钥。指定的 \fIpkey\fR 将始终视为十六进制密钥，而不管它是否具有 \fB0x\fR 前缀。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIprop\fR=\fI value\fR[,..]\fR
.ad
.br
.na
\fB\fB--prop\fR \fIprop\fR=\fI value\fR[,..]\fR
.ad
.sp .6
.RS 4n
要设置为指定值的属性的逗号分隔列表。下面的“常规链路属性”部分中提供了支持的属性。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
指定分区链路创建为临时分区链路创建。临时分区链路将持续到下一次重新引导。如果在非全局区域的名称空间中创建分区链路，必须指定 \fB-t\fR 选项。 
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-part\fR [\fB-R\fR \fI root-dir\fR] \fIpart-link\fR\fR
.ad
.sp .6
.RS 4n
删除指定的分区链路。
.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
指定分区链路删除为临时分区链路删除。临时删除将持续到下一次重新引导。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-part\fR [\fB-pP\fR] [\fB-l\fR \fIib-link\fR] [\fB-o\fR \fI field\fR[,...]] [\fIpart-link\fR]\fR
.ad
.sp .6
.RS 4n
显示所有分区链路或 \fIib-link\fR 上的所有分区的 IB 分区链路信息，或者仅显示指定 \fIpart-link\fR 的 IB 分区链路信息。
.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIib-link\fR、\fB- -link\fR=\fIib-link\fR\fR
.ad
.sp .6
.RS 4n
显示指定链路上的所有分区的信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
要显示的输出字段的列表，这些字段不区分大小写，并且由逗号分隔。字段名称必须是下面列出的某个字段，或者是可以显示所有字段的特殊值 \fBall\fR。缺省情况下（无 \fB-o\fR），\fBshow-part\fR 会显示所有字段。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
分区链路的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPKEY\fR\fR
.ad
.sp .6
.RS 4n
与分区链路关联的 \fBPkey\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOVER\fR\fR
.ad
.sp .6
.RS 4n
创建此分区链路所基于的物理链路的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
分区链路的当前状态。可能的值包括：\fBup\fR、\fBdown\fR 或 \fBunknown\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFLAGS\fR\fR
.ad
.sp .6
.RS 4n
用于创建分区链路的一组状态标志。可能的值为：
.sp
.ne 2
.mk
.na
\fB\fBf\fR\fR
.ad
.RS 5n
.rt  
已强制创建分区（未检查是否可以创建分区）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBt\fR\fR
.ad
.RS 5n
.rt  
分区链路为临时链路，仅持续到下一次重新引导。
.RE

.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR、\fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
显示持久性 IB 分区链路配置。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
使用稳定的可供计算机解析的格式显示。\fB-o\fR 选项需要与 \fB-p\fR 一起使用。请参见下文的“可解析的输出格式”。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-ib\fR [\fB-pP\fR] [\fB-o\fR \fIfield\fR[,...]] [\fIib-link \fR]\fR
.ad
.sp .6
.RS 4n
显示所有或指定 IB 链路上的 IB 物理链路信息。
.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
要显示的输出字段的列表，这些字段不区分大小写，并且由逗号分隔。字段名称必须是下面列出的某个字段，或者是可以显示所有字段的特殊值 \fBall\fR。缺省情况下（无 \fB-o\fR），\fBshow-ib\fR 会显示除 \fBHCA\fR、\fBGWID\fR 和 \fBGWFLAGS\fR 之外的所有字段。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
物理链路的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBHCA\fR\fR
.ad
.sp .6
.RS 4n
Infiniband 主机通道适配器 (Infiniband Host Channel Adapter, HCA) 名称，由 \fBibadm\fR(1M) 实用程序管理。
.RE

.sp
.ne 2
.mk
.na
\fB\fBHCAGUID\fR\fR
.ad
.sp .6
.RS 4n
HCA 的全局唯一标识符。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPORTGUID\fR\fR
.ad
.sp .6
.RS 4n
端口的全局唯一标识符。如果未设置 \fBPORTGUID\fR，其显示为未知。对于 IB SR-IOV 虚拟适配器，在链路启动时设置 \fBPORTGUID\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPORT\fR\fR
.ad
.sp .6
.RS 4n
端口号。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTATE\fR\fR
.ad
.sp .6
.RS 4n
物理链路的当前状态。可能的值包括：\fBup\fR、\fBdown\fR 或 \fBunknown\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBGWNAME\fR\fR
.ad
.sp .6
.RS 4n
在此 IB 物理链路中发现的 IB-Ethernet 网关开关的已配置系统名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBGWPORT\fR\fR
.ad
.sp .6
.RS 4n
与网关以太网端口关联的连接器的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBGWID\fR\fR
.ad
.sp .6
.RS 4n
与显示的网关以太网端口关联的网关实例的标识符。该值应该是唯一的，即使多个网关开关共享同一 InfiniBand 光纤网络也是如此。网关实例标识符的值范围是 0 到 1023。
.RE

.sp
.ne 2
.mk
.na
\fB\fBGWFLAGS\fR\fR
.ad
.sp .6
.RS 4n
一组与发现的网关相关联的标志。可能的标志包括：
.sp
.ne 2
.mk
.na
\fBa\fR
.ad
.RS 5n
.rt  
网关指示了其可用于从其通告中的此 IB 端口登录。
.RE

.sp
.ne 2
.mk
.na
\fBH\fR
.ad
.RS 5n
.rt  
网关允许使用此 IB 端口的主机管理的 VNIC。
.RE

.sp
.ne 2
.mk
.na
\fBn\fR
.ad
.RS 5n
.rt  
网关至少为此 IB 端口的 EoIB 数据链路分配了一个 macaddress。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBPKEYS\fR\fR
.ad
.sp .6
.RS 4n
与 \fBLINK\fR 字段中指定的 IP-over-IB 链路相关联的端口上的可用 \fBPkey\fR。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR、\fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
显示持久性 IB 物理链路配置。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
使用稳定的可供计算机解析的格式显示。\fB-o\fR 选项需要与 \fB-p\fR 一起使用。请参见下文的“可解析的输出格式”。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-eoib\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-l\fR \fI ib-link\fR \fB-g\fR \fIgw-system-name\fR \fB- c\fR \fIgw-eth-port\fR \fIeoib-link\fR\fR
.ad
.sp .6
.RS 4n
通过指定链路使用名称 eoib-link 创建 EoIB 链路。仅在 InfiniBand 物理链路上支持此子命令。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB-—temporary\fR\fR
.ad
.sp .6
.RS 4n
指定 EoIB 链路创建为临时 EoIB 链路创建。临时链路将持续到下一次重新引导。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB--root-dir=root-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIib-link\fR,\fB- -link=ib-link\fR\fR
.ad
.sp .6
.RS 4n
InfiniBand 物理链路名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR \fIgw-system-name\fR\fR
.ad
.sp .6
.RS 4n
指定 IB-Ethernet 网关开关的系统名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIgw-eth-port\fR\fR
.ad
.sp .6
.RS 4n
指定与网关开关的以太网端口关联的连接器的名称。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-eoib\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIeoib-link\fR\fR
.ad
.sp .6
.RS 4n
删除指定的 EoIB 链路。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB-—temporary\fR\fR
.ad
.sp .6
.RS 4n
指定 EoIB 链路创建为临时 EoIB 链路创建。临时链路将持续到下一次重新引导。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB--root-dir=root-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-eoib\fR [\fB-PZ\fR] [\fB-g\fR \fIgw-system-name\fR] [\fB-l\fR \fI ib-link\fR] [[\fB-p\fR] \fB-o\fR \fIfield \fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIeoib-link\fR]\fR
.ad
.sp .6
.RS 4n
显示关于系统上的所有 EoIB 数据链路、通过特定 ib-link 的 EoIB 数据链路和/或 \fIgw-system-name\fR 的信息，或者关于特定 EoIB 数据链路的信息。
.sp
.ne 2
.mk
.na
\fB\fB-P\fR、\fB--persistent\fR\fR
.ad
.RS 21n
.rt  
显示持久性 EoIB 链路配置。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.RS 21n
.rt  
在输出中显示ZONE列。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR \fIgw-system-name\fR\fR
.ad
.RS 21n
.rt  
显示关于与指定网关上的以太网端口绑定的 EoIB 数据链路的信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIib-link\fR\fR
.ad
.RS 21n
.rt  
显示关于通过指定 IB 链路构建的 EoIB 数据链路的信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...]\fR
.ad
.RS 21n
.rt  
要显示的输出字段的列表，这些字段不区分大小写，并且由逗号分隔。字段名称必须是下面列出的某个字段，或者是可以显示所有字段的特殊值 all。缺省情况下（无 \fB-o\fR 选项），\fBshow-eoib\fR 会显示所有字段。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.RS 14n
.rt  
EoIB 数据链路的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBGWNAME\fR\fR
.ad
.RS 14n
.rt  
IB-Ethernet 网关开关的已配置系统名称。对于持久性链路，如果网关系统名称未知（因为链路正从旧的管理模型迁移）并且如果尚未发现与链路的 GWID 对应的网关，则值显示为 \fB?\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBGWPORT\fR\fR
.ad
.RS 14n
.rt  
与网关以太网端口关联的连接器的名称。对于持久性链路，如果网关系统名称未知（因为链路正从旧的管理模型迁移）并且如果尚未发现与链路的 \fBGWID\fR 对应的网关，则值显示为 \fB?\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBGWID\fR\fR
.ad
.RS 14n
.rt  
与显示的网关以太网端口关联的网关实例的标识符。该值应该是唯一的，即使多个网关开关共享同一 InfiniBand 光纤网络也是如此。网关实例标识符的值范围是 0 到 1023。如果尚未发现网关，则值显示为 \fB--\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBSPEED\fR\fR
.ad
.RS 14n
.rt  
链路的最大速度（以兆位/秒为单位）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMACADDRESS\fR\fR
.ad
.RS 14n
.rt  
为网关上的 EoIB 链路分配的 MAC 地址。如果尚未与网关建立底层连接，\fBmacaddress\fR 全部显示为零。
.RE

.sp
.ne 2
.mk
.na
\fB\fBOVER\fR\fR
.ad
.RS 14n
.rt  
IB 物理链路的名称，通过该链路创建此 EoIB 数据链路。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFLAGS\fR\fR
.ad
.RS 14n
.rt  
一组与 EoIB 链路相关联的标志。除了前面 \fBshow-ib\fR 说明下列出的标志，还可以使用两个其他标志：
.sp
.ne 2
.mk
.na
\fB\fBD\fR\fR
.ad
.RS 5n
.rt  
与链路关联的以太网端口当前关闭。
.RE

.sp
.ne 2
.mk
.na
\fB\fBU\fR\fR
.ad
.RS 5n
.rt  
与链路关联的以太网端口当前打开。
.RE

.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.RS 21n
.rt  
使用稳定的可供计算机解析的格式显示。\fB-o\fR 选项需要与 \fB-p\fR 一起使用。请参见下文的“可解析的输出格式”。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-etherstub\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIetherstub\fR\fR
.ad
.sp .6
.RS 4n
创建具有指定名称的 etherstub。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB-–temporary\fR\fR
.ad
.sp .6
.RS 4n
指定 etherstub 为临时 etherstub。临时 etherstub 不会在重新引导后保留。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- –root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

可基于 etherstub（而非物理 NIC）创建 VNIC。与物理 NIC 相同，此类创建会导致栈在基于同一 etherstub 创建的不同 VNIC 之间隐式创建虚拟交换机。
.RE

.sp
.ne 2
.mk
.na
\fB\fR
.ad
.br
.na
\fB\fBdladm delete-etherstub\fR [\fB- t\fR] [\fB-R\fR \fIroot-dir\fR] \fI etherstub\fR\fR
.ad
.sp .6
.RS 4n
删除指定的 etherstub。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB-–temporary\fR\fR
.ad
.sp .6
.RS 4n
指定删除为临时删除。临时删除将持续到下一次重新引导。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- –root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-etherstub\fR [\fB-Z\fR] [\fB-z\fR \fIzone\fR[,...]] [\fIetherstub \fR]\fR
.ad
.sp .6
.RS 4n
缺省情况下显示配置的所有 etherstub，或者如果指定了 \fIetherstub\fR，则显示指定 etherstub。
.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
在输出中显示 \fBZONE\fR 列。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
请参见上面 \fBdladm show-link\fR 下 \fB-z\fR 选项的说明。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-iptun\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-T\fR \fI type\fR [\fB-a\fR {\fBlocal\fR|\fBremote\fR}=\fI addr\fR,...] \fIiptun-link\fR\fR
.ad
.sp .6
.RS 4n
创建名为 \fIiptun-link\fR 的 IP 隧道链路。通过使用 \fBipsecconf\fR(1M)，可以借助 IPsec 为此类链路提供额外的保护。
.sp
从概念上讲，一个 IP 隧道包括两个部分：两个或多个 IP 节点之间的虚拟链路，以及位于此链路上方的 IP 接口，该接口允许系统传送和接收由底层链路封装的 IP 包。此子命令创建一个虚拟链路。\fBipadm\fR(1M) 命令用于在此链路上方配置 IP 接口。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
指定 IP 隧道链路为临时链路。临时隧道将持续到下一次重新引导。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fItype\fR、\fB--tunnel-type \fR=\fItype\fR\fR
.ad
.sp .6
.RS 4n
指定要创建的隧道的类型。此类型必须是以下类型之一：
.sp
.ne 2
.mk
.na
\fB\fBipv4\fR\fR
.ad
.sp .6
.RS 4n
位于两个 IPv4 节点之间的点对点 IP-over-IP 隧道。此类型的隧道需要 IPv4 源地址和目标地址才能运行。可以在此类隧道上方检测到 IPv4 和 IPv6 接口，以便创建 IPv4-over-IPv4 和 IPv6-over-IPv4 隧道配置。
.RE

.sp
.ne 2
.mk
.na
\fB\fBipv6\fR\fR
.ad
.sp .6
.RS 4n
位于两个 IPv6 节点之间的点对点 IP-over-IP 隧道（按照 IETF RFC 2473 中的定义）。此类型的隧道需要 IPv6 源地址和目标地址才能运行。可以在此类隧道上方检测到 IPv4 和 IPv6 接口，以便创建 IPv4-over-IPv6 和 IPv6-over-IPv6 隧道配置。
.RE

.sp
.ne 2
.mk
.na
\fB\fB6to4\fR\fR
.ad
.sp .6
.RS 4n
6to4 一点对多点隧道（按照 IETF RFC 3056 中的定义）。此类型的隧道需要 IPv4 源地址才能运行。在此类隧道链路上方检测 IPv6 接口，以便配置 6to4 路由器。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR {\fBlocal\fR|\fBremote\fR}=\fI addr\fR,...\fR
.ad
.br
.na
\fB\fB--address\fR {\fBlocal\fR|\fB remote\fR}=\fIaddr\fR,...\fR
.ad
.sp .6
.RS 4n
与本地或远程隧道地址相对应的字面值 IP 地址或主机名。可单独指定本地或远程地址，也可以同时指定两个地址，并使用逗号进行分隔（例如，\fB-a\fR \fBlocal=\fR\fIladdr\fR\fB ,remote=\fR\fIraddr\fR）。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm modify-iptun\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-a\fR {\fB local\fR|\fBremote\fR}=\fIaddr\fR,... \fI iptun-link\fR\fR
.ad
.sp .6
.RS 4n
修改指定 IP 隧道的参数。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
指定修改为临时修改。临时修改将持续到下一次重新引导。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.sp
.ne 2
.mk
.na
\fB\fR
.ad
.br
.na
\fB\fR
.ad
.br
.na
\fB\fB-a\fR {\fBlocal\fR|\fB remote\fR}=\fIaddr\fR,...\fR
.ad
.br
.na
\fB\fB--address \fR {\fBlocal\fR|\fBremote\fR}=\fIaddr\fR,... \fR
.ad
.sp .6
.RS 4n
为隧道链路指定新的本地或远程地址。有关说明，请参见\fBcreate-iptun\fR。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-iptun\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIiptun-link\fR\fR
.ad
.sp .6
.RS 4n
删除指定的 IP 隧道链路。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
指定删除为临时删除。临时删除将持续到下一次重新引导。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-iptun\fR [\fB-PZ\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fB-z\fR \fIzone\fR[,...]] [\fIiptun-link \fR]\fR
.ad
.sp .6
.RS 4n
显示一个 IP 隧道或所有 IP 隧道的 IP 隧道链路配置。
.sp
.ne 2
.mk
.na
\fB\fB-P\fR、\fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
显示持久性 IP 隧道配置。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
使用稳定的可供计算机解析的格式显示。-o 选项必须与 -p 选项一起使用。请参见下文的“可解析的输出格式”。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...], \fB- -output\fR=\fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
要显示的输出字段的列表，这些字段不区分大小写，并且由逗号分隔。字段名称必须是下面列出的某个字段，或者是可以显示所有字段的特殊值 \fBall\fR。缺省情况下（无 \fB-o\fR），\fBshow-iptun\fR 会显示所有字段。
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.sp .6
.RS 4n
IP 隧道链路的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTYPE\fR\fR
.ad
.sp .6
.RS 4n
\fBcreate-iptun\fR 的 \fB-T\fR 选项指定的隧道类型。
.RE

.sp
.ne 2
.mk
.na
\fB\fBFLAGS\fR\fR
.ad
.sp .6
.RS 4n
一组与 IP 隧道链路相关联的标志。可能的标志包括：
.sp
.ne 2
.mk
.na
\fB\fBs\fR\fR
.ad
.sp .6
.RS 4n
IP 隧道链路受 IPsec 策略保护。要显示与隧道链路关联的 IPsec 策略，请输入：
.sp
.in +2
.nf
# \fBipsecconf -ln -i \fItunnel-link\fR\fR
.fi
.in -2
.sp

有关如何配置 IPsec 策略的更多详细信息，请参见 \fBipsecconf\fR(1M)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBi\fR\fR
.ad
.sp .6
.RS 4n
已使用 \fBipadm\fR(1M) 隐式创建 IP 隧道链路，并且当不再引用此 IP 隧道链路时（也就是，当删除此隧道上方的最后一个 IP 接口时），将自动删除此链路。有关隐式创建隧道的详细信息，请参见 \fBipadm\fR(1M)。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBLOCAL\fR\fR
.ad
.sp .6
.RS 4n
本地隧道地址。
.RE

.sp
.ne 2
.mk
.na
\fB\fBREMOTE\fR\fR
.ad
.sp .6
.RS 4n
远程隧道地址。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
在输出中显示 \fBZONE\fR 列。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR[,...]\fR
.ad
.sp .6
.RS 4n
请参见上面 \fBdladm show-link\fR 下 \fB-z\fR 选项的说明。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-vxlan\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fB-p\fR \fI vni\fR=<\fIvxlan id\fR>[,\fIprop=value \fR[,...] ] \fIvxlan-link\fR\fR
.ad
.sp .6
.RS 4n
创建名为 \fBvxlan-link\fR 的 VXLAN 链路。VXLAN 链路是创建在 IP 接口上的虚拟链路，将用于接收和传输 VXLAN 包。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
指定修改为临时修改。临时修改将持续到下一次重新引导。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上文的“选项”。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIprop\fR=\fI value\fR[,...]\fR
.ad
.sp .6
.RS 4n
要创建的 VXLAN 链路的属性。请参见“常规链路属性”了解 VXLAN 相关属性。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-vxlan\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIvxlan-link\fR\fR
.ad
.sp .6
.RS 4n
删除指定的 VXLAN 链路。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
指定修改为临时修改。临时修改将持续到下一次重新引导。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR、\fB- -root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上文的“选项”。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-vxlan\fR [\fB-P\fR] [[\fB-p\fR] \fB-o\fR \fIfield\fR[,...]] [\fIvxlan-link\fR]\fR
.ad
.sp .6
.RS 4n
显示所有 VXLAN 链路或指定 VXLAN 链路的 VXLAN 配置。
.sp
\fBshow-vxlan\fR 子命令接受下列选项： 
.sp
.ne 2
.mk
.na
\fB\fB-P\fR、\fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
显示持久性 IP 隧道配置。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
使用稳定的可供计算机解析的格式显示。使用 \fB-p\fR 选项时必须使用 \fB-o\fR 选项。请参见下文的“可解析的输出格式”。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIfield\fR[,...], \fB- -output\fR=\fIfield\fR[,...]\fR
.ad
.sp .6
.RS 4n
要显示的输出字段的列表，这些字段不区分大小写，并且由逗号分隔。字段名称必须是下面列出的某个字段，或者是可以显示所有字段的特殊值 all。对于每个 VXLAN 链路，可显示下列字段：
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.RS 10n
.rt  
VXLAN 链路的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBADDR\fR\fR
.ad
.RS 10n
.rt  
与 VXLAN 链路关联的 IP 接口的地址。
.RE

.sp
.ne 2
.mk
.na
\fB\fBVNI\fR\fR
.ad
.RS 10n
.rt  
VXLAN 链路所属的 VXLAN 网段编号。
.RE

.sp
.ne 2
.mk
.na
\fB\fBMGROUP\fR\fR
.ad
.RS 10n
.rt  
与 VXLAN 链路关联的多播组。
.RE

.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm create-cap\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIcap-link\fR\fR
.ad
.sp .6
.RS 4n
使用名称 cap-link 创建捕获数据链路。cap-link 在运行 dladm 命令的给定区域名称空间中必须唯一。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
指定捕获数据链路是临时的。临时捕获将持续到下一次重新引导。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm delete-cap\fR [\fB-t\fR] [\fB-R\fR \fIroot-dir\fR] \fIcap-link\fR\fR
.ad
.sp .6
.RS 4n
删除指定的捕获数据链路。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR、\fB--temporary\fR\fR
.ad
.sp .6
.RS 4n
指定删除为临时删除。临时删除将持续到下一次重新引导。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot-dir\fR, \fB--root-dir\fR=\fIroot-dir\fR\fR
.ad
.sp .6
.RS 4n
请参见上面的“选项”。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBdladm show-cap\fR [\fB-P\fR] [[\fB-p\fR] \fB-o\fR <\fIfield\fR>,...] [\fIcap-link\fR] \fR
.ad
.sp .6
.RS 4n
显示与运行 dladm 命令的区域绑定的所有/单个 cap-link 捕获接口。
.sp
.ne 2
.mk
.na
\fB\fB-P\fR、\fB--persistent\fR\fR
.ad
.sp .6
.RS 4n
显示持久性数据链路配置。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR, \fB--parseable\fR\fR
.ad
.sp .6
.RS 4n
使用稳定的可供计算机解析的格式显示。使用 \fB-p\fR 选项时必须使用 \fB-o\fR 选项。请参见下文的“可解析的输出格式”。
.RE

.sp
.ne 2
.mk
.na
\fB-o field[,...], --output=field[,...]\fR
.ad
.sp .6
.RS 4n
要显示的输出字段的列表，这些字段不区分大小写，并且由逗号分隔。字段名称必须是下面列出的某个字段，或者是可以显示所有字段的特殊值 \fBall\fR。对于每个捕获链路，可以显示以下字段：
.sp
.ne 2
.mk
.na
\fB\fBLINK\fR\fR
.ad
.RS 8n
.rt  
捕获链路的名称。
.RE

.sp
.ne 2
.mk
.na
\fB\fBZONE\fR\fR
.ad
.RS 8n
.rt  
数据链路的当前区域。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTYPE\fR\fR
.ad
.RS 8n
.rt  
数据链路类型，当前 \fBpflog\fR 链路类型是唯一支持的类型。
.RE

.sp
.ne 2
.mk
.na
\fBMTU\fR
.ad
.RS 8n
.rt  
链路 mtu。
.RE

.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBhelp\fR [\fIsubcommand-name\fR] \fR
.ad
.sp .6
.RS 4n
显示所有受支持的 \fBdladm\fR 子命令或显示给定子命令的用法。如果您针对某个特定子命令调用 help，则会显示命令语法和一个示例。使用无参数的 \fBdladm\fR help 将显示所有子命令。
.RE

.SS "可解析的输出格式"
.sp
.LP
许多 \fBdladm\fR 子命令都具有一个以计算机可解析的格式显示输出的选项。输出格式是一行或多行以冒号 (\fB:\fR) 分隔的字段。显示的字段特定于使用的子命令，并且在给定子命令的 \fB-o\fR 选项的条目下列出。输出仅包括通过 \fB-o\fR 选项请求的字段，这些字段按请求的顺序排列。
.sp
.LP
当请求多个字段时，将在输出之前使用反斜杠 (\fB\\fR) 对任何文本冒号字符进行转义。类似地，也会对文本反斜杠字符进行转义 (\fB\\\fR)。通过使用带有环境变量 \fBIFS=:\fR 的 shell \fBread\fR(1) 函数，可以解析此转义格式（请参见下文的\fB\fR“示例”部分）。请注意，当仅请求一个字段时，不会进行转义。
.SS "常规链路属性"
.sp
.LP
支持下列常规链路属性：
.sp
.ne 2
.mk
.na
\fB\fBaddr\fR\fR
.ad
.sp .6
.RS 4n
只适用于 VXLAN 链路。此属性指定承载着 VXLAN 链路的 IP 地址（IPv4 或 IPv6）。可以在 IPv4 或 IPv6 地址中指定 \fBprefixlen\fR。可以提供主机名来替代 IP 地址。如果提供了主机名，将通过 \fB/etc/hosts\fR 中的条目或在 \fBnsswitch.conf\fR(4) 中为 hosts 或 ipnodes 指定的解析器来获取其数值。由于先创建 IP 地址，然后才会在引导过程中将命名服务联机，因此应将使用的所有主机名包含在 \fB/etc/hosts\fR 中，这一点非常重要。如果还为 VXLAN 链路配置了 interface 属性，则不能指定此属性。只能在创建 VXLAN 链路时设置此属性，并且此后不能修改。此属性以后可能会更改。
.RE

.sp
.ne 2
.mk
.na
\fB\fBautopush\fR\fR
.ad
.sp .6
.RS 4n
指定在打开链路的 DLPI 设备时推送到与该链路相关联的流的 STREAMS 模块集。该模块集是以空格分隔的模块的列表。
.sp
可选的特殊字符序列 \fB[anchor]\fR 表示应将 STREAMS 锚放置到以前在列表中指定的模块的流中。指定多个锚或将锚放置在列表开头会产生错误。
.sp
最好使用 \fBautopush\fR 属性，而不是较通用的 \fBautopush\fR(1M) 命令。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcos\fR\fR
.ad
.sp .6
.RS 4n
与链路关联的 802.1p 优先级。当设置了此属性时，此属性指示链路上外发包的 802.1p 优先级。值的范围为 0 到 7。当设置了此属性时，链路上的所有外发包将带有一个 VLAN 标记，其中优先级字段设置为该属性值。当在某个物理 NIC 上设置了此属性时，只有该物理 NIC 上的主客户机的通信具有优先级设置，该 NIC 上的任何其他数据链路没有该设置。此属性仅在以太网数据链路上有效。对于 VLAN 数据链路或者当底层设备注册了 DCB 功能时，缺省 cos 为 0，在其他情况下，缺省行为是不添加 VLAN 标记。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcpus\fR\fR
.ad
.sp .6
.RS 4n
将给定数据链路的包处理绑定到某个或某组处理器。此值可以是一个或多个处理器 ID 或 ID 范围的逗号分隔列表。如果此列表包含多个处理器，处理将向外传播到所有处理器。系统将维护处理器连接关联以及任何单独的连接的包排序方式。
.sp
系统不会专门为链路保留处理器或处理器集。只有与链路处理相关联的内核线程和中断才会绑定到指定处理器或处理器集。如果需要将处理器专用于链路，可以使用 \fBpsrset\fR(1M) 创建处理器集，并指定要绑定到此链路的处理器集中的处理器。
.sp
如果已在以前的操作中将链路绑定到处理器或处理器集，则将删除此绑定，并改用新的处理器集。
.sp
缺省设置为无 CPU 绑定，也就是说，包处理不会绑定到任何特定处理器或处理器集。
.sp
在采用 \fBpool\fR 链路属性的链路上，不允许指定 \fBcpus\fR 属性。
.sp
\fBcpus\fR 属性的有效值显示指定数据链路上进行包处理用的 CPU 的列表。如果设置了 \fBcpus\fR 属性，该有效值将与设置的值相同。如果设置了池属性，将从管理员指定的池中选择有效值。如果未设置池和 \fBcpus\fR 属性，系统将为 \fBcpus\fR 属性选择有效值。
.RE

.sp
.ne 2
.mk
.na
\fB\fBetsbw-lcl\fR\fR
.ad
.sp .6
.RS 4n
这指示在链路的 TX 端配置的 ETS 带宽。仅当底层物理 NIC 注册了 DCB 功能并支持 ETS 时，才能在数据链路上配置此属性。该值是物理 NIC 的带宽的一个百分比，且物理 NIC 上所有链路的此属性值的总和不能超过 100。目前不支持聚合注册了 DCB 功能的物理 NIC，因此不能在聚合上设置此属性。此属性的有效值可以是 \fBetsbw-lcl\fR 或 \fBetsbw-lcl-advice\fR，具体取决于 LLDP 协商。
.RE

.sp
.ne 2
.mk
.na
\fB\fBetsbw-lcl-advice\fR\fR
.ad
.sp .6
.RS 4n
这指示由此链路的远程端建议的 ETS 带宽（以百分比表示）。该值是通过 LLDP 获得的。
.RE

.sp
.ne 2
.mk
.na
\fB\fBetsbw-rmt\fR\fR
.ad
.sp .6
.RS 4n
这指示在此链路的远程端上的 ETS 带宽（以百分比表示）。该值是通过 LLDP 获得的。
.RE

.sp
.ne 2
.mk
.na
\fB\fBetsbw-rmt-advice\fR\fR
.ad
.sp .6
.RS 4n
这指示向此链路的远程端建议的 ETS 带宽（以百分比表示）。此值由 LLDP 使用。
.RE

.sp
.ne 2
.mk
.na
\fB\fBinterface\fR\fR
.ad
.sp .6
.RS 4n
只适用于 VXLAN 链路。此属性指定 VXLAN 链路的底层 IP 接口。将使用在指定接口上可用的 IP 地址创建 VXLAN。缺省情况下，将为 VXLAN 链路选择 IPv4 地址，可使用 ipvers 属性更改此设置。只能在创建 VXLAN 链路时设置此属性，并且此后不能修改。此属性以后可能会更改。
.RE

.sp
.ne 2
.mk
.na
\fB\fBipvers\fR\fR
.ad
.sp .6
.RS 4n
只适用于 VXLAN 数据链路。此属性指示应当为 VXLAN 链路的 IP 接口（使用 interface 属性指定）选择 IPv4 还是 IPv6 地址。只能在创建 VXLAN 链路时设置此属性，并且此后不能修改。此属性以后可能会更改。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrxfanout\fR\fR
.ad
.sp .6
.RS 4n
允许您指定接收端扇出线程的数目。
.sp
接收环上接收的通信可以跨多个线程扇出并以并行方式进行处理。这在系统中具有大量 CPU 时特别有用。此属性是对特定数据链路的接收端扇出线程数的计数。请注意，此属性允许管理员指定所需的 \fBrxfanout\fR。但是，根据可用 CPU 和硬件 RX 环的数目，系统可能会选择其他（更小或甚至更大）扇出值。CPU 的数目是接收端扇出的上界，而 \fBrxrings\fR 的数目是下界。因此，实际的接收端扇出计数值可能不同于用户设置的值。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlearn_limit\fR\fR
.ad
.sp .6
.RS 4n
限制要通过网桥链路获取的新 MAC 源或已更改的 MAC 源的数目。当数目超过此值时，则会临时禁用在此链路上进行获取的功能。只有非 VLAN、非 VNIC 类型的链路才具有此属性。
.sp
缺省值为 \fB1000\fR。有效值大于或等于 0。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlearn_decay\fR\fR
.ad
.sp .6
.RS 4n
指定受 \fBlearn_limit\fR 限制的源更改的衰减速率。系统每 5 秒钟从网桥链路的计数器中减去此数字。只有非 VLAN、非 VNIC 类型的链路才具有此属性。
.sp
缺省值为 \fB200\fR。有效值大于或等于 0。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlro\fR\fR
.ad
.sp .6
.RS 4n
指定用户的部署（打开或关闭 LRO 或者在数据链路上使用系统缺省的 LRO 值）。
.sp
有效值为 off、on 或 auto。缺省值为 auto。对于物理 NIC，当它继承虚拟 NIC 的下游链路的 lro 配置时，值 auto 被设置为 off。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmac-address\fR\fR
.ad
.sp .6
.RS 4n
设置数据链路的主 MAC 地址。设置此选项后，更改底层数据链路的所有当前和未来 MAC 客户机使用的主 MAC 地址。
.LP
注 - 
.sp
.RS 2
如果系统确定启用 LRO 不安全，则可能不启用。例如，如果 IP 使用某个数据链路转发通信，则系统会将为该数据链路打开 LRO 视为不安全的。所以，有效值将与此类情况中的配置值不同。
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fBmaxbw\fR\fR
.ad
.sp .6
.RS 4n
设置链路的全双工带宽。此带宽指定为一个带有某个容量级后缀（分别表示 Kbps、Mbps 和 Gbps 的 \fBK\fR、\fBM\fR 或 \fBG\fR）的整数。如果未指定单位，输入值将以 Mbps 为单位进行读取。缺省值是无带宽限制。
.RE

.sp
.ne 2
.mk
.na
\fB\fBbwshare\fR\fR
.ad
.sp .6
.RS 4n
VNIC 的带宽份额是同一数据链路上存在来自其他 VNIC 的竞争时该 VNIC 将获得的最小带宽份额。请注意，在所有活动的 VNIC 中分配带宽。分配量与其份额成比例。例如，
.sp
.in +2
.nf
# \fBdladm set-linkprop -p bwshare=40 vnic1\fR
# \fBdladm set-linkprop -p bwshare=10 vnic2\fR
.fi
.in -2
.sp

假定 1Gbps 链路并且假定这两个是唯一的 VNIC，则 \fBvnic1\fR 最多可以具有 800 Mbps (1Gbps * 40/(40+10))，\fBvnic2\fR 最多可以具有 200 Mbps (1Gbps * 10/(40+10))。
.sp
以上示例假定 VNIC 具有通信来使用其带宽份额。但是，如果 \fBvnic1\fR 仅使用 100 Mbps，则 \fBvnic2\fR 可高达 900 Mbps。带宽份额的目的是当存在使用带宽的 VNIC 时不浪费带宽，同时当存在来自其他 VNIC 的竞争时确保分配的份额。
.sp
当前仅在某些 NIC 上支持此属性。\fBdladm show-linkprop -H -p bwshare\fR 命令用于确定给定链路上是否支持 \fBbwshare\fR 属性。值范围可以为 1 到 100。该值是相对份额值，不指示带宽的百分比。有效值列显为物理链路带宽的百分比。这是存在竞争时确保分配给 VNIC 的最小带宽百分比。有效值可以根据链路上的其他 VNIC 不同而保持更改。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmgroup\fR\fR
.ad
.sp .6
.RS 4n
只适用于 VXLAN 数据链路。此属性指示 VXLAN 链路所订阅的多播组。VXLAN 链路将使用此地址来搜索同一 VXLAN 网段上的其他 VXLAN 链路。如果未设置此属性，则 VXLAN 链路将使用缺省的 all-host 地址。只能在创建 VXLAN 链路时设置此属性，并且此后不能修改。此属性以后可能会更改。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpool\fR\fR
.ad
.sp .6
.RS 4n
将给定数据链路的包处理绑定到通过 \fBpoolcfg\fR(1M) 和 \fBpooladm\fR(1M) 进行定义和管理的处理器池。处理绑定与 \fBcpus\fR 链路属性的绑定方式相似，但 CPU 列表不是显式的，并且会通过池功能进行维护。
.sp
如果已启用池，并且未为链路指定池，\fBpool_default\fR 将用于包处理。
.sp
对于 \fBip-type=exclusive\fR 的区域，如果通过池区域属性或 \fBdedicated-cpus\fR 分配指定池，该池还将用于与此区域关联的所有数据链路。
.sp
在采用 \fBcpus\fR 链路属性的链路上，不允许指定 \fBpool\fR 属性。
.sp
如果启用了池功能，并且如果管理员未向数据链路分配池，池的有效值将是 \fBpool_default\fR。
.sp
如果已禁用池功能，则不存在有效池，并且该值将为空。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpriority\fR\fR
.ad
.sp .6
.RS 4n
设置链路的相对优先级。该值可指定为 \fBhigh\fR、\fBmedium\fR 或 \fBlow\fR 标记之一。缺省值为 \fBmedium\fR。此优先级不会反映在线路上的任何协议优先级字段中，而是用于系统内的包处理调度。高优先级链路可能延迟更短，具体取决于可用的系统资源。设置此属性可能会导致某些工作负荷的 CPU 利用率升高。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrxringsavail\fR\fR
.ad
.sp .6
.RS 4n
一种只读属性，可用于指定接收端上的可用环数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrxrings\fR\fR
.ad
.sp .6
.RS 4n
指定 MAC 客户机的接收环端的数目。值 \fBsw\fR 表示不应为此 MAC 客户机分配任何 RX 环且将以软件为基础。值 \fBhw\fR 表示此 MAC 客户机可获取一个 RX 环（如果可用），否则将以软件为基础。非零值表示为此 MAC 客户机保留此数目的环（如果可用），否则将失败。如果未指定此属性，MAC 客户机可获取一个 RX 环（如果可用），否则将以软件为基础。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrxhwclntavail\fR\fR
.ad
.sp .6
.RS 4n
一种只读属性，可用于指定可创建的基于 RX 硬件的额外 MAC 客户机数目。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtxringsavail\fR\fR
.ad
.sp .6
.RS 4n
一种只读属性，可用于指定传送端上的可用环数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtxrings\fR\fR
.ad
.sp .6
.RS 4n
指定 MAC 客户机的传送环的数目。值 \fBsw\fR 表示不应为此 MAC 客户机分配任何 TX 环。值 \fBhw\fR 表示此 MAC 客户机可获取一个 TX 环（如果可用），否则将以软件为基础。非零值表示为此 MAC 客户机保留此数目的环（如果可用），否则将失败。如果未指定此属性，MAC 客户机可获取一个 TX 环（如果可用），否则将以软件为基础。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtxhwclntavail\fR\fR
.ad
.sp .6
.RS 4n
一种只读属性，可用于指定可创建的基于 TX 硬件的额外 MAC 客户机数目。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstp\fR\fR
.ad
.sp .6
.RS 4n
在网桥链路上启用或禁用跨树协议。将此值设置为 \fB0\fR 可禁用跨树协议，并将链路置于转发模式，同时启用 BPDU 保护。此模式适用于仅连接到终端节点的点对点链路。只有非 VLAN、非 VNIC 类型的链路才具有此属性。启用 STP 所需的缺省值为 \fB1\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBforward\fR\fR
.ad
.sp .6
.RS 4n
启用或禁用 VLAN 的转发。将此值设置为 \fB0\fR 可禁用 VLAN 链路的网桥转发。禁用网桥转发会从网桥的“允许集”中删除此 VLAN。为配置的 VLAN 启用网桥转发时，所需的缺省值为 \fB1\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdefault_tag\fR\fR
.ad
.sp .6
.RS 4n
设置在此链路中收发的不带标记的包所采用的缺省 VLAN ID。只有非 VLAN、非 VNIC 类型的链路才具有此属性。将此值设置为 \fB0\fR 可禁用进出端口的不带标记的包的网桥转发。缺省值为 \fBVLAN ID 1\fR。有效值介于 0 至 4094 之间。缺省 VLAN ID 也称为端口 VLAN 标识符 (PVID)。
.sp
不能使用与底层链路的缺省 VLAN 值匹配的 VLAN ID 创建带有标记的 VLAN 或带有 VLAN 标记的 VNIC 链路。链路上所有不带标记的包都已经与缺省 VLAN (PVID) 关联。要成功创建 VLAN ID 等于缺省 VLAN 值的带有标记的 VLAN 或带有 VLAN 标记的 VNIC 链路，必须首先将底层链路的 \fBdefault_tag\fR 属性更改为其他 VLAN 值。
.sp
当 \fBdefault_tag=0\fR 时，链路上所有不带标记的包都不再与任何 VLAN 关联。因此，您可以使用介于 1 至 4094 之间的任何 VLAN ID 创建 VLAN 链路。请注意，系统可能会删除端点中使用 PVID 错误标记的所有接收的包。如果给定链路上的所有端点的 PVID 并不完全相符，则会出现此情况。链路上的所有端点必须使用相同的 PVID，并且不能使用 PVID 来标记通信。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstp_priority\fR\fR
.ad
.sp .6
.RS 4n
设置 STP 和 RSTP 端口优先级值，此值用于确定网桥上的首选根端口。数值越低，优先级越高。缺省值为 \fB128\fR。有效值介于 0 至 255 之间。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstp_cost\fR\fR
.ad
.sp .6
.RS 4n
设置使用链路的 STP 和 RSTP 成本。缺省值为 \fBauto\fR，该值根据链路速度设置成本，并使用 \fB100\fR 表示 10Mbps，\fB19\fR 表示 100Mbps，\fB4\fR 表示 1Gbps，\fB2\fR 表示 10Gbps。有效值介于 1 至 65535 之间。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstp_edge\fR\fR
.ad
.sp .6
.RS 4n
启用或禁用网桥边缘端口检测。如果设置为 \fB0\fR (false)，则即使未显示任何类型的网桥 PDU，系统也会假定此端口将连接到其他网桥。缺省值为 \fB1\fR，表示系统将自动检测边缘端口。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstp_p2p\fR\fR
.ad
.sp .6
.RS 4n
设置网桥点对点运行模式。可能的值包括：\fBtrue\fR、\fBfalse\fR 和 \fBauto\fR。如果设置为 \fBauto\fR，则会自动搜索点对点连接。如果设置为 \fBtrue\fR，则会强制端口模式使用点对点连接。如果设置为 \fBfalse\fR，则会强制端口模式使用普通多点模式。缺省值为 \fBauto\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstp_mcheck\fR\fR
.ad
.sp .6
.RS 4n
触发系统以便在此链路上运行 RSTP \fB强制 BPDU 迁移检查\fR过程。将此属性值设置为 \fB1\fR 即可触发此过程。此属性自动重置为原来的 \fB0\fR。除非满足下列条件，否则无法设置此值：
.RS +4
.TP
.ie t \(bu
.el o
链路处于桥接状态
.RE
.RS +4
.TP
.ie t \(bu
.el o
网桥受跨树协议保护
.RE
.RS +4
.TP
.ie t \(bu
.el o
网桥 \fBforce-protocol\fR 值至少为 2 (RSTP)
.RE
缺省值为 0。
.RE

.sp
.ne 2
.mk
.na
\fB\fBprotection\fR\fR
.ad
.sp .6
.RS 4n
启用一种或多种链路保护。有效值包括：
.sp
.ne 2
.mk
.na
\fB\fBmac-nospoof\fR\fR
.ad
.sp .6
.RS 4n
MAC 地址防欺骗。外发包的源 MAC 地址必须与链路的已配置 MAC 地址匹配。系统将删除不匹配的包。如果链路属于某个区域，启用 \fBmac-nospoof\fR 将防止区域所有者修改此链路的 MAC 地址。
.RE

.sp
.ne 2
.mk
.na
\fB\fBip-nospoof\fR\fR
.ad
.sp .6
.RS 4n
IP 地址防欺骗。此保护类型与链路属性 \fBallowed-ips\fR 配合运行。
.sp
\fBallowed-ips\fR 是包含 IP（IPv4 或 IPv6）地址的列表。缺省情况下，此列表为空。此列表中隐式存在的地址包括：符合 RFC 2464 的链路本地 IPv6 地址（从链路的 MAC 地址派生）；从 DHCP 回复获取的 IPv4/IPv6 地址；未指定的 IPv4/IPv6 地址（均为零）。
.sp
如果外发 IP 包的源地址位于 \fBallowed-ips\fR 中，则可以传递此包。
.sp
如果外发 ARP 包的发送方协议地址位于 \fBallowed-ips\fR 中，则可以传递此包。
.sp
将 \fBallowed-ips\fR 设置为包含一个或多个 IP 地址的集合以保护数据链路时，将无法对不在该集中的 IP 地址进行配置，此时系统会向用户返回 \fBEPERM\fR 错误。此外，接口不能用于转发 IP 包，尝试对此接口设置 \fBipadm\fR(1M) 转发属性将遇到 \fBEPERM\fR 错误。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdhcp-nospoof\fR\fR
.ad
.sp .6
.RS 4n
DHCP 客户机 ID（适用于 DHCPv6 的 DUID）和硬件地址防欺骗。此保护类型与链路属性 \fBallowed-dhcp-cids\fR 配合运行。
.sp
\fBallowed-dhcp-cids\fR 列表中项的格式应与 \fB/etc/default/dhcpagent\fR 文件中 \fBCLIENT_ID\fR 字段的格式相同。唯一区别在于，当指定 DUID 时，应使用 \fB\&.\fR（句点）替换 \fB,\fR（逗号）。有关详细信息，请参见 \fBdhcpagent\fR(1M)。
.sp
仅当满足下列条件时，才能传递外发 DHCP (v4/v6) 包。
.RS +4
.TP
.ie t \(bu
.el o
未配置 \fBallowed-dhcp-cids\fR，且包类型为：
.RS +4
.TP
.ie t \(bu
.el o
DHCPv4，客户机 ID 字段必须与配置的 MAC 地址匹配。
.RE
.RS +4
.TP
.ie t \(bu
.el o
DHCPv6，DUID 类型必须为 1 或 3，并且 DUID 的链路层地址部分必须与配置的 MAC 地址匹配。
.RE
.RE
.RS +4
.TP
.ie t \(bu
.el o
已配置 \fBallowed-dhcp-cids\fR，且包类型为：
.RS +4
.TP
.ie t \(bu
.el o
DHCPv4，客户机 ID 字段必须与此列表中的某个 ID 或配置的 MAC 地址匹配。
.RE
.RS +4
.TP
.ie t \(bu
.el o
DHCPv6，DUID 字段必须与此列表中的某个 ID 匹配，或者 DUID 类型必须为 1 或 3，并且 DUID 的链路层地址部分必须与配置的 MAC 地址匹配。
.RE
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fBrestricted\fR\fR
.ad
.sp .6
.RS 4n
此保护将外发包类型限定为 IPv4、IPv6 和 ARP。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBvni\fR\fR
.ad
.sp .6
.RS 4n
只适用于 VXLAN 数据链路。此属性指定链路所属的 VXLAN 网段，其值的范围为 0 到 16777215。在创建 VXLAN 链路时会强制设置此属性，并且此后不能修改。此属性以后可能会更改。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvsi-mgrid\fR\fR
.ad
.sp .6
.RS 4n
一个 IPv6 地址。
.sp
当在某个 VNIC 上启用了 VDP 服务时，可使用 3 字节的 VSI 类型 ID 和 1 字节的 VSI 版本将 VNIC 的属性与网桥进行交换。VSI 管理器维护着 {VSI 类型 ID－VSI 版本} 与属性集之间的映射。{VSI 管理器 ID, VSI 类型 ID, VSI 版本} 元组标识一个特定的属性集。
.sp
在 VNIC 上，可明确指定 \fBvsi-mgrid\fR。如果未明确指定 vsi-mgrid，则 \fBvsi-mgrid\fR 将设置为底层链路的 \fBvsi-mgrid\fR 值。
.sp
在物理链路上，\fBvsi-mgrid\fR 会为其上的所有 VNIC 指定缺省 \fBvsi-manageid\fR。物理链路上 \fBvsi-mgrid\fR 的缺省值为 0。
.sp
物理链路上的缺省 VSI 管理器 ID 与 Oracle VSI 管理器 (\fBoracle_v1\fR) 相关联。Oracle VSI 管理器被定义为使用以下链路属性的 3 字节编码：
.sp
.in +2
.nf
Bits            Properties
--------------------------------------------------
0-4             Link Bandwidth Limit
                00000-10100 :   0-100% of link speed
                                in increments of 5%
                rest        :   reserved

                5-7             Link Speed
                                000 - Unknown
                                001 - 10 Mbps
                                010 - 100 Mbps
                                011 - 1 Gbps
                                100 - 10 Gbps
                                101 - 40 Gbps
                                110 - 100 Gbps
                                111 - Reserved

                8-12            Reserved

                13-15           Traffic Class (0-7)

                16-17           Link MTU
                                00 - 1500 bytes
                                01 - 9000 bytes
                                10 - Custom
                                11 - Reserved


                18-23           Reserved
.fi
.in -2

.RE

.sp
.ne 2
.mk
.na
\fB\fBvsi-mgrid-enc\fR\fR
.ad
.sp .6
.RS 4n
与物理链路的 \fBvsi-mgrid\fR 相关联的编码。受支持的值包括 \fBoracle_v1\fR 和 \fBnone\fR。如果此属性设置为 \fBnone\fR，则不会在此链路上为未明确设置 \fBvsi-mgrid\fR 的 VNIC 自动生成 \fBvsi-typeid\fR 和 \fBvsi-vers\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvsi-typeid\fR\fR
.ad
.sp .6
.RS 4n
一个 3 字节值，用于确定与某个 VNIC 关联的属性。\fBvsi-typeid\fR 可与 \fBvsi-vers\fR 和 \fBvsi-mgrid\fR 一起用于获取与 VNIC 关联的实际属性。当 \fBvsi-mgrid\fR 没有明确位于 VNIC 上时，将使用 VNIC 的属性和以上编码 (\fBoracle_v1\fR) 自动生成 \fBvsi-typeid\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvsi-vers\fR\fR
.ad
.sp .6
.RS 4n
1 字节值，用于确定与 VNIC 相关联的属性。\fBvsi-vers\fR 可与 \fBvsi-typeid\fR 和 \fBvsi-mgrid\fR 一起用于获取与 VNIC 关联的实际属性。当 \fBvsi-mgrid\fR 没有明确位于 VNIC 上时，\fBvsi-vers\fR 将被设置为 0。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvswitching\fR\fR
.ad
.sp .6
.RS 4n
此属性确定 VNIC 或 MAC 客户机之间通过物理链路的切换是通过与该链路关联的虚拟交换机进行还是在外部交换机上进行。此属性仅适用于物理和聚合链路。缺省情况下，通过与链路关联的虚拟交换机进行切换。有效值包括：
.sp
.ne 2
.mk
.na
\fB\fBlocal\fR\fR
.ad
.RS 10n
.rt  
MAC 客户机或 VNIC 之间通过链路的切换在内部通过链路的虚拟交换机进行。这称为虚拟以太网桥接 (Virtual Ethernet Bridge, VEB)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBremote\fR\fR
.ad
.RS 10n
.rt  
MAC 客户机或 VNIC 之间通过链路的切换在外部通过外部交换机进行。这称为虚拟以太网端口聚合器 (Virtual Ethernet Port Aggregator, VEPA)。设置此值假定在外部交换机上配置了反射中继。
.RE

.sp
.ne 2
.mk
.na
\fB\fBauto\fR\fR
.ad
.RS 10n
.rt  
切换通过链路层发现协议 (Link Layer Discovery Protocol, LLDP) 协议来确定。此值启动与外部交换机的 LLDP 交换以启用反射中继。如果 LLDP 在交换机上成功启用反射中继，有效值是远程（即，在外部交换机上进行切换），否则该值是本地（即，在本地通过链路的虚拟交换机进行切换）。
.RE

.RE

.sp
.ne 2
.mk
.na
\fBpvlan-tagmode\fR
.ad
.sp .6
.RS 4n
此属性确定应如何标记传出数据包。此属性适用于物理链路。有效值为：
.sp
.ne 2
.mk
.na
\fB\fBprimary\fR\fR
.ad
.RS 13n
.rt  
将使用 VNIC 的主 VID 对传出数据包进行标记。
.RE

.sp
.ne 2
.mk
.na
\fBsecondary\fR
.ad
.RS 13n
.rt  
将使用 VNIC 的辅助 VID 对传出数据包进行标记。这是缺省值。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBiov\fR\fR
.ad
.sp .6
.RS 4n
根据是用于物理链路还是 VNIC，此属性的行为会有所不同。
.sp
对物理链路设置此链路属性可允许用户启用/禁用 SR-IOV 模式。物理链路的 \fBiov\fR 可能值包括：
.sp
.ne 2
.mk
.na
\fB\fBauto\fR\fR
.ad
.RS 8n
.rt  
允许 OS 决定是否要在此链路上启用 SR-IOV 模式。这是缺省值。
.RE

.sp
.ne 2
.mk
.na
\fB\fBon\fR\fR
.ad
.RS 8n
.rt  
启用 SR-IOV 模式。这将允许创建 VF VNIC。
.RE

.sp
.ne 2
.mk
.na
\fB\fBoff\fR\fR
.ad
.RS 8n
.rt  
禁用 SR-IOV 模式。这将禁止创建 VF VNIC。
.RE

用户可以使用 \fBshow-linkprop\fR 显示当前的 \fBiov\fR 设置。EFFECTIVE 列将显示 OS 所确定的值。VALUE 列将显示用户指定的值。
.sp
在创建 VNIC 时也可通过 \fB-p\fR 选项指定此属性。此选项允许用户选择是否要创建 VF VNIC。在这种情况下，\fBiov\fR 的可能值包括：
.sp
.ne 2
.mk
.na
\fB\fBinherit\fR\fR
.ad
.RS 11n
.rt  
从 VNIC 的底层链路继承 EFFECTIVE \fBiov\fR 设置。例如，如果底层链路启用了 \fB-iov\fR，则在创建 VNIC 时指定 \fBinherit\fR 意味着允许 OS 在可能时分配 VF；如果找不到 VF，则改为创建常规 VNIC。如果底层链路将 iov 设置为 \fBoff\fR，则意味着不会分配 VF。
.sp
如果在 \fBcreate-vnic\fR 中未指定 \fB-p\fR \fBiov\fR，则是假定的缺省值。
.RE

.sp
.ne 2
.mk
.na
\fB\fBon\fR\fR
.ad
.RS 11n
.rt  
必须为此 VNIC 分配 VF。如果找不到 VF，则 VNIC 创建会失败。
.RE

.sp
.ne 2
.mk
.na
\fB\fBoff\fR\fR
.ad
.RS 11n
.rt  
不为此 VNIC 分配 VF。不管底层 \fBiov\fR 设置为何，创建的 VNIC 将始终是常规 VNIC。
.RE

与物理链路不同，不能通过 \fBset-linkprop\fR 修改 VNIC 的 iov 属性。只能在 \fBcreate-vnic\fR 中指定。允许通过 \fBshow-linkprop\fR 显示此属性。
.RE

.sp
.ne 2
.mk
.na
\fB\fBzone\fR\fR
.ad
.sp .6
.RS 4n
指定链路所属的区域。通过 \fBdladm\fR 只能临时修改此属性，因此必须指定 \fB-t\fR 选项。要修改区域赋值使之在重新引导后保留，请使用 \fBzonecfg\fR(1M)。可能的值包括当前在系统上运行的任何独占 IP 区域。缺省情况下，按照 \fBzonecfg\fR(1M) 执行区域绑定。
.RE

.sp
.ne 2
.mk
.na
\fB\fBallow-autoconf\fR\fR
.ad
.sp .6
.RS 4n
指定是否应自动配置物理链路。仅当系统定义的自动网络配置文件处于活动状态时，此属性才适用。缺省值为 1，表示将自动配置链路。如果将该值设置为 0，将不会自动配置链路。
.RE

.sp
.ne 2
.mk
.na
\fB\fBfw-vers\fR\fR
.ad
.sp .6
.RS 4n
仅适用于物理数据链路。一个只读属性，用于指定物理 NIC 的固件版本信息。只有当通过 \fB-p\fR 选项显式请求此属性时，才会显示此属性。其值的格式、含义和稳定性取决于每个具体驱动程序，并且在驱动程序的手册页中可能有成文的记录。
.RE

.sp
.LP
在 IPoIB VNIC 上，仅支持以下链路属性：\fBautopush\fR、\fBzone\fR、\fBmaxbw\fR、\fBcpus\fR、\fBrxfanout\fR、\fBpool\fR、\fBpriority\fR、\fBprotection\fR、\fBallowed-ips\fR 和 \fBallowed-dhcp-cids\fR。
.SS "Wifi 链路属性"
.sp
.LP
支持下列 \fBWiFi\fR 链路属性。请注意，将给定属性设置为给定值的功能取决于驱动程序和硬件。
.sp
.ne 2
.mk
.na
\fB\fBchannel\fR\fR
.ad
.sp .6
.RS 4n
指定要使用的通道。当处于 \fBIBSS\fR 模式时，只能通过特定 \fBWiFi\fR 链路修改此属性。缺省值和允许值范围因管理域而异。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpowermode\fR\fR
.ad
.sp .6
.RS 4n
指定 \fBWiFi\fR 链路的电源管理模式。可能的值包括 \fBoff\fR（禁用电源管理）、\fBmax\fR（最省电模式）和 \fBfast\fR（性能敏感型电源管理）。缺省值为 \fBoff\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBradio\fR\fR
.ad
.sp .6
.RS 4n
指定 \fBWiFi\fR 链路的无线电模式。可能的值包括 \fBon\fR 或 \fBoff\fR。缺省值为 \fBon\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBspeed\fR\fR
.ad
.sp .6
.RS 4n
指定 \fBWiFi\fR 链路的固定速度（以兆位/秒为单位）。可能的值集取决于驱动程序和硬件（但可通过 \fBshow-linkprop\fR 显示）；常用速度包括 1、2、11 和 54。缺省情况下，没有固定速度。 
.RE

.SS "以太网链路属性"
.sp
.LP
仅在只读模式下支持下面的 MII 属性（如 \fBieee802.3\fR(5) 中所述）。
.RS +4
.TP
.ie t \(bu
.el o
\fBduplex\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBstate\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBadv_autoneg_cap\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBadv_10gfdx_cap\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBadv_1000fdx_cap\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBadv_1000hdx_cap\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBadv_100fdx_cap\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBadv_100hdx_cap\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBadv_10fdx_cap\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBadv_10hdx_cap\fR
.RE
.sp
.LP
各 \fBadv_\fR 属性（例如，\fBadv_10fdx_cap\fR）还具有一个对应的读/写 \fBen_\fR 属性（例如，\fBen_10fdx_cap\fR），用于控制在自动协商时使用的参数。在没有电源管理时，可通过 \fBadv\fR* 速度/双工参数提供经过协商的、可在当前硬件中使用的值。但是，如果启用电源管理，当前在硬件中公开的速度/双工功能可能是初始链路参数协商中使用的位集的子集。因此，可将 MII \fBadv_\fR* 参数标记为只读，并将另一组 \fBen_\fR* 参数用于配置初始协商时的速度和双工属性。
.sp
.LP
请注意，\fBadv_autoneg_cap\fR 没有对应的 \fBen_autoneg_cap\fR：\fBadv_autoneg_cap\fR 本身是禁用/启用自动协商的 0/1 开关，因此不受电源管理的影响。
.sp
.LP
此外，系统还会报告下列以太网属性：
.sp
.ne 2
.mk
.na
\fB\fBflowctrl\fR\fR
.ad
.sp .6
.RS 4n
建立将通过设备宣传的流量控制模式。有效输入为下列项之一：
.sp
.ne 2
.mk
.na
\fB\fBauto\fR\fR
.ad
.sp .6
.RS 4n
设备上的流量控制模式是动态确定的。要查看设备上设置的实际流量控制模式，请检查 \fBflowctrl\fR 属性的 \fBeffective\fR 值。
.RE

.sp
.ne 2
.mk
.na
\fB\fBno\fR\fR
.ad
.sp .6
.RS 4n
不启用流量控制。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrx\fR\fR
.ad
.sp .6
.RS 4n
接收并处理传入暂停帧。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtx\fR\fR
.ad
.sp .6
.RS 4n
当发生拥塞时，将暂停帧传送到同级设备，但忽略接收的暂停帧。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpfc\fR\fR
.ad
.sp .6
.RS 4n
传送包含应暂停的通信流量的优先级值的暂停帧。接收暂停帧，并对已在帧中指定其优先级值的通信流量执行操作。
.RE

.sp
.ne 2
.mk
.na
\fB\fBbi\fR\fR
.ad
.sp .6
.RS 4n
双向流量控制。
.RE

请注意，此值的实际设置受设备和链路合作伙伴允许的功能的限制。同样，\fBflowctrl\fR 的有效值指示系统选择的值。
.RE

.sp
.ne 2
.mk
.na
\fB\fBgvrp-timeout\fR\fR
.ad
.sp .6
.RS 4n
指定 VID 声明广播之间的等待时间（以毫秒为单位）。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmtu\fR\fR
.ad
.sp .6
.RS 4n
设备支持的最大客户机 SDU（Send Data Unit，发送数据单位）。有效范围为 68-65536。
.RE

.sp
.ne 2
.mk
.na
\fB\fBntcs\fR\fR
.ad
.sp .6
.RS 4n
设备上支持的通信流量类的数目。支持 DCB（Data Center Bridging，数据中心桥接）扩展的设备可以支持多个通信流量类。此属性可用于确定设备是否支持 DCB 扩展。该属性是只读属性。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpfcmap\fR\fR
.ad
.sp .6
.RS 4n
此属性用于指示启用 PFC（Priority-based flow control，基于优先级的流量控制）的 802.1p 优先级值。这是一个 8 位掩码，其中的每个位都表示是否为相应的优先级启用 PFC。对于启用 PFC 的优先级，设备将在发生拥塞时为该优先级传送暂停帧。这仅在 \fBntcs\fR 大于零且 \fBflowctrl\fR 的 \fBeffective\fR 值为 \fBpfc\fR 时才相关。
.sp
\fBpfcmap\fR 的有效值可以是用户配置的值或 \fBpfcmap-rmt\fR 的有效值，具体取决于 LLDP DCBx 协商。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpfcmap-rmt\fR\fR
.ad
.sp .6
.RS 4n
此属性用于指示远程对等方（通常为相邻的交换机）的 PFC 配置。
.RE

.sp
.ne 2
.mk
.na
\fB\fBptp\fR\fR
.ad
.sp .6
.RS 4n
（只读）此属性用于指示设备中的 PTP 硬件辅助是否可用。
.RE

.sp
.ne 2
.mk
.na
\fB\fBspeed\fR\fR
.ad
.sp .6
.RS 4n
（只读）设备的运行速度 (Mbps)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtagmode\fR\fR
.ad
.sp .6
.RS 4n
此链路属性用于控制将在链路上传送的包中插入 802.1Q VLAN 标记的条件。可以为此属性分配两个模式值：
.sp
.ne 2
.mk
.na
\fB\fBnormal\fR\fR
.ad
.RS 12n
.rt  
在下列条件下，在外发包中插入 VLAN 标记：
.RS +4
.TP
.ie t \(bu
.el o
此包属于某个 VLAN。
.RE
.RS +4
.TP
.ie t \(bu
.el o
用户已请求优先级标记。
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fBvlanonly\fR\fR
.ad
.RS 12n
.rt  
仅当外发包属于某个 VLAN 时才插入 VLAN 标记。如果在此模式下插入标记，并且用户还请求了非零优先级，则遵循此优先级并将其包含在 VLAN 标记中。
.RE

缺省值为 \fBvlanonly\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvlan-announce\fR\fR
.ad
.sp .6
.RS 4n
此属性控制自动 VLAN ID 声明。启用此属性后，它将广播设备上配置的任何 VNIC 或 VLAN 的 VID。它支持物理链路和聚合。可能的值为：
.sp
.ne 2
.mk
.na
\fB\fBoff\fR\fR
.ad
.sp .6
.RS 4n
不会发送 VID 声明。
.RE

.sp
.ne 2
.mk
.na
\fB\fBgvrp\fR\fR
.ad
.sp .6
.RS 4n
使用 GVRP 协议发送的声明（按照 802.1D 中的定义）。请参见 \fBgvrp-timeout\fR 以配置广播频率。
.RE

.RE

.SS "InfiniBand 链路属性"
.sp
.LP
以下属性仅在 IB 分区对象数据链路和 IPoIB VNIC 数据链路上受支持。
.sp
.ne 2
.mk
.na
\fB\fBlinkmode\fR\fR
.ad
.sp .6
.RS 4n
在 IB 分区数据链路上设置链路传输服务类型。缺省值为 \fBcm\fR。有效值包括：
.sp
.ne 2
.mk
.na
\fB\fBcm\fR\fR
.ad
.sp .6
.RS 4n
连接模式。此模式使用缺省 MTU 65520，并且支持的最大 MTU 为 65535 字节。如果远程节点无法使用连接模式，则会自动改用不可靠的数据报模式。
.RE

.sp
.ne 2
.mk
.na
\fB\fBud\fR\fR
.ad
.sp .6
.RS 4n
不可靠的数据报模式。此模式使用缺省 MTU 2044，并且支持的最大 MTU 为 4092 字节。
.RE

.RE

.SS "IP 隧道链路属性"
.sp
.LP
支持下列 IP 隧道链路属性。
.sp
.ne 2
.mk
.na
\fB\fBhoplimit\fR\fR
.ad
.sp .6
.RS 4n
指定用于封装隧道链路的外部 IP 头的 IPv4 TTL 或 IPv6 跳数限制。所有隧道类型都存在此属性。缺省值为 64。
.RE

.sp
.ne 2
.mk
.na
\fB\fBencaplimit\fR\fR
.ad
.sp .6
.RS 4n
指定 IPv6 隧道的 IPv6 封装限制（按照 RFC 2473 中的定义）。此值是给定隧道包的隧道嵌套限制。缺省值为 4。值为 0 表示将禁用封装限制。
.RE

.SS "聚合链路属性"
.sp
.LP
仅 DLMP 模式聚合支持以下属性。
.sp
.ne 2
.mk
.na
\fB\fBprobe-ip\fR\fR
.ad
.sp .6
.RS 4n
此属性是允许用作 ICMP 探测的源 IP 地址的 IP 地址逗号分隔列表。如果配置（为激活的主地址或作为 VNIC），此列表中的 IP 地址将用于 ICMP 探测。这些 IP 地址将向像平常一样继续传输数据通信。因此，不需要为探测保留专用 IP 地址。
.sp
列表中的每个字段包含“源 IP”后跟可选目标配置信息。如果指定，目标信息可以是目标 IP 地址或字符串 "rt"。如果是后者，\fBin.dlmpd\fR 守护进程将查询路由表以查找与指定“源 IP”地址相同的子网上的路由，使用指定的下一中继站作为目标 IP 地址。
.sp
如果未指定目标，DLMP 探测服务将尝试通过发送 ICMP 多播包来搜索可能目标 IP 地址。
.sp
无论目标 IP 地址的源如何（来自搜索、指定或路由表），目标 IP 地址必须与指定的源 IP 地址位于相同子网上，否则其不会生效。
.sp
接受以下格式。请注意，"target" 可以是目标的 IP 地址或主机名：
.sp
.ne 2
.mk
.na
\fB<\fIIP address\fR>[/\fBprefixlen \fR][+<\fItarget address\fR>\fR
.ad
.sp .6
.RS 4n
明确指定 IP 地址及其前缀长度（可选）。例如，\fI10.134.8.0/24+\fR。
.RE

.sp
.ne 2
.mk
.na
\fB<\fIaddrobj_name\fR>[+<\fItarget address\fR>\fR
.ad
.sp .6
.RS 4n
指定特定 \fIaddrobj\fR 名称，可以在 \fBipadm show-addr\fR 输出中看到该名称。例如，\fIvnic1/addr1+169.156.0.1\fR。
.RE

.sp
.ne 2
.mk
.na
\fB<\fIinterface_name\fR>[+<\fItarget address\fR>\fR
.ad
.sp .6
.RS 4n
指定特定接口名称。可以是聚合接口自身的名称或通过该聚合配置的任何 VNIC。在指定接口上配置的所有 IPv4 地址和 IPv6 地址将用于 ICMP 探测。请注意，为避免混淆主机名和接口名称，接口名称将用方括号括起来。例如，[\fIdlmp1\fR]+。 
.RE

.sp
.ne 2
.mk
.na
\fB+[<\fItarget\fR>]\fR
.ad
.sp .6
.RS 4n
如果未指定源 IP 地址，在全局区域中的聚合和 VNIC 上配置的所有 IP 地址将成为 ICMP 探测器的潜在源 IP 地址。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBprobe-fdt\fR\fR
.ad
.sp .6
.RS 4n
此链路属性定义故障检测时间。它配置预期故障检测时间值，以秒为单位。缺省值为 10 秒。
.RE

.SH 示例
.LP
\fB示例 1 \fR显示数据链路配置
.sp
.LP
以下命令显示了在不使用参数的情况下调用 \fBdladm\fR 的效果。

.sp
.in +2
.nf
# \fBdladm\fR
LINK                CLASS     MTU    STATE    OVER
net0                phys      1500   up       --
net1                phys      1500   up       --
net2                phys      1500   unknown  --
net3                phys      1500   up       --
vnic1               vnic      1500   up       net1
vlan1               vlan      1500   up       net1
aggr1               aggr      1500   up       net2 net3
stub1               etherstub 9000   unknown  --
.fi
.in -2
.sp

.LP
\fB示例 2 \fR配置聚合
.sp
.LP
要使用密钥 1 在设备 \fBbge0\fR（链路名称 \fBnet0\fR）和 \fBbge1\fR（链路名称 \fBnet1\fR）的聚合上方配置数据链路，请输入以下命令：

.sp
.in +2
.nf
# \fBdladm create-aggr -l net0 -l net1 1\fR
.fi
.in -2
.sp

.sp
.LP
要为设备 \fBe1000g1\fR（链路名称 \fBnet0\fR）和 \fBe1000g2\fR（链路名称 \fBnet1\fR）配置一个名为 \fBaggr1\fR 的 IEEE 802.3ad 链路聚合，请输入以下命令：

.sp
.in +2
.nf
# \fBdladm create-aggr -l net0 -l net1 aggr1\fR
.fi
.in -2
.sp

.sp
.LP
要为设备 \fBixgbe1\fR（链路名称 \fBnet2\fR）和 \fBixgbe2\fR（链路名称 \fBnet3\fR）配置名为 \fBaggr2\fR 的数据链路多路径 (\fBdlmp\fR) 链路聚合，请输入以下命令：

.sp
.in +2
.nf
# \fBdladm create-aggr -m dlmp -l net2  -l net3 aggr2\fR
.fi
.in -2
.sp

.sp
.LP
要列出聚合，请输入以下命令：

.sp
.in +2
.nf
# \fBdladm show-aggr\fR
LINK              MODE    POLICY   ADDRPOLICY           LACPACTIVITY  LACPTIMER
aggr1             trunk   L4       auto                 off           short
aggr2             dlmp    --       --                   --            --
.fi
.in -2
.sp

.LP
\fB示例 3 \fR连接到 WiFi 链路
.sp
.LP
要通过一个 \fBWiFi\fR 链路连接到系统上不安全的最佳可用网络（按照为 \fBconnect-wifi\fR 指定的优先级规则），请输入以下命令：

.sp
.in +2
.nf
# \fBdladm connect-wifi\fR
.fi
.in -2
.sp

.LP
\fB示例 4 \fR创建 WiFi 密钥
.sp
.LP
要以交互方式创建 \fBWEP\fR 密钥 \fBmykey\fR，请输入以下命令：

.sp
.in +2
.nf
# \fBdladm create-secobj -c wep mykey\fR
.fi
.in -2
.sp

.sp
.LP
此外，也可以使用文件内容以非交互方式创建 \fBWEP\fR 密钥 \fBmykey\fR：

.sp
.in +2
.nf
# \fBumask 077\fR
 # \fBcat >/tmp/mykey.$$ <<EOF\fR
 \fB12345\fR
 \fBEOF\fR
 # \fBdladm create-secobj -c wep -f /tmp/mykey.$$ mykey\fR
 # \fBrm /tmp/mykey.$$\fR
.fi
.in -2
.sp

.LP
\fB示例 5 \fR连接到指定的加密 WiFi 链路
.sp
.LP
要使用密钥 \fBmykey\fR 在链路 \fBath0\fR 上连接到 \fBESSID\fR \fBwlan\fR，请输入以下命令：

.sp
.in +2
.nf
# \fBdladm connect-wifi -k mykey -e wlan ath0\fR
.fi
.in -2
.sp

.LP
\fB示例 6 \fR更改链路属性
.sp
.LP
要在链路 \fBpcwl0\fR 上将 \fBpowermode\fR 设置为值 \fBfast\fR，请输入以下命令：

.sp
.in +2
.nf
# \fBdladm set-linkprop -p powermode=fast pcwl0\fR
.fi
.in -2
.sp

.LP
\fB示例 7 \fR连接到受 WPA 保护的 WiFi 链路
.sp
.LP
创建 WPA 密钥 \fBpsk\fR 并输入以下命令：

.sp
.in +2
.nf
# \fBdladm create-secobj -c wpa psk\fR
.fi
.in -2
.sp

.sp
.LP
然后，若要在链路 \fBath0\fR 上使用密钥 \fBpsk\fR 连接到 ESSID \fBwlan\fR，请输入以下命令：

.sp
.in +2
.nf
# \fBdladm connect-wifi -k psk -e wlan ath0\fR
.fi
.in -2
.sp

.LP
\fB示例 8 \fR重命名链路
.sp
.LP
要将 \fBbge0\fR 链路重命名为 \fBmgmt0\fR，请输入以下命令：

.sp
.in +2
.nf
# \fBdladm rename-link bge0 mgmt0\fR
.fi
.in -2
.sp

.LP
\fB示例 9 \fR更换网卡
.sp
.LP
假定由于硬件故障，需要将 \fBbge0\fR 设备（其链路命名为 \fBmgmt0\fR，如上一示例所示）替换为 \fBce0\fR 设备。以物理方式删除 \fBbge0\fR NIC，然后将其替换为新的 \fBce0\fR NIC。要将新添加的 \fBce0\fR 设备与 \fBmgmt0\fR 配置（以前与 \fBbge0\fR 关联）关联，请输入以下命令：

.sp
.in +2
.nf
# \fBdladm rename-link ce0 mgmt0\fR
.fi
.in -2
.sp

.LP
\fB示例 10 \fR删除网卡
.sp
.LP
假定在上一示例中，目的不是将 \fBbge0\fR NIC 更换为其他 NIC，而是删除但不更换此硬件。此种情况下，不应将 \fBmgmt0\fR 数据链路配置指定为与不同物理设备相关联（如上一示例所示），而应将其删除。请输入以下命令，以便删除与 \fBmgmt0\fR 数据链路相关联的数据链路配置，该数据链路的物理硬件（在本示例中为 \fBbge0\fR）已被删除：

.sp
.in +2
.nf
# \fBdladm delete-phys mgmt0\fR
.fi
.in -2
.sp

.LP
\fB示例 11 \fR使用可解析的输出捕获一个字段
.sp
.LP
下面的赋值将链路 \fBnet0\fR 的 MTU 保存为名为 \fBmtu\fR 的变量。

.sp
.in +2
.nf
# \fBmtu=`dladm show-link -p -o mtu net0`\fR
.fi
.in -2
.sp

.LP
\fB示例 12 \fR使用可解析的输出在链路上迭代
.sp
.LP
下面的脚本显示系统中每个链路的状态。

.sp
.in +2
.nf
# \fBdladm show-link -p -o link,state | while IFS=: read link state; do
            print "Link $link is in state $state"
        done\fR
.fi
.in -2
.sp

.LP
\fB示例 13 \fR配置 VNIC
.sp
.LP
通过一个物理链路 \fBnet0\fR 创建两个名为 \fBhello0\fR 和 \fBtest1\fR 的 VNIC：

.sp
.in +2
.nf
# \fBdladm create-vnic -l net0 hello0\fR
# \fBdladm create-vnic -l net0 test1\fR
.fi
.in -2
.sp

.LP
\fB示例 14 \fR配置 VNIC 并分配带宽和优先级
.sp
.LP
通过一个物理链路 \fBnet0\fR 创建两个名为 \fBhello0\fR 和 \fBtest1\fR 的 VNIC，并将 \fBhello0\fR 作为具有较高优先级的 VNIC，它具有出厂时分配的 MAC 地址，其最大带宽为 50 Mbps。将 \fBtest1\fR 作为具有较低优先级的 VNIC，它采用随机 MAC 地址，其最大带宽为 100 Mbps。

.sp
.in +2
.nf
# \fBdladm create-vnic -l net0 -m factory -p maxbw=50,priority=high hello0\fR
# \fBdladm create-vnic -l net0 -m random -p maxbw=100M,priority=low test1\fR
.fi
.in -2
.sp

.LP
\fB示例 15 \fR使用出厂 MAC 地址配置 VNIC
.sp
.LP
首先，列出可用的出厂 MAC 地址，并选择其中之一： 

.sp
.in +2
.nf
# \fBdladm show-phys -m net0\fR
LINK            SLOT         ADDRESS              INUSE    CLIENT
net0            primary      0:e0:81:27:d4:47     yes      net0
net0            1            8:0:20:fe:4e:a5      no
net0            2            8:0:20:fe:4e:a6      no
net0            3            8:0:20:fe:4e:a7      no
.fi
.in -2
.sp

.sp
.LP
创建一个名为 \fBhello0\fR 的 VNIC，并使用插槽 1 的地址：

.sp
.in +2
.nf
# \fBdladm create-vnic -l net0 -m factory -n 1 hello0\fR
# \fBdladm show-phys -m net0\fR
LINK            SLOT         ADDRESS              INUSE    CLIENT
net0            primary      0:e0:81:27:d4:47     yes      net0
net0            1            8:0:20:fe:4e:a5      yes      hello0
net0            2            8:0:20:fe:4e:a6      no
net0            3            8:0:20:fe:4e:a7      no
.fi
.in -2
.sp

.LP
\fB示例 16 \fR使用用户指定的 MAC 地址创建 VNIC，并将其绑定到处理器集
.sp
.LP
使用用户指定的 MAC 地址和处理器绑定 \fB0, 2, 4-6\fR 创建一个名为 \fBhello0\fR 的 VNIC。

.sp
.in +2
.nf
# \fBdladm create-vnic -l net0 -m 8:0:20:fe:4e:b8 -p cpus=0,2,4-6 hello0\fR
.fi
.in -2
.sp

.LP
\fB示例 17 \fR创建无物理 NIC 的虚拟网络
.sp
.LP
首先，创建一个名称为 \fBstub1\fR 的 etherstub：

.sp
.in +2
.nf
# \fBdladm create-etherstub stub1\fR
.fi
.in -2
.sp

.sp
.LP
在此 etherstub 上创建两个名为 \fBhello0\fR 和 \fBtest1\fR 的 VNIC。此操作会隐式创建一个连接 \fBhello0\fR 和 \fBtest1\fR 的虚拟交换机。

.sp
.in +2
.nf
# \fBdladm create-vnic -l stub1 hello0\fR
# \fBdladm create-vnic -l stub1 test1\fR
.fi
.in -2
.sp

.LP
\fB示例 18 \fR显示网桥信息
.sp
.LP
下面的命令使用了不带选项和带有不同选项的 \fBshow-bridge\fR 子命令。

.sp
.in +2
.nf
# \fBdladm show-bridge\fR
BRIDGE       PROTECT ADDRESS           PRIORITY DESROOT
foo          stp     32768/8:0:20:bf:f 32768    8192/0:d0:0:76:14:38
bar          stp     32768/8:0:20:e5:8 32768    8192/0:d0:0:76:14:38

# \fBdladm show-bridge -l foo\fR
LINK         STATE        UPTIME   DESROOT
hme0         forwarding   117      8192/0:d0:0:76:14:38
qfe1         forwarding   117      8192/0:d0:0:76:14:38

# \fBdladm show-bridge -s foo\fR
BRIDGE       DROPS        FORWARDS
foo          0            302

# \fBdladm show-bridge -ls foo\fR
LINK         DROPS     RECV      XMIT
hme0         0         360832    31797
qfe1         0         322311    356852

# \fBdladm show-bridge -f foo\fR
DEST              AGE     FLAGS  OUTPUT
8:0:20:bc:a7:dc   10.860  --     hme0
8:0:20:bf:f9:69   --      L      hme0
8:0:20:c0:20:26   17.420  --     hme0
8:0:20:e5:86:11   --      L      qfe1
.fi
.in -2
.sp

.LP
\fB示例 19 \fR创建 IPv4 隧道
.sp
.LP
可通过下面的命令序列在 66.1.2.3 和 192.4.5.6 之间创建并显示一个名为 \fBmytunnel0\fR 的持久性 IPv4 隧道链路：

.sp
.in +2
.nf
# \fBdladm create-iptun -T ipv4 -a local=66.1.2.3,remote=192.4.5.6 mytunnel0\fR
# \fBdladm show-iptun mytunnel0\fR
LINK            TYPE  FLAGS  SOURCE              DESTINATION
mytunnel0       ipv4  --     66.1.2.3            192.4.5.6
.fi
.in -2
.sp

.sp
.LP
然后，可以在此隧道链路上创建点对点 IP 接口：

.sp
.in +2
.nf
# \fBipadm create-ip mytunnel0\fR
# \fBipadm create-addr -T static -a local=10.1.0.1,remote=10.1.0.2 \e\fR
\fBmytunnel0/addr\fR
# \fBipadm show-addr mytunnel0/addr\fR
ADDROBJ           TYPE     STATE        ADDR
mytunnel0/addr    static   ok           10.1.0.1->10.1.0.2
.fi
.in -2
.sp

.LP
\fB示例 20 \fR创建 6to4 隧道
.sp
.LP
下面的命令了创建一个 6to4 隧道链路。6to4 路由器的 IPv4 地址为 75.10.11.12。

.sp
.in +2
.nf
# \fBdladm create-iptun -T 6to4 -a local=75.10.11.12 sitetunnel0\fR
# \fBdladm show-iptun sitetunnel0\fR
LINK            TYPE  FLAGS  SOURCE              DESTINATION
sitetunnel0     6to4  --     75.10.11.12         --
.fi
.in -2
.sp

.sp
.LP
下面的命令在此隧道上创建了一个 IPv6 接口：

.sp
.in +2
.nf
# \fBipadm create-ip sitetunnel0\fR
# \fBipadm show-addr sitetunnel0/_a\fR
ADDROBJ           TYPE     STATE        ADDR
sitetunnel0/_a    static   ok           2002:4b0a:b0c::1/16
.fi
.in -2
.sp

.sp
.LP
请注意，系统在 6to4 接口上自动配置 IPv6 地址。有关如何在 6to4 隧道链路上配置 IPv6 地址的说明，请参见 \fBipadm\fR(1M)。

.LP
\fB示例 21 \fR使用链路保护
.sp
.LP
启用链路保护：

.sp
.in +2
.nf
# \fBdladm set-linkprop \e\fR
\fB-p protection=mac-nospoof,restricted,ip-nospoof,dhcp-nospoof vnic0\fR
.fi
.in -2
.sp

.sp
.LP
禁用链路保护：

.sp
.in +2
.nf
# \fBdladm reset-linkprop -p protection vnic0\fR
.fi
.in -2
.sp

.sp
.LP
修改 \fBallowed-ips\fR 列表：

.sp
.in +2
.nf
# \fBdladm set-linkprop -p allowed-ips=10.0.0.1,10.0.0.2 vnic0\fR
.fi
.in -2
.sp

.sp
.LP
修改 \fBallowed-dhcp-cids\fR 列表：

.sp
.in +2
.nf
# \fBdladm set-linkprop -p allowed-dhcp-cids=hello vnic0\fR
.fi
.in -2
.sp

.sp
.LP
显示生成的配置：

.sp
.in +2
.nf
# \fBdladm show-linkprop -p protection,allowed-ips vnic0\fR

LINK  PROPERTY    PERM   VALUE        EFFECTIVE    DEFAULT POSSIBLE
vnic0 protection  rw     mac-nospoof, mac-nospoof, --      mac-nospoof,
                         restricted,  restricted,          restricted,
                         ip-nospoof,  ip-nospoof,          ip-nospoof,
                         dhcp-nospoof dhcp-nospoof         dhcp-nospoof
vnic0 allowed-ips rw     10.0.0.1,    10.0.0.1,    --      --
                         10.0.0.2     10.0.0.2
vnic0 allowed-dhcp-cids rw hello      hello        --      --
.fi
.in -2
.sp

.LP
\fB示例 22 \fR创建 IB 分区
.sp
.LP
下面的命令使用分区密钥 \fB0xffff\fR 在物理链路 \fBibp0\fR 上创建了一个 \fBffff.ibp0\fR 分区。

.sp
.in +2
.nf
# \fBdladm create-part -P ffff -l ibp0 ffff.ibp0\fR
.fi
.in -2
.sp

.LP
\fB示例 23 \fR显示 IB 分区信息
.sp
.LP
下面的命令显示了 IB 分区信息。

.sp
.in +2
.nf
# \fBdladm show-part\fR
LINK         PKEY OVER         STATE    FLAGS
ffff.ibp0    FFFF ibp0         up       ----
.fi
.in -2
.sp

.LP
\fB示例 24 \fR显示 IB 数据链路信息
.sp
.LP
下面的命令显示了 IB 数据链路信息。

.sp
.in +2
.nf
# \fBdladm show-ib\fR
LINK     HCAGUID        PORTGUID       PORT STATE  GWNAME GWPORT  PKEYS
net0     3BA000100CD7C  3BA000100CD7D  1    down   --     --      FFFF
net1     3BA000100CD7C  3BA000100CD7E  2    down   --     --      FFFF
net3     5AD0000033634  5AD0000033636  2    up     --     --      FFFF,8001
net2     5AD0000033634  5AD0000033635  1    up     --     --      FFFF,8001
.fi
.in -2
.sp

.LP
\fB示例 25 \fR显示 IB HCA 映射
.sp
.LP
以下命令显示 IB HCA 名称，该名称由每个 IB 链路运行的 \fBibadm\fR(1M) 进行管理。

.sp
.in +2
.nf
# \fBdladm show-ib -o link,hca,port,hcaguid,portguid,pkeys\fR
LINK     HCA            PORT   HCAGUID        PORTGUID       PKEYS
net0     hermon0        1      3BA000100CD7C  3BA000100CD7D  FFFF,8001
net1     hermon0        2      3BA000100CD7C  3BA000100CD7E  FFFF,8001
net3     hermon0.vhca0  2      5AD0000033634  5AD0000033636  FFFF,8001
net2     hermon0.vhca1  1      5AD0000033634  5AD0000033635  FFFF,8001
.fi
.in -2
.sp

.LP
\fB示例 26 \fR删除分区
.sp
.LP
下面的命令删除了分区 \fBffff.ibp0\fR。

.sp
.in +2
.nf
# \fBdladm delete-part ffff.ibp0\fR
.fi
.in -2
.sp

.LP
\fB示例 27 \fR使用 \fBshow-link\fR 显示分区信息
.sp
.LP
下面的命令使用 \fBshow-link\fR 子命令显示分区信息。

.sp
.in +2
.nf
# \fBdladm show-link\fR
LINK        CLASS     MTU    STATE    OVER
e1000g0     phys      1500   up       --
e1000g1     phys      1500   unknown  --
net0        phys      65520  down     --
net3        phys      65520  up       --
net2        phys      65520  up       --
net1        phys      65520  down     --
pffff.ibp0  part      2044   down     ibp0
p8001.ibp2  part      65520  unknown  ibp2
.fi
.in -2
.sp

.LP
\fB示例 28 \fR从全局区域显示所有区域中的链路
.sp
.LP
下面所示的 \fBshow-link\fR 命令将从全局区域显示所有区域中的数据链路。不在全局区域中的链路将以区域名前缀后跟斜杠 (\fB/\fR) 分隔符的方式显示。

.sp
.LP
在本示例中，\fBnet0\fR 是在全局区域中创建的 VNIC，\fBzone1/net0\fR 是自动为 \fBzone1\fR 创建的 VNIC，\fBzone2/net0\fR 是自动为 \fBzone2\fR 创建的 VNIC。

.sp
.in +2
.nf
# \fBdladm show-link\fR
LINK                CLASS     MTU    STATE    OVER
e1000g0             phys      1500   up       --
e1000g1             phys      8170   unknown  --
e1000g2             phys      1500   unknown  --
e1000g3             phys      1500   unknown  --
net0                vnic      1500   up       e1000g0
zone1/net0          vnic      1500   up       e1000g0
zone2/net0          vnic      1500   up       e1000g0
.fi
.in -2
.sp

.LP
\fB示例 29 \fR显示全局区域中的链路
.sp
.LP
以下 \fBshow-link\fR 命令仅显示全局区域中的数据链路。

.sp
.in +2
.nf
# \fBdladm show-link -z global\fR
LINK                CLASS     MTU    STATE    OVER
e1000g0             phys      1500   up       --
e1000g1             phys      8170   unknown  --
e1000g2             phys      1500   unknown  --
e1000g3             phys      1500   unknown  --
net0                vnic      1500   up       e1000g0
.fi
.in -2
.sp

.LP
\fB示例 30 \fR显示指定区域的链路
.sp
.LP
以下 \fBshow-link\fR 命令显示特定非全局区域中的数据链路。

.sp
.in +2
.nf
# \fBdladm show-link -z zone1\fR
LINK                CLASS     MTU    STATE    OVER
zone1/net0          vnic      1500   up       e1000g0
.fi
.in -2
.sp

.LP
\fB示例 31 \fR从全局区域显示指定区域的链路
.sp
.LP
以下 \fBshow-link\fR 命令从全局区域显示特定非全局区域中的数据链路。

.sp
.in +2
.nf
# \fBdladm show-link -z zone1\fR
LINK                CLASS     MTU    STATE    OVER
zone1/net0          vnic      1500   up       e1000g0
.fi
.in -2
.sp

.LP
\fB示例 32 \fR显示非全局区域中的链路
.sp
.LP
下面所示的 \fBshow-link\fR 是从 \fBzone1\fR 进行调用的，仅显示该区域的数据链路。

.sp
.LP
请注意，在 \fBshow-link\fR 输出中，不会显示 \fBzone1/\fR 前缀。不显示前缀的原因是命令是从区域内部调用的。

.sp
.in +2
.nf
# \fBzlogin zone1\fR
# \fBdladm show-link -z zone1\fR
LINK                CLASS     MTU    STATE    OVER
net0                vnic      1500   up       ?
.fi
.in -2
.sp

.LP
\fB示例 33 \fR使用 -Z 选项显示当前区域
.sp
.LP
下面的命令假定以下情况：

.RS +4
.TP
.ie t \(bu
.el o
链路 \fBnet1\fR 当前已分配给 \fBzoneA\fR。条目 \fBnet1\fR 和 \fBzoneA/net1\fR 表示同一链路。这两个条目的 \fBZONE\fR 列相同且为链路当前分配给的区域的名称。
.RE
.RS +4
.TP
.ie t \(bu
.el o
链路 \fBnet2\fR 未分配给任何非全局区域。
.RE
.RS +4
.TP
.ie t \(bu
.el o
链路 \fBzoneB/net2\fR 是自动为 \fBzoneB\fR 创建的 VNIC。
.RE
.RS +4
.TP
.ie t \(bu
.el o
链路 \fBzoneC/net2\fR 是自动为 \fBzoneC\fR 创建的 VNIC。
.RE
.RS +4
.TP
.ie t \(bu
.el o
链路 \fBzoneD/net2\fR 是在 \fBzoneD\fR 内创建的 IP 隧道。与 \fBnet1\fR 不同的是，\fBnet2\fR 的每个条目均表示一个不同的链路。这些条目的 \fBZONE\fR 列是不同的。
.RE
.sp
.in +2
.nf
# \fBdladm show-link -Z\fR
LINK        ZONE      CLASS     MTU    STATE    OVER
e1000g0     global    phys      1500   up       --
e1000g1     global    phys      1500   up       --
net1        zoneA     vnic      1500   up       e1000g0
zoneA/net1  zoneA     vnic      1500   up       e1000g0
net2        global    vnic      1500   up       e1000g1
zoneB/net2  zoneB     vnic      1500   up       e1000g1
zoneC/net2  zoneC     vnic      1500   up       e1000g1
zoneD/net2  zoneD     iptun     65515  up       --
.fi
.in -2
.sp

.LP
\fB示例 34 \fR显示 VDP 信息
.sp
.LP
以下命令显示 \fBvnic1\fR 的 VDP 信息。

.sp
.in +2
.nf
# \fBdladm show-ether -P vdp vnic1\fR
LINK    VSI     VSIID           VSI-TYPEID      VSI-STATE CMD-PENDING
ixgbe1  vnic1   2:8:20:3:2:b    0x58/0          ASSOC     DEASSOC
.fi
.in -2
.sp

.LP
\fB示例 35 \fR显示 ECP 信息
.sp
.LP
以下命令显示 \fBixgbe1\fR 的 ECP 信息。

.sp
.in +2
.nf
# \fBdladm show-ether -P ecp  ixgbe1\fR
LINK    SEQNO   ACKNO   LAST-ACK        MAX-RETRIES     TIMEOUTS
ixgbe1  65535   25660   0               3                164
.fi
.in -2
.sp

.LP
\fB示例 36 \fR设置 VSI 管理器 ID、VSI 类型和 VSI 版本
.sp
.LP
以下命令设置 \fBvnic1\fR 上的 VSI 管理器 ID、VSI 类型和 VSI 版本。

.sp
.in +2
.nf
# \fBdladm set-linkprop -p vsi-mgrid=fe80::214:4fff:fec2:67c8 vnic1\fR
# \fBdladm set-linkprop -p vsi-typeid=0x64,vsi-vers=1 vnic1\fR
.fi
.in -2
.sp

.LP
\fB示例 37 \fR迁移 VLAN，并修改其 VLAN-ID
.sp
.LP
以下命令序列展示了如何迁移 VLAN 并修改其 VLAN-ID。

.sp
.in +2
.nf
# \fBdladm show-vlan vlan0\fR
LINK		   VID SVID PVLAN-TYPE  FLAGS  OVER
vlan0		   100 --   --          -----  net0
# \fBdladm modify-vlan -l net1 -v 200 vlan0\fR
# \fBdladm show-vlan vlan0\fR
LINK		   VID SVID PVLAN-TYPE  FLAGS  OVER
vlan0		   200 --   --          -----  net1
.fi
.in -2
.sp

.LP
\fB示例 38 \fR迁移多个 VNIC
.sp
.LP
以下命令序列展示了如何迁移多个 VNIC。

.sp
.in +2
.nf
# \fBdladm show-vnic\fR
LINK      OVER     SPEED  MACADDRESS        MACADDRTYPE    IDS
vnic0     net0     1000   2:8:20:ec:c4:1d   random         VID:0
vnic1     net0     1000   2:8:20:ec:c4:1e   random         VID:0
# \fBdladm modify-vnic -l net1 -L net0\fR
# \fBdladm show-vnic\fR
LINK      OVER     SPEED  MACADDRESS        MACADDRTYPE    IDS
vnic0     net1     1000   2:8:20:ec:c4:1d   random         VID:0
vnic1     net1     1000   2:8:20:ec:c4:1e   random         VID:0
.fi
.in -2
.sp

.LP
\fB示例 39 \fR迁移 VNIC 并修改其 MAC 地址
.sp
.LP
以下命令序列展示了如何迁移 VNIC 并修改其 MAC 地址。

.sp
.in +2
.nf
# \fBdladm show-vnic vnic0\fR
LINK      OVER     SPEED  MACADDRESS        MACADDRTYPE    IDS
vnic0     net0     1000   2:8:20:ec:c4:1d   random         VID:0
# \fBdladm modify-vnic -l net1 -m 2:8:20:00:01:02 vnic0\fR
# \fBdladm show-vnic vnic0\fR
LINK      OVER     SPEED  MACADDRESS        MACADDRTYPE    IDS
vnic0     net1     1000   2:8:20:0:1:2      fixed          VID:0
.fi
.in -2
.sp

.LP
\fB示例 40 \fR配置 \fBcos\fR 和 ETS 带宽
.sp
.LP
以下示例在物理链路 \fBnet1\fR 上创建一个名为 \fBvnic1\fR 的 VNIC，并为其指定 \fBcos\fR 值 3。

.sp
.in +2
.nf
# \fBdladm create-vnic -p cos=3 -l net1 vnic1\fR
.fi
.in -2
.sp

.sp
.LP
由 \fBvnic1\fR 传输的所有包都将具有一个 priority 字段设置为 3 的 VLAN 标头。

.sp
.LP
此外，如果底层物理 NIC 已注册了 DCB 功能，还会为 \fBvnic1\fR 分配 ETS 带宽。以下命令假定未安装或未启用 LLDP 包。

.sp
.LP
使用 \fBntcs\fR 链路属性检查底层 NIC 是否注册了 DCB 功能。如果 \fBntcs\fR 值为非零值，则底层 NIC 已注册了 DCB 功能。

.sp
.in +2
.nf
# \fBdladm show-linkprop -p ntcs net1\fR
.fi
.in -2
.sp

.sp
.LP
以下命令会将占链路带宽 10% 的 ETS 带宽分配给 \fBvnic1\fR。

.sp
.in +2
.nf
# \fBdladm set-linkprop -p etsbw_lcl=10 vnic1\fR
.fi
.in -2
.sp

.sp
.LP
请注意，如果还设置了 \fBmaxbw\fR 链路属性，则 \fBmaxbw\fR 值会限制通信流量。

.sp
.LP
当安装并启用了 LLDP 包 (\fBservice/network/lldp\fR) 时，ETS 带宽配置将遵循 IEEE 802.1Qaz 规范。

.sp
.LP
LLDP ETS TLV willing 属性可确定是否已应用本地或远程配置。

.sp
.LP
\fBetsbw-lcl-advice\fR 链路属性指示由远程配置建议的值（如果有）。\fBetsbw-lcl\fR 链路属性的有效值将指示分配给 \fBvnic1\fR 的实际 ETS 带宽。

.sp
.in +2
.nf
# \fBdladm show-linkprop -p etsbw-lcl-advice,etsbw-lcl vnic1\fR
.fi
.in -2
.sp

.sp
.LP
以下命令用于指导对等方为 vnic1 分配 10% 的链路带宽。

.sp
.in +2
.nf
# \fBdladm set-linkprop -p etsbw-rmt-advice=10 vnic1\fR
.fi
.in -2
.sp

.LP
\fB示例 41 \fR配置 EoIB 数据链路
.sp
.LP
检查可以从特定 IB 端口 'ibp1' 到达的所有网关的列表。

.sp
.in +2
.nf
# \fBdladm show-ib ibp1\fR
LINK   HCAGUID        PORTGUID       PORT STATE  GWNAME    GWPORT    PKEYS
ibp1   212800013F2F5A 212800013F2F5B 1    up     nm2gw-1   0a-eth-1  FFFF
                                                 nm2gw-1   0a-eth-2
                                                 nm2gw-1   0a-eth-3
                                                 nm2gw-1   0a-eth-4
.fi
.in -2
.sp

.sp
.LP
创建 EoIB 数据链路 'elink1'，将主机 IB 端口 'ibp1' 绑定到 EoIB 网关 'nm2gw-1' 上的以太网端口 '0a-eth-2'。

.sp
.in +2
.nf
# \fBdladm create-eoib -l ibp1 -g nm2gw-1 -c 0a-eth-2 elink1\fR
.fi
.in -2
.sp

.sp
.LP
确认是否可以通过新创建的 EoIB 数据链路 'elink1' 创建 IP 接口。

.sp
.in +2
.nf
# \fBipadm create-ip elink1\fR
# \fBipadm create-addr -T static -a local=192.168.99.142/24 elink1/v4\fR
.fi
.in -2
.sp

.sp
.in +2
.nf
# \fBdladm show-eoib\fR
LINK    GWNAME  GWPORT   GWID   FLAGS   SPEED  MACADDRESS     OVER
elink1  nm2gw-1 0a-eth-2 1A8    aHnU--  10000  0:25:8b:60:2:3 ibp1
.fi
.in -2
.sp

.sp
.LP
如果不再需要 EoIB 数据链路 'elink1' 并且可以将其删除，则删除通过该数据链路构建的所有 IP 接口（或 VNIC），然后使用 \fBdelete-eoib\fR 子命令删除数据链路自身。

.sp
.in +2
.nf
# \fBipadm delete-ip elink1\fR
# \fBdladm delete-eoib elink1\fR
# \fBdladm show-eoib\fR
.fi
.in -2
.sp

.LP
\fB示例 42 \fR配置通过关闭的 IB 端口的 EoIB 数据链路
.sp
.in +2
.nf
# \fBdladm show-ib -p -o state ibp2\fR
down

# \fBdladm create-eoib -l ibp2 -g nm2gw-1 -c 0a-eth-1 elink2\fR

# \fBipadm create-ip elink2\fR

# \fBdladm show-link elink2\fR
LINK                CLASS     MTU    STATE    OVER
elink2              eoib      1500   down     ibp2
.fi
.in -2
.sp

.sp
.LP
现在，为 \fBibp2\fR 启用 IB 端口并检查数据链路状态。

.sp
.in +2
.nf
# \fBdladm show-ib -p -o state ibp2\fR
up

# \fBdladm show-link elink2\fR
LINK                CLASS     MTU    STATE    OVER
elink2              eoib      1500   up       ibp2
.fi
.in -2
.sp

.LP
\fB示例 43 \fR配置 IB 子网管理器关闭时的 EoIB 数据链路
.sp
.in +2
.nf
nm2gw-2# \fBdisablesm\fR
Stopping partitiond-daemon. [  OK  ]
Stopping IB Subnet Manager..-. [  OK  ]

ib-host# \fBsminfo\fR
ibwarn: [2488] _do_madrpc: recv failed: Connection timed out
ibwarn: [2488] mad_rpc: _do_madrpc failed; dport (Lid 1)
sminfo: iberror: failed: query

ib-host# \fBdladm create-eoib -l ibp2 -g nm2gw-2 -c 0a-eth-1 elink3\fR

ib-host# \fBipadm create-ip elink3\fR

ib-host# \fBdladm show-link elink3\fR
LINK                CLASS     MTU    STATE    OVER
elink3              eoib      1500   down     ibp2
.fi
.in -2
.sp

.sp
.LP
现在，在网关上启用 IB 子网管理器并再次检查数据链路的状态。

.sp
.in +2
.nf
ib-host# \fBdladm show-link elink3\fR
LINK                CLASS     MTU    STATE    OVER
elink3              eoib      1500   up       ibp2
.fi
.in -2
.sp

.LP
\fB示例 44 \fR显示 DLMP 模式聚合的探测状态
.sp
.LP
以下命令显示 DLMP 模式聚合的探测状态。 

.sp
.in +2
.nf
# dladm show-aggr -S aggr1
LINK       PORT   FLAGS  STATE  TARGETS        XTARGETS
aggr1      s1     u--3   active 192.169.0.2    s0
--         s0     u-2-   active --             s1
.fi
.in -2
.sp

.LP
\fB示例 45 \fR显示帮助信息
.sp
.LP
以下命令展示了在不使用参数的情况下调用 \fBhelp\fR 子命令的用法。

.sp
.in +2
.nf
# \fBdladm help\fR
The following subcommands are supported:
Bridge subcommands          : add-bridge, create-bridge, 
                              delete-bridge, modify-bridge, 
                              remove-bridge, show-bridge
EoIB subcommands            : create-eoib, delete-eoib,
                              show-eoib
Etherstub subcommands       : create-etherstub, delete-etherstub,
                              show-etherstub
IB subcommands              : create-part, delete-part,
                              show-ib, show-part
IP tunnel subcommands       : create-iptun, delete-iptun,
                              modify-iptun, show-iptun
Link Aggregation subcommands: add-aggr, create-aggr, delete-aggr,
                              modify-aggr, remove-aggr, show-aggr
Link subcommands            : rename-link, reset-linkprop,
                              set-linkprop, show-link, show-linkprop
Secure Object subcommands   : create-secobj, delete-secobj, 
                              show-secobj
VLAN subcommands            : create-vlan, delete-vlan, show-vlan
VNIC subcommands            : create-vnic, delete-vnic, show-vnic
Wifi subcommands            : connect-wifi, disconnect-wifi, 
                              scan-wifi, show-wifi
Miscellaneous subcommands   : delete-phys, show-ether, show-phys,
For more info, run: dladm help \fIsubcommand\fR
.fi
.in -2
.sp

.sp
.LP
以下命令展示了使用特定子命令时调用 \fBhelp\fR 子命令的用法。

.sp
.in +2
.nf
# \fBdladm help create-vnic\fR
usage:
          create-vnic     [-t] -l \fIlink\fR [-m \fIvalue\fR | auto |
          {factory [-n \fIslot-id\fR]} | {random [-r \fIprefix\fR]} |
          {vrrp -V \fIvrid\fR -A {inet | inet6}} [-v \fIvid\fR [-f]]
          [-p \fIprop\fR=\fIvalue\fR[,...]] \fIvnic-link\fR

        example:
          # dladm create-vnic -l net0 -m factory -n 2 -p mtu=1200 vnic1
.fi
.in -2
.sp

.LP
\fB示例 46 \fR在非全局区域中创建 VNIC
.sp
.LP
以下示例在全局区域中的非全局区域 zone1 和 zone2 中创建 VNIC v1。zone1/net0 和 zone2/net0 分别是为 zone1 和 zone2 自动创建的 VNIC。

.sp
.in +2
.nf
# \fBdladm create-vnic -t -l net1 zone1/v1\fR
# \fBdladm create-vnic -t -l net1 zone2/v1\fR
# \fBdladm show-link -Z\fR
LINK                ZONE      CLASS     MTU    STATE    OVER 
net1                global    phys      1500   unknown  -- 
net0                global    phys      1500   up       -- 
zone1/net0          zone1     vnic      1500   up       net0
zone2/net0          zone2     vnic      1500   up       net0
zone1/v1            zone1     vnic      1500   up       net1
zone2/v1            zone2     vnic      1500   up       net1
.fi
.in -2
.sp

.LP
\fB示例 47 \fR使用 \fB-m\fR 显示 VNIC
.sp
.LP
以下命令说明了如何使用 \fB-m\fR 选项显示 VNIC。

.sp
.in +2
.nf
# \fBdladm show-vnic -m\fR
LINK    OVER      SPEED  MACADDRESSES      MACADDRTYPES     IDS 

vnic0   net5      10000  0:14:4f:fb:87:ee  fixed            VID:0 

vnic1   net5      10000  0:14:4f:87:13:7a  fixed            VID:0 

                         0:14:4f:87:13:7e  fixed 

                         0:14:4f:f8:7e:a   fixed 
.fi
.in -2
.sp

.LP
\fB示例 48 \fR启用 SR-IOV 模式并创建 VF VNIC
.sp
.LP
以下命令说明了如何启用 SR-IOV 模式并创建 VF VNIC。

.sp
.in +2
.nf
# \fBdladm set-linkprop -p iov=on net0\fR
# \fBdladm show-linkprop -p iov net0\fR
LINK    PROPERTY  PERM VALUE    EFFECTIVE   DEFAULT   POSSIBLE
net0    iov       rw   auto     on          auto      auto,on,off
.fi
.in -2
.sp

.sp
.in +2
.nf
# \fBdladm create-vnic -lnet0 v1\fR
# \fBdladm show-linkprop -p iov v1\fR
LINK    PROPERTY  PERM VALUE    EFFECTIVE   DEFAULT   POSSIBLE
v1      iov       r-   inherit  on          inherit   inherit,on,off
.fi
.in -2
.sp

.LP
\fB示例 49 \fR显示 SR-IOV 信息
.sp
.LP
以下命令可用于显示附加的 SR-IOV 信息（接上例）。

.sp
.in +2
.nf
# \fBdladm show-phys -V\fR
LINK    VFS-AVAIL   VFS-INUSE    FLAGS
net0    30          1            -----
.fi
.in -2
.sp

.sp
.in +2
.nf
# \fBdladm show-vnic -V\fR
LINK    VF-ASSIGNED
v1      ixgbevf0
.fi
.in -2
.sp

.sp
.LP
还可以选择通过 \fB-o\fR 选项指定以上字段：

.sp
.in +2
.nf
# \fBdladm show-phys -o LINK,VFS-INUSE\fR
LINK    VFS-INUSE
net0    1
.fi
.in -2
.sp

.sp
.in +2
.nf
# \fBdladm show-vnic -o VF-ASSIGNED\fR
VF-ASSIGNED
ixgbevf0
.fi
.in -2
.sp

.LP
\fB示例 50 \fR在物理链路上创建常规 VNIC 并启用 iov
.sp
.LP
以下命令可用于在链路上创建常规 VNIC 并启用 iov。

.sp
.in +2
.nf
# \fBdladm create-vnic -lnet0 -piov=off v1\fR
.fi
.in -2
.sp

.sp
.LP
以下命令可用于验证 VNIC 没有 VF：

.sp
.in +2
.nf
# \fBdladm show-linkprop -p iov v1\fR
LINK    PROPERTY  PERM VALUE    EFFECTIVE   DEFAULT   POSSIBLE
v1      iov       r-   off      off         inherit   inherit,on,off
.fi
.in -2
.sp

.sp
.in +2
.nf
# \fBdladm show-vnic -V\fR
LINK    VF-ASSIGNED
v1      --
.fi
.in -2
.sp

.LP
\fB示例 51 \fR通过将 VNIC 连接到弹性虚拟交换机 (Elastic Virtual Switch, EVS) 来创建 VNIC
.sp
.LP
以下示例通过连接到 EVS 来创建 VNIC。

.sp
.in +2
.nf
# \fBdladm create-vnic -t -c HR/vport0 vnic0\fR
# \fBdladm show-vnic -c\fR

LINK   TENANT     EVS    VPORT    OVER     MACADDRESS        IDS
vnic0  sys-global HR     vport0   net2     2:8:20:c1:df:14   VID:100
.fi
.in -2
.sp

.sp
.LP
\fBHR\fR 是一个 EVS，它具有端口 \fIvport0\fR，\fIvnic0\fR 将连接到该端口。\fIvnic0\fR 将继承 \fIvport0\fR 的所有属性。\fBHR\fR 和 \fIvport0\fR 通过 \fBevsadm\fR(1M) 进行管理。

.LP
\fB示例 52 \fR创建 IPoIB VNIC
.sp
.LP
以下示例基于 pkey 为 0xffff 的物理链路 net4 创建名为 ipoib_vnic0 的 IPoIB VNIC。

.sp
.in +2
.nf
# \fBdladm create-vnic -l net4 -P 0xffff ipoib_vnic0\fR
.fi
.in -2
.sp

.sp
.LP
查看 VNIC 信息：

.sp
.in +2
.nf
# dladm show-vnic

LINK         OVER    SPEED  MACADDRESS        MACADDRTYPE IDS
ipoib_vnic0  net4    32000  80:0:0:4a:fe:..   fixed       PKEY:0xFFFF

# dladm show-vnic  -o link,macaddress

LINK            MACADDRESS
ipoib_vnic0     80:0:0:4a:fe:80:0:0:0:0:0:0:0:21:28:0:1:a0:a5:8e
.fi
.in -2
.sp

.SH 属性
.sp
.LP
有关下列属性的说明，请参见 \fBattributes\fR(5)：
.sp
.LP
\fB/usr/sbin\fR
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
_
接口稳定性Committed（已确定）
.TE

.sp
.LP
\fB/sbin\fR
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
_
接口稳定性Committed（已确定）
.TE

.sp
.LP
请注意，对于 \fB/usr/sbin\fR 和 \fB/sbin\fR，已确定 \fB-show-aggr\fR、\fB-show-link\fR 和 \fBshow-vnic\fR 子命令的 \fBs\fR 和 \fBi\fR 选项为过时选项。
.sp
.LP
请注意，对于 \fB/usr/sbin\fR 和 \fB/sbin\fR，\fBvswitching\fR 链路属性均具有 Volatile（可变）接口稳定性。
.sp
.LP
请注意，随上面的 \fBdladm\fR 子命令一起介绍的 \fBbridge-related\fR 子命令要求安装 \fBpkg://solaris/network/bridging\fR 软件包。
.SH 另请参见
.sp
.LP
\fBacctadm\fR(1M)、\fBautopush\fR(1M)、\fBdhcpagent\fR(1M)、\fBdlstat\fR(1M)、\fBifconfig\fR(1M)、\fBipadm\fR(1M)、\fBipsecconf\fR(1M)、\fBlldpadm\fR(1M)、\fBndd\fR(1M)、\fBnetadm\fR(1M)、\fBnetcfg\fR(1M)\fBpooladm\fR(1M)、\fBpoolcfg\fR(1M)、\fBpsrset\fR(1M)、\fBvrrpadm\fR(1M)、\fBwpad\fR(1M)、\fBin.dlmpd\fR(1M)、\fBzonecfg\fR(1M)、\fBattributes\fR(5)、\fBieee802.3\fR(5)、\fBdlpi\fR(7P)、\fBevsadm\fR(1M)
.SH 附注
.sp
.LP
在聚合子命令中引用聚合的首选方法是使用其链路名称。此外，还支持使用整数 \fIkey\fR 引用聚合以便实现向后兼容，但这不是必需的。当创建聚合时，如果指定了 \fIkey\fR（而非链路名称），\fBdladm\fR 将以 \fBaggr\fR\fIkey\fR 的形式自动生成此聚合的链路名称。
