Alhadis/Silos/Solaris-11.3/zh_CN.UTF-8/man1m/hal-fdi-validate.1m
'\" te
.\" Copyright (c) 2006, 2011, Oracle and/or its affiliates.All rights reserved.
.TH hal-fdi-validate 1M "2011 年 8 月 16 日" "SunOS 5.11" "系统管理命令"
.SH 名称
hal-fdi-validate \- 验证 HAL 设备信息文件
.SH 用法概要
.LP
.nf
\fBhal-fdi-validate\fR  [\fB-f\fR \fIdtd\fR] \fIfile\fR [\fIfile\fR]...
.fi

.SH 描述
.sp
.LP
\fBhal-fdi-validate\fR 命令可以对一个或多个设备信息文件进行验证。请参见 \fBfdi\fR(4)。除非使用 \fB-f\fR 选项指定了其他文件，否则将使用标准 DTD 文件。
.SH 选项
.sp
.LP
支持以下选项： 
.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIdtd\fR\fR
.ad
.RS 10n
.rt  
指定 DTD 文件的路径。
.RE

.SH 操作数
.sp
.LP
\fBhal-fdi-validate\fR 命令接受以下操作数：
.sp
.ne 2
.mk
.na
\fB\fIfile\fR [\fIfile\fR...]\fR
.ad
.RS 18n
.rt  
要验证的一个或多个 DTD 文件。
.RE

.SH 属性
.sp
.LP
有关下列属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/hal
_
接口稳定性Volatile（可变）
.TE

.SH 另请参见
.sp
.LP
\fBhald\fR(1M)、\fBfdi\fR(4)、\fBattributes\fR(5)、\fBhal\fR(5)
