Alhadis/Silos/Solaris-11.3/zh_CN.UTF-8/man1m/js2ai.1m
'\" te
.\" Copyright (c) 2011, 2013, Oracle and/or its affiliates.All rights reserved.
.TH js2ai 1M "2012 年 2 月 20 日" "SunOS 5.11" "系统管理命令"
.SH 名称
js2ai \- 转换 JumpStart 规则和配置文件以供自动化安装程序 (Automated Installer, AI) 使用。
.SH 用法概要
.LP
.nf
js2ai [-h | --version]
.fi

.LP
.nf
js2ai -r | -p \fIprofile\fR [-d \fIjsdir\fR]
    [-D \fIdestdir\fR] [-lSv]
.fi

.LP
.nf
js2ai -s [-d \fIjsdir\fR]
    [-D \fIdestdir\fR] [-Sv]
.fi

.LP
.nf
js2ai -V \fImanifest\fR
.fi

.SH 描述
.sp
.LP
\fBjs2ai\fR 是用于将 Oracle Solaris 10 JumpStart \fBrules\fR、配置文件和 \fBsyscfg\fR 配置文件转换为与自动化安装程序 (Automated Installer, AI) 兼容的格式的实用程序。该实用程序会尽最大努力转换那些可转换到 AI 上下文中的 JumpStart 关键字。尽管此转换过程并不为 JumpStart 创建完整的一对一对等项，但是它确实可以提供可用作模板的 AI 清单和系统配置文件条目，之后可借助此模板根据从 JumpStart 配置文件收集的信息创建完整的 AI 配置设置。
.sp
.LP
使用 \fBjs2ai\fR 可执行以下操作：
.RS +4
.TP
.ie t \(bu
.el o
处理当前工作目录中的 \fBrules\fR 文件和关联配置文件。
.RE
.RS +4
.TP
.ie t \(bu
.el o
处理指定目录中的 \fBrules\fR 文件和关联配置文件。
.RE
.RS +4
.TP
.ie t \(bu
.el o
处理特定配置文件或 \fBsysidcfg\fR 文件。
.RE
.RS +4
.TP
.ie t \(bu
.el o
将生成的输出文件定向到特定目录。有关 \fBjs2ai\fR 输出文件的更多信息，请参见“示例”和“文件”部分。
.RE
.SS "转换规则关键字"
.sp
\fB表 1 \fRJumpStart 规则关键字转换
.sp
.TS
tab();
cw(1.38i) cw(4.13i) 
lw(1.38i) lw(4.13i) 
.
JumpStart 规则关键字AI 条件关键字
_
\fBarch\fR\fBcpu\fR
\fBhostaddress\fR\fBipv4\fR
\fBkarch\fR\fBarch\fR
\fBmemsize\fR\fBmem\fR
\fBmodel\fR\fBplatform\fR
\fBnetwork\fR\fBipv4\fR
.TE

.sp
.LP
\fBjs2ai\fR 不支持的 JumpStart 规则关键字：
.sp
.in +2
.nf
any             installed
disksize        osname
domainname      probe
hostname        totaldisk
.fi
.in -2

.SS "转换配置文件关键字"
.sp
\fB表 2 \fRJumpStart 配置文件关键字
.sp
.TS
tab();
cw(1.38i) cw(4.13i) 
lw(1.38i) lw(4.13i) 
.
JumpStart 配置文件关键字附注
_
\fBboot_device\fRT{
如果 \fBrootdisk\fR 以前不是由 \fBroot_device\fR 关键字设置的，则设为指定设备。
T}
\fBfdisk\fRT{
\fBdisk_name\fR 的值必须是设备。不支持 \fBall\fR 设备。\fBfdisk\fR 类型必须是 \fBsolaris\fR。不支持大小为 0 或 \fBdelete\fR。如果 \fBpartitioning\fR 是 \fBdefault\fR 并且 \fBrootdisk\fR 尚未设置，则遇到的首个 \fBfdisk solaris\fR 分区将用作 \fBrootdisk\fR。
T}
\fBfilesys\fRT{
如果指定的挂载点是 / 或 \fBswap\fR，将支持本地和镜像文件系统。不对大小进行验证。可能需要调整生成的 AI 清单中指定的大小，以便该清单能实现成功安装。
T}
\fBinstall_type\fR仅支持 \fBinitial_install\fR 值。
\fBlocale\fRT{
不执行转换。确保 Oracle Solaris 11 支持指定的语言环境。
T}
\fBpackage\fRT{
尝试将指定的软件包转换为其 Oracle Solaris 11 等效项。不支持指定软件包位置。软件包查找可能要花费很长的时间。如果您的配置文件中包含较长的软件包列表，您可能需要在转换过程中使用 \fB--local\fR 标志。
T}
\fBpartitioning\fRT{
支持的类型为 \fBdefault\fR 和 \fBexplicit\fR。与 JumpStart 不同的是，如果指定了 \fBpartitioning default\fR，仅使用 \fBjs2ai\fR 可识别的磁盘。如果未在任何关键字中指定磁盘，则生成的配置文件会通知 AI 选择要使用的磁盘。
T}
\fBpool\fRT{
如果在配置文件中指定了池，则使用指定设备创建 ZFS 根池。确定 ZFS 根池使用哪些设备时，\fBpool\fR 关键字将取代其他的所有关键字。不验证池大小、交换大小或转储大小。可能需要在生成的 AI 清单中调整这些大小，以编该清单能实现成功安装。
T}
\fBroot_device\fR\fBrootdisk\fR 设置为指定设备。
\fBsystem_type\fR仅支持 \fBstandalone\fR 值。
\fBusedisk\fRT{
指定设备可用于在转换过程中解析 \fBany\fR 或 \fB rootdisk\fR 设备。在未镜像 ZFS 根池时，不用于此目的任何指定设备都将添加到该池。
T}
.TE

.sp
.LP
\fBjs2ai\fR 不支持的 JumpStart 配置文件关键字：
.sp
.in +2
.nf
archive_location       geo
backup_media           layout_constraint
bootenv                local_customization
client_arch            metabd
client_root            no_master_check
client_swap            no_content_check
cluster                num_clients
dontuse                patch
forced_deployment
.fi
.in -2

.sp
.LP
\fB在配置文件转换期间如何确定系统的根磁盘\fR
.sp
.LP
由于 \fBjs2ai\fR 在配置文件转换过程中不能访问配置文件引用的实际系统，\fBjs2ai\fR 会在转换期间尝试使用尽可能匹配 JumpStart 的过程确定根磁盘。
.sp
.LP
\fBjs2ai\fR 工具执行以下步骤来确定要用于根磁盘的设备。
.sp

.sp
.TS
tab();
cw(.44i) cw(5.06i) 
lw(.44i) lw(5.06i) 
.
阶段操作
_
1T{
如果在配置文件中指定了 \fBroot_device\fR 关键字，则 \fBjs2ai\fR 会将 \fBrootdisk\fR 设置为分片所在的设备。
T}
2T{
如果未设置 \fBrootdisk\fR 但在配置文件中指定了 \fBboot_device\fR 关键字，\fBjs2ai\fR 会将 \fBrootdisk\fR 设置为引导设备。
T}
3T{
如果未设置 \fBrootdisk\fR，但指定了 \fBpartitioning default\fR 并遇到 \fBsolaris\fR \fBfdisk\fR 条目，\fBjs2ai\fR 会将 \fBrootdisk\fR 设置为指定的 \fBdisk_name\fR。
T}
4T{
如果未设置 \fBrootdisk\fR 但在配置文件中指定了 \fBfilesys\fI cwtxdysz\fR \fIsize\fR /\fR 条目，则 \fBjs2ai\fR 将 \fBrootdisk\fR 设置为该条目中指定的 \fIcwtxdysz\fR 磁盘。
T}
5T{
如果未设置 \fBrootdisk\fR 且在配置文件中指定了 \fBusedisk \fI disk\fR\fR 条目，则 \fBjs2ai\fR 会将 \fBrootdisk\fR 设置为在该条目中指定的 \fIdisk\fR 磁盘。
T}
6T{
如果未设置 \fBrootdisk\fR 并且在配置文件中遇到了如下指定（其中 \fIsize\fR 不是 0 或 \fBdelete\fR 并且 \fIdisk\fR 不是 \fBall\fR），则 \fBrootdisk\fR 将设置为此 \fIdisk\fR 名称。
.sp
.in +2
.nf
fdisk \fIdisk\fR solaris \fIsize\fR
.fi
.in -2

T}
7T{
如果未设置 \fBrootdisk\fR，每次遇到指定为 \fBrootdisk\fR 的设备时都会生成一个转换错误。
T}
.TE

.sp
.LP
\fB在配置文件转换期间如何转换 any 设备\fR
.sp
.LP
\fBjs2ai\fR 工具执行以下步骤来确定指定了 \fBany\fR 关键字时要使用的设备。
.sp

.sp
.TS
tab();
cw(.44i) cw(5.06i) 
lw(.44i) lw(5.06i) 
.
阶段操作
_
1T{
如果指定了 \fBany\fR 设备且指定了关键字操作（非镜像池或具有 / 挂载点的 \fBfilesys\fR），则在设置了 \fBrootdisk\fR 时 \fBany\fR 设备将设置为 \fBrootdisk\fR。
T}
2T{
如果 \fBany\fR 设备尚未转换并且配置文件中存在 \fBusedisk\fR 语句，\fBany\fR 设备将设置为由 \fBusedisk\fR 语句指定的设备。
T}
3T{
如果 \fBany\fR 设备尚未转换并且指定 \fBany\fR 设备的操作会创建 ZFS 根池，则 AI 会选择该设备。这在指定了镜像pool时不适用。
T}
.TE

.sp
.LP
\fB在配置文件转换期间如何确定 ZFS 根池\fR
.sp
.LP
\fBjs2ai\fR 工具执行以下步骤来确定要用于 ZFS 根池的设备。确定 ZFS 根池后，如果之后遇到的定义与已确定的 ZFS 根池发生冲突，会将这些定义标记为错误。
.sp

.sp
.TS
tab();
cw(.44i) cw(5.06i) 
lw(.44i) lw(5.06i) 
.
阶段操作
_
1T{
如果配置文件指定了 \fBpool\fR 关键字，\fBjs2ai\fR 会将 ZFS 根池设置为 \fBpool\fR 关键字指定的设备。
T}
2T{
如果尚未确定 ZFS 根池但配置文件指定了具有 / 挂载点的 \fBfilesys\fR，则使用指定设备创建 ZFS 根池。
T}
3T{
如果尚未确定 ZFS 根池、配置文件中的所有关键字已处理并且已设置 \fBrootdisk\fR，则使用 \fBrootdisk\fR 设备创建 ZFS 根池。
T}
4T{
如果尚未确定 ZFS 根池并且分区类型为 \fBdefault\fR，AI 会选择用于 ZFS 根池的设备。
T}
5T{
如果尚未确定 ZFS 根池并且在处理期间未发生错误，AI 会选择用于 ZFS 根池的设备。
T}
6T{
如果 ZFS 根池不是镜像池，并且有一个或多个指定的 \fBusedisk \fR 设备未用于 \fBrootdisk \fR 或 \fBany\fR 设备转换，则将这些磁盘添加到 ZFS 根池中。
T}
.TE

.SS "转换 \fBsysidcfg\fR 关键字"
.sp
\fB表 3 \fRJumpStart \fBsysidcfg\fR 关键字
.sp
.TS
tab();
cw(1.38i) cw(4.13i) 
lw(1.38i) lw(4.13i) 
.
\fBsysidcfg\fR 关键字附注
_
\fBkeyboard\fRT{
不执行转换。确保 Oracle Solaris 11 支持 \fB sysidcfg\fR 文件中指定的键盘。
T}
\fBname_service\fRT{
支持的值包括 \fBNone\fR、\fBDNS\fR、\fBNIS\fR 和 \fBLDAP\fR。NIS+ 名称服务将转换为 NIS。如果指定了名称服务，请为 \fBDefaultFixed\fR 配置 Oracle Solaris 11 中的网络接口。可以使用 \fBnetwork_interface \fR 关键字来定义网络特征。缺省情况下，Oracle Solaris 使用前缀 'net' 来指定链路名称。为了使用 sysidcfg 文件中指定的现有 Oracle Solaris 10 接口名称，将禁用此功能。如果您希望使用中性链路名称的自动分配，必须将 \fBsysidcfg\fR 中指定的网络接口名称更改为类似 \fBnet0\fR 的 Oracle Solaris 中性链路名称。 
T}
\fBnetwork_interface\fRT{
AI 仅支持在系统安装过程中配置一个接口。由于此限制，\fBjs2ai\fR 工具仅处理标为 \fBPRIMARY\fR 的接口或在 \fBsysidcfg\fR 文件中遇到的第一个接口。如果指定了 \fBname_service\fR，网络将配置为 \fBDefaultFixed\fR。需要由正确配置的 \fBDefaultFixed\fR 网络来提供主机名、IP 地址、网络掩码和网关。仅当未指定名称服务时才支持自动化网络配置。
T}
\fBroot_password\fRT{
Oracle Solaris 11 使用角色，而不是 root 用户。需要定义具有 root 角色特权的管理用户以便在 \fBmulti-user\fR 模式下访问系统。因为无法通过 \fBroot_password\fR 关键字完全定义必需结构，将在 xml 文件 \fBsc_profile.xml\fR 中添加用于定义具有 root 角色特权的用户帐户的必需结构，作为注释。如果未指定 \fBroot_password \fR 关键字，它的必需数据结构也将定义为注释。
T}
\fBsecurity_policy\fR支持的值：\fBNone\fR
\fBservice_profile\fR支持的值：\fBlimited_net\fR
\fBsystem_locale\fRT{
\fBjs2ai\fR 将进行检查以确保指定的语言环境是支持的缺省核心语言环境之一。有关核心语言环境的更多信息，请参见 http://docs.oracle.com/cd/E23824_01/html/E24456/glmwl.html 。如果指定的语言环境不在核心语言环境中，则将生成警告。\fBjs2ai\fR 还将尝试将非核心语言环境转换为核心语言环境。
T}
\fBterminal\fRT{
不执行转换。确保 Oracle Solaris 11 支持 \fB sysidcfg\fR 文件中指定的终端类型。
T}
\fBtimeserver\fR支持的值：\fBlocalhost\fR
\fBtimezone\fR无需执行转换。
\fBnfs4_domain\fRT{
\fBnfs4_domain=dynamic\fR 受 Automatic 网络和 DefaultFixed 网络的支持。\fBnfs4_domain=<custom_domain_name>\fR 仅受 DefaultFixed 网络的支持。\fBnetwork_interface \fR 关键字的转换确定配置了 DefaultFixed 网络还是 Automatic 网络。 
T}
.TE

.SH 选项
.sp
.LP
\fBjs2ai\fR 命令包含以下选项。“示例”部分对这些选项的用法进行了说明。
.sp
.ne 2
.mk
.na
\fB\fB-h\fR，\fB--help\fR\fR
.ad
.sp .6
.RS 4n
显示用法帮助消息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--version\fR\fR
.ad
.sp .6
.RS 4n
显示 \fBjs2ai\fR 实用程序的版本号。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIjsdir\fR, \fB- -dir\fR \fIjsdir\fR\fR
.ad
.sp .6
.RS 4n
指定 \fBrules\fR 和配置文件或 \fBsysidcfg\fR 文件的位置。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR \fIdestdir\fR, \fB- -dest\fR \fIdestdir\fR\fR
.ad
.sp .6
.RS 4n
指定输出文件的位置。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR, \fB--local\fR\fR
.ad
.sp .6
.RS 4n
在 JumpStart 配置文件中搜索 \fBpackage\fR 关键字值的映像包管理系统 (Image Packaging System, IPS) 等效项时，会搜索在主机系统中安装的 IPS 软件包，而不是 IPS 软件包系统信息库中的软件包。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIprofile\fR, \fB- -profile\fR \fIprofile\fR\fR
.ad
.sp .6
.RS 4n
转换指定的 JumpStart 配置文件并为已处理的配置文件生成清单。在这种情况下，无需或不会生成条件文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR, \fB--rule\fR\fR
.ad
.sp .6
.RS 4n
转换规则和关联的配置文件并为已处理的每个配置文件生成清单。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR, \fB--sysidcfg\fR\fR
.ad
.sp .6
.RS 4n
处理 \fBsysidcfg\fR 文件并将结果输出至 \fBsc_profile.xml\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR, \fB--skip\fR\fR
.ad
.sp .6
.RS 4n
跳过验证。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR，\fB--verbose\fR\fR
.ad
.sp .6
.RS 4n
提供有关在处理期间发生的操作的详细信息。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR \fIfilename\fR\fR
.ad
.sp .6
.RS 4n
验证指定的 AI 清单文件或 SMF 系统配置文件。不支持 AI 条件验证。
.RE

.SH 错误报告
.sp
.LP
在转换期间发生一个或多个错误时，\fBjs2ai\fR 工具将生成错误报告。
.sp
.in +2
.nf
# \fBjs2ai -r\fR
                    Process  Unsupported  Conversion  Validation
Name      Warnings  Errors   Items        Errors      Errors
--------  --------  -------  -----------  ----------  ----------
rules            0        0            2           0           -
profile1         0        0            0           2           1

Conversion completed. One or more failures and/or warnings occurred.
For details see ./js2ai.log
.fi
.in -2
.sp

.sp
.LP
对于 \fBjs2ai\fR 发现有错误的每个文件，报告中将包含一个条目。要实现即使没有错误也生成错误报告，请指定 \fB-v\fR 或 \fB--verbose\fR。
.sp
.LP
该报告可说明各个文件中错误的类型。定义了 5 个错误类型：警告、处理错误、不支持的项、转换错误和验证错误。
.sp
.ne 2
.mk
.na
\fB警告\fR
.ad
.sp .6
.RS 4n
不需要更正这些消息中的项。例如，您可能会收到一条警告消息，说明未提供主机名或 root 口令等信息，将使用缺省值。
.RE

.sp
.ne 2
.mk
.na
\fB处理错误\fR
.ad
.sp .6
.RS 4n
这类错误表示阻止 \fBjs2ai\fR 处理文件或文件内某一行的问题。处理错误通常在文件包含语法错误时发生。
.RE

.sp
.ne 2
.mk
.na
\fB不支持的项\fR
.ad
.sp .6
.RS 4n
这些项表示 \fBjs2ai\fR 不支持的行。更改与关键字关联的值可以消除该错误。
.RE

.sp
.ne 2
.mk
.na
\fB转换错误\fR
.ad
.sp .6
.RS 4n
这类错误是指阻止 \fBjs2ai\fR 处理某个行的状况。应手动更正这类错误或从文件中删除违例的行。
.RE

.sp
.ne 2
.mk
.na
\fB验证错误\fR
.ad
.sp .6
.RS 4n
这类错误是指在根据 AI 使用的架构定义验证生成的清单时发生的错误。必须先更正这些错误，AI 才能使用清单。
.RE

.sp
.LP
\fBjs2ai.log\fR 文件指示哪一行中发生了什么错误。
.sp
.in +2
.nf
# \fBcat js2ai.log\fR
rules: line 4: unsupported keyword: disksize
rules: line 4: unsupported keyword: installed
net924_sun4c: line 4: unsupported keyword: cluster
net924_sun4c: line 5: unsupported keyword: num_clients
net924_sun4c: line 6: unsupported keyword: client_swap
net924_sun4c: line 7: unsupported keyword: client_arch
upgrade: line 1: unsupported value for 'install_type' specified: upgrade
.fi
.in -2
.sp

.sp
.LP
如果发生清单验证错误，\fBjs2ai.log\fR 文件包含指向存在验证错误的日志文件的指针，如以下示例中所示：
.sp
.in +2
.nf
Validation Errors:
    profile1: manifest validation of
    ./AI_profile1/profile1.xml failed.
    For details see ./AI_profile1/profile_validation.log
.fi
.in -2

.SH 转换策略
.sp
.LP
\fB建议的规则和配置文件转换策略 \fR
.sp
.LP
JumpStart 与 AI 之间不存在一对一转换。以下步骤说明了转换的常规执行过程。
.RS +4
.TP
1.
\fBjs2ai\fR 实用程序尝试标记它遇到的任何错误，但 \fBjs2ai\fR 假定转换的规则、配置文件和 \fBsysidcfg\fR 文件有效。
.RE
.RS +4
.TP
2.
将包含 \fBrules\fR、配置文件和 \fBsyscfg\fR 配置文件的 JumpStart 配置目录复制到安装了 \fBinstall/installadm\fR 软件包的 Oracle Solaris 11 系统。
.RE
.RS +4
.TP
3.
在第 2 步复制到 Oracle Solaris 11 系统的 JumpStart 配置目录下，运行 \fBjs2ai\fR 转换工具。
.sp
.in +2
.nf
# \fBjs2ai -rS\fR
.fi
.in -2
.sp

该命令对 \fBrules\fR 文件和 \fBrules\fR 文件引用的配置文件执行转换操作。根据 AI 客户机置备清单 \fB/usr/share/auto_install/manifest/default.xml\fR 处理 \fBrules\fR 文件中引用的每个配置文件。此步骤将为 JumpStart \fBrules \fR 文件中指定的每个配置文件创建一个名为 \fBAI_\fIprofile \fR\fR 的目录。对于转换的配置文件，\fBAI_\fIprofile\fR\fR 目录会包含一个或多个 \fB\fIprofile_name\fR${arch}.xml\fR 形式的 AI 清单。有关更多信息，请参见“文件”部分。
.sp
\fB-S\fR 选项跳过验证环节。验证在第 5 步执行。
.RE
.RS +4
.TP
4.
如果输出以下消息 “Successfully completed conversion”（成功完成转换），请跳到第 5 步。否则，检查 \fBjs2ai.log\fR 文件并执行以下步骤： 
.RS +4
.TP
a.
更正所有处理错误。
.RE
.RS +4
.TP
b.
从 \fBrules\fR 和配置文件中删除任何列为“不支持的项”的行。
.RE
.RS +4
.TP
c.
如果可能，检查并更正转换错误。否则删除导致错误的行。
.RE
.RS +4
.TP
d.
检查所有警告消息并确保无需做任何更正。
.RE
.RS +4
.TP
e.
重复执行第 3 步，直到不再报告处理错误、不支持的项和转换错误。
.RE
.RE
.RS +4
.TP
5.
在不使用 \fB-S\fR 选项的情况下重新运行 \fBjs2ai\fR。
.sp
.in +2
.nf
# \fBjs2ai -r\fR
.fi
.in -2
.sp

如果任何处理的配置文件发生验证错误，必须手动更正生成的 AI 清单。检查 \fBjs2ai.log \fR 文件以了解失败详细信息。有关 AI 清单的信息，请参见 AI 文档。
.RE
.RS +4
.TP
6.
转换与该 JumpStart 配置关联的任何 \fBsysidcfg\fR 文件。
.sp
对于每个 \fBsysidcfg\fR 文件，执行以下命令：
.sp
.in +2
.nf
# \fBjs2ai -sS -d \fIsysidcfgdir\fR\fR
.fi
.in -2
.sp

对于所处理的每个 \fBsysidcfg\fR 文件，此步骤将在调用 \fBjs2ai\fR 命令的目录中创建一个名为 \fBsc_profile.xml\fR 的 AI 系统配置文件。可使用 \fB-D\fR 选项为 \fBsc_profile.xml\fR 文件指定其他目录。
.sp
与配置文件转换不同，js2ai sysidcfg 转换将始终生成关于用户帐户的警告。
.sp
.in +2
.nf
sysidcfg:line x:WARNING: Oracle Solaris 11 uses roles instead of root user.
An admin user with root role privileges will need to be defined in order to
access the system in multi-user mode.  The necessary xml structures have been
added to sc_profile.xml as a comment.  Edit sc_profile.xml to perform the
necessary modifications to define the admin user.
.fi
.in -2
.sp

此警告与 \fBjs2ai\fR 无法仅通过 \fBroot_passwd\fR 关键字生成必需数据结构有关。将需要在转换过程结束时执行手动步骤来更正此情况。
.sp
此外，还可能生成关于即将禁用中性链路名称支持的警告消息。
.sp
.in +2
.nf
sysidcfg:line x:WARNING: In order to support the direct translation of the
sysidcfg interface 'e1000g', Oracle Solaris 11 neutral link name support will
be disabled.  If you wish to use neutral link names, change the interface
name specified in the sysidcfg file to a 'netx' style interface name or edit
the resulting sc_profile.xml file.
.fi
.in -2
.sp

如果您希望使用旧样式链路名称，则不需要执行任何操作。在大多数情况下，接口将与它们在 Oracle Solaris 10 中所做的一样。但是不能保证将始终这样。
.RE
.RS +4
.TP
7.
检查结果：
.RS +4
.TP
a.
更正所有处理错误。
.RE
.RS +4
.TP
b.
从作为“不受支持的项”列出的 \fBsysidcfg\fR 文件中删除任何行。
.RE
.RS +4
.TP
c.
如果可能，检查并更正转换错误。否则删除导致错误的行。
.RE
.RS +4
.TP
d.
检查所有警告消息并确保无需做任何更正。
.RE
.RS +4
.TP
e.
重复执行第 6 步，直到不再报告处理错误、不支持的项和转换错误。
.RE
.RE
.RS +4
.TP
8.
在不使用 \fB-S\fR 选项的情况下重新运行 \fBjs2ai\fR。
.sp
.in +2
.nf
# \fBjs2ai -s -d \fIsysidcfgdir\fR\fR
.fi
.in -2
.sp

如果处理的任何 \fBsysidcfg\fR 文件出现任何验证错误，则必须手动更正生成的 AI 系统配置文件。检查 \fBjs2ai.log \fR 文件以了解有关故障的详细信息。有关系统配置文件的信息，请参见 AI 文档。
.RE
.RS +4
.TP
9.
编辑 \fBjs2ai\fR 生成的 \fBsc_profile.xml\fR 文件，以向 \fBsystem/config-user\fR 结构中添加用户帐户信息。如果您的 \fBsysidcfg \fR 文件中包含了 \fBroot_passwd\fR 关键字，则 \fB js2ai\fR 将生成如下所示的 \fBsystem/config-user\fR 结构：
.sp
.in +2
.nf
<service name="system/config-user" type="service" version="1">
<instance enabled="true" name="default">
<!--
Configures user account as follows:
* User account name 'jack'
* password 'jack'
* GID 10
* UID 101
* root role
* bash shell
-->
       <!--
<property_group name="user_account" type="application">
   <propval name="login" type="astring" value="jack"/>
   <propval name="password" type="astring" value="9Nd/cwBcNWFZg"/>
   <propval name="description" type="astring" value="default_user"/>
   <propval name="shell" type="astring" value="/usr/bin/bash"/>
   <propval name="gid" type="astring" value="10"/>
   <propval name="uid" type="astring" value="101"/>
   <propval name="type" type="astring" value="normal"/>
   <propval name="roles" type="astring" value="root"/>
   <propval name="profiles" type="astring" value="System Administrator"/>
</property_group>
 -->
   <property_group name="root_account" type="application">
         <propval name="password" type="astring" value="{your_root_passwd}"/>
         <propval name="type" type="astring" value="role"/>
       </property_group>
     </instance>
   </service>
.fi
.in -2
.sp

在 XML 中，注释以 <!-- and ends in --> 开头。要定义支持 Oracle Solaris 11 所需的用户，请删除 \fBuser_account\fR 结构周围的 XML 注释标记。然后根据需要修改该结构，以创建将具有 root 角色特权的用户。如果未指定 \fB root_password\fR 关键字，还会将 \fBroot_account\fR 属性组结构注释掉，您将需要对其取消注释并更新 root 口令字段。
.RE
.RS +4
.TP
10.
\fBjs2ai\fR 转换过程完成。对生成的条件、AI 清单和系统配置文件执行手动验证。Oracle Solaris 11 安装所需的磁盘空间与 Oracle Solaris 10 安装所需的磁盘空间不同。确保在 AI 清单中分配的磁盘空间符合 Oracle Solaris 11 的要求。
.RE
.RS +4
.TP
11.
配置 AI 以使用新生成的文件。将新生成的条件、AI 清单和系统配置文件添加到现有的 AI 安装服务。
.sp
使用带有 \fB create-manifest\fR 子命令的 \fBinstalladm\fR 命令添加每个 AI 清单以及用于选择该清单的条件。每个客户机只能使用一个 AI 清单。
.sp
.in +2
.nf
# \fBinstalladm create-manifest -n \fIsvcname\fR \e\fR
\fB-f \fIfilename\fR -m \fImanifest\fR \e\fR
\fB-C \fIcriteriafile\fR\fR
.fi
.in -2
.sp

使用 \fBcreate-profile\fR 子命令，为每个配置文件添加用于选择该配置文件的条件。每个客户机可以使用一个或多个系统配置文件。
.sp
.in +2
.nf
# \fBinstalladm create-profile -n \fIsvcname\fR \e\fR
\fB-f \fIfilename\fR -p \fIprofile\fR \e\fR
\fB-C \fIcriteriafile\fR\fR
.fi
.in -2
.sp

有关配置 AI 安装服务的信息，请参见 AI 文档和 \fBinstalladm\fR(1M) 手册页。
.RE
.SH 示例
.LP
\fB示例 1 \fR处理 JumpStart 配置
.sp
.LP
以下命令处理当前目录中的 JumpStart 规则和配置文件。输出也将放在该目录中。

.sp
.in +2
.nf
# \fBjs2ai -r\fR
.fi
.in -2
.sp

.LP
\fB示例 2 \fR处理特定的 JumpStart 目录
.sp
.LP
以下命令处理指定目录中的 JumpStart 规则和配置文件，并将输出文件放在同一目录中。

.sp
.in +2
.nf
# \fBjs2ai -r -d /export/jumpstart\fR
.fi
.in -2
.sp

.sp
.LP
有关输出文件的更多信息，请参见示例 4 和“文件”部分。

.LP
\fB示例 3 \fR处理特定 JumpStart 目录中的配置文件和输出到另外的目标目录
.sp
.LP
以下命令处理 \fB/export/jumpstart\fR 目录中的 JumpStart \fBrules\fR 和配置文件，并将输出文件放在 \fB/export/output\fR 中。

.sp
.in +2
.nf
# \fBjs2ai -p profile1 -d /export/jumpstart -D /export/output\fR
.fi
.in -2
.sp

.LP
\fB示例 4 \fR指定规则及其配置文件的输入和输出结果示例
.sp
.LP
规则：

.sp
.in +2
.nf
arch sparc && karch sun4u && \e
    model 'SUNW,Serverblade1'  -   profile    -
.fi
.in -2

.sp
.LP
配置文件：

.sp
.in +2
.nf
install_type    initial_install
pool mypool auto auto auto c1t0d0s0
.fi
.in -2

.sp
.LP
转换命令：

.sp
.in +2
.nf
# \fBjs2ai -r -d /jumpstart -D /tmp/output\fR
.fi
.in -2
.sp

.sp
.LP
输出文件：

.sp
.in +2
.nf
/tmp/output/AI_profile/profile.x86.xml
/tmp/output/AI_profile/profile.sparc.xml
/tmp/output/AI_profile/criteria-1.xml
.fi
.in -2

.sp
.LP
将创建两个清单文件，一个用于 SPARC，另一个用于 x86，即使 \fBrules\fR 文件将 CPU 类型指定为 SPARC 也是如此。在转换过程中，规则和配置文件分开处理。

.LP
\fB示例 5 \fR将生成的文件添加到 AI 安装服务中
.sp
.LP
该示例使用示例 4 中生成的文件将清单和条件添加到现有服务中。

.sp
.LP
文件：

.sp
.in +2
.nf
/tmp/output/AI_profile/profile.sparc.xml
/tmp/output/AI_profile/criteria-1.xml
.fi
.in -2

.sp
.LP
\fBinstalladm\fR 命令：

.sp
.in +2
.nf
# \fBinstalladm create-manifest -n svc-name \e\fR
\fB-f /tmp/output/AI_profile/profile.sparc.xml \e\fR
\fB-m sparc_profile \e\fR
\fB-C /tmp/output/AI_profile/criteria-1.xml\fR
.fi
.in -2
.sp

.LP
\fB示例 6 \fR处理 \fBsysidcfg\fR 文件
.sp
.LP
以下命令处理当前目录中的 \fBsysidcfg\fR 文件，并将生成的 SMF 系统配置文件作为 \fBsc_profile.xml\fR 输出到同一目录中。

.sp
.in +2
.nf
# \fBjs2ai -s\fR
.fi
.in -2
.sp

.SH 退出状态
.sp
.LP
将返回以下退出值：
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 13n
.rt  
所有文件均已成功处理。
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 13n
.rt  
出现错误。
.RE

.SH 文件
.sp
.ne 2
.mk
.na
\fB\fB\fIoutputdir\fR/AI_${\fI profile\fR}\fR\fR
.ad
.sp .6
.RS 4n
该目录包含与特定配置文件关联的转换为新 AI 语法的所有对应文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fB\fIoutputdir\fR/AI_${\fI profile\fR}.${\fIarch\fR}.xml\fR\fR
.ad
.sp .6
.RS 4n
由于转换配置文件而创建的清单文件。\fB${\fIarch\fR}\fR 可以为以下三个值之一：\fBsparc\fR、\fBx86\fR 或 \fBgeneric\fR。\fB${\fIprofile\fR}.generic.xml \fR 形式的清单文件可用于安装 x86 和 SPARC 系统。
.RE

.sp
.ne 2
.mk
.na
\fB\fB\fIoutputdir\fR/AI_${\fI profile\fR}/criteria-\fIrule\fR.xml\fR\fR
.ad
.sp .6
.RS 4n
生成的 \fBcriteria-\fIrule\fR.xml\fR 文件对应于 \fBrules\fR 文件中的规则。\fB\fI rule\fR\fR 是基于该规则在 \fBrules\fR 文件中的位置的规则编号。此后，可以在 \fBinstalladm\fR 命令中将该条件文件与 \fB-C\fR 选项一起使用。
.sp
由于可以有多个规则指定同一配置文件，因此每个目录中可能存在多个条件文件，但每个输出目录中只存在 \fB${\fIprofile\fR}.${\fIarch\fR}.xml\fR 文件的一个实例。
.LP
注 - 
.sp
.RS 2
如果使用 \fB-p\fR 选项，不会为处理的配置文件生成条件文件。仅在使用 \fB-r\fR 选项时才会生成条件文件。
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fB\fIoutputdir\fR/js2ai.err\fR\fR
.ad
.sp .6
.RS 4n
该文件包含在处理期间发生的意外状况的栈跟踪。通常不创建该文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fB\fIoutputdir\fR/js2ai.log\fR\fR
.ad
.sp .6
.RS 4n
该日志文件记录了处理的文件和在处理期间发现的所有错误。
.RE

.sp
.ne 2
.mk
.na
\fB\fB\fIoutputdir\fR/sc_profile.xml \fR\fR
.ad
.sp .6
.RS 4n
此文件是使用 \fB-s\fR 选项转换 \fBsysidcfg\fR 文件时生成的 SMF 系统配置文件。
.RE

.SH 属性
.sp
.LP
有关下列属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性\fBinstall/js2ai\fR
_
接口稳定性Committed（已确定）
.TE

.SH 另请参见
.sp
.LP
\fBinstalladm\fR(1M)、\fBpkg\fR(1)
.sp
.LP
\fI《Transitioning From Oracle Solaris 10 JumpStart to Oracle Solaris 11.3 Automated Installer》\fR
.sp
.LP
Part\ III, \fI"Installing Using an Install Server,"\fR in \fI《Installing Oracle Solaris 11.3 Systems》\fR
