Alhadis/Silos/Solaris-11.3/zh_CN.UTF-8/man1m/netcfgd.1m
'\" te
.\" Copyright (c) 2010, 2012, Oracle and/or its affiliates.All rights reserved.
.TH netcfgd 1M "2012 年 6 月 1 日" "SunOS 5.11" "系统管理命令"
.SH 名称
netcfgd \- 网络配置管理守护进程
.SH 用法概要
.LP
.nf
\fB/lib/inet/netcfgd\fR
.fi

.SH 描述
.sp
.LP
\fBnetcfgd\fR 是用于管理网络配置的系统守护进程。此守护进程会通过 svc:/network/netcfg:default 自动启动，不应直接调用。它不构成编程接口的一部分。
.sp
.LP
\fBnetcfgd\fR 管理对网络配置系统信息库的访问，以确保读取者和写入者具有适当的授权。所需的授权会有所不同，具体取决于所访问的数据库部分。
.sp

.sp
.TS
tab();
cw(.56i) cw(1.01i) cw(3.93i) 
lw(.56i) lw(1.01i) lw(3.93i) 
.
工具读/写授权（或特权）
_
dladm写sys_dl_config 特权
ipadm写solaris.network.interface.config
netcfg读solaris.network.autoconf.read
netcfg写solaris.network.autoconf.write
netcfg读/写 wlansolaris.network.autoconf.wlan
netadm启用/禁用配置文件T{
solaris.network.autoconf.read solaris.network.autoconf.select
T}
.TE

.sp
.LP
\fBsolaris.network.interface.config\fR 授权和 \fBsys_dl_config\fR 特权是通过 "Network Management"（网络管理）安全配置文件获得的。\fBsolaris.network.autoconf.read\fR 授权是 "Basic Solaris User"（基本 Solaris 用户）配置文件的一部分。\fBsolaris.network.autoconf.wlan\fR 和 \fB\&.select\fR 授权是通过 "Network Autoconf User"（网络自动配置用户）配置文件获得的，\fBautoconf.write\fR 授权以及 "Network Autoconf User"（网络自动配置用户）配置文件中包含的授权是通过 "Network Autoconf Admin"（网络自动配置管理）配置文件获得的。
.SH 属性
.sp
.LP
有关下列属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
_
接口稳定性Committed（已确定）
.TE

.SH 另请参见
.sp
.LP
\fBsvcs\fR(1)、\fBdladm\fR(1M)、\fBipadm\fR(1M)、\fBnetcfg\fR(1M)、\fBnwamd\fR(1M)、\fBsvcadm\fR(1M)、\fBauth_attr\fR(4)、\fBexec_attr\fR(4)、\fBprof_attr\fR(4)、\fBattributes\fR(5)、\fBsmf\fR(5)
.sp
.LP
另请参见 JDS/GNOME 手册页集合中的 \fBnwam-manager(1M)\fR。
