Alhadis/Silos/Solaris-11.3/zh_CN.UTF-8/man1m/smbstat.1m
'\" te
.\" Copyright (c) 2008, 2015, Oracle and/or its affiliates.All rights reserved.
.TH smbstat 1M "2011 年 4 月 26 日" "SunOS 5.11" "系统管理命令"
.SH 名称
smbstat \- 显示 Solaris SMB 文件服务器统计信息
.SH 用法概要
.LP
.nf
\fBsmbstat\fR [\fB-r\fR [\fB-n\fR [\fB-a\fR | \fB-z\fR] \fB-v\fR ]] [\fB-t\fR] [\fB-u\fR] [\fB-c\fR] [\fIinterval\fR [\fIcount\fR]
.fi

.SH 描述
.sp
.LP
\fBsmbstat\fR 命令显示 \fBsmbd\fR(1M) 服务器的统计信息。\fBsmbstat\fR 具有多个选项（如下所述）和一个操作数 \fIinterval\fR。如果指定了 \fIinterval\fR，首先将显示自服务器启动以来直至输入命令时捕获的统计信息。接下来显示最后一个 \fIinterval\fR 中捕获的统计信息。
.sp
.LP
缺省情况下，\fBsmbstat\fR 命令显示所有统计信息。
.SH 选项
.sp
.LP
\fBsmbstat\fR 命令具有以下选项：
.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.sp .6
.RS 4n
显示计数器。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
显示请求的统计信息。\fB-r\fR 选项可以与以下选项组合使用。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
显示所有类型的服务器请求（包括有效的和无效的）的统计信息。请注意，有 256 种类型的服务器请求。\fB-a\fR 选项和 \fB-z\fR 选项是互斥的。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
按字母顺序显示。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR\fR
.ad
.sp .6
.RS 4n
显示实际接收的请求的统计信息。\fB-a\fR 选项和 \fB-z\fR 选项是互斥的。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR version\fR
.ad
.sp .6
.RS 4n
指定要输出其统计信息的 SMB 版本。version 参数（1 或 2）仅请求该版本的统计信息。不指定 \fB-v\fR 选项时，\fBsmbstat\fR 将输出所有版本的统计信息。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.sp .6
.RS 4n
显示 SMB 服务器的吞吐量。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.sp .6
.RS 4n
显示 SMB 服务器的使用率。
.RE

.SH 扩展描述
.sp
.LP
\fBsmbstat\fR 命令显示下面所示的标题。为给定命令显示的标题根据所指定的选项不同而不同。有四种类别的标题，分别对应于四种类别的统计信息：计数器、吞吐量、使用率和（服务器）请求。
.SS "计数器"
.sp
.ne 2
.mk
.na
\fB\fBnbt\fR\fR
.ad
.sp .6
.RS 4n
SMB NetBIOS-over-TCP (NBT) 会话的数目。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtcp\fR\fR
.ad
.sp .6
.RS 4n
SMB TCP 会话的数目。
.RE

.sp
.ne 2
.mk
.na
\fB\fBusers\fR\fR
.ad
.sp .6
.RS 4n
登录的用户的数目。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtrees\fR\fR
.ad
.sp .6
.RS 4n
连接的树的数目。
.RE

.sp
.ne 2
.mk
.na
\fB\fBfiles\fR\fR
.ad
.sp .6
.RS 4n
打开的文件的数目。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpipes\fR\fR
.ad
.sp .6
.RS 4n
打开的管道的数目。
.RE

.SS "吞吐量"
.sp
.ne 2
.mk
.na
\fB\fBrbytes/s\fR\fR
.ad
.sp .6
.RS 4n
每秒接收的字节数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtbytes/s\fR\fR
.ad
.sp .6
.RS 4n
每秒传输的字节数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBreqs/s\fR\fR
.ad
.sp .6
.RS 4n
每秒处理的请求数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBreads/s\fR\fR
.ad
.sp .6
.RS 4n
每秒的读取请求数。这将是下列请求的聚合：\fBSMB_COM_READ\fR、\fBSMB_COM_LOCK_AND_READ\fR、\fBSMB_COM_READ_RAW\fR 和 \fBSMB_COM_READ_ANDX\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fBwrites/s\fR\fR
.ad
.sp .6
.RS 4n
每秒的写入请求数。这将是下列请求的聚合：\fBSMB_COM_WRITE\fR、\fBSMB_COM_WRITE_AND_UNLOCK\fR、\fBSMB_COM_WRITE_RAW\fR 和 \fBSMB_COM_WRITE_AND_CLOSE\fR。
.RE

.SS "使用率"
.sp
.ne 2
.mk
.na
\fB\fBwcnt\fR\fR
.ad
.sp .6
.RS 4n
已被接收但在等待 SMB 工作线程执行的平均请求数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrcnt\fR\fR
.ad
.sp .6
.RS 4n
SMB 工作线程同时执行的平均请求数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBwtime\fR\fR
.ad
.sp .6
.RS 4n
请求在 SMB 工作线程开始执行它之前等待的平均时间。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrtime\fR\fR
.ad
.sp .6
.RS 4n
请求的平均执行时间。
.RE

.sp
.ne 2
.mk
.na
\fB\fBw%\fR\fR
.ad
.sp .6
.RS 4n
至少有一个请求处于等待状态的时间所占的百分比。
.RE

.sp
.ne 2
.mk
.na
\fB\fBr%\fR\fR
.ad
.sp .6
.RS 4n
至少有一个请求处于执行状态的时间所占的百分比。
.RE

.sp
.ne 2
.mk
.na
\fB\fBu%\fR\fR
.ad
.sp .6
.RS 4n
SMB 服务器使用率百分比。此数字的定义为：\fBrcnt\fR / (\fImax_worker_threads\fR)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsat\fR\fR
.ad
.sp .6
.RS 4n
表示服务器过去是否已经饱和的标志。饱和的定义是 \fBu%\fR == 100%。
.RE

.sp
.ne 2
.mk
.na
\fB\fBusr%\fR\fR
.ad
.sp .6
.RS 4n
处理器在用户空间中花费的时间所占的百分比。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsys%\fR\fR
.ad
.sp .6
.RS 4n
处理器在内核空间中花费的时间所占的百分比。
.RE

.sp
.ne 2
.mk
.na
\fB\fBidle%\fR\fR
.ad
.sp .6
.RS 4n
处理空闲时间所占的百分比。
.RE

.SS "请求"
.sp
.LP
为每种类型的请求显示以下标题。
.sp
.ne 2
.mk
.na
\fB\fBcode\fR\fR
.ad
.sp .6
.RS 4n
以十六进制表示的请求代码。
.RE

.sp
.ne 2
.mk
.na
\fB\fB%\fR\fR
.ad
.sp .6
.RS 4n
给定类型的请求所占的百分比。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcount\fR\fR
.ad
.sp .6
.RS 4n
已接收的请求数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrbytes/s\fR\fR
.ad
.sp .6
.RS 4n
每秒接收的字节数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtbytes/s\fR\fR
.ad
.sp .6
.RS 4n
每秒接收的字节数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBreq/s\fR\fR
.ad
.sp .6
.RS 4n
每秒处理的请求数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrt-mean\fR\fR
.ad
.sp .6
.RS 4n
平均响应时间，以秒为单位。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrt-stddev\fR\fR
.ad
.sp .6
.RS 4n
响应时间的标准偏差。
.RE

.SH 操作数
.sp
.LP
支持以下操作数。
.sp
.ne 2
.mk
.na
\fB\fBcount\fR\fR
.ad
.RS 12n
.rt  
要输出统计信息的次数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBinterval\fR\fR
.ad
.RS 12n
.rt  
每隔一定间隔（秒）报告一次。
.RE

.SH 示例
.LP
\fB示例 1 \fR组合选项
.sp
.LP
以下命令将 \fB-c\fR、\fB-t\fR 和 \fB-u\fR 选项组合使用。

.sp
.in +2
.nf
% \fBsmbstat -ctu\fR
nbt   tcp users trees files pipes
0     1     1     2    20     0

rbytes/s   tbytes/s    reqs/s     reads/s   writes/s
1.036e+02  1.298e+00  0.000e+00  0.000e+00  0.000e+00

wcnt       rcnt       wtime      rtime       w%   r%  u% sat usr% sys% idle%
4.317e-01  7.410e+00  2.461e-05  4.224e-04   31  100  0  no  0    76   24
.fi
.in -2
.sp

.SH 退出状态
.sp
.LP
将返回以下退出值：
.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.RS 13n
.rt  
成功完成。
.RE

.sp
.ne 2
.mk
.na
\fB>0\fR
.ad
.RS 13n
.rt  
出现错误。
.RE

.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5) 手册页：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性service/file-system/smb
_
接口稳定性Uncommitted（未确定）
_
实用程序输出格式Not-an-Interface（不是接口）
.TE

.SH 另请参见
.sp
.LP
\fBsharectl\fR(1M)、\fBsmbadm\fR(1M)、\fBsmbd\fR(1M)、\fBattributes\fR(5)
