Alhadis/Silos/Solaris-11.3/man5/filesystem.5
'\" te
.\" Copyright 1989 AT&T
.\" Portions Copyright (c) 2008, 2015, Oracle and/or its affiliates. All    rights reserved.
.TH filesystem 5 "11 Mar 2015" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
filesystem \- file system organization
.SH SYNOPSIS
.LP
.nf
/
.fi

.SH DESCRIPTION
.sp
.LP
The file system is a hierarchical structure of descendent file systems and directories that are used to organize system-related components and binaries as well as non-system-related components and home directories in the Oracle Solaris OS. By default, the root file system is installed within a ZFS root pool and specifically, is a ZFS file system with separate directories of system-related components, such as \fBetc\fR, \fBusr\fR, and \fBvar\fR, that must be available for the system to function correctly. After a system is installed, the root of the Solaris file system is mounted, which means files and directories are accessible.
.sp
.LP
All subdirectories of the root file system that are part of the Oracle Solaris OS, with the exception of \fB/var\fR, must be contained in the same file system as the root file system. In addition, all packaged software must reside in the root pool, with the exception of the swap and dump devices. A default swap device and dump device are created automatically as ZFS volumes in the root pool when a system is installed. 
.sp
.LP
The following file system content descriptions make use of platform, platform-dependent, platform-independent, and platform-specific terms. Platform refers to a system's Instruction Set Architecture or processor type as returned by the \fBuname -i\fR command. Platform-dependent refers to a file that is installed on all platforms and whose contents vary depending on the platform. Like a platform-dependent file, a platform-independent file is installed on all platforms. However, the contents of the latter type remains the same on all platforms. An example of a platform-dependent file is compiled, executable program. An example of a platform-independent file is a standard configuration file, such as \fB/etc/hosts\fR. Unlike a platform-dependent or a platform- independent file, the platform-specific file is installed only on a subset of supported platforms. Most platform-specific files are gathered under \fB/platform\fR and \fB/usr/platform\fR.
.SS "Root File System"
.sp
.LP
The root file system contains files and directories that are critical for system operation, such as the kernel, the device drivers, and the programs used to boot the system. These components are described below. The root (\fB/\fR) directory also contains mount point directories where local and remote file systems can be attached to the file system hierarchy.
.sp
.ne 2
.mk
.na
\fB\fB/\fR\fR
.ad
.sp .6
.RS 4n
Root directory of the entire file system name space. This is a special file system that is mounted by the kernel at system boot time.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/boot\fR\fR
.ad
.sp .6
.RS 4n
Directory that contains files and executables that are needed for booting the system.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/bin\fR\fR
.ad
.sp .6
.RS 4n
Symbolic link to the \fB/usr/bin\fR directory that contains system executables and scripts.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev\fR\fR
.ad
.sp .6
.RS 4n
Directory that contains special device files. Typically, device files are built to match the kernel and hardware configuration of the system.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/devices\fR\fR
.ad
.sp .6
.RS 4n
Mount point directory for the \fBdevfs\fR file system that manages the device name space.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc\fR\fR
.ad
.sp .6
.RS 4n
Directory that contains platform-dependent administrative and configuration files and databases that are not shared among systems. This directory defines the system's identity. An approved installation location for bundled Solaris software.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/export/home\fR or \fB/home\fR\fR
.ad
.sp .6
.RS 4n
Directory or file system mount point for user home directories, which store user files. By default, the \fB/home\fR directory is an automounted file system.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel\fR\fR
.ad
.sp .6
.RS 4n
Directory of platform-dependent loadable kernel modules required as part of the boot process. It includes the generic part of the core kernel that is platform-independent, \fB/kernel/genunix\fR. See \fBkernel\fR(1M). An approved installation location for bundled Oracle Solaris software and for add-on system software.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/lib\fR\fR
.ad
.sp .6
.RS 4n
Directory that contains core system libraries. Historically, this directory contained essential library components for system startup.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/media\fR\fR
.ad
.sp .6
.RS 4n
Directory for accessing removable media that is automatically mounted.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/mnt\fR\fR
.ad
.sp .6
.RS 4n
Default temporary mount point directory for file systems. This empty directory is used to temporarily mount a file system.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/net\fR\fR
.ad
.sp .6
.RS 4n
Temporary mount point directory for file systems that are mounted by the automounter.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/opt\fR\fR
.ad
.sp .6
.RS 4n
Directory for unbundled application packages.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/platform\fR\fR
.ad
.sp .6
.RS 4n
Directory of platform-specific objects that need to reside in the root file system. It contains a series of directories, one per supported platform. The semantics of the series of directories is equivalent to \fB/\fR (root).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/proc\fR\fR
.ad
.sp .6
.RS 4n
Mount point directory for the process file system.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/root\fR\fR
.ad
.sp .6
.RS 4n
Home directory for the root user.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/rpool\fR\fR
.ad
.sp .6
.RS 4n
Mount point directory for the ZFS boot-related components. By default, the root pool is named \fBrpool\fR during installation.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/sbin\fR\fR
.ad
.sp .6
.RS 4n
Symbolic link to the \fB/usr/sbin\fR directory.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/system\fR\fR
.ad
.sp .6
.RS 4n
Mount point directory for the contract (\fBCTFS\fR) and object (\fBOBJFS\fR) file systems.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/system/zones\fR\fR
.ad
.sp .6
.RS 4n
Directory that is shared across several boot environments, and is resident on a separate dataset beneath the zpool containing boot environments. This is the default parent of zonepaths.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/tmp\fR\fR
.ad
.sp .6
.RS 4n
Directory that contains temporary files that are removed during a boot operation.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr\fR\fR
.ad
.sp .6
.RS 4n
Directory that contains platform-dependent and platform-independent binaries and files. The \fB/usr/share\fR subdirectory contains platform-independent files. The rest of the \fB/usr\fR directory contains platform-dependent files.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/bin\fR\fR
.ad
.sp .6
.RS 4n
Directory that contains platform-dependent, user-invoked executables. These are commands that users expect to be run as part of their normal \fB$PATH\fR. An approved installation location for bundled Oracle Solaris software. The analogous location for unbundled system software or for applications is \fB/opt/packagename/bin\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/sunos\fR\fR
.ad
.sp .6
.RS 4n
Versions of \fB/usr/bin\fR commands that have been kept for compatibility with older releases of Solaris. The executables are located in \fB/usr/sunos/bin\fR, which can be placed before \fB/usr/bin\fR in \fB$PATH\fR if the older versions are preferred.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/gnu\fR\fR
.ad
.sp .6
.RS 4n
GNU versions of commands that are not used as the default Solaris implementation but which are provided for familiarity with other platforms. The executables are located in \fB/usr/gnu/bin\fR, which can be placed before \fB/usr/bin\fR in \fB$PATH\fR if the GNU versions are preferred. In addition, all the commands in this directory tree will be accessible from \fB/usr/bin\fR through symlinks which are the command name prefixed by the \fB\&'g'\fR character. For example:
.sp
.in +2
.nf
/usr/bin/ggrep -> ../gnu/bin/grep.
.fi
.in -2
.sp

If the GNU compatibility facet is deactivated, all the \fBg*\fR symlinks will be removed from \fB/usr/bin\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib\fR\fR
.ad
.sp .6
.RS 4n
Directory that augments the contents of \fB/lib\fR with additional system libraries, and other supporting files that are required by programs at runtime.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/java\fR\fR
.ad
.sp .6
.RS 4n
Directory that contains Java files and executables.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/sbin\fR\fR
.ad
.sp .6
.RS 4n
Contains essential executables used in the booting process and in manual system recovery. Historically, this directory was needed to recover the system before the \fB/usr\fR file system was mounted. In this Oracle Solaris release, \fB/usr\fR is a directory, not a separate file system and is available when the root file system is mounted.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var\fR\fR
.ad
.sp .6
.RS 4n
Directory or file system that contains varying files that are unique to a system but can grow to an arbitrary or variable size. An example is a log file. An approved installation location for bundled Oracle Solaris software.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/share\fR\fR
.ad
.sp .6
.RS 4n
Directory that is shared across several boot environments, and is resident on a separate dataset beneath the \fBzpool\fR containing boot environments. Packages should not deliver content here, since package metadata in a given boot environment may not reflect the current content of \fB/var/share\fR.
.sp
Packages may deliver directories to \fB/var/.migrate\fR, which will be created automatically beneath \fB/var/share\fR during boot. See \fBpkg\fR(5) and the IPS Developer's Guide for a description of how to share data across boot environments.
.sp
By default, the following directories are shared:
.sp
.in +2
.nf
/var/share/audit
/var/share/cores
/var/share/crash
/var/share/mail
.fi
.in -2

Symlinks are delivered to \fB/var\fR to point to each shared directory.
.sp
If existing datasets attempt to mount on one of those symlinks (for example, users with an existing dataset that normally mounts on \fB/var/mail\fR), then those datasets will be mounted beneath \fB/var/share\fR, since filesystem mounts traverse symlinks. The dataset will still be accessible through the original mountpoint.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/tmp\fR\fR
.ad
.sp .6
.RS 4n
Directory that contains files that vary in size or presence during normal system operations. The content of this directory is not removed during a boot operation. It is possible to change the default behavior for \fB/var/tmp\fR to clear all of the files except editor temporary files by setting the \fBclean_vartmp\fR property value of the \fBrmtmpfiles\fR service. This is done with the following commands: 
.sp
.in +2
.nf
# svccfg -s svc:/system/rmtmpfiles setprop\e
            options/clean_vartmp = "true"
# svcadm refresh svc:/system/rmtmpfiles:default
.fi
.in -2
.sp

The \fBsolaris.smf.value.rmtmpfiles\fR authorization is required to modify this property.
.RE

.SH SEE ALSO
.sp
.LP
\fBisainfo\fR(1), \fBsvcs\fR(1), \fBuname\fR(1), \fBautomount\fR(1M), \fBautomountd\fR(1M), \fBboot\fR(1M), \fBinit\fR(1M), \fBkernel\fR(1M), \fBmount\fR(1M), \fBsvcadm\fR(1M), \fBsvccfg\fR(1M), \fBzfs\fR(1M), \fBzpool\fR(1M), \fBmount\fR(2), \fBIntro\fR(4), \fBproc\fR(4), \fBterminfo\fR(4), \fBpkg\fR(5), \fBctfs\fR(7FS), \fBdevfs\fR(7FS), \fBobjfs\fR(7FS), 
