Alhadis/Silos/Solaris-11.3/man5/groff_me.5
'\" te
.\" t
.\" Copyright (c) 1980 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
.\"
.\"	@(#)me.7	6.4 (Berkeley) 4/13/90
.\"
.\" Modified for groff by jjc@jclark.com
.\" Changed to use TBL and eliminate low-level troff hackery by ESR
.\" (this enables it to be lifted to structural markup).
.hc %
.TH GROFF_ME 5 "7 February 2013" "1.22.2"
.UC 3
.SH NAME
groff_me \- troff macros for formatting papers
.SH SYNOPSIS
.B "groff \-me"
[ options ]
file ...
.br
.B "groff \-m\ me"
[ options ]
file ...
.SH DESCRIPTION
This manual page describes the GNU version of the \-me macros,
which is part of the groff document formatting system.
This version can be used with both GNU troff and Unix troff.
This package of
.I troff
macro definitions provides a canned formatting
facility for technical papers in various formats.
.PP
The macro requests are defined below.
Many
.I troff
requests are unsafe in conjunction with
this package, however, these requests may be used with
impunity after the first .pp:
.TS
l l.
\&.bp	begin new page
\&.br	break output line here
\&.sp n	insert n spacing lines
\&.ls n	(line spacing) n=1 single, n=2 double space
\&.na	no alignment of right margin
\&.ce n		center next n lines
\&.ul n	underline next n lines
.TE
.PP
Output of the
.I pic,
.I eqn,
.I refer,
and
.I tbl
preprocessors
is acceptable as input.
.SH FILES
/usr/share/groff/1.21/tmac/me.tmac (a wrapper file for e.tmac)
.br
/usr/share/groff/1.21/tmac/e.tmac

.\" Oracle has added the ARC stability level to this manual page
.SH ATTRIBUTES
See
.BR attributes (5)
for descriptions of the following attributes:
.sp
.TS
box;
cbp-1 | cbp-1
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE 
=
Availability	text/groff
=
Stability	Uncommitted
.TE 
.PP
.SH "SEE ALSO"
.BR groff (1),
.BR troff (1)
.br
\-me Reference Manual, Eric P. Allman
.br
Writing Papers with Groff Using \-me
.tr &.
.SH REQUESTS
This list is incomplete;
see
.I "The \-me Reference Manual"
for interesting details.
.PP
.TS
expand;
l l l l.
Request	Initial	Causes	Explanation
	Value	Break
_
\&.(c	\-	yes	Begin centered block
\&.(d	\-	no	Begin delayed text
\&.(f	\-	no	Begin footnote
\&.(l	\-	yes	Begin list
\&.(q	\-	yes	Begin major quote
\&.(x \fIx\fR	\-	no	Begin indexed item in index
\&.(z	\-	no	Begin floating keep
\&.)c	\-	yes	End centered block
\&.)d	\-	yes	End delayed text
\&.)f	\-	yes	End footnote
\&.)l	\-	yes	End list
\&.)q	\-	yes	End major quote
\&.)x	\-	yes	End index item
\&.)z	\-	yes	End floating keep
\&.++ \fIm H\fR	\-	no	T{
Define paper section.
.I m
defines the part of the paper, and can be
.B C
(chapter),
.B A
(appendix),
.B P
(preliminary, e.g., abstract, table of contents, etc.),
.B B
(bibliography),
.B RC
(chapters renumbered from page one each chapter),
or
.B RA
(appendix renumbered from page one).
T}
\&.+c \fIT\fR	\-	yes	T{
Begin chapter (or appendix, etc., as
set by .++).
.I T
is the chapter title.
T}
\&.1c	1	yes	One column format on a new page.
\&.2c	1	yes	Two column format.
\&.EN	\-	yes	T{
Space after equation
produced by
.I eqn
or
.IR neqn .
T}
\&.EQ \fIx y\fR	\-	yes	T{
Precede equation; break out and
add space.
Equation number is
.IR y .
The optional argument \fIx\fR
may be
.I I
to indent equation (default),
.I L
to left-adjust the equation, or
.I C
to center the equation.
T}
\&.GE	\-	yes	End \fIgremlin\fP picture.
\&.GS	\-	yes	Begin \fIgremlin\fP picture.
\&.PE	\-	yes	End \fIpic\fP picture.
\&.PS	\-	yes	Begin \fIpic\fP picture.
\&.TE	\-	yes	End table.
\&.TH	\-	yes	End heading section of table.
\&.TS \fIx\fR	\-	yes	T{
Begin table; if \fIx\fR is
.I H
table has repeated heading.
T}
\&.b \fIx\fR	no	no	T{
Print
.I x
in boldface; if no argument switch to boldface.
T}
\&.ba \fI+n\fR	0	yes	T{
Augments the base indent by
.I n.
This indent is used to set the indent on regular text
(like paragraphs).
T}
\&.bc	no	yes	Begin new column
\&.bi \fIx\fR	no	no	T{
Print
.I x
in bold italics (nofill only)
T}
\&.bu	\-	yes	Begin bulleted paragraph
\&.bx \fIx\fR	no	no	Print \fIx\fR in a box (nofill only).
\&.ef \fI\'x\'y\'z\'\fR	\'\'\'\'	no	Set even footer to x  y  z
\&.eh \fI\'x\'y\'z\'\fR	\'\'\'\'	no	Set even header to x  y  z
\&.fo \fI\'x\'y\'z\'\fR	\'\'\'\'	no	Set footer to x  y  z
\&.hx	\-	no	Suppress headers and footers on next page.
\&.he \fI\'x\'y\'z\'\fR	\'\'\'\'	no	Set header to x  y  z
\&.hl	\-	yes	Draw a horizontal line
\&.i \fIx\fR	no	no	T{
Italicize
.I x;
if
.I x
missing, italic text follows.
T}
\&.ip \fIx y\fR	no	yes	T{
Start indented paragraph,
with hanging tag
.IR x .
Indentation is
.I y
ens (default 5).
T}
\&.lp	yes	yes	Start left-blocked paragraph.
\&.np	1	yes	Start numbered paragraph.
\&.of \fI\'x\'y\'z\'\fR	\'\'\'\'	no	Set odd footer to x  y  z
\&.oh \fI\'x\'y\'z\'\fR	\'\'\'\'	no	Set odd header to x  y  z
\&.pd	\-	yes	Print delayed text.
\&.pp	no	yes	T{
Begin paragraph.
First line indented.
T}
\&.r	yes	no	Roman text follows.
\&.re	\-	no	Reset tabs to default values.
\&.sh \fIn x\fR	\-	yes	T{
Section head follows,
font automatically bold.
.I n
is level of section,
.I x
is title of section.
T}
\&.sk	no	no	T{
Leave the next page blank.
Only one page is remembered ahead.
T}
\&.sm \fIx\fR	\-	no	T{
Set
.I x
in a smaller pointsize.
T}
\&.sz \fI+n\fR	10p	no	T{
Augment the point size by
.I n
points.
T}
\&.tp	no	yes	Begin title page.
\&.u \fIx\fR	\-	no	T{
Underline argument (even in \fItroff\fR).
(Nofill only).
T}
\&.uh	\-	yes	Like .sh but unnumbered.
\&.xp \fIx\fR	\-	no	Print index.
.TE

.
.\" Local Variables:
.\" mode: nroff
.\" tab-with: 20
.\" End:


.SH NOTES

.\" Oracle has added source availability information to this manual page
This software was built from source available at https://java.net/projects/solaris-userland.  The original community source was downloaded from  http://ftp.gnu.org/gnu/groff/groff-1.22.2.tar.gz

Further information about this software can be found on the open source community website at http://www.gnu.org/software/groff/.
