Alhadis/Silos/Solaris-11.3/man5/hal-cups-utils.5
'\" te
.TH hal-cups-utils 5 "14 Apr 2009" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
hal-cups-utils - automatic queue configuration for CUPS
.SH DESCRIPTION
.sp
.LP
hal-cups-utils is a Hardware Abstraction Layer (HAL) plugin module that
automatically creates print queues under the Common UNIX Printing System (CUPS)
for printers detected by HAL.  When a printer is detected by the HAL framework,
HAL activates hal-cups-utils to attempt to create a corresponding print queue
under the CUPS print service.  If the CUPS print service is not active, no
action is taken.  See http://fedorahosted.org/hal-cups-utils/ for additional
information.

.\" Oracle has added the ARC stability level to this manual page
.SH ATTRIBUTES
See
.BR attributes (5)
for descriptions of the following attributes:
.sp
.TS
box;
cbp-1 | cbp-1
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE 
=
Availability	print/cups/hal-cups-utils
=
Stability	Volatile
.TE 
.PP
.SH SEE ALSO
.sp
.LP
\fBhal\fR(5), 
.sp
http://fedorahosted.org/hal-cups-utils/
.sp
http://www.cups.org/
.sp
.LP


.SH NOTES

.\" Oracle has added source availability information to this manual page
This software was built from source available at https://java.net/projects/solaris-userland.  The original community source was downloaded from  http://fedorahosted.org/releases/h/a/hal-cups-utils/hal-cups-utils-0.6.19.tar.gz

Further information about this software can be found on the open source community website at http://fedorahosted.org/hal-cups-utils/.
