Alhadis/Silos/Solaris-11.3/man5/iconv_zh.5
.\" @(#)iconv_zh.5	1.6 11/01/2001 SMI; from SVr4
'\"macro stdmacro
.\" Copyright 1989 AT&T
.nr X
.TH iconv_zh 5 "2 Nov 2001"
.SH NAME
iconv_zh \- code set conversion tables
.SH DESCRIPTION
.IX "code set conversion tables" "iconv_zh" "" "\(em \fLiconv_zh\fP"
.IX "iconv_zh" "" "\fLiconv_zh\fP \(em code set conversion tables"

The following code set conversions are supported:

.\" === troff version of table ============
.if n .ig IG
.TS
center box tab(;) ;
c s s s s
c | c | c | c | c
l | l | l | l | l .
Code Set Conversions Supported
_
Code;Symbol;Target Code;Symbol
_
GB 2312-80;zh_CN.euc;UTF-8;UTF-8
GB 2312-80;zh_CN.euc;ISO-2022-CN;zh_CN.iso2022-CN
ISO-2022-CN;zh_CN.iso2022-CN;GB 2312-80;zh_CN.euc
UTF-8;UTF-8;GB 2312-80;zh_CN.euc
.TE
.IG
.\" === end troff version ======
.\" ====nroff version ==========
.if t .ig IG
.RS .0i
.nf
.ta 11n +16n +11n +16n
	Code Set Conversions Supported
Code         Symbol             TargetCode   Symbol

GB 2312-80   zh_CN.euc          UTF-8        UTF-8
GB 2312-80   zh_CN.euc          HZ-GB-2312   HZ-GB-2312
GB 2312-80   zh_CN.euc          ISO-2022-CN  zh_CN.iso2022-CN
GBK          zh_CN.gbk          UTF-8        UTF-8
GBK          zh_CN.gbk          HZ-GB-2312   HZ-GB-2312
GBK          zh_CN.gbk          ISO-2022-CN  zh_CN.iso2022-CN
GB18030-2000 zh_CN.gb18030      UTF-8        UTF-8
GB18030-2000 zh_CN.gb18030      IS0-2022-CN  zh_CN.iso2022-CN
HZ-GB-2312   HZ-GB-2312         UTF-8        UTF-8
HZ-GB-2312   HZ-GB-2312         GB 2312-80   zh_CN.euc
HZ-GB-2312   HZ-GB-2312         GBK          zh_CN.gbk
ISO-2022-CN  zh_CN.iso2022-CN   GB 2312-80   zh_CN.euc
ISO-2022-CN  zh_CN.iso2022-CN   GBK          zh_CN.gbk
ISO-2022-CN  zh_CN.iso2022-CN   GB18030-2000 zh_CN.gb18030
IS0-2022-CN  zh_CN.iso2022-CN   UTF-8        UTF-8
Code Page 935 zh_CN-cp935       UTF-8        UTF-8
UTF-8        UTF-8              GB 2312-80   zh_CN.euc
UTF-8        UTF-8              GBK          zh_CN.gbk
UTF-8        UTF-8              GB18030-2000 zh_CN.gb18030
UTF-8        UTF-8              HZ-GB-2312   HZ-GB-2312
UTF-8        UTF-8              IS0-2022-CN  zh_CN.iso2022-CN
UTF-8        UTF-8              Code Page 935 zh_CN-cp935

GB 2312-80   zh_CN.euc          Big-5        zh_TW-big5
GBK          zh_CN.gbk          Big-5        zh_TW-big5
GBK          zh_CN.gbk          Big-5p       zh_TW-big5p
GBK          zh_CN.gbk          BIG5HK       zh_HK-big5hk
GB18030-2000 zh_CN.gb18030      Big-5        zh_TW-big5
GB18030-2000 zh_CN.gb18030      Big-5p       zh_TW-big5p
GB18030-2000 zh_CN.gb18030      BIG5HK       zh_HK-big5hk
Big-5        zh_TW-big5         GB18030-2000 zh_CN.gb18030
Big-5        zh_TW-big5         GBK          zh_CN.gbk
Big-5        zh_TW-big5         GB 2312-80   zh_CN.euc
Big-5p       zh_TW-big5p        GB18030-2000 zh_CN.gb18030
Big-5p       zh_TW-big5p        GBK          zh_CN.gbk
BIG5HK       zh_HK-big5hk       GB18030-2000 zh_CN.gb18030
BIG5HK       zh_HK-big5hk       GBK          zh_CN.gbk
.fi
.RE
.IG
.\" === end nroff version ======
.LP

Conversion are performed as described below, For all conver-
sions, if the source code set includes characters not inclu-
ded in the target code set, conversion and output for all 
such characters will be done using a substitute characters.

.SH "zh_CN.euc to UTF-8 and UTF-8 to zh_CN.euc"

Conversion modules can be used to convert GB 2312-80 characters
between EUC-CN and UTF-8 encodings. If input data which does not
have the corresponding character in the target code is encountered,
it will be replaced with the substitute character (zh_CN.euc: '??'
(0x3f3f), UTF-8: U+FFFD(0xefbfbd)).
.br
.ne 15

.SH "zh_CN.gbk to UTF-8 and UTF-8 to zh_CN.gbk"
Conversion modules can be used to convert GBK characters between
GBK and UTF-8 encodings. If input data which does not have the
corresponding character in the target code is encountered, it 
will be replaced with the subsitute character (zh_CN.gbk: '??'
(0x3f3f), UTF-8: U+FFFD(0xefbfbd)).
.br
.ne 15

.SH "zh_CN.gb18030 to UTF-8 and UTF-8 to zh_CN.gb18030"
Conversion modules can be used to convert GB18030-2000 characters
between GB18030 and UTF-8 encodings. If input data which does not
have the corresponding character in the target code is encountered,
it will be replaced with the substitute character (zh_CN.GB18030: '??'
(0x3f3f), UTF-8: U+FFFD(0xefbfbd)). 
.br
.ne 15

.SH "zh_CN.euc to zh_CN.iso2022-CN and zh_CN.iso2022-CN to zh_CN.euc"
Conversion modules are provided to convert GB 2312-80 characters
between IS0-2022-CN and EUC-CN encodings.
.br
.ne 15

.SH "zh_CN.gbk to zh_CN.iso2022-CN and zh_CN.iso2022-CN to zh_CN.euc"
Conversion modules are provided to convert GB 2312-80, CNS 11643-1992
plane 1 and 2 characters between ISO-2022-CN and EUC-CN encoding. If
input data which doesn't belong to above charset is encountered, it
will be replaced with the substitute character (zh_CN.gbk: 0xa1f5,
zh_CN.iso2022-CN: 0x2175).
.br
.ne 15

.SH "zh_CN.euc to HZ-GB-2312 and HZ-GB-2312 to zh_CN.euc"
Conversion modules are provided to convert GB 2312-80 characters
between EUC-CN and HZ encodings.
.br
.ne 15

.SH "zh_CN.gbk to HZ-GB-2312 and HZ-GB-2312 to zh_CN.gbk"
Conversion modules are provided to convert GB 2312-80 characters
between EUC-CN and HZ encodings. If input data which does not belong
to the above charset is encountered, it will be replaced with the
substitute characters (HZ-GB-2312: 0x2175).
.br
.ne 15

.SH "zh_CN.iso2022-CN to UTF-8 and UTF-8 to zh_CN.iso2022-CN"
Conversion modules are provided to convert GB 2312-80 and CNS 11643
plane 1 and 2 characters between ISO-2022-CN and UTF-8 encodings. If 
input data which does not belong to the above charsets is encountered, 
it will be replaced with the substitute characters (zh_CN.iso2022-CN: '??'
(0x3f3f), UTF-8: U+FFFD).
.br
.ne 15

.SH "HZ-GB-2312 to UTF-8 and UTF-8 to HZ-GB-2312"
Conversion modules can be used to convert GB 2312-80 characters
between HZ and UTF-8 encoding. If input data which does not belong
to the above charset is encountered, it will be replaced with the
substitute characters ( HZ-GB-2312: '??' (0x3f3f), UTF-8: U+FFFD).
.br
.ne 15

.SH "zh_CN-cp935 to UTF-8 and UTF-8 to zh_CN-cp935"
Conversion modules are provided to convert GB 2312-80 characters
between IBM Code Page 935 and UTF-8 encodings.
.br
.ne 15

.SH "zh_CN.euc to zh_TW-big5 and zh_TW-big5 to zh_CN.euc"
Conversion modules are provided to convert between simplified chinese
(EUC-CN encoding) and traditional chinese (BIG5 encoding). If input
data which does not have corresponding simplified/traditional chinese 
character is encountered, it will be replaced with the substitute character
(zh_CN.euc: '__' (0x5f5f), zh_TW-big5: '__' (0x5f5f)).
.br
.ne 15

.SH "zh_CN.gbk to zh_TW-big5 and zh_TW-big5 to zh_CN.gbk"
Conversion modules are provided to convert GBK characters between GBK
and BIG5 encoding. If input data which neither has corresponding
simplified/traditional chinese character nor belongs to the other charset
is encountered, it will be replaced with the substitute character
(zh_CN.gbk: '__' (0x5f5f), zh_TW-big5: '__' (0x5f5f)).
.br
.ne 15

.SH "zh_CN.gbk to zh_TW-big5p and zh_TW-big5p to zh_CN.gbk"
Conversion modules can be used to convert GBK or Big-5p characters
between GBK and Big-5p encodings. If input data which does not
belong to the other charset, it will be replaced with the substitute
character (zh_CN.gbk: '__' (0x5f5f), zh_TW-big5p: '__' (0x5f5f)).
.br
.ne 15

.SH "zh_CN.gbk to zh_HK-big5hk and zh_HK-big5hk to zh_CN.gbk"
Conversion modules can be used to convert GBK characters between
GBK and BIG5HK encodings. if input data which does not belong to
the other charset, it will be replaced with the substitute character
(zh_CN.gbk: '__' (0x5f5f), zh_HK-big5hk: '__' (0x5f5f)).
.br
.ne 15

.fi
.SH SEE ALSO
.BR iconv (1),
.BR iconv (3),
.BR iconv (5),
.BR iconv_zh_TW (5)
