Alhadis/Silos/Solaris-11.3/man5/iconv_zh_TW.5
.\" $Id: iconv_zh_TW.5,v 1.8 2002/04/16 20:36:25 fzhang Exp $ SMI; from SVr4
'\"macro stdmacro
.\" Copyright 1989 AT&T
.nr X
.TH iconv_zh_TW 5 "2 Nov 2001"
.SH NAME
iconv_zh_TW \- code set conversion tables in traditional Chinese (zh_TW) locale
.SH AVAILABILITY
system/library/iconv/utf-8
.SH DESCRIPTION
.IX "code set conversion tables" "iconv_zh_TW" "" "\(em \fLiconv_zh_TW\fP"
.IX "iconv_zh_TW" "" "\fLiconv_zh_TW\fP \(em code set conversion tables"

The following code set conversions are supported:

.\" === troff version of table ============
.if n .ig IG
.TS
center box tab(;) ;
c s s s s
c | c | c | c | c
l | l | l | l | l .
Code Set Conversions Supported
_
Code;Symbol;Target Code;Symbol;comment
_
CNS 11643;zh_TW-euc;Big-5;zh_TW-big5;Chinese EUC to Big-5
CNS 11643;zh_TW-euc;ISO 2022-7;zh_TW-iso2022-7;Chinese EUC to ISO 2022-7
.\" CNS 11643;zh_TW-euc;UTF-8;UTF-8;Chinese EUC to UTF-8
Big-5;zh_TW-big5;CNS 11643;zh_TW-euc;Chinese Big-5 to EUC
Big-5;zh_TW-big5;ISO 2022-7;zh_TW-iso2022-7;Chinese Big-5 to ISO 2022-7
.\" Big-5;zh_TW-big5;UTF-8;UTF-8;Chinese Big-5 to UTF-8
ISO 2022-7;zh_TW-iso2022-7;CNS 11643;zh_TW-euc;ISO 2022-7 to EUC
ISO 2022-7;zh_TW-iso2022-7;Big-5;zh_TW-big5;ISO 2022-7 to Big-5
.\" ISO 2022-7;zh_TW-iso2022-7;UTF-8;UTF-8;ISO 2022-7 to UTF-8
.\" UTF-8;UTF-8;CNS 11643;zh_TW-euc;UTF-8 to Chinese EUC
.\" UTF-8;UTF-8;Big-5;zh_TW-big5;UTF-8 to Chinese Big-5
.\" UTF-8;UTF-8;ISO 2022-7;zh_TW-iso2022-7;UTF-8 to ISO 2022-7
.TE
.IG
.\" === end troff version ======
.\" ====nroff version ==========
.if t .ig IG
.RS .0i
.nf
.ta 11n +16n +11n +16n
	Code Set Conversions Supported
Code            Symbol               TargetCode      Symbol

CNS 11643       zh_TW-euc            Big-5           zh_TW-big5
CNS 11643       zh_TW-euc            ISO 2022-7      zh_TW-iso2022-7
CNS 11643       zh_TW-euc            UTF-8           UTF-8
CNS 11643       zh_TW-euc            IS0 2022-CN-EXT zh_TW-iso2022-CN-EXT
Big-5           zh_TW-big5           CNS 11643       zh_TW-euc
Big-5           zh_TW-big5           ISO 2022-7      zh_TW-iso2022-7
Big-5           zh_TW-big5           IS0 2022-CN-EXT zh_TW-is02022-CN-EXT
Big-5           zh_TW-big5           UTF-8           UTF-8
ISO 2022-7      zh_TW-iso2022-7      CNS 11643       zh_TW-euc
ISO 2022-7      zh_TW-iso2022-7      Big-5           zh_TW-big5
IS0 2022-7      zh_TW-iso2022-7      UTF-8           UTF-8
IS0 2022-CN-EXT zh_TW-iso2022-CN-EXT CNS 11643       zh_TW-euc
IS0 2022-CN-EXT zh_TW-iso2022-CN-EXT Big-5           zh_TW-big5
Code Page 937   zh_TW-cp937          UTF-8           UTF-8
BIG5HK          zh_HK-big5hk         UTF-8           UTF-8
Big-5p          zh_TW-big5p          UTF-8           UTF-8
UTF-8           UTF-8                CNS 11643       zh_TW-euc
UTF-8           UTF-8                IS0 2022-7      zh_TW-iso2022-7
UTF-8           UTF-8                Big-5           Big-5
UTF-8           UTF-8                Code Page 937   zh_TW-cp937
UTF-8           UTF-8                BIG5HK          zh_HK-big5hk
UTF-8           UTF-8                Big-5p          zh_TW-big5p

.fi
.RE
.IG
.\" === end nroff version ======
.LP

Conversions are performed as described below. For all conversions,
if the source code set includes characters not included in the 
target code set, conversion and output for all such characters
will be done using a substitute characters.

.SH "zh_TW-euc to UTF-8 and UTF-8 to zh_TW-euc"
Conversion modules are provided to convert CNS 11643 plane 1, 2 and
3 characters between EUC-TW and UTF-8 encodings. If input data which
does not belong to the above charset is encountered, it will be 
replaced with the substitute character (zh_TW-euc: '??' (0x3f3f),
UTF-8: U+FFFD (0xefbfbd)).
.br
.ne 15

.SH "zh_TW-euc to zh_TW-big5 and zh_TW-big5 to zh_TW-euc"
Conversion modules can be used to convert CNS 11643 plane 1 and 2
characters between EUC-TW and BIG5 encodings. If input data which
does not belong to the above charset is encountered, it will be
replaced with the subsitute character (zh_TW-euc: '__' (0x5f5f),
zh_TW-big5: '__' (0x5f5f)).

Note that the seven additional popular characters from ETen extension
have been supported, they belong to CNS 11643 plane 3.
.br
.ne 15

.SH "zh_TW-euc to zh_TW-iso2022-7 and zh_TW-iso2022-7 to zh_TW-euc"
Conversion modules can be used to convert CNS 11643 characters between
EUC-TW and ISO-2022-7 encodings.
.br
.ne 15

.SH "zh_TW-euc to zh_TW-iso2022-CN-EXT and zh_TW-iso2022-CN-EXT to zh_TW-euc"
Conversion modules can be used to convert GB 2312-80, CNS 11643 plane
1, 2, 3, 4, 5, 6 and 7 characters between EUC-TW and IS0-2022-CN-EXT encodings.
.br
.ne 15

.SH "zh_TW-big5 to UTF-8 and UTF-8 to zh_TW-big5"
Conversion modules are provided to convert Big-5 characters between
BIG5 and UTF-8 encodings. If input data which does not belong to the
above charset is encountered, it will be replaced with the substitute
character (zh_TW-big5: '??' (0x3f3f), UTF-8: U+FFFD (0xefbfbd)).

Note that the seven additional popular characters from ETen extension
have been supported, they are 0xf9d6 -- 0xf9dc.
.br
.ne 15

.SH "zh_TW-big5 to zh_TW-iso2022-7 and zh_TW-iso2022-7 to zh_TW-big5"
Conversion modules can be used to convert Big-5 characters between
BIG5 and ISO-2022-7 encodings. If input Big-5 data which does not
have corresponding CNS 11643 character is encountered, it will be replaced
with the substitute character (zh_TW-iso2022-7: '__' (0x5f5f)).
.br
.ne 15

.SH "zh_TW-big5 to zh_TW-iso2022-CN-EXT and zh_TW-iso2022-CN-EXT to zh_TW-big5"
Conversion modules are provided to convert Big-5 characters between
BIG5 and ISO-2022-CN-EXT encodings. If input Big-5 data which does not
have corresponding CNS 11643 character is encountered, it will be replaced
with the substitute character (zh_TW-iso2022-7: '__' (0x5f5f)).
.br
.ne 15

.SH "zh_TW-big5p to UTF-8 and UTF-8 to zh_TW-big5p"
Conversion modules can be used to convert Big-5p characters between
BIG5+ and UTF-8 encodings. If input data which doesn't belong to the
above charset is encountered, it will be replaced with the substitute
character (zh_TW-big5p: '??' (0x3f3f), UTF-8: U+FFFD).
.br
.ne 15

.SH "zh_HK-big5hk to UTF-8 and UTF-8 to zh_HK-big5hk"
Conversion modules can be used to convert HKSCS and Big-5 characters
between BIG5HK and UTF-8 encoding. If input data which does not belong
to the above charsets is encountered, it will be replaced with the
substitute character (zh_HK-big5hk: '??' (0x3f3f), UTF-8: U+FFFD).
.br
.ne 15 

.SH "zh_TW-cp937 to UTF-8 and UTF-8 to zh_TW-cp937"
Conversion modules are provided to convert CNS 11643 characters between
IBM Code Page 937 and UTF-8 encodings.
.br
.ne 15

.SH "zh_TW-iso2022-7 to UTF-8 and UTF-8 to zh_TW-iso2022-7"
Conversion modules can be used to convert CNS 11643 characters between
ISO-2022-7 and UTF-8 encodings.
.br
.ne 15

.\" .SH "CNS 11643 (Chinese EUC) to UTF-8"
.\" 
.\" For the conversion of CNS 11643 to UTF-8 (UCS Transformation Format 8)
.\" which will be added to ISO/IEC 10646-1 as Annex P, all characters
.\" not in the following table can be mapped to UTF-8 format.
.\" .LP
.\" .br
.\" .ne 10
.\" .\" === troff version of table ============
.\" .if n .ig IG
.\" .LP
.\" .TS
.\" center box tab(;) ;
.\" c s
.\" c | c
.\" l | l .
.\" Conversions Performed
.\" _
.\" CNS 11643 (Chinese EUC);UTF-8
.\" _
.\" .TE
.\" .IG
.\" .\" ====== end troff version ===
.\" .\" =======begin nroff version =
.\" .if t .ig IG
.\" .nf
.\" .RS 1.25i
.\" .ta 25n
.\" Conversions Performed
.\" CNS 11643 (Chinese EUC)	UTF-8
.\" 
.\" .RE
.\" .IG
.\" .\" ====== end nroff version ===
.\" .br
.\" .ne 20
.\" .\" === troff version of table ============
.\" .if n .ig IG
.\" .TS
.\" center box tab ;
.\" c
.\" c
.\" l .
.\" Converted to Underscore '__' (0x5f5f)
.\" _
.\" 0x2721 0x2722 0x2723 0x2724 0x2725 0x2726 0x2727 0x2728
.\" _
.\" 0x2729 0x272a 0x272b 0x272c 0x272d 0x272e 0x272f 0x2730
.\" _
.\" 0x2731 0x2732 0x2733 0x2734 0x2735 0x2736 0x2737 0x2738
.\" _
.\" 0x2739 0x273a 0x273b 0x273c 0x273d 0x273e 0x273f 0x2740
.\" _
.\" 0x2741 0x2742 0x2743 0x2744 0x2745 0x2746 0x2747 0x2748
.\" _
.\" 0x2749 0x274a 0x274b 0x274c 0x274d 0x274e 0x274f 0x2750
.\" _
.\" 0x2751 0x2752 0x2753 0x2754 0x2755 0x2756 0x2757 0x2758
.\" _
.\" 0x2759 0x275a 0x275b 0x275c 0x275d 0x275e 0x275f 0x2760
.\" _
.\" 0x2761 0x2762 0x2763 0x2764 0x2765 0x2766 0x2767 0x2768
.\" _
.\" 0x2769 0x276a 0x276b 0x276c 0x276d 0x276e 0x276f 0x2770
.\" _
.\" 0x2771 0x2772 0x2773 0x2774 0x2775 0x2776 0x2777 0x2778
.\" _
.\" 0x2779 0x277a 0x277b 0x277c 0x277d 0x277e 0x2821 0x2822
.\" _
.\" 0x2823 0x2824 0x2825 0x2826 0x2827 0x2828 0x2829 0x282a
.\" _
.\" 0x282b 0x282c 0x282d 0x282e 0x282f 0x2830 0x2831 0x2832
.\" _
.\" 0x2833 0x2834 0x2835 0x2836 0x2837 0x2838 0x2839 0x283a
.\" _
.\" 0x283b 0x283c 0x283d 0x283e 0x283f 0x2840 0x2841 0x2842
.\" _
.\" 0x2843 0x2844 0x2845 0x2846 0x2847 0x2848 0x2849 0x284a
.\" _
.\" 0x284b 0x284c 0x284d 0x284e 0x284f 0x2850 0x2851 0x2852
.\" _
.\" 0x2853 0x2854 0x2855 0x2856 0x2857 0x2858 0x2859 0x285a
.\" _
.\" 0x285b 0x285c 0x285d 0x285e 0x285f 0x2860 0x2861 0x2862
.\" _
.\" 0x2863 0x2864 0x2865 0x2866 0x2867 0x2868 0x2869 0x286a
.\" _
.\" 0x286b 0x286c 0x286d 0x286e 0x286f 0x2870 0x2871 0x2872
.\" _
.\" 0x2873 0x2874 0x2875 0x2876 0x2877 0x2878 0x2879 0x287a
.\" _
.\" 0x287b 0x287c 0x287d 0x287e 0x2921 0x2922 0x2923 0x2924
.\" _
.\" 0x2925 0x2926 0x2927 0x2928 0x2929 0x292a 0x292b 0x292c
.\" _
.\" 0x292d 0x292e 0x292f 0x2930 0x2931 0x2932 0x2933 0x2934
.\" _
.\" 0x2935 0x2936 0x2937 0x2938 0x2939
.\" .TE
.\" .IG
.\" .\" ====== end troff version ===
.\" .\" =======begin nroff version =
.\" .if t .ig IG
.\" .nf
.\" .RS .75i
.\" Converted to Underscore '__' (0x5f5f)
.\" 0x2721 0x2722 0x2723 0x2724 0x2725 0x2726 0x2727 0x2728
.\" 0x2729 0x272a 0x272b 0x272c 0x272d 0x272e 0x272f 0x2730
.\" 0x2731 0x2732 0x2733 0x2734 0x2735 0x2736 0x2737 0x2738
.\" 0x2739 0x273a 0x273b 0x273c 0x273d 0x273e 0x273f 0x2740
.\" 0x2741 0x2742 0x2743 0x2744 0x2745 0x2746 0x2747 0x2748
.\" 0x2749 0x274a 0x274b 0x274c 0x274d 0x274e 0x274f 0x2750
.\" 0x2751 0x2752 0x2753 0x2754 0x2755 0x2756 0x2757 0x2758
.\" 0x2759 0x275a 0x275b 0x275c 0x275d 0x275e 0x275f 0x2760
.\" 0x2761 0x2762 0x2763 0x2764 0x2765 0x2766 0x2767 0x2768
.\" 0x2769 0x276a 0x276b 0x276c 0x276d 0x276e 0x276f 0x2770
.\" 0x2771 0x2772 0x2773 0x2774 0x2775 0x2776 0x2777 0x2778
.\" 0x2779 0x277a 0x277b 0x277c 0x277d 0x277e 0x2821 0x2822
.\" 0x2823 0x2824 0x2825 0x2826 0x2827 0x2828 0x2829 0x282a
.\" 0x282b 0x282c 0x282d 0x282e 0x282f 0x2830 0x2831 0x2832
.\" 0x2833 0x2834 0x2835 0x2836 0x2837 0x2838 0x2839 0x283a
.\" 0x283b 0x283c 0x283d 0x283e 0x283f 0x2840 0x2841 0x2842
.\" 0x2843 0x2844 0x2845 0x2846 0x2847 0x2848 0x2849 0x284a
.\" 0x284b 0x284c 0x284d 0x284e 0x284f 0x2850 0x2851 0x2852
.\" 0x2853 0x2854 0x2855 0x2856 0x2857 0x2858 0x2859 0x285a
.\" 0x285b 0x285c 0x285d 0x285e 0x285f 0x2860 0x2861 0x2862
.\" 0x2863 0x2864 0x2865 0x2866 0x2867 0x2868 0x2869 0x286a
.\" 0x286b 0x286c 0x286d 0x286e 0x286f 0x2870 0x2871 0x2872
.\" 0x2873 0x2874 0x2875 0x2876 0x2877 0x2878 0x2879 0x287a
.\" 0x287b 0x287c 0x287d 0x287e 0x2921 0x2922 0x2923 0x2924
.\" 0x2925 0x2926 0x2927 0x2928 0x2929 0x292a 0x292b 0x292c
.\" 0x292d 0x292e 0x292f 0x2930 0x2931 0x2932 0x2933 0x2934
.\" 0x2935 0x2936 0x2937 0x2938 0x2939
.\" .RE
.\" .IG
.\" .\" ====== end nroff version ===
.\" .br
.\" .ne 15
.\" .SH "Big-5 (Chinese Big-5) to UTF-8"
.\" 
.\" For the conversion of Big-5 to UTF-8 characters not
.\" in the following table can be mapped to UTF-8 format.
.\" .LP
.\" .br
.\" .ne 15
.\" .\" === troff version of table ============
.\" .if n .ig IG
.\" .TS
.\" center box tab(;) ;
.\" c s
.\" c | c
.\" l | l .
.\" Conversions Performed
.\" _
.\" Big-5 (Chinese Big-5);UTF-8
.\" _
.\" .TE
.\" .IG
.\" .\" ====== end troff version ===
.\" .\" =======begin nroff version =
.\" .if t .ig IG
.\" .nf
.\" .RS 1.25i
.\" .ta 25n
.\" Conversions Performed
.\" Big-5 (Chinese Big-5)	UTF-8
.\" 
.\" .RE
.\" .IG
.\" .\" ====== end nroff version ===
.\" .br
.\" .ne 20
.\" .\" === troff version of table ============
.\" .if n .ig IG
.\" .TS
.\" center box tab ;
.\" c
.\" c
.\" l .
.\" Converted to Underscore '__' (0x5f5f)
.\" _
.\" 0xc6e4 0xc6e5 0xc879 0xc87a 0xc87b 0xc87c 0xc87d 0xc87e
.\" _
.\" 0xc8a1 0xc8a2 0xc8a3 0xc8a4 0xc8a5 0xc8a6 0xc8a7 0xc8a8
.\" _
.\" 0xc8a9 0xc8aa 0xc8ab 0xc8ac 0xc8ad 0xc8ae 0xc8af 0xc8b0
.\" _
.\" 0xc8b1 0xc8b2 0xc8b3 0xc8b4 0xc8b5 0xc8b6 0xc8b7 0xc8b8
.\" _
.\" 0xc8b9 0xc8ba 0xc8bb 0xc8bc 0xc8bd 0xc8be 0xc8bf 0xc8c0
.\" _
.\" 0xc8c1 0xc8c2 0xc8c3 0xc8c4 0xc8c5 0xc8c6 0xc8c7 0xc8c8
.\" _
.\" 0xc8c9 0xc8ca 0xc8cb 0xc8cc 0xc8d4 0xc8d5 0xc8d6 0xc8d7
.\" _
.\" 0xc8d8 0xc8d9 0xc8da 0xc8db 0xc8dc 0xc8dd 0xc8de 0xc8df
.\" _
.\" 0xc8e0 0xc8e1 0xc8e2 0xc8e3 0xc8e4 0xc8e5 0xc8e6 0xc8e7
.\" _
.\" 0xc8e8 0xc8e9 0xc8ea 0xc8eb 0xc8ec 0xc8ed 0xc8ee 0xc8ef
.\" _
.\" 0xc8f0 0xc8f1 0xc8f2 0xc8f3 0xc8f4 0xc8f5 0xc8f6 0xc8f7
.\" _
.\" 0xc8f8 0xc8f9 0xc8fa 0xc8fb 0xc8fc 0xc8fd 0xc8fe
.\" .TE
.\" .IG
.\" .\" ====== end troff version ===
.\" .\" =======begin nroff version =
.\" .if t .ig IG
.\" .nf
.\" .RS .75i
.\" Converted to Underscore '__' (0x5f5f)
.\" 0xc6e4 0xc6e5 0xc879 0xc87a 0xc87b 0xc87c 0xc87d 0xc87e
.\" 0xc8a1 0xc8a2 0xc8a3 0xc8a4 0xc8a5 0xc8a6 0xc8a7 0xc8a8
.\" 0xc8a9 0xc8aa 0xc8ab 0xc8ac 0xc8ad 0xc8ae 0xc8af 0xc8b0
.\" 0xc8b1 0xc8b2 0xc8b3 0xc8b4 0xc8b5 0xc8b6 0xc8b7 0xc8b8
.\" 0xc8b9 0xc8ba 0xc8bb 0xc8bc 0xc8bd 0xc8be 0xc8bf 0xc8c0
.\" 0xc8c1 0xc8c2 0xc8c3 0xc8c4 0xc8c5 0xc8c6 0xc8c7 0xc8c8
.\" 0xc8c9 0xc8ca 0xc8cb 0xc8cc 0xc8d4 0xc8d5 0xc8d6 0xc8d7
.\" 0xc8d8 0xc8d9 0xc8da 0xc8db 0xc8dc 0xc8dd 0xc8de 0xc8df
.\" 0xc8e0 0xc8e1 0xc8e2 0xc8e3 0xc8e4 0xc8e5 0xc8e6 0xc8e7
.\" 0xc8e8 0xc8e9 0xc8ea 0xc8eb 0xc8ec 0xc8ed 0xc8ee 0xc8ef
.\" 0xc8f0 0xc8f1 0xc8f2 0xc8f3 0xc8f4 0xc8f5 0xc8f6 0xc8f7
.\" 0xc8f8 0xc8f9 0xc8fa 0xc8fb 0xc8fc 0xc8fd 0xc8fe
.\" .RE
.\" .IG
.\" .\" ====== end nroff version ===
.\" .LP
.\" .br
.\" .ne 15
.\" .SH "ISO 2022-7 to UTF-8"
.\" 
.\" For the conversion of ISO 2022-7 to UTF-8,
.\" characters not in the following table
.\" can be mapped to UTF-8 format.
.\" .LP
.\" .br
.\" .ne 10
.\" .\" === troff version of table ============
.\" .if n .ig IG
.\" .TS
.\" center box tab(;) ;
.\" c s
.\" c | c
.\" l | l .
.\" Conversions Performed
.\" _
.\" ISO 2022-7;UTF-8
.\" _
.\" .TE
.\" .IG
.\" .\" ====== end troff version ===
.\" .\" =======begin nroff version =
.\" .if t .ig IG
.\" .nf
.\" .RS 1.25i
.\" .ta 25n
.\" Conversions Performed
.\" ISO 2022-7	UTF-8
.\" 
.\" .RE
.\" .IG
.\" .\" ====== end nroff version ===
.\" .br
.\" .ne 20
.\" .\" === troff version of table ============
.\" .if n .ig IG
.\" .TS
.\" center box tab ;
.\" c
.\" c
.\" l .
.\" Converted to Underscore '__' (0x5f5f)
.\" _
.\" 0x2721 0x2722 0x2723 0x2724 0x2725 0x2726 0x2727 0x2728
.\" _
.\" 0x2729 0x272a 0x272b 0x272c 0x272d 0x272e 0x272f 0x2730
.\" _
.\" 0x2731 0x2732 0x2733 0x2734 0x2735 0x2736 0x2737 0x2738
.\" _
.\" 0x2739 0x273a 0x273b 0x273c 0x273d 0x273e 0x273f 0x2740
.\" _
.\" 0x2741 0x2742 0x2743 0x2744 0x2745 0x2746 0x2747 0x2748
.\" _
.\" 0x2749 0x274a 0x274b 0x274c 0x274d 0x274e 0x274f 0x2750
.\" _
.\" 0x2751 0x2752 0x2753 0x2754 0x2755 0x2756 0x2757 0x2758
.\" _
.\" 0x2759 0x275a 0x275b 0x275c 0x275d 0x275e 0x275f 0x2760
.\" _
.\" 0x2761 0x2762 0x2763 0x2764 0x2765 0x2766 0x2767 0x2768
.\" _
.\" 0x2769 0x276a 0x276b 0x276c 0x276d 0x276e 0x276f 0x2770
.\" _
.\" 0x2771 0x2772 0x2773 0x2774 0x2775 0x2776 0x2777 0x2778
.\" _
.\" 0x2779 0x277a 0x277b 0x277c 0x277d 0x277e 0x2821 0x2822
.\" _
.\" 0x2823 0x2824 0x2825 0x2826 0x2827 0x2828 0x2829 0x282a
.\" _
.\" 0x282b 0x282c 0x282d 0x282e 0x282f 0x2830 0x2831 0x2832
.\" _
.\" 0x2833 0x2834 0x2835 0x2836 0x2837 0x2838 0x2839 0x283a
.\" _
.\" 0x283b 0x283c 0x283d 0x283e 0x283f 0x2840 0x2841 0x2842
.\" _
.\" 0x2843 0x2844 0x2845 0x2846 0x2847 0x2848 0x2849 0x284a
.\" _
.\" 0x284b 0x284c 0x284d 0x284e 0x284f 0x2850 0x2851 0x2852
.\" _
.\" 0x2853 0x2854 0x2855 0x2856 0x2857 0x2858 0x2859 0x285a
.\" _
.\" 0x285b 0x285c 0x285d 0x285e 0x285f 0x2860 0x2861 0x2862
.\" _
.\" 0x2863 0x2864 0x2865 0x2866 0x2867 0x2868 0x2869 0x286a
.\" _
.\" 0x286b 0x286c 0x286d 0x286e 0x286f 0x2870 0x2871 0x2872
.\" _
.\" 0x2873 0x2874 0x2875 0x2876 0x2877 0x2878 0x2879 0x287a
.\" _
.\" 0x287b 0x287c 0x287d 0x287e 0x2921 0x2922 0x2923 0x2924
.\" _
.\" 0x2925 0x2926 0x2927 0x2928 0x2929 0x292a 0x292b 0x292c
.\" _
.\" 0x292d 0x292e 0x292f 0x2930 0x2931 0x2932 0x2933 0x2934
.\" _
.\" 0x2935 0x2936 0x2937 0x2938 0x2939
.\" .TE
.\" .IG
.\" .\" ====== end troff version ===
.\" .\" =======begin nroff version =
.\" .if t .ig IG
.\" .nf
.\" .RS .75i
.\" Converted to Underscore '__' (0x5f5f)
.\" 0x2721 0x2722 0x2723 0x2724 0x2725 0x2726 0x2727 0x2728
.\" 0x2729 0x272a 0x272b 0x272c 0x272d 0x272e 0x272f 0x2730
.\" 0x2731 0x2732 0x2733 0x2734 0x2735 0x2736 0x2737 0x2738
.\" 0x2739 0x273a 0x273b 0x273c 0x273d 0x273e 0x273f 0x2740
.\" 0x2741 0x2742 0x2743 0x2744 0x2745 0x2746 0x2747 0x2748
.\" 0x2749 0x274a 0x274b 0x274c 0x274d 0x274e 0x274f 0x2750
.\" 0x2751 0x2752 0x2753 0x2754 0x2755 0x2756 0x2757 0x2758
.\" 0x2759 0x275a 0x275b 0x275c 0x275d 0x275e 0x275f 0x2760
.\" 0x2761 0x2762 0x2763 0x2764 0x2765 0x2766 0x2767 0x2768
.\" 0x2769 0x276a 0x276b 0x276c 0x276d 0x276e 0x276f 0x2770
.\" 0x2771 0x2772 0x2773 0x2774 0x2775 0x2776 0x2777 0x2778
.\" 0x2779 0x277a 0x277b 0x277c 0x277d 0x277e 0x2821 0x2822
.\" 0x2823 0x2824 0x2825 0x2826 0x2827 0x2828 0x2829 0x282a
.\" 0x282b 0x282c 0x282d 0x282e 0x282f 0x2830 0x2831 0x2832
.\" 0x2833 0x2834 0x2835 0x2836 0x2837 0x2838 0x2839 0x283a
.\" 0x283b 0x283c 0x283d 0x283e 0x283f 0x2840 0x2841 0x2842
.\" 0x2843 0x2844 0x2845 0x2846 0x2847 0x2848 0x2849 0x284a
.\" 0x284b 0x284c 0x284d 0x284e 0x284f 0x2850 0x2851 0x2852
.\" 0x2853 0x2854 0x2855 0x2856 0x2857 0x2858 0x2859 0x285a
.\" 0x285b 0x285c 0x285d 0x285e 0x285f 0x2860 0x2861 0x2862
.\" 0x2863 0x2864 0x2865 0x2866 0x2867 0x2868 0x2869 0x286a
.\" 0x286b 0x286c 0x286d 0x286e 0x286f 0x2870 0x2871 0x2872
.\" 0x2873 0x2874 0x2875 0x2876 0x2877 0x2878 0x2879 0x287a
.\" 0x287b 0x287c 0x287d 0x287e 0x2921 0x2922 0x2923 0x2924
.\" 0x2925 0x2926 0x2927 0x2928 0x2929 0x292a 0x292b 0x292c
.\" 0x292d 0x292e 0x292f 0x2930 0x2931 0x2932 0x2933 0x2934
.\" 0x2935 0x2936 0x2937 0x2938 0x2939
.\" .RE
.\" .IG
.\" .\" ====== end nroff version ===
.\" .br
.\" .ne 15
.\" .SH "UTF-8 to CNS 11643 (Chinese EUC)"
.\" 
.\" For the conversion of UTF-8 to CNS 11643,
.\" all characters within CNS 11643 code space in UTF-8
.\" can be mapped to CNS 11643 format.
.\" .br
.\" .ne 15
.\" .SH "UTF-8 to Big-5 (Chinese Big-5)"
.\" 
.\" For the conversion of UTF-8 to Big-5,
.\" all characters within Big-5 code space in UTF-8
.\" can be mapped to Big-5 format.
.\" .br
.\" .ne 15
.\" .SH "UTF-8 to ISO 2022-7"
.\" 
.\" For the conversion of UTF-8 to ISO 2022-7 characters
.\" within ISO 2022-7 code space in UTF-8 can be mapped to
.\" ISO 2022-7 format.
.\" .LP
.\" .br
.\" .ne 15

.fi
.SH SEE ALSO
.BR iconv (1),
.BR iconv (3),
.BR iconv (5),
.BR iconv_zh (5)
