Alhadis/Silos/Solaris-11.3/man5/iconv_ko.UTF-8.5
.\" $Id: iconv_ko.5,v 1.7 1997/10/31 16:50:40 binz Exp $ SMI; from SVr4
'\"macro stdmacro
.\" Copyright 1989 AT&T
.nr X
.TH iconv_ko 5 "10 Mar 1995"
.SH NAME
iconv_ko \- code set conversions in Korean (ko) locale
.SH AVAILABILITY
system/library/iconv/utf-8
.SH DESCRIPTION
.IX "code set conversion tables" "iconv_ko" "" "\(em \fLiconv_ko\fP"
.IX "iconv_ko" "" "\fLiconv_ko\fP \(em code set conversion tables"

The following code set conversions are supported:

.\" === troff version of table ============
.if n .ig IG
.TS
center box tab(;) ;
c s s s s
c | c | c | c | c
l | l | l | l | l .
Code Set Conversions Supported
_
Code;Symbol;Target Code;Symbol;comment
_
Wansung;ko_KR-euc;Johap;ko_KR-johap92;Korean EUC to Johap
Wansung;ko_KR-euc;Packed;ko_KR-johap;Korean EUC to Packed
Wansung;ko_KR-euc;N-Byte;ko_KR-nbyte;Korean EUC to N-Byte
Wansung;ko_KR-euc;ISO-2022-KR;ko_KR-iso2022-7;Korean EUC to ISO-2022-KR
Johap;ko_KR-johap92;Wansung;ko_KR-euc;Johap to Korean EUC
Packed;ko_KR-johap;Wansung;ko_KR-euc;Packed to Korean EUC
N-Byte;ko_KR-nbyte;Wansung;ko_KR-euc;Johap to Korean EUC
ISO-2022-KR;ko_KR-iso2022-7;Wansung;ko_KR-euc;ISO-2022-KR to Korean EUC
.\"UTF-8;UTF-8;Wansung;ko_KR-euc;UTF-8 to Korean EUC
.\"UTF-8;UTF-8;Johap;ko_KR-johap92;UTF-8 to Johap
.\"UTF-8;UTF-8;Packed;ko_KR-johap;UTF-8 to Packed
.\"UTF-8;UTF-8;N-Byte;ko_KR-nbyte;UTF-8 to N-Byte
.\"UTF-8;UTF-8;ISO-2022-KR;ko_KR-iso2022-7;UTF-8 to ISO-2022-KR
.\"Wansung;ko_KR-euc;UTF-8;UTF-8;Korean EUC to UTF-8
.\"Johap;ko_KR-johap92;UTF-8;UTF-8;Johap to UTF-8
.\"Packed;ko_KR-johap;UTF-8;UTF-8;Packed to UTF-8
.\"N-Byte;ko_KR-nbyte;UTF-8;UTF-8;N-Byte to UTF-8
.\"ISO-2022-KR;ko_KR-iso2022-7;UTF-8;UTF-8;ISO-2022-KR to UTF-8
.TE
.IG
.\" === end troff version ======
.\" ====nroff version ==========
.if t .ig IG
.RS .0i
.nf
.ta 16n +16n +16n +16n
	Code Set Conversions Supported
Code	Symbol	TargetCode	Symbol

Wansung	ko_KR-euc	Johap	ko_KR-johap92
Wansung	ko_KR-euc	Packed	ko_KR-johap
Wansung	ko_KR-euc	N-Byte	ko_KR-nbyte
Wansung	ko_KR-euc	ISO-2022-KR	ko_KR-iso2022-7
Johap	ko_KR-johap92	Wansung	ko_KR-euc
Packed	ko_KR-johap	Wansung	ko_KR-euc
N-Byte	ko_KR-nbyte	Wansung	ko_KR-euc
ISO-2022-KR	ko_KR-iso2022-7	Wansung	ko_KR-euc
.\"UTF-8	UTF-8	Wansung	ko_KR-euc
.\"UTF-8	UTF-8	Johap	ko_KR-johap92
.\"UTF-8	UTF-8	Packed	ko_KR-johap
.\"UTF-8	UTF-8	N-Byte	ko_KR-nbyte
.\"UTF-8	UTF-8	ISO-2022-KR	ko_KR-iso2022-7
.\"Wansung	ko_KR-euc	UTF-8	UTF-8
.\"Johap	ko_KR-johap92	UTF-8	UTF-8
.\"Packed	ko_KR-johap	UTF-8	UTF-8
.\"N-Byte	ko_KR-nbyte	UTF-8	UTF-8
.\"ISO-2022-KR	ko_KR-iso2022-7	UTF-8	UTF-8
.fi
.RE
.IG
.\" === end nroff version ======
.LP

The conversions are performed as like following descriptions.

.SH "Wansung to Johap and Johap to Wansung"

For the conversion between Wansung which is in Korean EUC representation of 
KS C 5601-1992 and also known as Completion code and
Johap which is described at KS C 5601-1992 Annex 3: Supplementary Code System
(2 Byte Johap Code System) and also known as Combination code,
all characters can be mapped if conversion is from Wansung to Johap. 
However, from Johap to Wansung conversion, certain Hangul characters which are
not in KS C 5601-1992 precompsed character set will not be
able to mapped. Such characters will be mapped into underscore character 
(octal value of 137) of KS C 5636.
In case of Hanja and special symbol characters, they will follow the mapping
rules of Table 3 of Annex 3 of KS C 5601-1992.
.br
.ne 15
.SH "Wansung to Packed and Packed to Wansung"

For the conversion between Wansung and Packed which is described at
KS C 5601-1987 Annex 3: Supplementary Code System (2 Byte Johap Code System),
all characters except Hanja and special symbol
characters can be mapped if conversion is from Wansung to Packed. 
Such Hanja and special symbol characters will be mapped into underscore
character (octal value 137) of KS C 5636.
From Packed to Wansung conversion, certain Hangul chracters will not be
able to mapped since not every Hangul Packed code is representable in Wansung.
Such characters will be mapped into underscore character of KS C 5636.
.br
.ne 15
.SH "Wansung to N-Byte and N-Byte to Wansung"

For the conversion between Wansung and N-Byte which is described at
KS C 5601-1992 Annex 4: 7 Bit Hangul Alphabet codes,
all characters except Hanja and special symbol characters can be mapped.
Such Hanja and special symbol characters will be mapped into underscore
character (octal value 137) of KS C 5636.
.br
.ne 15
.SH "Wansung to ISO-2022-KR and ISO-2022-KR to Wansung"

For the conversion between Wansung and ISO-2022-KR which is described at
RFC 1557: Korean Character Encoding for Internet Messages,
all characters can be mapped.
.br
.\".ne 15
.\".SH "UTF-8 to Wansung and Wansung to UTF-8"
.\"
.\"For the conversion between UTF-8 (UCS Transformation Format 8) which will be
.\"added to ISO/IEC 10646-1 as Annex P and Wansung, all characters except
.\"characters which are not exist in Wansung but UTF-8 (non-identical characters),
.\"can be mapped.
.\"Such non-identical characters will be mapped into underscore characters
.\"(octal value 137) of KS C 5636.
.\"In case of Hangul characters, UTF-8 will have combining characters at row 11 of
.\"ISO/IEC 10646 in UTF-8 representation. Other characters like Hanja and special
.\"symbol characters will be mapped by the mapping rules at
.\"KS C 5601 to Unicode Table (version 0.0d2) which is provided by Unicode, Inc.
.\".br
.\".ne 15
.\".SH "UTF-8 to Johap and Johap to UTF-8"
.\"
.\"For the conversion between UTF-8 and Johap, all characters in Johap except
.\"characters which are not exist in Johap but UTF-8, can be mapped.
.\"Such non-identical characters will be mapped into underscore characters
.\"(octal value 137) of KS C 5636. In case of Hangul characters,
.\"UTF-8 will have combining characters at row 11 of ISO/IEC 10646 in UTF-8
.\"representation. Other characters like Hanja and special symbol characters will
.\"be mapped by the mapping rules at KS C 5601 to Unicode Table (version 0.0d2).
.\"and Table 3 of Annex 3 of KS C 5601-1992.
.\".br
.\".ne 15
.\".SH "UTF-8 to Packed and Packed to UTF-8"
.\"
.\"For the conversion between UTF-8 and Packed, all characters in Packed except
.\"characters which are not exist in Packed but UTF-8, can be mapped.
.\"Such non-identical characters including Hanja and special symbol characters
.\"will be mapped into underscore characters (octal value 137) of KS C 5636.
.\"In case of Hangul characters, UTF-8 will have combining characters at
.\"row 11 of ISO/IEC 10646 in UTF-8 representation. 
.\".br
.\".ne 15
.\".SH "UTF-8 to N-Byte and N-Byte to UTF-8"
.\"
.\"For the conversion between UTF-8 and N-Byte, all characters in N-Byte except
.\"characters which are not exist in N-Byte but UTF-8, can be mapped.
.\"Such non-identical characters including Hanja and special symbol characters
.\"will be mapped into underscore characters (octal value 137) of KS C 5636.
.\"In case of Hangul characters, UTF-8 will have combining characters at
.\"row 11 of ISO/IEC 10646 in UTF-8 representation. 
.\".br
.\".ne 15
.\".SH "UTF-8 to ISO-2022-KR and ISO-2022-KR to UTF-8"
.\"
.\"For the conversion between UTF-8 and ISO-2022-KR, all characters in
.\"ISO-2022-KR except characters which are not exist in ISO-2022-KR but UTF-8,
.\"can be mapped.
.\"Such non-identical characters including Hanja and special symbol characters
.\"will be mapped into underscore characters (octal value 137) of KS C 5636.
.\"In case of Hangul characters, UTF-8 will have combining characters at
.\"row 11 of ISO/IEC 10646 in UTF-8 representation. 
.SH FILES
.PD 0
.TP 40
\f4/usr/lib/iconv/ko_KR-euc%ko_KR-johap92.so\fP
Shared object for Korean EUC to Johap code conversion
.TP
\f4/usr/lib/iconv/ko_KR-euc%ko_KR-johap.so\fP
Shared object for Korean EUC to Packed code conversion
.TP
\f4/usr/lib/iconv/ko_KR-euc%ko_KR-nbyte.so\fP
Shared object for Korean EUC to N-Byte code conversion
.TP
\f4/usr/lib/iconv/ko_KR-euc%ko_KR-iso2022-7.so\fP
Shared object for Korean EUC to ISO-2022-KR code conversion
.TP
\f4/usr/lib/iconv/ko_KR-johap92%ko_KR-euc.so\fP
Shared object for Johap to Korean EUC code conversion
.TP
\f4/usr/lib/iconv/ko_KR-johap%ko_KR-euc.so\fP
Shared object for Packed to Korean EUC code conversion
.TP
\f4/usr/lib/iconv/ko_KR-nbyte%ko_KR-euc.so\fP
Shared object for Johap to Korean EUC code conversion
.TP
\f4/usr/lib/iconv/ko_KR-iso2022-7%ko_KR-euc.so\fP
Shared object for ISO-2022-KR to Korean EUC code conversion
.\".TP
.\"\f4/usr/lib/iconv/UTF-8%ko_KR-euc.so\fP
.\"Shared object for UTF-8 to Korean EUC code conversion
.\".TP
.\"\f4/usr/lib/iconv/UTF-8%ko_KR-johap92.so\fP
.\"Shared object for UTF-8 to Johap code conversion
.\".TP
.\"\f4/usr/lib/iconv/UTF-8%ko_KR-johap.so\fP
.\"Shared object for UTF-8 to Packed code conversion
.\".TP
.\"\f4/usr/lib/iconv/UTF-8%ko_KR-nbyte.so\fP
.\"Shared object for UTF-8 to N-Byte code conversion
.\".TP
.\"\f4/usr/lib/iconv/UTF-8%ko_KR-iso2022-7.so\fP
.\"Shared object for UTF-8 to ISO-2022-KR code conversion
.\".TP
.\"\f4/usr/lib/iconv/ko_KR-euc%UTF-8.so\fP
.\"Shared object for Korean EUC to UTF-8 code conversion
.\".TP
.\"\f4/usr/lib/iconv/ko_KR-johap92%UTF-8.so\fP
.\"Shared object for Johap to UTF-8 code conversion
.\".TP
.\"\f4/usr/lib/iconv/ko_KR-johap%UTF-8.so\fP
.\"Shared object for Packed to UTF-8 code conversion
.\".TP
.\"\f4/usr/lib/iconv/ko_KR-nbyte%UTF-8.so\fP
.\"Shared object for N-Byte to UTF-8 code conversion
.\".TP
.\"\f4/usr/lib/iconv/ko_KR-iso2022-7%UTF-8.so\fP
.\"Shared object for ISO-2022-KR to UTF-8 code conversion
.PD
.SH SEE ALSO
.BR iconv (1),
.BR iconv (3),
.BR iconv (5)
