Alhadis/Silos/Solaris-11.3/man5/ifconfig.5
'\" te
.\" Copyright (c) 2015, Oracle and/or its affiliates. All rights             reserved.
.TH ifconfig 5 "22 Jan 2015" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
ifconfig, ipadm, dladm \- mapping of ifconfig commands to ipadm and dladm utilities
.SH DESCRIPTION
.sp
.LP
The \fBifconfig\fR(1M) command has largely been replaced by \fBipadm\fR(1M). There are also several features that are replaced by \fBdladm\fR(1M), and a few replaced by other commands.
.sp
.LP
Modern network environments have become more complex, and configuration takes place on many different layers. The \fBipadm\fR and \fBdladm\fR commands map directly to these layers, and have been designed to be extensible as new features are added. In addition, they have been designed such that the various components are managed in a uniform way; learning to configure a new type of network component should not require learning new command syntax. Finally, these commands also provide configuration persistence across a system reboot.
.sp
.LP
While the \fBipadm\fR and \fBdladm\fR commands directly manage network configuration of the zone in which they are run, the global zone administrator can also manage or restrict network configuration within non-global zones using the \fBzonecfg\fR command. Please refer to \fBzonecfg\fR(1M) for more details about this command.
.sp
.LP
To aid in the transition from \fBifconfig\fR to the new commands, the following table provides translations from \fBifconfig\fR options to the appropriate \fBipadm\fR and \fBdladm\fR subcommands.
.LP
Note - 
.sp
.RS 2
The syntax given in the table is not complete. Full syntax for each \fBipadm\fR or \fBdladm\fR sub-command can be found by typing \fBipadm help \fIsub-command\fR\fR or \fBdladm help \fIsub-command\fR\fR on the command-line. For example,
.sp
.in +2
.nf
$ \fBipadm help create-ip\fR
.fi
.in -2
.sp

.sp
.RS 2
usage:
.sp
.in +2
.nf
create-ip [-t] <IP-interface>
.fi
.in -2
.sp

.RE
.sp

.sp
.TS
tab() box;
cw(1.83i) |cw(1.83i) |cw(1.83i) 
lw(1.83i) |lw(1.83i) |lw(1.83i) 
.
\fBifconfig\fRDescription\fBipadm\fR (other) command
_
\fBifconfig \fB-a\fR\fRList all interfaces and their addresses.\fBipadm\fR
_
T{

.RS +4
.TP
.ie t \(bu
.el o
\fBplumb\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBunplumb\fR
.RE
T}Create or delete an IP interface.T{

.RS +4
.TP
.ie t \(bu
.el o
\fBipadm create-ip\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBipadm delete-ip\fR
.RE
T}
_
T{

.RS +4
.TP
.ie t \(bu
.el o
[\fIaddress\fR]
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBaddif\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBremoveif\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBnetmask\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBdestination\fR
.RE
T}T{
Create or delete a static IP address on an interface, with or without an explicit netmask or prefix length.
T}T{

.RS +4
.TP
.ie t \(bu
.el o
\fBipadm create-addr \fB-a\fR \fIaddr\fR\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBipadm delete-addr\fR
.RE
T}
_
T{
\fBdhcp[1]\fR
.RS +4
.TP
.ie t \(bu
.el o
\fBwait \fIseconds\fR\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBstart\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBdrop\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBrelease\fR
.RE
T}T{
Create or delete DHCP address on an interface, with optional wait time specified.
T}T{

.RS +4
.TP
.ie t \(bu
.el o
\fBipadm create-addr \fB-T\fR dhcp [\fB-w\fR\fIseconds\fR]\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBipadm delete-addr\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBipadm delete-addr \fB-r\fR\fR
.RE
T}
_
\fBdhcp[1] extend\fRExtend a DHCP lease.\fBipadm refresh-addr\fR
_
\fBdhcp[1] inform\fRT{
Obtain configuration parameters from DHCP without obtaining a lease.
T}\fBipadm refresh-addr \fB-i\fR\fR
_
\fBdhcp[1] ping\fRCheck if DHCP is in use on an interface.\fBipadm show-addr \fIinterface\fR\fR
_
\fBdhcp[1] status\fRDisplay DHCP status.\fBnetstat \fB-D\fR\fR
_
T{

.RS +4
.TP
.ie t \(bu
.el o
\fBinet6 plumb up\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBtoken\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBunplumb\fR
.RE
T}T{
Create or delete an auto-configured IPv6 address on an existing interface.
T}T{

.RS +4
.TP
.ie t \(bu
.el o
\fBipadm create-addr \fB-T\fR addconf [\fB-i\fR \fIinterface-id\fR]\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBipadm delete-addr\fR
.RE
T}
_
T{

.RS +4
.TP
.ie t \(bu
.el o
\fB[-] deprecated\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB[-] preferred\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB[-] private\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB[-] xmit\fR
.REzone\fB-zones\fR\fB-all-zones\fR
T}View or set address properties.T{

.RS +4
.TP
.ie t \(bu
.el o
\fBipadm show-addrprop\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBipadm set-addrprop\fR
.RE
T}
_
\fBup\fRBring an address up.T{
\fBipadm up-addr\fR [implicit in the \fBcreate-addr\fR command; only needed after an explicit \fBdown-addr\fR]
T}
_
\fBdown\fRTake an address down.\fBipadm down-addr\fR
_
\fBmetric\fR\fBmtu\fR\fB[-] nud\fR\fB[-] arp\fR\fBuserrc\fR\fB[-] router\fRView or set interface properties.\fBipadm show-ifprop\fR\fBipadm set-ifprop\fR
_
\fBipmp group \fIname\fR\fR\fBunplumb\fRCreate or delete an IPMP group.\fBipadm create-ipmp\fR\fBipadm delete-ipmp\fR
_
\fBgroup \fIname\fR\fRAdd an interface to an IPMP group.\fBipmp add-ipmp \fB-i\fR \fIifname\fR\fR
_
\fB[-] standby\fRTurn on/off standby flag.T{
\fBipadm set-ifprop \fB-p\fR standby=on\fR\fBipadm set-ifprop \fB-p\fR standby=off\fR
T}
_
\fBtdst\fR\fBtsrc\fR\fB[-]encaplimit\fR\fBthoplimit\fRConfigure a tunnel link\fBdladm *\fB-iptun\fR\fR subcommands
_
\fBether \fIaddr\fR\fRT{
View or set the hardware address of a link.
T}T{
\fBdladm show-linkprop \fB-p\fR mac-address\fR\fBdladm set-linkprop \fB-p\fR mac-address=\fIaddr\fR\fR
T}
_
\fBmodlist\fR\fBmodinsert\fR\fBmodremove\fRT{
View or set modules to be autopushed on a link.
T}T{
\fBdladm show-linkprop \fB-p\fR autopush\fR\fBdladm set-linkprop \fB-p\fR autopush=\fImodlist\fR\fR
T}
_
\fBsubnet\fR\fBbroadcast\fRSet subnet/netmask/broadcast domain.\fBipadm set-addrprop \fB-p\fR prefixlen=\fIlen\fR\fR
_
\fBauth_algs\fR\fBencr_algs\fR\fBencr_auth_algs\fRSet IPsec policy for a tunnel link.\fBipsecconf\fR
_
\fBauto-revarp\fR\fBindex\fRThese features are no longer supported.
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBifconfig\fR(1M), \fBipadm\fR(1M), \fBipsecconf\fR(1M), \fBnetstat\fR(1M), \fBzonecfg\fR(1M)
