Alhadis/Silos/Solaris-11.3/man5/pam_unix_session.5
'\" te
.\" Copyright (c) 2009, 2015, Oracle and/or its affiliates. All rights reserved.
.TH pam_unix_session 5 "10 Mar 2015" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_unix_session \- session management PAM module for UNIX
.SH SYNOPSIS
.LP
.nf
\fBpam_unix_session.so.1\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBpam_unix_session\fR module implements \fBpam_sm_open_session\fR(3PAM) and \fBpam_sm_close_session\fR(3PAM). 
.sp
.LP
\fBpam_sm_open_session()\fR reads the \fB/var/adm/lastlog\fR file to retrieve the last login time for the user and displays a \fBPAM_TEXT_INFO\fR message using the current PAM conversation function to display the time and date of the last login of the user. The format of the message is in either one of the following formats:
.sp
.in +2
.nf
Last login: Wed Sep 17 14:57:54 2014 from abc.example.com
.fi
.in -2

.sp
.in +2
.nf
Last login: Wed Sep 17 14:57:54 2014 on /dev/console
.fi
.in -2

.sp
.LP
\fBpam_sm_open_session()\fR also updates the \fB/var/adm/lastlog\fR file with the information contained in the \fBPAM_USER\fR, \fBPAM_TTY\fR, and \fBPAM_RHOST\fR items. \fBpam_unix_account\fR(5) uses this information to determine the previous time the user logged in when checking for account inactivity.
.sp
.LP
\fBpam_sm_close_session()\fR is a null function.
.sp
.LP
The following options can be passed to the module:
.sp
.ne 2
.mk
.na
\fBdebug\fR
.ad
.RS 10n
.rt  
\fBsyslog\fR(3C) debugging information at the \fBLOG_DEBUG\fR level
.RE

.sp
.ne 2
.mk
.na
\fBnowarn\fR
.ad
.RS 10n
.rt  
Disables any error messages or warnings including the last login \fBPAM_TEXT_INFO\fR message.
.RE

.SH ERRORS
.sp
.LP
Upon successful completion, \fBPAM_SUCCESS\fR is returned. The following error codes are returned upon error:
.sp
.ne 2
.mk
.na
\fB\fBPAM_SESSION_ERR\fR\fR
.ad
.RS 20n
.rt  
Cannot make or remove the entry for the specified session (PAM_TTY is not present).
.RE

.sp
.ne 2
.mk
.na
\fB\fBPAM_USER_UNKNOWN\fR\fR
.ad
.RS 20n
.rt  
No account is present for \fIuser\fR.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
_
MT LevelMT-Safe with exceptions
.TE

.SH SEE ALSO
.sp
.LP
\fBpam\fR(3PAM), \fBpam_authenticate\fR(3PAM), \fBsyslog\fR(3C), \fBlibpam\fR(3LIB), \fBpam.conf\fR(4), \fBnsswitch.conf\fR(4), \fBattributes\fR(5), \fBpam_authtok_check\fR(5), \fBpam_authtok_get\fR(5), \fBpam_authtok_store\fR(5), \fBpam_dhkeys\fR(5), \fBpam_passwd_auth\fR(5), \fBpam_unix_account\fR(5),\fBpam_unix_auth\fR(5), 
.SH NOTES
.sp
.LP
The interfaces in \fBlibpam\fR(3LIB) are MT-Safe only if each thread within the multi-threaded application uses its own PAM handle.
