Alhadis/Silos/Solaris-11.3/man5/sane-pie.5
'\" te
.TH sane-pie 5 "7 Sept 2000" "sane-backends 1.0.19" "SANE Scanner Access Now Easy"
.IX sane-pie
.SH NAME
sane-pie \- SANE backend for PIE, Devcom and AdLib SCSI flatbed scanners

.SH DESCRIPTION
The
.B sane-pie
library implements a SANE (Scanner Access Now Easy) backend that
provides access to PIE, Devcom and AdLib SCSI flatbed scanners.
.br
At present, the following scanners should work with this backend:
.PP
.ft CR
.nf
Model:                  Status
----------------------  ------
Devcom 9636PRO          OK
Devcom 9636S            Untested
Devcom 9630S            Untested
ScanAce 1236S           Untested
ScanAce 1230S           Untested
ScanAce II              Untested
ScanAce III             OK
ScanAce Plus            Untested
ScanAce II Plus         Untested
ScanAce III Plus        Untested
ScanAce V               Untested
ScanAce ScanMedia       Untested
ScanAce ScanMedia II    Untested
ScanAce 630S            Untested
ScanAce 636S            Untested
JetScan 630             OK
JetScan 636PRO          Untested
.fi
.ft R
.PP

.SH FILES
.TP
.I /etc/sane.d/pie.conf
The backend configuration file
.TP
.I /usr/lib/sane/libsane-pie.a
The static library implementing this backend.
.TP
.I /usr/lib/sane/libsane-pie.so
The shared library implementing this backend (present on systems that
support dynamic loading).
.PP


.\" Oracle has added the ARC stability level to this manual page
.SH ATTRIBUTES
See
.BR attributes (5)
for descriptions of the following attributes:
.sp
.TS
box;
cbp-1 | cbp-1
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE 
=
Availability	image/scanner/xsane/sane-backends
=
Stability	Uncommitted
.TE 
.PP
.SH SEE ALSO
sane(7)

.SH "CONTACT AND BUG-REPORTS"
Please send any information and bug-reports to:
.br
.B Simon Munton <simon@munton.demon.co.uk>


.SH NOTES

.\" Oracle has added source availability information to this manual page
This software was built from source available at https://java.net/projects/solaris-userland.  The original community source was downloaded from  ftp://ftp2.sane-project.org/pub/sane/old-versions/sane-backends-1.0.19/sane-backends-1.0.19.tar.gz

Further information about this software can be found on the open source community website at http://www.sane-project.org/.
