Alhadis/Silos/Solaris 11.3/man1m/gettable.1m
'\" te
.\"  Copyright 1989 AT&T Copyright 
.\" Portions Copyright (c) 1997, 2014, Oracle and/or its affiliates. All rights reserved.
.TH gettable 1M "13 Feb 2014" "SunOS 5.11" "System Administration Commands"
.SH NAME
gettable \- get DoD Internet format host table from a host
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/gettable\fR \fIhost\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBgettable\fR is a simple program used to obtain the DoD Internet host table from a "hostname" server. The specified  \fIhost\fR is queried for the table. The table is placed in the file \fBhosts.txt\fR.
.sp
.LP
\fBgettable\fR operates by opening a \fBTCP\fR connection to the port indicated in the service specification for "hostname". A request is then made for all names and the resultant information is placed in the output file.
.sp
.LP
\fBgettable\fR is best used in conjunction with the \fBhtable\fR(1M) program which converts the DoD Internet host table format to that used by the network library lookup routines.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/network/nis
.TE

.SH SEE ALSO
.sp
.LP
\fBhtable\fR(1M), \fBattributes\fR(5) Harrenstien, Ken, Mary Stahl, and Elizabeth Feinler, \fI\fR \fBHOSTNAME\fR \fIServer\fR, \fBRFC\fR 953, Network Information Center, \fBSRI\fR International, Menlo Park, California, October 1985.
.SH NOTES
.sp
.LP
Should allow requests for only part of the database.
.sp
.LP
This command is obsolete and will be removed in a future release of Oracle Solaris.
