Alhadis/Silos/Solaris 11.3/man1m/in.stlisten.1m
'\" te
.\" Copyright (c) 2007, 2011, Oracle and/or its affiliates. All rights reserved.
.TH in.stlisten 1M "11 Dec 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
in.stlisten \- Service Tag Listener
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/inet/in.stlisten\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBin.stlisten\fR daemon allows a mechanism for discovering the location of the Service Tag. By default, the \fBin.stlisten\fR daemon listens for discovery probes (using a minimal built-in protocol) on \fBTCP\fR port 6481.
.sp
.LP
The daemon is under control of the service management facility, \fBsmf\fR(5), under its \fBinetd\fR framework. It only runs upon demand and exits when no longer in use.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/management/service-tag
_
Interface StabilityPrivate
.TE

.SH SEE ALSO
.sp
.LP
\fBin.stdiscover\fR(1M), \fBstclient\fR(1M), \fBsvccfg\fR(1M), \fBattributes\fR(5), \fBenviron\fR(5), \fBsmf\fR(5)
.SH NOTES
.sp
.LP
In open networks where the participants may not always be trusted, it is recommended that you deploy this daemon with the \fBpassphrase-encryption\fR option. In \fBsmf\fR(5) environments, the following command can be used to set the \fIpassphrase\fR:
.sp
.in +2
.nf
< prepare a text file "passfile" containing the passphrase >
# chown svctag:daemon passfile
# chmod 600 passfile
svccfg -s svc:/network/stlisten \e
        setprop servicetag/passphrase=passfile
.fi
.in -2
.sp

.sp
.LP
where \fIpassfile\fR is the path of a file containing the intended \fIpassphrase\fR.
.sp
.LP
This \fIpassphrase\fR can be subsequently cleared as follows:
.sp
.in +2
.nf
svccfg -s svc:/network/stlisten \e
        setprop servicetag/passphrase=""
.fi
.in -2
.sp

