Alhadis/Silos/Solaris 11.3/man1m/mount_pcfs.1m
'\" te
.\" Copyright (c) 2004, 2011, Oracle and/or its affiliates. All rights reserved.
.\" Based on mount_hsfs(1M), which is Copyright 1989 AT&T
.TH mount_pcfs 1M "17 Nov 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
mount_pcfs \- mount pcfs file systems
.SH SYNOPSIS
.LP
.nf
\fBmount\fR \fB-F\fR pcfs [\fIgeneric_options\fR] 
     [\fB-o\fR \fIFSType-specific_options\fR] \fIspecial\fR | \fImount_point\fR
.fi

.LP
.nf
\fBmount\fR \fB-F\fR pcfs [\fIgeneric_options\fR] 
     [\fB-o\fR \fIFSType-specific_options\fR] \fIspecial\fR \fImount_point\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBmount\fR attaches an \fBMS-DOS\fR file system (\fBpcfs\fR) to the file system hierarchy at the \fImount_point\fR, which is the pathname of a directory. If \fImount_point\fR has any contents prior to the \fBmount\fR operation, these are hidden until the file system is unmounted.
.sp
.LP
The \fBpcfs\fR file system supports direct mounting of files containing the file system as well as block devices. See \fBmount\fR(1M) and \fBlofiadm\fR(1M).
.sp
.LP
If \fBmount\fR is invoked with \fIspecial\fR or \fImount_point\fR as the only arguments, \fBmount\fR will search \fB/etc/vfstab\fR to fill in the missing arguments, including the \fIFSType-specific_options\fR; see \fBmount\fR(1M) for more details.
.sp
.LP
The \fIspecial\fR argument is a special device file type, which is:
.sp
.LP
A DOS logical drive on a hard disk expressed as \fIdevice-name\fR\fB:\fR\fIlogical-drive\fR , where \fIdevice-name\fR specifies the special block device-file for the whole disk and \fIlogical-drive\fR is either a drive letter (c through z) or a drive number (1 through 24). Examples are \fB/dev/dsk/c0t0d0p0:\fR\fIc\fR and \fB/dev/dsk/c0t0d0p0:\fR\fI1\fR.
.sp
.LP
The \fIspecial\fR device file type must have a formatted \fBMS-DOS\fR file system with either a 12-bit, 16-bit, or 32-bit File Allocation Table.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fIgeneric_options\fR\fR
.ad
.sp .6
.RS 4n
See \fBmount\fR(1M) for the list of supported options.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR\fR
.ad
.sp .6
.RS 4n
Specify \fBpcfs\fR file system-specific options. The following options are supported: 
.sp
.ne 2
.mk
.na
\fB\fBclamptime\fR | \fBnoclamptime\fR\fR
.ad
.sp .6
.RS 4n
File timestamps in \fBpcfs\fR cover a range between January 1st 1980 and December 31st 2127. This is not equal to the range of \fBtime_t\fR on Unix for either 32-bit or 64-bit applications. In particular, 32-bit applications fail with \fBEOVERFLOW\fR errors on the \fBstat\fR(2) system call when timestamps beyond the range of 32-bit \fBtime_t\fR are encountered. In order to prevent such spurious failures, \fBpcfs\fR by default clamps timestamps to the common subset of possible \fBpcfs\fR timestamps and the range available to 32-bit applications in Unix. The \fBclamptime\fR mount option therefore is active by default. If you want access to the full range of possible timestamps on \fBpcfs\fR, mount the file system with the \fBnoclamptime\fR mount option. Note that if \fBnoclamptime\fR is used, only 64-bit applications will have access to timestamps beyond January 19th 2038, 03:14:06 UTC; 32-bit applications will encounter \fBEOVERFLOW\fR errors.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfoldcase\fR | \fBnofoldcase\fR\fR
.ad
.sp .6
.RS 4n
Force uppercase characters in filenames to lowercase when reading them from the filesystem. This is for compatibility with the previous behavior of \fBpcfs\fR. The default is \fBnofoldcase\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBhidden\fR | \fBnohidden\fR\fR
.ad
.sp .6
.RS 4n
Allow or disallow listing of files with hidden or system bits set. Option \fBhidden\fR is the default. When \fBnohidden\fR is effect, hidden and system files are neither visible nor accessible. Note that PCFS in previous releases of the Solaris operating system used the \fBnohidden\fR option as the default.
.RE

.sp
.ne 2
.mk
.na
\fB\fBatime\fR | \fBnoatime\fR\fR
.ad
.sp .6
.RS 4n
Enable or disable write access timestamps on DOS-formatted media. Default for fixed disks is \fBatime\fR, while for removable media \fBnoatime\fR is used. The latter default is so that writes to flash-based media ("memory sticks") can be minimized, to prolong lifetime.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtimezone=\fItimezone\fR\fR\fR
.ad
.sp .6
.RS 4n
Timestamps on DOS-formatted media are recorded in the local time of the recording system. This can cause confusion when accessing removable media in which the recording and receiving system use different time zones. Use this option to force media timestamps to be interpreted for a specific time zone. The \fBmount_pcfs\fR command converts the given time zone name into a numerical offset that is passed to the \fBpcfs\fR kernel module, using the same rules as described in \fBenviron\fR(5) for the \fBTZ\fR environment variable. By default, the \fBtimezone\fR value is taken from the \fBTZ\fR environment variable.
.RE

.sp
.ne 2
.mk
.na
\fB\fBowner\fR={\fIusername\fR|\fIuser_id\fR}\fR
.ad
.sp .6
.RS 4n
Specifies the owner for the contents of the file system. The value can either be a character-string for a user name, or an integer value for the user ID. The default owner is the user ID of current process.
.RE

.sp
.ne 2
.mk
.na
\fB\fBgroup\fR={\fIgroupname\fR|\fIgroup_id\fR}\fR
.ad
.sp .6
.RS 4n
Specifies the group ID for the contents of the file systems. The value can either be a character-string for a group name, or an integer value for the group ID. The default group is the group ID of the mounting process.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmask\fR=\fIuser_mask\fR\fR
.ad
.sp .6
.RS 4n
Specifies the mask used for setting maximum access permissions on contents of the file system. The  \fIuser_mask\fR is an octal value, a bitmask, where each bit represents the permissions that should be disabled. The default \fIuser_mask\fR is the file mode creation mask of the mounting process.
.sp
See \fBIntro\fR(2) for more information on masks.
.RE

.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/mnttab\fR\fR
.ad
.sp .6
.RS 4n
table of mounted file systems
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/vfstab\fR\fR
.ad
.sp .6
.RS 4n
list of default parameters for each file system
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/file-system/pcfs
.TE

.SH SEE ALSO
.sp
.LP
\fBlofiadm\fR(1M), \fBmount\fR(1M), \fBmountall\fR(1M), \fBIntro\fR(2), \fBmount\fR(2), \fBstat\fR(2), \fBtime\fR(2), \fBmnttab\fR(4), \fBvfstab\fR(4), \fBattributes\fR(5), \fBenviron\fR(5), \fBpcfs\fR(7FS)
.SH NOTES
.sp
.LP
If the directory on which a file system is to be mounted is a symbolic link, the file system is mounted on the directory to which the symbolic link refers, rather than on top of the symbolic link itself.
