Alhadis/Silos/Solaris 11.3/man1m/mountd.1m
'\" te
.\"  Copyright 1989 AT&T
.\" Copyright (c) 1989, 2012, Oracle and/or its affiliates. All rights reserved.
.TH mountd 1M "26 Jun 2012" "SunOS 5.11" "System Administration Commands"
.SH NAME
mountd \- server for NFS mount requests and NFS access checks
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/nfs/mountd\fR [\fB-v\fR] [\fB-r\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBmountd\fR is an \fBRPC\fR server that answers requests for \fBNFS\fR access information and file system mount requests. It reads the file \fB/etc/dfs/sharetab\fR to determine which file systems are available for mounting by which remote machines. See \fBsharetab\fR(4). \fBnfsd\fR running on the local server will contact \fBmountd\fR the first time an \fBNFS\fR client tries to access the file system to determine whether the client should get read-write, read-only, or no access. This access can be dependent on the security mode used in the remoted procedure call from the client. See \fBshare_nfs\fR(1M).
.sp
.LP
The command also provides information as to what file systems are mounted by which clients. This information can be printed using the \fBshowmount\fR(1M) command.
.sp
.LP
The \fBmountd\fR daemon is automatically invoked by \fBshare\fR(1M).
.sp
.LP
Only super user can run the \fBmountd\fR daemon.
.SS "SMF Management"
.sp
.LP
Since \fBmountd\fR must be running for \fBnfsd\fR to function properly, \fBmountd\fR is automatically started by the \fBsvc:/network/nfs/server\fR service.
.sp
.LP
Startup SMF parameters for \fBmountd\fR can be manipulated using the \fBsharectl\fR(1M) command. The currently supported parameters are:
.sp
.ne 2
.mk
.na
\fB\fBserver_versmax\fR=\fInum\fR\fR
.ad
.br
.na
\fB\fBserver_versmin\fR=\fInum\fR\fR
.ad
.sp .6
.RS 4n
The NFS server only uses NFS versions in the range specified by these variables. Valid values or versions are: 2, 3, and 4. If one or both of these parameters are left unset, the default minimum version is 2, while the default maximum version is 4.
.RE

.sp
.ne 2
.mk
.na
\fB\fBshowmount_info\fR={\fBfull\fR | \fBnone\fR}\fR
.ad
.sp .6
.RS 4n
If the value of this property is \fBnone\fR, the following rules apply:
.RS +4
.TP
.ie t \(bu
.el o
A client can see only the shares that it is allowed to access.
.RE
.RS +4
.TP
.ie t \(bu
.el o
A client cannot see access lists for the shares defined at server.
.RE
.RS +4
.TP
.ie t \(bu
.el o
A client cannot see remote mounts from the server done by other clients.
.RE
If the value is \fBfull\fR, these rules do not apply. The default value is \fBfull\fR.
.sp
For example, to place the restrictions specified above for users of \fBshowmount\fR(1M), enter:
.sp
.in +2
.nf
# \fBsharectl set -p showmount_info=none nfs\fR
% \fBsharectl get -p showmount_info nfs\fR
showmount_info=none
.fi
.in -2
.sp

.RE

.SH OPTIONS
.sp
.LP
The options shown below are supported for NFSv2/v3 clients. They are not supported for Solaris NFSv4 clients.
.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.RS 6n
.rt  
Reject mount requests from clients. Clients that have file systems mounted will not be affected.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 6n
.rt  
Run the command in verbose mode. Each time \fBmountd\fR determines what access a client should get, it will log the result to the console, as well as how it got that result.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/dfs/sharetab\fR\fR
.ad
.RS 21n
.rt  
shared file system table
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/file-system/nfs
.TE

.SH SEE ALSO
.sp
.LP
\fBmount_nfs\fR(1M), \fBnfsd\fR(1M), \fBshare\fR(1M), \fBshare_nfs\fR(1M), \fBsharectl\fR(1M), \fBshowmount\fR(1M), \fBsharetab\fR(4), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
Some routines that compare hostnames use case-sensitive string comparisons; some do not. If an incoming request fails, verify that the case of the hostname in the file to be parsed matches the case of the hostname called for, and attempt the request again.
