Alhadis/Silos/Solaris 11.3/man1m/ntptrace.1m
'\" te
'\" te

.\"
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.\"
.TH "ntptrace" "1M" "" "" "System Administration Commands"
.SH NAME
ntptrace \- trace a chain of NTP hosts back to their master time source
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/ntptrace\fR [\fB-n\fR] [\fB-m\fR \fImaxhosts\fR] [\fIserver\fR]
.fi
.SH DESCRIPTION
.LP
\fBntptrace\fR determines from where a given Network Time Protocol (\fBNTP\fR) server gets its time, and follows the chain of  \fBNTP\fR servers back to their master time source. If given no arguments, it starts with  \fIlocalhost\fR.
.SH OPTIONS
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 14n
.rt  
Turns off the printing of host names; instead, host IP addresses are given.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fImaxhosts\fR\fR
.ad
.RS 14n
.rt  
Sets the maximum number of levels up the chain that will be followed.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRSample Output From the \fBntptrace\fR Command
.LP
The following example shows the output from the \fBntptrace\fR command:

.sp
.in +2
.nf
% \fBntptrace\fR


 localhost: stratum 4, offset 0.0019529, synch distance 0.144135
 server2.bozo.com: stratum 2, offset 0.0124263, synch distance 0.115784
 usndh.edu: stratum 1, offset 0.0019298, synch distance 0.011993, refid 'WWVB'
.fi
.in -2
.sp

.LP
On each line, the fields are (left to right):

.RS +4
.TP
.ie t \(bu
.el o
The server's host name
.RE
.RS +4
.TP
.ie t \(bu
.el o
The server's stratum
.RE
.RS +4
.TP
.ie t \(bu
.el o
The time offset between that server and the local host (as measured by \fBntptrace\fR; this is why it is not always zero for  \fIlocalhost\fR)
.RE
.RS +4
.TP
.ie t \(bu
.el o
The host's synchronization distance
.RE
.RS +4
.TP
.ie t \(bu
.el o
The reference clock \fBID\fR (only for stratum-1 servers)
.RE
.LP
All times are given in seconds. Synchronization distance is a measure of the goodness of the clock's time.

.\" Oracle has added the ARC stability level to this manual page
.SH ATTRIBUTES
See
.BR attributes (5)
for descriptions of the following attributes:
.sp
.TS
box;
cbp-1 | cbp-1
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE 
=
Availability	service/network/ntp
=
Stability	Volatile
.TE 
.PP
.SH SEE ALSO
.LP
\fBntpq\fR(1M), \fBntpd\fR(1M), \fBntpdc\fR(1M), \fBattributes\fR(5))



.SH NOTES

.\" Oracle has added source availability information to this manual page
This software was built from source available at https://java.net/projects/solaris-userland.  The original community source was downloaded from  http://archive.ntp.org/ntp4/ntp-4.2/ntp-4.2.8p2.tar.gz

Further information about this software can be found on the open source community website at http://www.ntp.org/.
