Alhadis/Silos/Solaris 11.3/man1m/perfquery.1m
'\" te
.TH PERFQUERY 1m "Jun 16, 2010" "OpenIB" "OpenIB Diagnostics"

.SH NAME
perfquery \- query InfiniBand port counters

.SH SYNOPSIS
.B perfquery
[\-d(ebug)] [\-G(uid)] [\-x|\-\-extended] [\-X|\-\-xmtsl] [\-S|\-\-rcvsl]
[\-D|\-\-xmtdisc] [\-E|\-\-rcverr] [\-c|\-\-smplctl]
[-a(ll_ports)] [-l(oop_ports)] [-r(eset_after_read)] [-R(eset_only)]
[\-C ca_name] [\-P ca_port] [\-t(imeout) timeout_ms] [\-V(ersion)] [\-h(elp)]
[<lid|guid> [[port] [reset_mask]]]

.SH DESCRIPTION
.PP
perfquery uses PerfMgt GMPs to obtain the PortCounters (basic performance
and error counters), PortExtendedCounters, PortXmitDataSL, PortRcvDataSL,
PortRcvErrorDetails, PortXmitDiscardDetails, or PortSamplesControl
from the PMA at the node/port specified. Optionally shows aggregated
counters for all ports of node.
Also, optionally, reset after read, or only reset counters.

Note: In PortCounters, PortCountersExtended, PortXmitDataSL, and PortRcvDataSL,
components that represent Data (e.g. PortXmitData and PortRcvData) indicate
octets divided by 4 rather than just octets.

Note: Inputting a port of 255 indicates an operation be performed on all ports.

.SH OPTIONS

.PP
.TP
\fB\-x\fR, \fB\-\-extended\fR
show extended port counters rather than (basic) port counters.
Note that extended port counters attribute is optional.
.TP
\fB\-X\fR, \fB\-\-xmtsl\fR
show transmit data SL counter. This is an optional counter for QoS.
.TP
\fB\-S\fR, \fB\-\-rcvsl\fR
show receive data SL counter. This is an optional counter for QoS.
.TP
\fB\-D\fR, \fB\-\-xmtdisc\fR
show transmit discard details. This is an optional counter.
.TP
\fB\-E\fR, \fB\-\-rcverr\fR
show receive error details. This is an optional counter.
.TP
\fB\-D\fR, \fB\-\-xmtdisc\fR
show transmit discard details. This is an optional counter.
.TP
\fB\-c\fR, \fB\-\-smplctl\fR
show port samples control.
.TP
\fB\-a\fR, \fB\-\-all_ports\fR
show aggregated counters for all ports of the destination lid
or reset all counters for all ports.  If the destination lid
does not support the AllPortSelect flag, all ports will be
iterated through to emulate AllPortSelect behavior.
.TP
\fB\-l\fR, \fB\-\-loop_ports\fR
If all ports are selected by the user (either through the
\fB\-a\fR option or port 255) iterate through each port
rather than doing than aggregate operation.
.TP
\fB\-r\fR, \fB\-\-reset_after_read\fR
reset counters after read
.TP
\fB\-R\fR, \fB\-\-Reset_only\fR
only reset counters

.SH COMMON OPTIONS

Most OpenIB diagnostics take the following common flags. The exact list of
supported flags per utility can be found in the usage message and can be shown
using the util_name -h syntax.

# Debugging flags
.PP
\-d      raise the IB debugging level.
        May be used several times (-ddd or -d -d -d).
.PP
\-e      show send and receive errors (timeouts and others)
.PP
\-h      show the usage message
.PP
\-v      increase the application verbosity level.
        May be used several times (-vv or -v -v -v)
.PP
\-V      show the version info.

# Addressing flags
.PP
\-G      use GUID address argument. In most cases, it is the Port GUID.
        Example:
        "0x08f1040023"
.PP
\-s <smlid>      use 'smlid' as the target lid for SM/SA queries.

# Other common flags:
.PP
\-C <ca_name>    use the specified ca_name.
.PP
\-P <ca_port>    use the specified ca_port.
.PP
\-t <timeout_ms> override the default timeout for the solicited mads.

Multiple CA/Multiple Port Support

When no IB device or port is specified, the port to use is selected
by the following criteria:
.PP
1. the first port that is ACTIVE.
.PP
2. if not found, the first port that is UP (physical link up).

If a port and/or CA name is specified, the user request is
attempted to be fulfilled, and will fail if it is not possible.

.SH EXAMPLES

.PP
perfquery               # read local port performance counters
.PP
perfquery 32 1          # read performance counters from lid 32, port 1
.PP
perfquery -x 32 1       # read extended performance counters from lid 32, port 1
.PP
perfquery -a 32         # read perf counters from lid 32, all ports
.PP
perfquery -r 32 1       # read performance counters and reset
.PP
perfquery -x -r 32 1    # read extended performance counters and reset
.PP
perfquery -R 0x20 1     # reset performance counters of port 1 only
.PP
perfquery -x -R 0x20 1  # reset extended performance counters of port 1 only
.PP
perfquery -R -a 32      # reset performance counters of all ports
.PP
perfquery -R 32 2 0x0fff # reset only error counters of port 2
.PP
perfquery -R 32 2 0xf000 # reset only non-error counters of port 2

.SH AUTHOR
.TP
Hal Rosenstock
.RI < hal.rosenstock@gmail.com >


.\" Oracle has added the ARC stability level to this manual page
.SH ATTRIBUTES
See
.BR attributes (5)
for descriptions of the following attributes:
.sp
.TS
box;
cbp-1 | cbp-1
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE 
=
Availability	network/open-fabrics
=
Stability	Volatile
.TE 
.PP

.SH NOTES

.\" Oracle has added source availability information to this manual page
This software was built from source available at https://java.net/projects/solaris-userland.  The original community source was downloaded from  ['http://www.openfabrics.org/downloads/ibutils/ibutils-1.5.7.tar.gz', 'http://www.openfabrics.org/downloads/libibverbs/libibverbs-1.1.4-1.22.g7257cd3.tar.gz', 'http://www.openfabrics.org/downloads/libmlx4/libmlx4-1.0.1-1.18.gb810a27.tar.gz', 'http://www.openfabrics.org/downloads/libsdp/libsdp-1.1.108-0.15.gd7fdb72.tar.gz', 'http://www.openfabrics.org/downloads/management/infiniband-diags-1.5.8.tar.gz', 'http://www.openfabrics.org/downloads/management/libibmad-1.3.7.tar.gz', 'http://www.openfabrics.org/downloads/management/libibumad-1.3.7.tar.gz', 'http://www.openfabrics.org/downloads/management/opensm-3.3.9.tar.gz', 'http://www.openfabrics.org/downloads/perftest/perftest-1.3.0-0.42.gf350d3d.tar.gz', 'http://www.openfabrics.org/downloads/qperf/qperf-0.4.6-0.1.gb81434e.tar.gz', 'http://www.openfabrics.org/downloads/rdmacm/librdmacm-1.0.14.1.tar.gz', 'http://www.openfabrics.org/downloads/rds-tools/rds-tools-2.0.4.tar.gz']

Further information about this software can be found on the open source community website at http://www.openfabrics.org/.
