Alhadis/Silos/Solaris 11.3/man1m/smbstat.1m
'\" te
.\" Copyright (c) 2008, 2015, Oracle and/or its affiliates. All rights             reserved.
.TH smbstat 1M "26 Apr 2011" "SunOS 5.11" "System Administration Commands"
.SH NAME
smbstat \- show Solaris SMB file server statistics
.SH SYNOPSIS
.LP
.nf
\fBsmbstat\fR [\fB-r\fR [\fB-n\fR [\fB-a\fR | \fB-z\fR] \fB-v\fR ]] [\fB-t\fR] [\fB-u\fR] [\fB-c\fR] [\fIinterval\fR [\fIcount\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBsmbstat\fR command shows statistical information for the \fBsmbd\fR(1M) server. \fBsmbstat\fR has a number of options, described below, and a single operand, \fIinterval\fR. If \fIinterval\fR is specified, the first display captures statistics since the server started, up to the moment the command was entered. Subsequent displays capture statistics for the last \fIinterval\fR.
.sp
.LP
By default, the \fBsmbstat\fR command shows all statistics.
.SH OPTIONS
.sp
.LP
The \fBsmbstat\fR command includes the following options:
.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.sp .6
.RS 4n
Display counters.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
Display the statistics of the requests. You can combine \fB-r\fR with the following options.
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
Display statistics for all the types of server requests, whether valid or not. Note that there are 256 types of server requests. The \fB-a\fR and \fB-z\fR options are mutually exclusive.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
Display in alphabetic order.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR\fR
.ad
.sp .6
.RS 4n
Display statistics for requests actually received. The \fB-a\fR and \fB-z\fR options are mutually exclusive.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR version\fR
.ad
.sp .6
.RS 4n
Specify the SMB version for which to print statistics. The version argument, 1 or 2, requests statistics for only that version. Without \fB-v\fR option, \fBsmbstat\fR prints statistics for all versions.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.sp .6
.RS 4n
Display the throughput of the SMB server.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.sp .6
.RS 4n
Display the utilization of the SMB server.
.RE

.SH EXTENDED DESCRIPTION
.sp
.LP
The \fBsmbstat\fR command displays the headings shown below. The headings displayed for a given command vary according to which option(s) are specified. There are four categories of headings, corresponding to categories of statistics: counters, throughput, utilization, and (server) requests.
.SS "Counters"
.sp
.ne 2
.mk
.na
\fB\fBnbt\fR\fR
.ad
.sp .6
.RS 4n
Number of SMB NetBIOS-over-TCP (NBT) sessions.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtcp\fR\fR
.ad
.sp .6
.RS 4n
Number of SMB TCP sessions.
.RE

.sp
.ne 2
.mk
.na
\fB\fBusers\fR\fR
.ad
.sp .6
.RS 4n
Number of users logged in.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtrees\fR\fR
.ad
.sp .6
.RS 4n
Number of trees connected.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfiles\fR\fR
.ad
.sp .6
.RS 4n
Number of open files.
.RE

.sp
.ne 2
.mk
.na
\fB\fBpipes\fR\fR
.ad
.sp .6
.RS 4n
Number of open pipes.
.RE

.SS "Throughput"
.sp
.ne 2
.mk
.na
\fB\fBrbytes/s\fR\fR
.ad
.sp .6
.RS 4n
Number of bytes received per second.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtbytes/s\fR\fR
.ad
.sp .6
.RS 4n
Number of bytes transmitted per second.
.RE

.sp
.ne 2
.mk
.na
\fB\fBreqs/s\fR\fR
.ad
.sp .6
.RS 4n
Number of requests handled per second.
.RE

.sp
.ne 2
.mk
.na
\fB\fBreads/s\fR\fR
.ad
.sp .6
.RS 4n
Number of read requests per second. This would be an aggregation of the following requests: \fBSMB_COM_READ\fR, \fBSMB_COM_LOCK_AND_READ\fR, \fBSMB_COM_READ_RAW\fR, and \fBSMB_COM_READ_ANDX\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBwrites/s\fR\fR
.ad
.sp .6
.RS 4n
Number of write requests per second. This would ba an aggregation of the following requests: \fBSMB_COM_WRITE\fR, \fBSMB_COM_WRITE_AND_UNLOCK\fR, \fBSMB_COM_WRITE_RAW\fR, and \fBSMB_COM_WRITE_AND_CLOSE\fR.
.RE

.SS "Utilization"
.sp
.ne 2
.mk
.na
\fB\fBwcnt\fR\fR
.ad
.sp .6
.RS 4n
Average number of requests received but waiting for an SMB worker thread to execute them.
.RE

.sp
.ne 2
.mk
.na
\fB\fBrcnt\fR\fR
.ad
.sp .6
.RS 4n
Average number of requests being simultaneously executed by an SMB worker thread.
.RE

.sp
.ne 2
.mk
.na
\fB\fBwtime\fR\fR
.ad
.sp .6
.RS 4n
Average time a request waits before an SMB worker thread starts executing it.
.RE

.sp
.ne 2
.mk
.na
\fB\fBrtime\fR\fR
.ad
.sp .6
.RS 4n
Average execution time of a request.
.RE

.sp
.ne 2
.mk
.na
\fB\fBw%\fR\fR
.ad
.sp .6
.RS 4n
Percentage of the time during which at least one request was waiting.
.RE

.sp
.ne 2
.mk
.na
\fB\fBr%\fR\fR
.ad
.sp .6
.RS 4n
Percentage of the time during which at least one request was being executed.
.RE

.sp
.ne 2
.mk
.na
\fB\fBu%\fR\fR
.ad
.sp .6
.RS 4n
Percentage of utilization of the SMB server. This number is defined as: \fBrcnt\fR / (\fImax_worker_threads\fR).
.RE

.sp
.ne 2
.mk
.na
\fB\fBsat\fR\fR
.ad
.sp .6
.RS 4n
Flag indicating if the server has been saturated in the past. Saturation is defined as: \fBu%\fR == 100%.
.RE

.sp
.ne 2
.mk
.na
\fB\fBusr%\fR\fR
.ad
.sp .6
.RS 4n
Percentage of the time the processor(s) spent in user space.
.RE

.sp
.ne 2
.mk
.na
\fB\fBsys%\fR\fR
.ad
.sp .6
.RS 4n
Percentage of the time the processor(s) spent in kernel space.
.RE

.sp
.ne 2
.mk
.na
\fB\fBidle%\fR\fR
.ad
.sp .6
.RS 4n
Percentage of the time the processor(s) was(were) idle.
.RE

.SS "Requests"
.sp
.LP
The following headings are displayed for each type of request.
.sp
.ne 2
.mk
.na
\fB\fBcode\fR\fR
.ad
.sp .6
.RS 4n
Code of the request, in hexadecimal.
.RE

.sp
.ne 2
.mk
.na
\fB\fB%\fR\fR
.ad
.sp .6
.RS 4n
Percentage of a given type of request.
.RE

.sp
.ne 2
.mk
.na
\fB\fBcount\fR\fR
.ad
.sp .6
.RS 4n
Number of requests received.
.RE

.sp
.ne 2
.mk
.na
\fB\fBrbytes/s\fR\fR
.ad
.sp .6
.RS 4n
Number of bytes received per second.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtbytes/s\fR\fR
.ad
.sp .6
.RS 4n
Number of bytes received per second.
.RE

.sp
.ne 2
.mk
.na
\fB\fBreq/s\fR\fR
.ad
.sp .6
.RS 4n
Number of requests handled per second.
.RE

.sp
.ne 2
.mk
.na
\fB\fBrt-mean\fR\fR
.ad
.sp .6
.RS 4n
Average response time in seconds.
.RE

.sp
.ne 2
.mk
.na
\fB\fBrt-stddev\fR\fR
.ad
.sp .6
.RS 4n
Standard deviation of the response time.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported.
.sp
.ne 2
.mk
.na
\fB\fBcount\fR\fR
.ad
.RS 12n
.rt  
Number of times statistics are printed.
.RE

.sp
.ne 2
.mk
.na
\fB\fBinterval\fR\fR
.ad
.RS 12n
.rt  
Report once each interval seconds.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRCombining Options
.sp
.LP
The following command combines the \fB-c\fR, \fB-t\fR, and \fB-u\fR options.

.sp
.in +2
.nf
% \fBsmbstat -ctu\fR
nbt   tcp users trees files pipes
0     1     1     2    20     0

rbytes/s   tbytes/s    reqs/s     reads/s   writes/s
1.036e+02  1.298e+00  0.000e+00  0.000e+00  0.000e+00

wcnt       rcnt       wtime      rtime       w%   r%  u% sat usr% sys% idle%
4.317e-01  7.410e+00  2.461e-05  4.224e-04   31  100  0  no  0    76   24
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.RS 13n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB>0\fR
.ad
.RS 13n
.rt  
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See the \fBattributes\fR(5) man page for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/file-system/smb
_
Interface StabilityUncommitted
_
Utility Output FormatNot-an-Interface
.TE

.SH SEE ALSO
.sp
.LP
\fBsharectl\fR(1M), \fBsmbadm\fR(1M), \fBsmbd\fR(1M), \fBattributes\fR(5)
