Alhadis/Silos/Solaris 11.3/man1m/uadmin.1m
'\" te
.\" Portions Copyright (c) 2009, 2015, Oracle and/or its affiliates. All    rights reserved.
.\" Copyright 1989 AT&T
.TH uadmin 1M "06 Apr 2015" "SunOS 5.11" "System Administration Commands"
.SH NAME
uadmin \- administrative control
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/uadmin\fR \fIcmd\fR \fIfcn\fR [\fImdep\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBuadmin\fR command provides control for basic administrative functions. This command is tightly coupled to the system administration procedures and is not intended for general use. It may be invoked only by the super-user.
.sp
.LP
Both the \fIcmd\fR (command) and \fIfcn\fR (function) arguments are converted to integers and passed to the \fBuadmin\fR system call. The optional \fImdep\fR (machine dependent) argument is only available for the \fIcmd\fR values of \fB1\fR (\fBA_REBOOT\fR), \fB2\fR (\fBA_SHUTDOWN\fR), or \fB5\fR (\fBA_DUMP\fR). For any other \fIcmd\fR value, no \fImdep\fR command-line argument is allowed.
.sp
.LP
When passing an \fImdep\fR value that contains whitespaces, the string must be grouped together as a single argument enclosed within quotes, for example:
.sp
.in +2
.nf
uadmin 1 1 "\fB-s\fR kernel/unix"
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
.TE

.SH SEE ALSO
.sp
.LP
\fBhalt\fR(1M), \fBreboot\fR(1M), \fBuadmin\fR(2), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
If the SMF property \fBsvc:/system/boot-config:defaultconfig/uadmin_boot_archive_sync\fR is set to \fBTRUE\fR, then \fBuadmin\fR will update the boot archive.
