Alhadis/Silos/Solaris 11.3/man1m/vtdaemon.1m
'\" te
.\" Copyright (c) 2012, Oracle and/or its affiliates. All rights reserved
.TH vtdaemon 1M "23 Apr 2012" "SunOS 5.11" "System Administration Commands"
.SH NAME
vtdaemon \- switch function between text virtual consoles
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/vtdaemon\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBvtdaemon\fR provides a secure switch function, by means of hotkeys, between different text virtual consoles. It runs with full privileges. See \fBvt\fR(7I) for specifications of hotkey sequences.
.sp
.LP
The service is managed using the action authorization \fBsolaris.smf.manage.vt\fR which is included in the Device Security Rights Profile. The service is local only and has no inbound network ports. It is disabled in non-global zones or when the virtual console functionality is not available.
.sp
.LP
\fBvtdaemon\fR uses PAM for authentication.
.sp
.LP
Note that \fBvtdaemon\fR only locks and unlocks the text console. For graphical X sessions, it invokes the corresponding lock program (for example, \fBxscreensaver\fR), which deals with authentication and audit.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
Interface StabilityPrivate
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBsvcadm\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5), \fBvt\fR(7I)
.SH NOTES
.sp
.LP
The \fBvtdaemon\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/system/vtdaemon:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command.
.sp
.LP
The \fBvtdaemon\fR service has the following SMF configuration properties:
.sp
.ne 2
.mk
.na
\fB\fBhotkeys\fR (boolean)\fR
.ad
.sp .6
.RS 4n
Allows authorized users to dynamically enable or disable the VT switch by means of hotkeys. Its default value is \fBTRUE\fR (enabled).
.RE

.sp
.ne 2
.mk
.na
\fB\fBsecure\fR (boolean)\fR
.ad
.sp .6
.RS 4n
Allows authorized users to dynamically enable or disable the security of hotkeys. If disabled, the user can freely switch to any session without authentication. Its default value is TRUE (enabled).
.RE

