Alhadis/Silos/Solaris 11.3/man2/getisax.2
'\" te
.\" Copyright (c) 2007, 2014, Sun Microsystems, Inc. All rights reserved.
.TH getisax 2 "23 April 2014" "SunOS 5.11" "System Calls"
.SH NAME
getisax \- extract valid instruction set extensions
.SH SYNOPSIS
.LP
.nf
#include <sys/auxv.h>

\fBuint_t\fR \fBgetisax\fR(\fBuint32_t *\fR\fIarray\fR, \fBuint_t\fR \fIn\fR);
.fi

.SH DESCRIPTION
.sp
.LP
The \fBgetisax()\fR function sets the vector \fIarray\fR of \fIn\fR 32-bit integers to contain the bits from the \fBAV\fR_\fIxxx\fR_\fIyyy\fR namespace of the given instruction set architecture.
.sp
.LP
Values for \fBAV\fR_\fIxxx\fR_\fIyyy\fR for SPARC and SPARCV9, and their associated descriptions, can be found in \fB<sys/auxv_SPARC.h>\fR.
.sp
.LP
Values for \fBAV\fR_\fIxxx\fR_\fIyyy\fR for i386 and AMD64, and their associated descriptions, can be found in \fB<sys/auxv_386.h>\fR.
.SH RETURN VALUES
.sp
.LP
The \fBgetisax()\fR function returns the number of array elements that contain non-zero values.
.SH EXAMPLES
.LP
\fBExample 1 \fRUse \fBgetisax()\fR to determine if the SSE2 instruction set is present.
.sp
.LP
In the following example, if the message is written, the SSE2 instruction set is present and fully supported by the operating system.

.sp
.in +2
.nf
uint_t ui;
 
(void) getisax(&ui, 1);
 
if (ui & AV_386_SSE2)
        printf("SSE2 instruction set extension is present.\en");
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
_
MT-LevelSafe
.TE

.SH SEE ALSO
.sp
.LP
\fBisainfo\fR(1), \fBld\fR(1), \fBpargs\fR(1), \fBattributes\fR(5)
.sp
.LP
\fIOracle Solaris 11.3 Linkers and Libraries         Guide\fR
