Alhadis/Silos/Solaris-11.3/man1/ps.1
'\" te
.\" Copyright 1989 AT&T
.\" Portions Copyright (c) 2009, 2014, Oracle and/or its affiliates. All rights reserved.
.\" Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation. In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html.  This notice shall appear on any product containing this material.
.TH ps 1 "29 Jan 2014" "SunOS 5.11" "User Commands"
.SH NAME
ps \- report process status
.SH SYNOPSIS
.LP
.nf
\fBps\fR [\fB-aAcdefjHlLPyZ\fR] [\fB-g\fR \fIgrplist\fR] [\fB-h\fR \fIlgrplist\fR] 
     [\fB-n\fR \fInamelist\fR] [\fB-o\fR \fIformat\fR]... [\fB-p\fR \fIproclist\fR] 
     [\fB-s\fR \fIsidlist\fR] [\fB-t\fR \fIterm\fR] [\fB-u\fR \fIuidlist\fR] [\fB-U\fR \fIuidlist\fR] 
     [\fB-G\fR \fIgidlist\fR] [\fB-z\fR \fIzonelist\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBps\fR command prints information about active processes. Without options, \fBps\fR prints information about processes that have the same effective user \fBID\fR and the same controlling terminal as the invoker. The output contains only the process \fBID\fR, terminal identifier, cumulative execution time, and the command name. Otherwise, the information that is displayed is controlled by the options.
.sp
.LP
Some options accept lists as arguments. Items in a list can be either separated by commas or else enclosed in quotes and separated by commas or spaces. Values for \fIproclist\fR and \fIgrplist\fR must be numeric.
.sp
.LP
The \fBps\fR command tries to determine whether it is called natively or using  	the command syntax expected by \fBps\fR(1B).  In the latter case, the 	\fBps\fR command behaves exactly as described in \fBps\fR(1B). 
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
Lists information about \fBa\fRll processes most frequently requested: all those except session leaders and processes not associated with a terminal.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-A\fR\fR
.ad
.sp .6
.RS 4n
Lists information for all processes. Identical to \fB-e\fR, below.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.sp .6
.RS 4n
Prints information in a format that reflects scheduler properties as described in \fBpriocntl\fR(1). The \fB-c\fR option affects the output of the \fB-f\fR and \fB-l\fR options, as described below.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
Lists information about all processes except session leaders.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.sp .6
.RS 4n
Lists information about \fBe\fRvery process now running.
.sp
When the \fB-e\fRoption is specified, options \fB-z\fR, \fB-t\fR, \fB-u\fR, \fB-U\fR, \fB-g\fR, \fB-G\fR, \fB-p\fR, \fB-g\fR, \fB-s\fR and \fB-a\fR options have no effect.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
Generates a \fBf\fRull listing. (See below for significance of columns in a full listing.)
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR \fIgrplist\fR\fR
.ad
.sp .6
.RS 4n
Lists only process data whose group leader's \fBID\fR number(s) appears in \fIgrplist\fR. (A group leader is a process whose process \fBID\fR number is identical to its process group \fBID\fR number.)
.RE

.sp
.ne 2
.mk
.na
\fB\fB-G\fR \fIgidlist\fR\fR
.ad
.sp .6
.RS 4n
Lists information for processes whose real group ID numbers are given in \fIgidlist\fR. The \fIgidlist\fR must be a single argument in the form of a blank- or comma-separated list.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR \fIlgrplist\fR\fR
.ad
.sp .6
.RS 4n
Lists only the processes homed to the specified \fIlgrplist\fR. Nothing is listed for any invalid group specified in \fIlgrplist\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR\fR
.ad
.sp .6
.RS 4n
Prints the home lgroup of the process under an additional column header, LGRP.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-j\fR\fR
.ad
.sp .6
.RS 4n
Prints session \fBID\fR and process group \fBID\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
Generates a \fBl\fRong listing. (See below.)
.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fR
.ad
.sp .6
.RS 4n
Prints information about each light weight process (\fIlwp\fR) in each selected process. (See below.)
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR \fInamelist\fR\fR
.ad
.sp .6
.RS 4n
Specifies the name of an alternative system \fInamelist\fR file in place of the default. This option is accepted for compatibility, but is ignored.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIformat\fR\fR
.ad
.sp .6
.RS 4n
Prints information according to the format specification given in \fIformat\fR. This is fully described in \fBDISPLAY FORMATS\fR. Multiple \fB-o\fR options can be specified; the format specification is interpreted as the space-character-separated concatenation of all the \fIformat\fR option-arguments.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIproclist\fR\fR
.ad
.sp .6
.RS 4n
Lists only process data whose process \fBID\fR numbers are given in \fIproclist\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR\fR
.ad
.sp .6
.RS 4n
Prints the number of the processor to which the process or lwp is bound, if any, under an additional column header, \fBPSR\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIsidlist\fR\fR
.ad
.sp .6
.RS 4n
Lists information on all session leaders whose \fBID\fRs appear in \fIsidlist\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fIterm\fR\fR
.ad
.sp .6
.RS 4n
Lists only process data associated with \fIterm\fR. Terminal identifiers are specified as a device file name, and an identifier. For example, \fBterm/a\fR, or \fBpts/0\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR \fIuidlist\fR\fR
.ad
.sp .6
.RS 4n
Lists only process data whose effective user \fBID\fR number or login name is given in \fIuidlist\fR. In the listing, the numerical user \fBID\fR is printed unless you give the \fB-f\fR option, which prints the login name.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-U\fR \fIuidlist\fR\fR
.ad
.sp .6
.RS 4n
Lists information for processes whose real user \fBID\fR numbers or login names are given in \fIuidlist\fR. The \fIuidlist\fR must be a single argument in the form of a blank- or comma-separated list.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-y\fR\fR
.ad
.sp .6
.RS 4n
Under a long listing (\fB-l\fR), omits the obsolete \fBF\fR and \fBADDR\fR columns and includes an \fBRSS\fR column to report the resident set size of the process. Under the \fB-y\fR option, both \fBRSS\fR and \fBSZ\fR (see below) is reported in units of kilobytes instead of pages.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzonelist\fR\fR
.ad
.sp .6
.RS 4n
Lists only processes in the specified zones. Zones can be specified either by name or ID. This option is only useful when executed in the global zone.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR\fR
.ad
.sp .6
.RS 4n
Prints the name of the zone with which the process is associated under an additional column header, \fBZONE\fR. The \fBZONE\fR column width is limited to 8 characters. Use \fBps\fR \fB-eZ\fR for a quick way to see information about every process now running along with the associated zone name. Use 
.sp
.in +2
.nf
ps -eo zone,uid,pid,ppid,time,comm,...
.fi
.in -2
.sp

to see zone names wider than 8 characters.
.RE

.sp
.LP
The following options are used by the \fB/usr/ucb/ps\fR command (see \fBps\fR(1B)). They are supported in \fB/usr/bin/ps\fR, allowing the latter to emulate UCB behavior. The UCB options do not use a hyphen. You cannot mix these options with the options described above.
.sp
.ne 2
.mk
.na
\fB\fBr\fR\fR
.ad
.sp .6
.RS 4n
Restricts output to running and runnable processes.
.RE

.sp
.ne 2
.mk
.na
\fB\fBS\fR\fR
.ad
.sp .6
.RS 4n
Displays accumulated \fBCPU\fR time used by this process and all of its reaped  children.
.RE

.sp
.ne 2
.mk
.na
\fB\fBv\fR\fR
.ad
.sp .6
.RS 4n
Displays a version of the output containing virtual memory. This includes fields \fBSIZE\fR, \fB%CPU\fR, \fB%MEM\fR, and \fBRSS\fR, described below.
.RE

.sp
.ne 2
.mk
.na
\fB\fBw\fR\fR
.ad
.sp .6
.RS 4n
Uses a wide output format, that is, 132 columns rather than 80. If the option letter is repeated, that is, \fB-ww\fR, this option uses arbitrarily wide output. This information is used to decide how much of long commands to print. \fBNote:\fR The wide output option can be viewed only by a superuser or the user who owns the process.
.RE

.sp
.ne 2
.mk
.na
\fB\fBx\fR\fR
.ad
.sp .6
.RS 4n
Includes processes with no controlling terminal.
.RE

.sp
.ne 2
.mk
.na
\fB\fInum\fR\fR
.ad
.sp .6
.RS 4n
A process number may be given, in which case the output is restricted to that process. This option must be supplied last.
.RE

.sp
.LP
Many of the options shown are used to select processes to list. If any are specified, the default list is ignored and \fBps\fR selects the processes represented by the inclusive OR of all the selection-criteria options.
.SH DISPLAY FORMATS
.sp
.LP
Under the \fB-f\fR option, \fBps\fR tries to determine the command name and arguments given when the process was created by examining the user block. Failing this, the command name is printed, as it would have appeared without the \fB-f\fR option, in square brackets.
.sp
.LP
The column headings and the meaning of the columns in a \fBps\fR listing are given below; the letters \fBf\fR and \fBl\fR indicate the option (f\fBull\fR or \fBl\fRong, respectively) that causes the corresponding heading to appear; \fBall\fR means that the heading always appears. \fBNote:\fR These two options determine only what information is provided for a process; they do not determine which processes are listed.
.sp
.ne 2
.mk
.na
\fB\fBF\fR(l)\fR
.ad
.sp .6
.RS 4n
Flags (hexadecimal and additive) associated with the process. These flags are available for historical purposes; no meaning should be currently ascribed to them.
.RE

.sp
.ne 2
.mk
.na
\fB\fBS\fR (l)\fR
.ad
.sp .6
.RS 4n
The state of the process:
.sp
.ne 2
.mk
.na
\fBO\fR
.ad
.sp .6
.RS 4n
Process is running on a processor.
.RE

.sp
.ne 2
.mk
.na
\fBS\fR
.ad
.sp .6
.RS 4n
Sleeping: process is waiting for an event to complete.
.RE

.sp
.ne 2
.mk
.na
\fBR\fR
.ad
.sp .6
.RS 4n
Runnable: process is on run queue.
.RE

.sp
.ne 2
.mk
.na
\fBT\fR
.ad
.sp .6
.RS 4n
Process is stopped, either by a job control signal or because it is being traced.
.RE

.sp
.ne 2
.mk
.na
\fBW\fR
.ad
.sp .6
.RS 4n
Waiting: process is waiting for CPU usage to drop to the CPU-caps enforced limits.
.RE

.sp
.ne 2
.mk
.na
\fBZ\fR
.ad
.sp .6
.RS 4n
Zombie state: process terminated and parent not waiting.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBUID\fR (f,l)\fR
.ad
.sp .6
.RS 4n
The effective user \fBID\fR number of the process (the login name is printed under the \fB-f\fR option).
.RE

.sp
.ne 2
.mk
.na
\fB\fBPID\fR(all)\fR
.ad
.sp .6
.RS 4n
The process \fBID\fR of the process (this datum is necessary in order to kill a process).
.RE

.sp
.ne 2
.mk
.na
\fB\fBPPID\fR(f,l)\fR
.ad
.sp .6
.RS 4n
The process \fBID\fR of the parent process.
.RE

.sp
.ne 2
.mk
.na
\fB\fBC\fR(f,l)\fR
.ad
.sp .6
.RS 4n
Processor utilization for scheduling (obsolete). Not printed when the \fB-c\fR option is used.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCLS\fR(f,l)\fR
.ad
.sp .6
.RS 4n
Scheduling class. Printed only when the \fB-c\fR option is used.
.RE

.sp
.ne 2
.mk
.na
\fB\fBPRI\fR(l)\fR
.ad
.sp .6
.RS 4n
The priority of the process. Without the \fB-c\fR option, higher numbers mean lower priority. With the \fB-c\fR option, higher numbers mean higher priority.
.RE

.sp
.ne 2
.mk
.na
\fB\fBNI\fR(l)\fR
.ad
.sp .6
.RS 4n
Nice value, used in priority computation. Not printed when the \fB-c\fR option is used. Only processes in the certain scheduling classes have a nice value.
.RE

.sp
.ne 2
.mk
.na
\fB\fBADDR\fR(l)\fR
.ad
.sp .6
.RS 4n
The memory address of the process, \fB0\fR unless running with all privilege.
.RE

.sp
.ne 2
.mk
.na
\fB\fBSZ\fR(l)\fR
.ad
.sp .6
.RS 4n
The total size of the process in virtual memory, including all mapped files and devices, in pages. See \fBpagesize\fR(1).
.RE

.sp
.ne 2
.mk
.na
\fB\fBWCHAN\fR(l)\fR
.ad
.sp .6
.RS 4n
The address of an event for which the process is sleeping. Only visible when running with all privilege, otherwise it is \fB0\fR. To determine if a process is sleeping, check the \fBS\fR column.
.RE

.sp
.ne 2
.mk
.na
\fB\fBSTIME\fR(f)\fR
.ad
.sp .6
.RS 4n
The starting time of the process, given in hours, minutes, and seconds. (A process begun more than twenty-four hours before the \fBps\fR inquiry is executed is given in months and days.)
.RE

.sp
.ne 2
.mk
.na
\fB\fBTTY\fR(all)\fR
.ad
.sp .6
.RS 4n
The controlling terminal for the process (the message, \fB?\fR, is printed when there is no controlling terminal).
.RE

.sp
.ne 2
.mk
.na
\fB\fBTIME\fR(all)\fR
.ad
.sp .6
.RS 4n
The cumulative execution time for the process.
.RE

.sp
.ne 2
.mk
.na
\fB\fBLTIME\fR(all)\fR
.ad
.sp .6
.RS 4n
The execution time for the lwp being reported.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCMD\fR(all)\fR
.ad
.sp .6
.RS 4n
The command name (the full command name and its arguments, up to a limit of 80 characters, are printed under the \fB-f\fR option).
.RE

.sp
.LP
The following two additional columns are printed when the \fB-j\fR option is specified:
.sp
.ne 2
.mk
.na
\fB\fBPGID\fR\fR
.ad
.sp .6
.RS 4n
The process ID of the process group leader.
.RE

.sp
.ne 2
.mk
.na
\fB\fBSID\fR\fR
.ad
.sp .6
.RS 4n
The process ID of the session leader.
.RE

.sp
.LP
The following two additional columns are printed when the \fB-L\fR option is specified:
.sp
.ne 2
.mk
.na
\fB\fBLWP\fR\fR
.ad
.sp .6
.RS 4n
The lwp ID of the lwp being reported.
.RE

.sp
.ne 2
.mk
.na
\fB\fBNLWP\fR\fR
.ad
.sp .6
.RS 4n
The number of lwps in the process (if \fB-f\fR is also specified).
.RE

.sp
.LP
Under the \fB-L\fR option, one line is printed for each lwp in the process and the time-reporting fields \fBSTIME\fR and \fBLTIME\fR show the values for the lwp, not the process. A traditional single-threaded process contains only one lwp.
.sp
.LP
A process that has exited and has a parent, but has not yet been waited for by the parent, is marked \fB<defunct>\fR\&.
.SS "\fB-o\fR format"
.sp
.LP
The \fB-o\fR option allows the output format to be specified under user control.
.sp
.LP
The format specification must be a list of names presented as a single argument, blank- or comma-separated. Each variable has a default header. The default header can be overridden by appending an equals sign and the new text of the header. The rest of the characters in the argument is used as the header text. The fields specified are written in the order specified on the command line, and should be arranged in columns in the output. The field widths are selected by the system to be at least as wide as the header text (default or overridden value). If the header text is null, such as \fB-o\fR \fIuser=,\fR the field width is at least as wide as the default header text. If all header text fields are null, no header line is written.
.sp
.LP
The following names are recognized in the POSIX locale:
.sp
.ne 2
.mk
.na
\fB\fBuser\fR\fR
.ad
.sp .6
.RS 4n
The effective user \fBID\fR of the process. This is the textual user \fBID\fR, if it can be obtained and the field width permits, or a decimal representation otherwise.
.RE

.sp
.ne 2
.mk
.na
\fB\fBruser\fR\fR
.ad
.sp .6
.RS 4n
The real user \fBID\fR of the process. This is the textual user \fBID\fR, if it can be obtained and the field width permits, or a decimal representation otherwise.
.RE

.sp
.ne 2
.mk
.na
\fB\fBgroup\fR\fR
.ad
.sp .6
.RS 4n
The effective group \fBID\fR of the process. This is the textual group \fBID,\fR if it can be obtained and the field width permits, or a decimal representation otherwise.
.RE

.sp
.ne 2
.mk
.na
\fB\fBrgroup\fR\fR
.ad
.sp .6
.RS 4n
The real group \fBID\fR of the process. This is the textual group \fBID,\fR if it can be obtained and the field width permits, or a decimal representation otherwise.
.RE

.sp
.ne 2
.mk
.na
\fB\fBpid\fR\fR
.ad
.sp .6
.RS 4n
The decimal value of the process \fBID\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBppid\fR\fR
.ad
.sp .6
.RS 4n
The decimal value of the parent process \fBID\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBpgid\fR\fR
.ad
.sp .6
.RS 4n
The decimal value of the process group \fBID.\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fBpcpu\fR\fR
.ad
.sp .6
.RS 4n
The ratio of CPU time used recently to CPU time available in the same period, expressed as a percentage. The meaning of ``recently'' in this context is unspecified. The CPU time available is determined in an unspecified manner.
.RE

.sp
.ne 2
.mk
.na
\fB\fBvsz\fR\fR
.ad
.sp .6
.RS 4n
The total size of the process in virtual memory, in kilobytes.
.RE

.sp
.ne 2
.mk
.na
\fB\fBnice\fR\fR
.ad
.sp .6
.RS 4n
The decimal value of the system scheduling priority of the process. See \fBnice\fR(1).
.RE

.sp
.ne 2
.mk
.na
\fB\fBetime\fR\fR
.ad
.sp .6
.RS 4n
The elapsed time since the process was started. In the POSIX locale, has the form:
.sp
\fB[[\fR\fIdd\fR-\fB]\fR\fIhh\fR:\fB]\fR\fImm\fR:\fIss\fR 
.sp
where
.sp
.ne 2
.mk
.na
\fB\fIdd\fR\fR
.ad
.sp .6
.RS 4n
is the number of days 
.RE

.sp
.ne 2
.mk
.na
\fB\fIhh\fR\fR
.ad
.sp .6
.RS 4n
is the number of hours 
.RE

.sp
.ne 2
.mk
.na
\fB\fImm\fR\fR
.ad
.sp .6
.RS 4n
is the number of minutes 
.RE

.sp
.ne 2
.mk
.na
\fB\fIss\fR\fR
.ad
.sp .6
.RS 4n
is the number of seconds
.RE

The \fIdd\fR field is a decimal integer. The \fIhh\fR, \fImm\fR and \fIss\fR fields is two-digit decimal integers padded on the left with zeros.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtime\fR\fR
.ad
.sp .6
.RS 4n
The cumulative CPU time of the process. In the POSIX locale, has the form:
.sp
\fB[\fR\fIdd\fR-\fB]\fR\fIhh\fR:\fImm\fR:\fIss\fR
.sp
The \fIdd\fR, \fIhh\fR, \fImm\fR, and \fIss\fR fields is as described in the \fBetime\fR specifier.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtty\fR\fR
.ad
.sp .6
.RS 4n
The name of the controlling terminal of the process (if any) in the same format used by the \fBwho\fR(1) command.
.RE

.sp
.ne 2
.mk
.na
\fB\fBcomm\fR\fR
.ad
.sp .6
.RS 4n
The name of the command being executed (\fBargv[0]\fR value) as a string.
.RE

.sp
.ne 2
.mk
.na
\fB\fBargs\fR\fR
.ad
.sp .6
.RS 4n
The command with all its arguments as a string. The implementation might truncate this value to the field width; it is implementation-dependent whether any further truncation occurs. It is unspecified whether the string represented is a version of the argument list as it was passed to the command when it started, or is a version of the arguments as they might have been modified by the application. Applications cannot depend on being able to modify their argument list and having that modification be reflected in the output of \fBps\fR. The Solaris implementation limits the string to 80 bytes; the string is the version of the argument list as it was passed to the command when it started.
.RE

.sp
.LP
The following names are recognized in the Solaris implementation:
.sp
.ne 2
.mk
.na
\fB\fBf\fR\fR
.ad
.sp .6
.RS 4n
Flags (hexadecimal and additive) associated with the process.
.RE

.sp
.ne 2
.mk
.na
\fB\fBs\fR\fR
.ad
.sp .6
.RS 4n
The state of the process.
.RE

.sp
.ne 2
.mk
.na
\fB\fBc\fR\fR
.ad
.sp .6
.RS 4n
Processor utilization for scheduling (obsolete).
.RE

.sp
.ne 2
.mk
.na
\fB\fBuid\fR\fR
.ad
.sp .6
.RS 4n
The effective user \fBID\fR number of the process as a decimal integer.
.RE

.sp
.ne 2
.mk
.na
\fB\fBruid\fR\fR
.ad
.sp .6
.RS 4n
The real user \fBID\fR number of the process as a decimal integer.
.RE

.sp
.ne 2
.mk
.na
\fB\fBgid\fR\fR
.ad
.sp .6
.RS 4n
The effective group \fBID\fR number of the process as a decimal integer.
.RE

.sp
.ne 2
.mk
.na
\fB\fBrgid\fR\fR
.ad
.sp .6
.RS 4n
The real group \fBID\fR number of the process as a decimal integer.
.RE

.sp
.ne 2
.mk
.na
\fB\fBprojid\fR\fR
.ad
.sp .6
.RS 4n
The project \fBID\fR number of the process as a decimal integer.
.RE

.sp
.ne 2
.mk
.na
\fB\fBproject\fR\fR
.ad
.sp .6
.RS 4n
The project \fBID\fR of the process as a textual value if that value can be obtained; otherwise, as a decimal integer.
.RE

.sp
.ne 2
.mk
.na
\fB\fBzoneid\fR\fR
.ad
.sp .6
.RS 4n
The zone \fBID\fR number of the process as a decimal integer.
.RE

.sp
.ne 2
.mk
.na
\fB\fBzone\fR\fR
.ad
.sp .6
.RS 4n
The zone \fBID\fR of the process as a textual value if that value can be obtained; otherwise, as a decimal integer.
.RE

.sp
.ne 2
.mk
.na
\fB\fBsid\fR\fR
.ad
.sp .6
.RS 4n
The process ID of the session leader.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtaskid\fR\fR
.ad
.sp .6
.RS 4n
The task \fBID\fR of the process.
.RE

.sp
.ne 2
.mk
.na
\fB\fBclass\fR\fR
.ad
.sp .6
.RS 4n
The scheduling class of the process.
.RE

.sp
.ne 2
.mk
.na
\fB\fBpri\fR\fR
.ad
.sp .6
.RS 4n
The priority of the process. Higher numbers mean higher priority.
.RE

.sp
.ne 2
.mk
.na
\fB\fBopri\fR\fR
.ad
.sp .6
.RS 4n
The obsolete priority of the process. Lower numbers mean higher priority.
.RE

.sp
.ne 2
.mk
.na
\fB\fBlwp\fR\fR
.ad
.sp .6
.RS 4n
The decimal value of the lwp \fBID\fR. Requesting this formatting option causes one line to be printed for each lwp in the process.
.RE

.sp
.ne 2
.mk
.na
\fB\fBnlwp\fR\fR
.ad
.sp .6
.RS 4n
The number of lwps in the process.
.RE

.sp
.ne 2
.mk
.na
\fB\fBpsr\fR\fR
.ad
.sp .6
.RS 4n
The number of the processor to which the process or lwp is bound.
.RE

.sp
.ne 2
.mk
.na
\fB\fBpset\fR\fR
.ad
.sp .6
.RS 4n
The \fBID\fR of the processor set to which the process or lwp is bound.
.RE

.sp
.ne 2
.mk
.na
\fB\fBaddr\fR\fR
.ad
.sp .6
.RS 4n
The memory address of the process.
.RE

.sp
.ne 2
.mk
.na
\fB\fBosz\fR\fR
.ad
.sp .6
.RS 4n
The total size of the process in virtual memory, in pages.
.RE

.sp
.ne 2
.mk
.na
\fB\fBwchan\fR\fR
.ad
.sp .6
.RS 4n
The address of an event for which the process is sleeping (if \(mi, the process is running).
.RE

.sp
.ne 2
.mk
.na
\fB\fBstime\fR\fR
.ad
.sp .6
.RS 4n
The starting time or date of the process, printed with no blanks.
.RE

.sp
.ne 2
.mk
.na
\fB\fBrss\fR\fR
.ad
.sp .6
.RS 4n
The resident set size of the process, in kilobytes. The \fBrss\fR value reported by \fBps\fR is an estimate provided by \fBproc\fR(4) that might underestimate the actual resident set size. Users who wish to get more accurate usage information for capacity planning should use \fBpmap\fR(1) \fB-x\fR instead.
.RE

.sp
.ne 2
.mk
.na
\fB\fBpmem\fR\fR
.ad
.sp .6
.RS 4n
The ratio of the process's resident set size to the physical memory on the machine, expressed as a percentage.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfname\fR\fR
.ad
.sp .6
.RS 4n
The first 8 bytes of the base name of the process's executable file.
.RE

.sp
.ne 2
.mk
.na
\fB\fBctid\fR\fR
.ad
.sp .6
.RS 4n
The contract ID of the process contract the process is a member of as a decimal integer.
.RE

.sp
.ne 2
.mk
.na
\fB\fBlgrp\fR\fR
.ad
.sp .6
.RS 4n
The home lgroup of the process.
.RE

.sp
.LP
Only \fBcomm\fR and \fBargs\fR are allowed to contain blank characters; all others, including the Solaris implementation variables, are not.
.sp
.LP
The following table specifies the default header to be used in the POSIX locale corresponding to each format specifier.
.sp

.sp
.TS
tab() box;
cw(1.38i) cw(1.38i) cw(1.38i) cw(1.38i) 
cw(1.38i) cw(1.38i) cw(1.38i) cw(1.38i) 
.
FormatDefaultFormatDefault
SpecifierHeaderSpecifierHeader
_
argsCOMMANDppidPPID
commCOMMANDrgroupRGROUP
etimeELAPSEDruserRUSER
groupGROUPtimeTIME
niceNIttyTT
pcpu%CPUuserUSER
pgidPGIDvszVSZ
pidPID
.TE

.sp
.LP
The following table lists the Solaris implementation format specifiers and the default header used with each.
.sp

.sp
.TS
tab() box;
cw(1.38i) cw(1.38i) cw(1.38i) cw(1.38i) 
cw(1.38i) cw(1.38i) cw(1.38i) cw(1.38i) 
.
FormatDefaultFormatDefault
SpecifierHeaderSpecifierHeader
_
addrADDRprojidPROJID
cCprojectPROJECT
classCLSpsrPSR
fFrgidRGID
fnameCOMMANDrssRSS
gidGIDruidRUID
lgrpLGRPsS
lwpLWPsidSID
nlwpNLWPstimeSTIME
opriPRItaskidTASKID
oszSZuidUID
pmem%MEMwchanWCHAN
priPRIzoneZONE
ctidCTIDzoneidZONEID
.TE

.SH EXAMPLES
.LP
\fBExample 1 \fRUsing \fBps\fR Command
.sp
.LP
The command:

.sp
.in +2
.nf
example% \fBps -o user,pid,ppid=MOM -o args\fR
.fi
.in -2
.sp

.sp
.LP
writes the following in the POSIX locale:

.sp
.in +2
.nf
 USER  PID   MOM   COMMAND
helene  34    12   ps -o uid,pid,ppid=MOM -o args
.fi
.in -2
.sp

.sp
.LP
The contents of the \fBCOMMAND\fR field need not be the same due to possible truncation.

.SH ENVIRONMENT VARIABLES
.sp
.LP
See \fBenviron\fR(5) for descriptions of the following environment variables that affect the execution of \fBps\fR: \fBLANG\fR, \fBLC_ALL\fR, \fBLC_CTYPE\fR, \fBLC_MESSAGES\fR, \fBLC_TIME\fR, and \fBNLSPATH\fR.
.sp
.ne 2
.mk
.na
\fB\fBCOLUMNS\fR\fR
.ad
.sp .6
.RS 4n
Override the system-selected horizontal screen size, used to determine the number of text columns to display.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.sp .6
.RS 4n
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/pts/*\fR\fR
.ad
.sp .6
.RS 4n

.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/term/*\fR\fR
.ad
.sp .6
.RS 4n
terminal (``tty'') names searcher files
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/passwd\fR\fR
.ad
.sp .6
.RS 4n
\fBUID\fR information supplier
.RE

.sp
.ne 2
.mk
.na
\fB\fB/proc/*\fR\fR
.ad
.sp .6
.RS 4n
process control files
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/core-os
_
CSIEnabled (see USAGE)
_
Interface StabilityCommitted
_
StandardSee \fBstandards\fR(5).
.TE

.SH SEE ALSO
.sp
.LP
\fBkill\fR(1), \fBlgrpinfo\fR(1), \fBnice\fR(1), \fBpagesize\fR(1), \fBpmap\fR(1), \fBpriocntl\fR(1), \fBwho\fR(1), \fBps\fR(1B), \fBgetty\fR(1M), \fBproc\fR(4), \fBttysrch\fR(4), \fBattributes\fR(5), \fBenviron\fR(5), \fBresource-controls \fR(5), \fBstandards\fR(5), \fBzones\fR(5)
.SH NOTES
.sp
.LP
Things can change while \fBps\fR is running. The snapshot it gives is true only for a split-second, and it might not be accurate by the time you see it. Some data printed for defunct processes is irrelevant.
.sp
.LP
If no options to select processes are specified, \fBps\fR reports all processes associated with the controlling terminal. If there is no controlling terminal, there is no report other than the header.
.sp
.LP
\fBps\fR \fB-ef\fR or \fBps\fR \fB-o\fR \fBstime\fR might not report the actual start of a tty login session, but rather an earlier time, when a \fBgetty\fR was last respawned on the \fBtty\fR line.
.sp
.LP
On prior releases the \fBADDR\fR and \fBWCHAN\fR fields might have contained the kernel memory address of the process and/or event it was waiting on. These fields are now always \fB0\fR unless requested by a process running with all privilege. The values can still be obtained using the \fB::ps and ::thread dcmds\fR within \fBmdb\fR.
.sp
.LP
\fBps\fR is \fBCSI\fR-enabled except for login names (usernames).
