Alhadis/Silos/Solaris-11.3/man1/scanpci.1
'\" t
.\" Copyright (C) 2000 The XFree86 Project, Inc.  All Rights Reserved.
.\"
.\" Permission is hereby granted, free of charge, to any person obtaining a copy
.\" of this software and associated documentation files (the "Software"), to
.\" deal in the Software without restriction, including without limitation the
.\" rights to use, copy, modify, merge, publish, distribute, sublicense, and/or
.\" sell copies of the Software, and to permit persons to whom the Software is
.\" furnished to do so, subject to the following conditions:
.\"
.\" The above copyright notice and this permission notice shall be included in
.\" all copies or substantial portions of the Software.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
.\" IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
.\" FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
.\" XFREE86 PROJECT BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
.\" IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
.\" CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
.\"
.\" Except as contained in this notice, the name of the XFree86 Project shall
.\" not be used in advertising or otherwise to promote the sale, use or other
.\" dealings in this Software without prior written authorization from the
.\" XFree86 Project.
.\"
.TH SCANPCI 1 "libpciaccess 0.13.2" "X Version 11"
.SH NAME
scanpci - scan/probe PCI buses
.SH SYNOPSIS
.B /usr/bin/scanpci
.RB [ \-v ]
.SH DESCRIPTION
.I Scanpci
is a utility that can be used to scan PCI buses and report information
about the configuration space settings for each PCI device.
On most platforms,
.I scanpci
can only be run by the root user.
On Oracle Solaris it may also be run using the 
.I "Desktop Configuration"
rights profile.  See \fBrbac\fR(5) and \fBuser_attr\fR(4).
.SH OPTIONS
.TP 8
.B \-v
Print the configuration space information for each device in a verbose
format.  Without this option, only a brief description is printed for
each device.
.SH "SEE ALSO"
.BR prtconf "(1M), " prtdiag "(1M), " smbios "(1M), "
.BR user_attr "(4), " rbac "(5)."


.\" Begin Oracle Solaris update
.SH "ATTRIBUTES"
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp
.TS
allbox;
cw(2.750000i)| cw(2.750000i)
lw(2.750000i)| lw(2.750000i).
ATTRIBUTE TYPE	ATTRIBUTE VALUE
Availability	diagnostic/scanpci
Interface Stability	Volatile
.TE
.sp
.\" End Oracle Solaris update
