Alhadis/Silos/Solaris-11.3/man9f/ddi_mem_put8.9f
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved
.TH ddi_mem_put8 9F "1 Nov 2005" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_mem_put8, ddi_mem_put16, ddi_mem_put32, ddi_mem_put64, ddi_mem_putb, ddi_mem_putw, ddi_mem_putl, ddi_mem_putll \- write data to mapped device in the memory space or allocated DMA memory
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h> 
#include <sys/sunddi.h>

\fBvoid\fR \fBddi_mem_put8\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBuint8_t *\fR\fIdev_addr\fR, 
     \fBuint8_t\fR \fIvalue\fR);
.fi

.LP
.nf
\fBvoid\fR \fBddi_mem_put16\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBuint16_t *\fR\fIdev_addr\fR, 
     \fBuint16_t\fR \fIvalue\fR);
.fi

.LP
.nf
\fBvoid\fR \fBddi_mem_put32\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBuint32_t *\fR\fIdev_addr\fR, 
     \fBuint32_t\fR \fIvalue\fR);
.fi

.LP
.nf
\fBvoid\fR \fBddi_mem_put64\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBuint64_t *\fR\fIdev_addr\fR, 
     \fBuint64_t\fR \fIvalue\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIhandle\fR\fR
.ad
.RS 12n
.rt  
The data access handle returned from setup calls, such as  \fBddi_regs_map_setup\fR(9F).
.RE

.sp
.ne 2
.mk
.na
\fB\fIdev_addr\fR\fR
.ad
.RS 12n
.rt  
Base device address.
.RE

.sp
.ne 2
.mk
.na
\fB\fIvalue\fR\fR
.ad
.RS 12n
.rt  
The data to be written to the device.
.RE

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI). The \fBddi_mem_put8()\fR, \fBddi_mem_put16()\fR, \fBddi_mem_put32()\fR, \fBddi_mem_put64()\fR, \fBddi_mem_putb()\fR, \fBddi_mem_putl()\fR, \fBddi_mem_putll()\fR, and \fBddi_mem_putw()\fR functions are obsolete. The \fBddi_put8\fR(9F) function replaces \fBddi_mem_put8()\fR. The \fBddi_put16\fR(9F) function replaces \fBddi_mem_put16()\fR. The \fBddi_put32\fR(9F) function replaces \fBddi_mem_put32()\fR. The \fBddi_put64\fR(9F) function replaces \fBddi_mem_put64()\fR. The \fBddi_put8\fR(9F) function replaces \fBddi_mem_putb()\fR. The \fBddi_put32\fR(9F) function replaces \fBddi_mem_putl()\fR. The \fBddi_put64\fR(9F) function replaces \fBddi_mem_putll()\fR. The \fBddi_put16\fR(9F) function replaces \fBddi_mem_putw()\fR.
.SH DESCRIPTION
.sp
.LP
These routines generate a write of various sizes to memory space or allocated \fBDMA \fRmemory. The \fBddi_mem_put8()\fR, \fBddi_mem_put16()\fR, \fBddi_mem_put32()\fR, and \fBddi_mem_put64()\fR functions write 8 bits, 16 bits, 32 bits and 64 bits of data, respectively, to the device address, \fIdev_addr\fR, in memory space.
.sp
.LP
Each individual datum will automatically be translated to maintain a consistent view between the host and the device based on the encoded information in the data access handle. The translation may involve byte-swapping if the host and the device have incompatible endian characteristics.
.SH CONTEXT
.sp
.LP
These functions can be called from user, kernel, or interrupt context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
\fBddi_mem_get8\fR(9F), \fBddi_mem_rep_get8\fR(9F), \fBddi_put8\fR(9F), \fBddi_put16\fR(9F), \fBddi_put32\fR(9F), \fBddi_put64\fR(9F), \fBddi_mem_get8\fR(9F), \fBddi_regs_map_setup\fR(9F), \fBddi_device_acc_attr\fR(9S) 
