Alhadis/Silos/Solaris 11.3/man9f/usb_pipe_get_max_bulk_streams.9f
'\" te
.\" Copyright (c) 2009, 2013, Oracle and/or its affiliates. All rights reserved.
.TH usb_pipe_get_max_bulk_streams  9F "05 February 2013" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
usb_pipe_get_max_bulk_streams \- Get maximum streams count on a USB bulk pipe
.SH SYNOPSIS
.LP
.nf
#include <sys/usb/usba.h>
.fi

.LP
.nf
\fBint usb_pipe_get_max_bulk_streams(usb_pipe_handle_t *\fR\fIpipe_handle\fR, \fBuint16_t *\fR\fImax_streams\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIpipe_handle\fR\fR
.ad
.RS 15n
.rt  
Pointer to a USB bulk pipe handle.
.RE

.sp
.ne 2
.mk
.na
\fB\fImax_streams\fR\fR
.ad
.RS 15n
.rt  
Returns the maximum streams count.
.RE

.SH DESCRIPTION
.sp
.LP
The\fBusb_pipe_get_max_bulk_streams()\fR function returns the maximum streams count that the host and client can support per bulk pipe. This information can be used by the USB client to decide how many streams can be allocated. 
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
\fB\fBUSB_SUCCESS\fR\fR
.ad
.RS 21n
.rt  
Maximum streams count is returned in \fBmax_stream\fR argument.
.RE

.sp
.ne 2
.mk
.na
\fB\fBUSB_INVALID_ARGS\fR\fR
.ad
.RS 21n
.rt  
\fBpipe_handle\fR is \fBNULL\fR and/or the \fBmax_stream\fR argument is\fBNULL\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBUSB_INVALID_PIPE\fR\fR
.ad
.RS 21n
.rt  
Pipe is closing or closed.
.RE

.sp
.ne 2
.mk
.na
\fB\fBUSB_NOT_SUPPORTED\fR\fR
.ad
.RS 21n
.rt  
The host does not support SuperSpeed streams.
.RE

.sp
.LP
Exception handlers of any queued requests which were flushed are called with a completion reason of \fBUSB_CR_FLUSHED\fR.
.SH CONTEXT
.sp
.LP
The allocation routines may always be called from kernel, user, or interrupt context.
.SH EXAMPLES
.sp
.in +2
.nf
uint16_t stream_max_cnt;

           if (usb_pipe_get_max_bulk_streams(pipe, &stream_cnt) !=
               USB_SUCCESS) {
           }
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes: 
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCI-based systems
_
Interface StabilityCommitted
_
Availabilitysystem/io/usb
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBusb_pipe_bulk_alloc_streams\fR(9F), \fBusb_pipe_bulk_free_streams\fR(9F), \fBusb_pipe_bulk_reset_stream\fR(9F)
