Alhadis/Silos/Solaris-11.3/man1b/exportfs.1b
'\" te
.\"  Copyright (c) 1994, 2013, Oracle and/or its affiliates. - All rights reserved.
.TH exportfs 1B "6 Nov 2000" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
exportfs \- translates exportfs options to share/unshare commands
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/exportfs\fR [\fB-aiuv\fR] [\fB-o\fR \fIoptions\fR] [\fIpathname\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBexportfs\fR translates SunOS 4.x \fBexportfs\fR options to the corresponding \fBshare\fR/\fBunshare\fR options and invokes \fBshare\fR/\fBunshare\fR with the translated options.
.sp
.LP
With no options or arguments, \fBexportfs\fR invokes \fBshare\fR to print out the list of all currently shared \fBNFS\fR filesystems.
.sp
.LP
This command is obsolete and will be removed in a future release of Oracle Solaris. Use \fBshare\fR(1M) \fBunshare\fR(1M) or instead. 
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 14n
.rt  
Invokes \fBshareall\fR(1M), or if \fB-u\fR is specified, invokes \fBunshareall\fR(1M).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.RS 14n
.rt  
Ignore options in \fB/etc/dfs/dfstab\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.RS 14n
.rt  
Invokes \fBunshare\fR(1M) on \fIpathname\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 14n
.rt  
Verbose.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR\fI options\fR\fR
.ad
.RS 14n
.rt  
Specify a comma-separated list of optional characteristics for the filesystems being exported. \fBexportfs\fR translates \fIoptions\fR to \fBshare\fR-equivalent options. (see \fBshare\fR(1M) for information about individual options).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/file-system/nfs
.TE

.SH SEE ALSO
.sp
.LP
\fBshare\fR(1M), \fBshareall\fR(1M), \fBunshare\fR(1M), \fBunshareall\fR(1M), \fBattributes\fR(5)
