DEFINE DATA
LOCAL
1 #W(A20)
END-DEFINE
DEFINE SUBROUTINE STOMS01-CHECK-NEXT 
WRITE *LEVEL *PROGRAM 
  /* *CURRENT-UNIT *SUBROUTINE 
  *TYPE
END-SUBROUTINE
END
