Alhadis/Silos/Solaris-11.3/man5oldap/slapd-passwd.5oldap
'\" te
.TH SLAPD-PASSWD 5 "2012/02/29" "OpenLDAP 2.4.30"
.\" Copyright 1998-2012 The OpenLDAP Foundation All Rights Reserved.
.\" Copying restrictions apply.  See COPYRIGHT/LICENSE.
.\" $OpenLDAP$
.SH NAME
slapd\-passwd \- /etc/passwd backend to slapd
.SH SYNOPSIS
/etc/openldap/slapd.conf
.SH DESCRIPTION
The PASSWD backend to
.BR slapd (8)
serves up the user account information listed in the system
.BR passwd (5)
file.  This backend is provided for demonstration purposes only.
The DN of each entry is "uid=<username>,<suffix>".
Note that non-base searches scan the the entire passwd file, and
are best suited for hosts with small passwd files.
.SH CONFIGURATION
This
.B slapd.conf
option applies to the PASSWD backend database.
That is, it must follow a "database passwd" line and come before any
subsequent "backend" or "database" lines.
Other database options are described in the
.BR slapd.conf (5)
manual page.
.TP
.B file <filename>
Specifies an alternate passwd file to use.
The default is
.BR /etc/passwd .
.SH ACCESS CONTROL
The
.B passwd
backend does not honor any of the access control semantics described in
.BR slapd.access (5).
Only
.B read (=r)
access to the
.B entry
pseudo-attribute and to the other attribute values of the entries
returned by the
.B search
operation is honored, which is performed by the frontend.

.SH FILES
.TP
/etc/openldap/slapd.conf
default slapd configuration file
.TP
/etc/passwd
user account information

.\" Oracle has added the ARC stability level to this manual page
.SH ATTRIBUTES
See
.BR attributes (5)
for descriptions of the following attributes:
.sp
.TS
box;
cbp-1 | cbp-1
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE 
=
Availability	library/openldap
=
Stability	Committed
.TE 
.PP
.SH SEE ALSO
.BR slapd.conf (5),
.BR slapd (8),
.BR passwd (5).


.SH NOTES

.\" Oracle has added source availability information to this manual page
This software was built from source available at https://java.net/projects/solaris-userland.  The original community source was downloaded from  ftp://ftp.openldap.org/pub/OpenLDAP/openldap-release/openldap-2.4.30.tgz

Further information about this software can be found on the open source community website at http://www.openldap.org/.
