Alhadis/Silos/Solaris-11.3/man5oldap/slapo-dyngroup.5oldap
'\" te
.TH SLAPO-DYNGROUP 5 "2012/02/29" "OpenLDAP 2.4.30"
.\" Copyright 2005-2012 The OpenLDAP Foundation All Rights Reserved.
.\" Copying restrictions apply.  See COPYRIGHT/LICENSE.
.\" $OpenLDAP$
.SH NAME
slapo\-dyngroup \- Dynamic Group overlay to slapd
.SH SYNOPSIS
/etc/openldap/slapd.conf
.SH DESCRIPTION
The Dynamic Group overlay allows clients to use LDAP Compare operations
to test the membership of a dynamic group the same way they would check
against a static group. Compare operations targeting a group's static
member attribute will be intercepted and tested against the configured
dynamic group's URL attribute.
.LP
Note that this intercept only happens if the actual
Compare operation does not return a LDAP_COMPARE_TRUE result. So if a
group has both static and dynamic members, the static member list will
be checked first.
.SH CONFIGURATION
This
.B slapd.conf
option applies to the Dynamic Group overlay.
It should appear after the
.B overlay
directive.
.TP
.B attrpair <memberAttr> <URLattr>
Specify the attributes to be compared. A compare operation on the
.I memberAttr
will cause the
.I URLattr
to be evaluated for the result.
.SH EXAMPLES
.nf
  database bdb
  ...
  overlay dyngroup
  attrpair member memberURL
.fi
.SH FILES
.TP
/etc/openldap/slapd.conf
default slapd configuration file

.\" Oracle has added the ARC stability level to this manual page
.SH ATTRIBUTES
See
.BR attributes (5)
for descriptions of the following attributes:
.sp
.TS
box;
cbp-1 | cbp-1
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE 
=
Availability	library/openldap
=
Stability	Committed
.TE 
.PP
.SH SEE ALSO
.BR slapd.conf (5),
.BR slapd\-config (5).
.SH AUTHOR
Howard Chu


.SH NOTES

.\" Oracle has added source availability information to this manual page
This software was built from source available at https://java.net/projects/solaris-userland.  The original community source was downloaded from  ftp://ftp.openldap.org/pub/OpenLDAP/openldap-release/openldap-2.4.30.tgz

Further information about this software can be found on the open source community website at http://www.openldap.org/.
