Alhadis/Silos/Solaris 11.3/man7d/emlxs.7d
'\" te
.\" Copyright (c) 2004, 2014, Oracle and/or its affiliates. All rights reserved.
.TH emlxs 7D "28 Feb 2014" "SunOS 5.11" "Devices"
.SH NAME
emlxs \- Emulex-Sun LightPulse Fibre Channel host bus adapter driver
.SH SYNOPSIS
.LP
.nf
SUNW,emlxs
.fi

.SH DESCRIPTION
.sp
.LP
The \fBemlxs\fR host bus adapter driver is a Sun Fibre  Channel transport layer-compliant nexus driver for the Emulex Light-Pulse family of Fibre Channel adapters. These adapters support Fibre Channel SCSI and IP Protocols, FC-AL public loop profile, point-to-point fabric connection and Fibre Channel service classes two and three.
.sp
.LP
The \fBemlxs\fR driver interfaces with the Sun Fibre Channel transport layer to support the standard functions provided by the SCSA interface. It supports auto request sense and tagged queueing by default. The driver requires that all devices have  unique hard addresses in private loop configurations. Devices with conflicting hard addresses are not accessible.
.sp
.LP
The \fBemlxs\fR driver also supports the SR-IOV capability on the Sun Storage 16 Gb Fibre Channel PCIe Universal Host Bus Adapter. In the SR-IOV enabled mode, it supports the physical function and virtual function of the adapter. Point-to-point fabric connections are not supported in the SR-IOV enabled mode.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd/emlxs\fR\fR
.ad
.RS 29n
.rt  
64-bit ELF kernel module (x86).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/emlxs\fR\fR
.ad
.RS 29n
.rt  
64-bit ELF kernel module (SPARC).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/emlxs.conf\fR\fR
.ad
.RS 29n
.rt  
Driver configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
_
Availabilitydriver/fc/emlxs
.TE

.SH SEE ALSO
.sp
.LP
\fBprtconf\fR(1M), \fBdriver.conf\fR(4), \fBfcp\fR(7D), \fBfp\fR(7d)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fIANSI X3.230:1994, Fibre Channel Physical Signaling (FC-PH)\fR
.sp
.LP
\fIProject 1134-D, Fibre Channel Generic Services (FC-GS-2)\fR
.sp
.LP
\fIANSI X3.269-1996, Fibre Channel Arbitrated Loop (FC-AL)\fR
.sp
.LP
\fIANSI X3.270-1996, Fibre Channel Protocol for  SCSI (FCP-SCSI)\fR
.sp
.LP
\fIANSI X3.270-1996, SCSI-3 Architecture Model (SAM)\fR
.sp
.LP
\fIFibre Channel Private Loop SCSI Direct  Attach  (FC-PLDA)\fR
.sp
.LP
\fIFabric Loop Attachment (FC-FLA)\fR
