Alhadis/Silos/Solaris 11.3/man7d/fcoei.7d
'\" te
.\" Copyright (c) 2009, 2012, Oracle and/or its affiliates. All rights reserved.
.TH fcoei 7D "4 Jan 2012" "SunOS 5.11" "Devices"
.SH NAME
fcoei \- Fibre Channel Over Ethernet Initiator Mode Driver
.SH SYNOPSIS
.sp
.in +2
.nf
fcoei@port,0
.fi
.in -2

.SH DESCRIPTION
.sp
.LP
The \fBfcoei\fR driver is a pseudo device driver which encapsulates the raw Fibre Channel frames into FCoE ethernet frames, or decapsulates FC frames from FCoE ethernet frames. The supported FC frames include extended/basic link services, common transport frames and initiator mode FCP frames.
.sp
.LP
The \fBfcoei\fR driver interfaces with the Sun Fibre Channel port driver, \fBfp\fR(7d), and the FCoE transport driver, \fBfcoe\fR(7D).
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/fcoei\fR\fR
.ad
.RS 27n
.rt  
64-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fBkernel/drv/sparcv/fcoei\fR\fR
.ad
.RS 27n
.rt  
64-bit ELF kernel module (SPARC)
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attribute:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
_
Availabilitysystem/storage/fcoe/fcoe-initiator
.TE

.SH SEE ALSO
.sp
.LP
\fBdriver.conf\fR(4), \fBattributes\fR(5), \fBfcoe\fR(7D), \fBfcoet\fR(7D), \fBfp\fR(7d)
.sp
.LP
\fIWriting Device Drivers for Oracle Solaris 11.2\fR
.sp
.LP
\fIANSI X3.269-1996, Fibre Channel Protocol for SCSI (FCP)\fR
