Alhadis/Silos/Solaris 11.3/man7d/fctl.7d
'\" te
.\" Copyright (c) 2004, 2012, Oracle and/or its affiliates. All rights reserved.
.TH fctl 7D "5 Jan 2012" "SunOS 5.11" "Devices"
.SH NAME
fctl \- Sun Fibre Channel transport library
.SH DESCRIPTION
.sp
.LP
The \fBfctl\fR kernel module interfaces the Sun Fibre Channel upper layer protocol (ULP) mapping modules with Sun Fibre Channel adapter (FCA) drivers. There are no user-configurable options for this module.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/amd64/fctl\fR\fR
.ad
.RS 29n
.rt  
64-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/sparcv9/fctl\fR\fR
.ad
.RS 29n
.rt  
64-bit ELF kernel module (SPARC)
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes: 
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC
_
Interface StabilityUnknown
_
Availabilitysystem/io/fc/fc-port
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBfp\fR(7d)
