Alhadis/Silos/Solaris 11.3/man7d/ipw.7d
'\" te
.\" Copyright (c) 2007, 2012, Oracle and/or its affiliates. All rights reserved.
.TH ipw 7D "5 Jan 2012" "SunOS 5.11" "Devices"
.SH NAME
ipw \- Intel Pro. Wireless 802.11b IPW2100B driver
.SH DESCRIPTION
.sp
.LP
The \fBipw\fR \fI802.11b\fR wireless NIC driver is a multi-threaded, loadable, clonable, GLDv3-based STREAMS driver supporting the Data Link Provider Interface, \fBdlpi\fR(7P), on Intel Pro Wireless  2100B chipset-based wireless NIC's. Driver  functions  include controller initialization, wireless \fI802.11b\fR infrastructure network connection, WEP, frame transmit and receive and promiscuous support.
.SH DRIVER CONFIGURATION
.sp
.LP
The \fBipw\fR driver performs auto-negotiation to determine the data rate and mode. Supported \fI802.11b\fR data rates are 1, 2, 5.5 and 11 Mbits/sec.
.sp
.LP
The \fBipw\fR driver supports only BSS networks (also known as \fBap\fR or \fBinfrastructure\fR networks) and the \fBopen\fR (\fBopen-system\fR) or \fBshared system\fR authentication. Only WEP encryption is currently supported. You perform configuration and administration tasks using the \fBdladm\fR(1M) utility.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/ipw*\fR\fR
.ad
.RS 25n
.rt  
Special character device.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/ipw\fR\fR
.ad
.RS 25n
.rt  
64-bit ELF kernel module (x86).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitydriver/network/wlan/ipw
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBattributes\fR(5), \fBgld\fR(7D), \fBdlpi\fR(7P)
.sp
.LP
\fIANSI/IEEE Std 802.11- Standard for Wireless LAN  Technology\fR \(em 1999
.sp
.LP
\fIIEEE Std 802.11b - Standard  for  Wireless  LAN  Technology-Rev. B \fR - 2003
