Alhadis/Silos/Solaris 11.3/man7d/iscsi.7d
'\" te
.\" Copyright (c) 2009, 2012, Oracle and/or its affiliates. All rights reserved.
.TH iscsi 7D "5 Jan 2012" "SunOS 5.11" "Devices"
.SH NAME
iscsi \- iSCSI software initiator driver and service
.SH DESCRIPTION
.sp
.LP
The \fBiscsi\fR driver is a software initiator that transports SCSI commands over TCP/IP as described in \fIRFC 3720\fR. 
.sp
.LP
The initiator driver is administered through \fBiscsiadm\fR(1M). The \fBiscsi\fR initiator service is managed by the service management facility, \fBsmf\fR(5), under the following FMRI:  
.sp
.in +2
.nf
svc:/network/iscsi/initiator:default
.fi
.in -2
.sp

.sp
.LP
The \fBiscsi\fR initiator acts as a host adapter driver that attaches the appropriate target driver, for example, \fBsd\fR(7D) for disks, or \fBst\fR(7D) for tapes) for devices it discovers. See the \fIManaging Devices in Oracle Solaris 11.2\fR for more information. 
.sp
.LP
Once enabled, the \fBiscsi\fR initiator service ensures the right timing to start the discovery and enumeration of iSCSI devices during boot, but it doesn't guarantee the success of discovery for certain iSCSI devices. If the service is disabled, \fBiscsi\fR driver stops the discovery and enumeration of iSCSI devices and also tries to offline all existing iSCSI devices. \fBiscsiadm\fR(1M) works only when the service is enabled.
.sp
.LP
iSCSI \fBboot\fR(1M) is not affected by the status of the \fBiscsi\fR initiator service.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/iscsi\fR\fR
.ad
.RS 29n
.rt  
64-bit SPARC ELF kernel driver
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/iscsi\fR\fR
.ad
.RS 29n
.rt  
64-bit AMD64 ELF kernel driver
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/iscsi.conf\fR\fR
.ad
.RS 29n
.rt  
Driver configuration file
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/iscsi/*\fR\fR
.ad
.RS 29n
.rt  
\fBiscsi\fR persistent store
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitysystem/storage/iscsi/iscsi-initiato
.TE

.SH SEE ALSO
.sp
.LP
\fBiscsiadm\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5), \fBsd\fR(7D), \fBst\fR(7D)
.sp
.LP
\fIRFC 3720 Internet Small Computer Systems Interface (iSCSI)\fR
.sp
.LP
\fIManaging Devices in Oracle Solaris 11.2\fR
