Alhadis/Silos/Solaris 11.3/man7d/ral.7d
'\" te
.\" Copyright (c) 2006 Damien Bergamini
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  * WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF  * MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR  * ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES  * WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN  * ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF  * OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\" Portions Copyright (c) 2007, 2012, Oracle and/or its affiliates. All rights reserved.
.TH ral 7D "5 Jan 2012" "SunOS 5.11" "Devices"
.SH NAME
ral \- Ralink RT2500 802.11b/g Wireless driver
.SH DESCRIPTION
.sp
.LP
The \fBral\fR \fI802.11b/g\fR wireless NIC driver is a  multi-threaded, loadable, clonable, GLDv3-based  STREAMS driver supporting Ralink RT2500 chipset-based NIC's.
.SH CONFIGURATION
.sp
.LP
The \fBral\fR driver performs auto-negotiation to determine the data rate and mode. Supported \fI802.11b\fR data rates are 1, 2, 5.5 and 11 Mbits/sec. Supported \fI802.11g\fR data rates are 1, 2, 5.5, 6, 9, 11, 12, 18, 24, 36, 48 and 54 Mbits/sec. The \fBral\fR driver supports only BSS  networks (also  known as \fBap\fR or \fBinfrastructure\fR networks) and \fBopen\fR (or \fBopen-system\fR) or \fBshared system\fR authentication. 
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/ral*\fR\fR
.ad
.sp .6
.RS 4n
Special character device.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/ral\fR\fR
.ad
.sp .6
.RS 4n
64-bit ELF kernel module (x86).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availabilitydriver/network/wlan/ral
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBattributes\fR(5), \fBgld\fR(7D), \fBdlpi\fR(7P)
.sp
.LP
\fI802.11 - Wireless LAN  Media  Access  Control  and  Physical Layer Specification\fR \(em IEEE, 2001
