Alhadis/Silos/Solaris 11.3/man7d/sd.7d
'\" te
.\" Copyright (c) 2009, 2014, Oracle and/or its affiliates. All rights reserved.
.TH sd 7D "8 Sep 2014" "SunOS 5.11" "Devices"
.SH NAME
sd \- SCSI disk and ATAPI/SCSI CD-ROM device driver
.SH SYNOPSIS
.LP
.nf
\fBsd@target,lun:partition\fR
.fi

.SH DESCRIPTION
.sp
.LP
To open a device without checking if the vtoc is valid, use the O_NDELAY flag. When the device is opened using O_NDELAY, the first read or write to the device that happens after the open results in the label being read if the label is not currently valid. Once read, the label remains valid until the last close of the device. Except for reading the label, O_NDELAY has no impact on the driver.
.SS "SPARC"
.sp
.LP
The \fBsd\fR \fBSCSI\fR and \fBSCSI/ATAPI\fR driver supports embedded \fBSCSI\fR-2 and \fBCCS\fR-compatible \fBSCSI\fR disk and CD-ROM drives, \fBATAPI \fR 2.6 (SFF-8020i)-compliant CD-ROM drives, SFF-8090-compliant \fBSCSI/ATAPI\fR DVD-ROM drives, IOMEGA \fBSCSI/ATAPI\fR ZIP drives, \fBSCSI JAZ\fR drives, and USB mass storage devices (refer to \fBscsa2usb\fR(7D)).
.sp
.LP
To determine the disk drive type, use the \fBSCSI/ATAPI\fR inquiry command and read the volume label stored on block 0 of the drive. (The volume label describes the disk geometry and partitioning and must be present for the disk to be mounted by the system.) A volume label is not required for removable, re-writable or read-only media.
.SS "x86 Only"
.sp
.LP
The \fBsd\fRdriver supports embedded \fBSCSI\fR-2 and \fBCCS\fR-compatible \fBSCSI \fRdisk and CD-ROM drives, \fBATAPI \fR2.6 (SFF-8020i)-compliant CD-ROM drives, SFF-8090-compliant \fBSCSI/ATAPI\fR DVD-ROM drives, IOMEGA \fBSCSI/ATAPI\fR ZIP drives\fB, and SCSI JAZ\fR drives.
.sp
.LP
The x86 BIOS legacy requires a master boot record (MBR) and \fBfdisk\fR table in the first physical sector of the bootable media. If the x86 hard disk contains a Solaris disk label, it is located in the second 512-byte sector of the FDISK partition. 
.SH DEVICE SPECIAL FILES
.sp
.LP
Block-files access the disk using normal buffering mechanism and are read-from and written-to without regard to physical disk records. A \fBraw\fR interface enables direct transmission between the disk and the user's read or write buffer. A single \fBread\fR or \fBwrite\fR call usually results in a single I/O operation, therefore raw I/O is more efficient when many bytes are transmitted. Block files names are found in \fB/dev/dsk\fR; raw file names are found in \fB/dev/rdsk\fR.
.sp
.LP
I/O requests to the raw device must be aligned on a 512-byte (\fBDEV_BSIZE\fR) boundary and all I/O request lengths must be in multiples of 512 bytes. Requests that do not meet these requirements will trigger an \fBEINVAL\fR error. There are no alignment or length restrictions on I/O requests to the block device.
.SH CD-ROM DRIVE SUPPORT
.sp
.LP
A CD-ROM disk is single-sided and contains approximately 640 megabytes of data or 74 minutes of audio. When the CD-ROM is opened, the eject button is disabled to prevent manual removal of the disk until the last \fBclose()\fR is called. No volume label is required for a CD-ROM. The disk geometry and partitioning information are constant and never change. If the CD-ROM contains data recorded in a Solaris-aware file system format, it can be mounted using the appropriate Solaris file system support.
.SH DVD-ROM DRIVE SUPPORT
.sp
.LP
DVD-ROM media can be single or double-sided and can be recorded upon using a single or double layer structure. Double-layer media provides parallel or opposite track paths. A DVD-ROM can hold from between 4.5 Gbytes and 17 Gbytes of data, depending on the layer structure used for recording and if the DVD-ROM is single or double-sided. 
.sp
.LP
When the DVD-ROM is opened, the eject button is disabled to prevent the manual removal of a disk until the last \fBclose()\fR is called. No volume label is required for a DVD-ROM. If the DVD-ROM contains data recorded in a Solaris-aware file system format, it can be mounted using the appropriate Solaris file system support.
.SH ZIP/JAZ DRIVE SUPPORT
.sp
.LP
\fBZIP/JAZ\fR media provide varied data capacity points; a single \fBJAZ \fRdrive can store up to 2 GBytes of data, while a ZIP-250 can store up to 250MBytes of data. \fBZIP/JAZ\fR drives can be read-from or written-to using the appropriate drive. 
.sp
.LP
When a \fBZIP/JAZ\fR drive is opened, the eject button is disabled to prevent the manual removal of a disk until the last \fBclose()\fR is called. No volume label is required for a \fBZIP/JAZ\fR drive. If the \fBZIP/JAZ\fR drive contains data recorded in a Solaris-aware file system format, it can be mounted using the appropriate Solaris file system support.
.SH DEVICE STATISTICS SUPPORT
.sp
.LP
Each device maintains I/O statistics for the device and for partitions allocated for that device. For each device/partition, the driver accumulates reads, writes, bytes read, and bytes written. The driver also initiates hi-resolution time stamps at queue entry and exit points to enable monitoring of residence time and cumulative residence-length product for each queue. 
.sp
.LP
Not all device drivers make per-partition IO statistics available for reporting. \fBsd\fR and \fBssd\fR(7D) per-partition statistics are enabled by default but may disabled in their configuration files.
.SH SCSI FMA PHASE III
.sp
.LP
Based on the implementation of SCSI FMA phase III, the \fBsd\fR driver is able to send out FMA telemetries (ereports) when detecting an error condition. The ereports detail what is happening at the kernel driver level.
.SS "Error Reports and Payloads"
.sp
.LP
Ereports (error reports) are generated upon the detection of an abnormal condition, recorded in persistent storage (for example a file system) in binary format, and used as input to automated diagnosis engines.
.sp
.LP
An ereport is described by its event class (hierarchy path) and a payload of name-value pairs that can be used for diagnosis and logging.
.sp
.LP
Six new ereports are introduced by SCSI FMA:
.RS +4
.TP
.ie t \(bu
.el o
\fBereport.io.scsi.cmd.disk.dev.rqs.merr\fR -- Media error 
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBereport.io.scsi.cmd.disk.dev.rqs.derr\fR -- Device error
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBereport.io.scsi.cmd.disk.dev.serr\fR -- SCSI command status error 
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBereport.io.scsi.cmd.disk.dev.uderr\fR -- Unexpected data error
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBereport.io.scsi.cmd.disk.recovered\fR -- SCSI command recovered from a failure 
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBereport.io.scsi.cmd.disk.tran\fR -- SCSI command transport error 
.RE
.sp
.LP
There are many payloads along with these ereports. For analyzing problems, ENA and \fBdriver-assessment\fR are quite useful.
.sp
.LP
ENA (error numeric association) is used in SCSI FMA as a link for a sequence of related ereports. For example, a command retried several times that finally succeeds would result in a sequence of posted ereports that are associated by the same ENA value.
.sp
.LP
The \fBdriver-assessment\fR value is used to indicate the action the driver is going to take. Usually this value is helpful for the administrator to analyze what happened to a specific SCSI command at the kernel level. The table in the "driver-assessment values" section below lists the available values of \fBdriver-assessment\fR.
.sp
.LP
Other useful payloads for analyzing SCSI FMA ereports are listed in the following table.
.sp

.sp
.TS
tab() box;
cw(1.24i) |cw(4.26i) 
lw(1.24i) |lw(4.26i) 
.
Payload NameDescription 
_
ENAT{
Error Numeric Association. Can be used to associate a series of related ereports.
T}
_
detectorT{
The device that detected the error condition.
T}
_
cdbCommand Description Block.
_
driver-assessmentThe action the driver is going to take.
_
op-codeT{
The SCSI command that resulted in the error condition.
T}
_
pkt-reasonT{
Refer to the man page for scsi_pkt(9s), pkt-reason section.
T}
_
pkt-stateT{
Refer to the man page for scsi_pkt(9s), pkt-state section.	
T}
_
pkt-statsT{
Refer to the man page of scsi_pkt(9s), pkt-statistics section.
T}
_
stat-codeSCSI STATUS Code of the SCSI command.
_
keySense key of the SCSI command. 
_
ascAdditional Sense Code. 
_
ascqAdditional Sense Code Qualifier.
_
sense-dataT{
SCSI Sense data sent back from the device.
T}
_
lbaLogical Block Address on the device.
_
un-decode-infoT{
Usually indicating the payload that is storing an unexpected value or other information as a hint of undecodable value.
T}
_
un-decode-valueT{
Could be empty or be used together with un-decode-info to indicate the undecodable value.
T}
.TE

.SS "FMA Utilities"
.sp
.LP
The following utilities are useful for inspecting details of ereports:
.sp
.ne 2
.mk
.na
\fB\fBfmdump\fR(1M)\fR
.ad
.RS 14n
.rt  
A fault management log viewer. The FMA framework maintains two categories of logs: one for faults and another for ereports. Using \fBfmdump\fR you can see the detail of a specific pattern of ereports and also the fault list produced by the diagnosis engine.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfmadm\fR(1M)\fR
.ad
.RS 14n
.rt  
A tool for fault management configuration. It provides many functions, some of them quite frequently used, including viewing the faulty system component and resolving a fault.
.RE

.sp
.LP
Both these utilities need to be run as root. The following table lists some example usage of these utilities:
.sp

.sp
.TS
tab() box;
cw(1.63i) |cw(3.87i) 
lw(1.63i) |lw(3.87i) 
.
Example UsageDescription 
_
fmdump -evShow the ereport list with ENA.
_
fmdump -e -n \fIpayload\fR=\fIvalue\fRT{
Show ereports that match the specified pattern.
T}
_
fmdump -eVT{
Show ereport details, usually combined with -n option
T}
_
fmdump -V -u \fIUUID\fRShow fault details with given \fIUUID\fR
_
fmadm faulty -u \fIUUID\fRT{
Display status information for faulty resources with given \fIUUID\fR
T}
_
fmadm repair \fIUUID\fRT{
Set the status of a faulty device with given \fIUUID\fR back to normal.
T}
.TE

.SS "driver-assessment values"
.sp
.LP
The following table lists the available values of \fBdriver-assessment\fR:
.sp

.sp
.TS
tab() box;
cw(.85i) |cw(4.65i) 
lw(.85i) |lw(4.65i) 
.
ValueDescription 
_
fatalT{
SD driver failed the current SCSI command due to a non-recoverable device error (sense-key 0x3h or 0x4h).
T}
_
failT{
The scsi driver is not going to stop the service but it cannot guarantee normal service.
T}
_
infoT{
The driver has detected an error, but the services provided by the device instance are unaffected.
T}
_
retryT{
The scsi driver is going to retry a failed command and the service is unaffected.
T}
_
recoveredT{
The SD driver has recovered a SCSI command and the service is unaffected.
T}
.TE

.sp
.LP
See the Example section of this manual page for examples of ereports.
.SH IOCTLS
.sp
.LP
Refer to \fBdkio\fR(7I), and \fBcdio\fR(7I)
.SH ERRORS
.sp
.ne 2
.mk
.na
\fB\fBEACCES\fR\fR
.ad
.RS 10n
.rt  
Permission denied
.RE

.sp
.ne 2
.mk
.na
\fB\fBEBUSY\fR\fR
.ad
.RS 10n
.rt  
The partition was opened exclusively by another thread
.RE

.sp
.ne 2
.mk
.na
\fB\fBEFAULT\fR\fR
.ad
.RS 10n
.rt  
The argument features a bad address
.RE

.sp
.ne 2
.mk
.na
\fB\fBEINVAL\fR\fR
.ad
.RS 10n
.rt  
Invalid argument 
.RE

.sp
.ne 2
.mk
.na
\fB\fBENOTTY\fR\fR
.ad
.RS 10n
.rt  
The device does not support the requested ioctl function
.RE

.sp
.ne 2
.mk
.na
\fB\fBENXIO\fR\fR
.ad
.RS 10n
.rt  
During opening, the device did not exist. During close, the drive unlock failed
.RE

.sp
.ne 2
.mk
.na
\fB\fBEROFS\fR\fR
.ad
.RS 10n
.rt  
The device is read-only
.RE

.sp
.ne 2
.mk
.na
\fB\fBEAGAIN\fR\fR
.ad
.RS 10n
.rt  
Resource temporarily unavailable
.RE

.sp
.ne 2
.mk
.na
\fB\fBEINTR\fR\fR
.ad
.RS 10n
.rt  
A signal was caught during the execution of the \fBioctl()\fR function
.RE

.sp
.ne 2
.mk
.na
\fB\fBENOMEM\fR\fR
.ad
.RS 10n
.rt  
Insufficient memory
.RE

.sp
.ne 2
.mk
.na
\fB\fBEPERM\fR\fR
.ad
.RS 10n
.rt  
Insufficient access permission
.RE

.sp
.ne 2
.mk
.na
\fB\fBEIO\fR\fR
.ad
.RS 10n
.rt  
An I/O error occurred. Refer to notes for details on copy-protected DVD-ROM media.
.RE

.SH CONFIGURATION
.sp
.LP
The \fBsd\fR driver can be configured by defining properties in the \fBsd.conf\fR file. The \fBsd\fR driver supports the following properties:
.sp
.ne 2
.mk
.na
\fB\fBallow-bus-device-reset\fR\fR
.ad
.sp .6
.RS 4n
The default value is 1, which allows resetting to occur. Set this value to \fB0\fR (zero) to prevent the \fBsd\fR driver from calling \fBscsi_reset\fR(9F) with a second argument of \fBRESET_TARGET\fR when in error-recovery mode. This \fBscsi_reset\fR(9F) call may prompt the HBA driver to send a SCSI Bus Device Reset message. The \fBscsi_reset\fR(9F) call with a second argument of \fBRESET_TARGET\fR may result from an explicit request via the \fBUSCSICMD\fR \fBioctl\fR. Some high-availability multi-initiator systems may wish to prohibit the Bus Device Reset message; to do this, set the \fBallow-bus-device-reset\fR property to \fB0\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBenable-partition-kstats\fR\fR
.ad
.sp .6
.RS 4n
The default value is 1, which causes partition IO statistics to be maintained. Set this value to zero to prevent the driver from recording partition statistics. This slightly reduces the CPU overhead for IO, mimimizes the amount of \fBsar\fR(1) data collected and makes these statistics unavailable for reporting by \fBiostat\fR(1M) even though the \fB-p\fR/\fB-P\fR option is specified. Regardless of this setting, disk IO statistics are always maintained.
.RE

.sp
.ne 2
.mk
.na
\fB\fBoptical-device-bind\fR\fR
.ad
.sp .6
.RS 4n
Controls the binding of the driver to non self-identifying SCSI target optical devices. (See \fBscsi\fR(4)). The default value is 1, which causes \fBsd\fR to bind to DTYPE_OPTICAL devices (as noted in \fBscsi\fR(4)). Setting this value to 0 prevents automatic binding. The default behavior for the SPARC-based \fBsd\fR driver prior to Solaris 9 was not to bind to optical devices.
.RE

.sp
.ne 2
.mk
.na
\fB\fBpower-condition\fR\fR
.ad
.sp .6
.RS 4n
Boolean type, when set to \fBFalse\fR, it indicates that the disk does not support \fBpower condition\fR field in th\fBe START STOP UNIT\fR command.
.RE

.sp
.ne 2
.mk
.na
\fB\fBqfull-retries\fR\fR
.ad
.sp .6
.RS 4n
The supplied value is passed as the \fBqfull-retries\fR capability value of the HBA driver. See \fBscsi_ifsetcap\fR(9F) for details.
.RE

.sp
.ne 2
.mk
.na
\fB\fBqfull-retry-interval\fR\fR
.ad
.sp .6
.RS 4n
The supplied value is passed as the \fBqfull-retry interval\fR capability value of the HBA driver. See \fBscsi_ifsetcap\fR(9F) for details.
.RE

.sp
.LP
In addition to the above properties, some device-specific tunables can be configured in \fBsd.conf\fR using the \fBsd-config-list\fR global property. The value of this property is a list of duplets. The formal syntax is:
.sp
.in +2
.nf
sd-config-list = <duplet> [, <duplet> ]* ;

where 

<duplet>:= "<vid+pid>" , "<tunable-list>"

and 

<tunable-list>:= <tunable>[, <tunable> ]*;
<tunable> = <name> : <value>

The <vid+pid> is the string that is returned by the target device
on a SCSI inquiry command.

The <tunable-list> contains one or more tunables to apply to
all target devices with the specified <vid+pid>.

Each <tunable> is a <name> : <value> pair. Supported
tunable names are:
  
   delay-busy: when busy, nsecs of delay before retry.
   
   retries-timeout: retries to perform on an IO timeout.

   disable-caching: to disable cache, set this boolean property to true.
.fi
.in -2

.sp
.ne 2
.mk
.na
\fB\fBrmw-type\fR\fR
.ad
.sp .6
.RS 4n
Configure the behavior for given device when misaligned IOs are performed to it. It can be set to, 
.sp
.in +2
.nf
0 : Do  RMW  (READ MODIFY WRITE)  with
    warning message.
1 : Do RMW without warning message.
2 : Do NOT do RMW and return error.
.fi
.in -2
.sp

The warning message looks as follows:\fBIO request is not aligned with %d disk sector size. It is transmitted through but the performance is very low.\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fBemulation-rmw\fR\fR
.ad
.sp .6
.RS 4n
Turns on or off \fBRMW\fR in the \fBsd\fR driver for disks in emulation mode. Emulation mode is a disk which has different physical block size and logical block size. This improves the throughputs of some \fBSSD\fRs that have bad \fBRMW\fR performance in firmware.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmmc-gesn-polling\fR\fR
.ad
.sp .6
.RS 4n
For optical drives compliant with \fBMMC-3\fR and supporting the \fBGET EVENT STATUS NOTIFICATION\fR command, this command is used for periodic media state polling, usually initiated by the \fBDKIOCSTATE\fR \fBdkio\fR(7I) ioctl. To disable the use of this command, set this boolean property to \fBfalse\fR. In that case, either the \fBTEST UNIT READY\fR or zero-length \fBWRITE(10)\fR command is used instead.
.RE

.sp
.ne 2
.mk
.na
\fB\fBphysical-block-size\fR\fR
.ad
.sp .6
.RS 4n
SCSI Disk drivers take this value as the physical block size of the disks that do not report valid physical block size. The value must be a power of two. If not specified, \fBDEV_BSIZE\fR(512 bytes) is implied.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfm-log-enabled\fR\fR
.ad
.sp .6
.RS 4n
Controls the flag that enables logging of FMA events. The default value is 0, which causes \fBsd\fR to disable the ability to print any log for FMA events. Setting this value to 1 enables \fBsd\fR to print FMA events to \fB/var/adm/messages\fR and to the console.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRExample of a global sd-config-list property.
.sp
.in +2
.nf
The following is an example of a global sd-config-list property:
  
   sd-config-list =
      "SUN     T4", "delay-busy:6000000000, retries-timeout:6",
      "SUN     StorEdge_3510", "retries-timeout:3";
.fi
.in -2

.LP
\fBExample 2 \fRExample of an ereport where the driver-assessment value is fail.
.sp
.in +2
.nf
Apr 04 2010 01:30:23.464768275 ereport.io.scsi.cmd.disk.dev.uderr
nvlist version: 0
        class = ereport.io.scsi.cmd.disk.dev.uderr
        ena = 0xde0cd54f84201c01
        detector = (embedded nvlist)
        nvlist version: 0
                version = 0x0
                scheme = dev
                device-path = /pci@0,0/pci8086,25f8@4/pci108e,286@0/disk@5,0
                devid = id1,sd@TSun_____STK_RAID_INT____EA4B6F24
        (end detector)

        driver-assessment = fail
        op-code = 0x1a
        cdb = 0x1a 0x0 0x8 0x0 0x18 0x0
        pkt-reason = 0x0
        pkt-state = 0x1f
        pkt-stats = 0x0
        stat-code = 0x0
        un-decode-info = sd_get_write_cache_enabled: Mode Sense caching
page code mismatch 0

        un-decode-value        __ttl = 0x1
        __tod = 0x4bb7cf8f 0x1bb3cd13
.fi
.in -2

.LP
\fBExample 3 \fRExample of an ereport where the driver-assessment value is fatal.
.sp
.in +2
.nf
Jan 20 2011 18:50:16.276742278 ereport.io.scsi.cmd.disk.dev.rqs.merr
nvlist version: 0
        class = ereport.io.scsi.cmd.disk.dev.rqs.merr
        ena = 0xf83e2f0e78101c01
        detector = (embedded nvlist)
        nvlist version: 0
                version = 0x0
                scheme = dev
                device-path = /pci at 0,0/pci8086,340e at 7/pci1000,3080 
at 0/iport at f0/disk at w500 0c50010384d1d,0
                devid = id1,sd at n5000c50010384d1f
        (end detector)

        driver-assessment = fatal
        op-code = 0x28
        cdb = 0x28 0x0 0x9 0xcb 0x6f 0x0 0x0 0x0 0x80 0x0
        pkt-reason = 0x0
        pkt-state = 0x3f
        pkt-stats = 0x0
        stat-code = 0x2
        key = 0x3
        asc = 0x11
        ascq = 0x0
        sense-data = 0xf0 0x0 0x3 0x9 0xcb 0x6f 0x77 0xa 0x0 0x0 0x0 0x0
0x11 0x0 0x81 0x80 0x0 0x9d 0 xdd 0xba
        lba = 0x9cb6f00
        __ttl = 0x1
        __tod = 0x4d3883e8 0x107ec086
.fi
.in -2

.LP
\fBExample 4 \fRExample of an ereport where the driver-assessment value is recovered.
.sp
.in +2
.nf
Okt 08 2010 10:51:12.889604904 ereport.io.scsi.cmd.disk.recovered
nvlist version: 0
       class = ereport.io.scsi.cmd.disk.recovered
       ena = 0x92500a9c0ca01801
       detector = (embedded nvlist)
       nvlist version: 0
              version = 0x0
              scheme = dev
              device-path = /pci <at> 0,0/pci8086,3410 <at> 9/pci1077,
138 <at> 0/fp <at> 0,0/disk <at> w2100001378ac026e,0
              devid = id1,sd <at> n2034001378ac026e
       (end detector)

       driver-assessment = recovered
       op-code = 0x8a
       cdb = 0x8a 0x0 0x0 0x0 0x0 0x3 0x1a 0x49 0x7e 0xa9 0x0 0x0 0x1 0x0 0x0 0x0
       pkt-reason = 0x0
       pkt-state = 0x1f
       pkt-stats = 0x0
       __ttl = 0x1
       __tod = 0x4caedb80 0x35064b28
.fi
.in -2

.LP
\fBExample 5 \fRExample of an ereport where the driver-assessment value is retry.
.sp
.in +2
.nf
Jan 09 2012 10:04:31.334477741 ereport.io.scsi.cmd.disk.dev.rqs.derr
nvlist version: 0
        class = ereport.io.scsi.cmd.disk.dev.rqs.derr
        ena = 0xc3ca9ccb73e00c01
        detector = (embedded nvlist)
        nvlist version: 0
                version = 0x0
                scheme = dev
                device-path = 
/pci at 0,0/pci8086,3410 at 9/pci15d9,400 at 0/iport at 80/disk at w5000c50033f5bfb9,0
                devid = id1,sd at n5000c50033f5bfbb
        (end detector)

        devid = id1,sd at n5000c50033f5bfbb
        driver-assessment = retry
        op-code = 0x28
        cdb = 0x28 0x0 0x11 0x5d 0x75 0xf9 0x0 0x1 0x0 0x0
        pkt-reason = 0x0
        pkt-state = 0x37
        pkt-stats = 0x0
        stat-code = 0x2
        key = 0x6
        asc = 0x29
        ascq = 0x2
        sense-data = 0x70 0x0 0x6 0x0 0x0 0x0 0x0 0xa 0x0 0x0 0x0 0x0 
0x29 0x2 0x2 0x0 0x0 0x0 0xdd 0xba
        __ttl = 0x1
        __tod = 0x4f0b2c2f 0x13efb9ad
.fi
.in -2

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sd.conf\fR\fR
.ad
.RS 23n
.rt  
Driver configuration file
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/dsk/cntndnsn\fR\fR
.ad
.RS 23n
.rt  
Block files
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/rdsk/cntndnsn\fR\fR
.ad
.RS 23n
.rt  
Raw files
.RE

.sp
.LP
Where: 
.sp
.ne 2
.mk
.na
\fBcn\fR
.ad
.RS 6n
.rt  
controller n
.RE

.sp
.ne 2
.mk
.na
\fBtn\fR
.ad
.RS 6n
.rt  
SCSI target id n (0-6) 
.RE

.sp
.ne 2
.mk
.na
\fBdn\fR
.ad
.RS 6n
.rt  
SCSI LUN n (0-7 normally; some HBAs support LUNs to 15 or 32. See the specific manual page for details).
.RE

.sp
.ne 2
.mk
.na
\fBsn\fR
.ad
.RS 6n
.rt  
partition n (0-7)
.RE

.SS "x86 Only"
.sp
.ne 2
.mk
.na
\fB\fB/dev/rdsk/cntndnpn\fR\fR
.ad
.RS 22n
.rt  
raw files
.RE

.sp
.LP
Where: 
.sp
.ne 2
.mk
.na
\fBpn\fR
.ad
.RS 6n
.rt  
Where \fIn\fR=0 the node corresponds to the entire disk.
.RE

.SH SEE ALSO
.sp
.LP
\fBsar\fR(1), \fBcfgadm_scsi\fR(1M), \fBfdisk\fR(1M), \fBfmadm\fR(1M), \fBfmdump\fR(1M), \fBformat\fR(1M), \fBiostat\fR(1M), \fBclose\fR(2), \fBioctl\fR(2), \fBlseek\fR(2), \fBread\fR(2), \fBwrite\fR(2), \fBdriver.conf\fR(4), \fBscsi\fR(4), \fBfilesystem\fR(5), \fBscsa2usb\fR(7D), \fBssd\fR(7D), \fBhsfs\fR(7FS), \fBpcfs\fR(7FS), \fBudfs\fR(7FS), \fBcdio\fR(7I), \fBdkio\fR(7I), \fBscsi_ifsetcap\fR(9F), \fBscsi_reset\fR(9F), \fBscsi_pkt\fR(9S)
.sp
.LP
\fIANSI Small Computer System Interface-2 (SCSI-2)\fR
.sp
.LP
\fIATA Packet Interface for CD-ROMs, SFF-8020i\fR
.sp
.LP
\fIMt.Fuji Commands for CD and DVD, SFF8090v3\fR
.sp
.LP
http://\fIwww.sun.com/io\fR
.SH DIAGNOSTICS
.sp
.in +2
.nf
Error for Command:\fI<command name>\fR
Error Level: Fatal
Requested Block: \fI<n>\fR
Error  Block: \fI<m>\fR
Vendor:'\fI<vendorname>\fR\&'
Serial Number:'\fI<serial number>\fR\&'
Sense Key:\fI<sense key name>\fR
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
\fBASC: 0x<a> (<ASC name>), ASCQ: 0x<b>, FRU: 0x<c>\fR
.ad
.sp .6
.RS 4n
The command indicated by <command name> failed. The Requested Block is the block where the transfer started and the Error Block is the block that caused the error. Sense Key, \fBASC\fR, and \fBASCQ\fR information is returned by the target in response to a request sense command.
.RE

.sp
.ne 2
.mk
.na
\fBCaddy not inserted in drive\fR
.ad
.sp .6
.RS 4n
The drive is not ready because no caddy has been inserted.
.RE

.sp
.ne 2
.mk
.na
\fBCheck Condition on REQUEST SENSE\fR
.ad
.sp .6
.RS 4n
A REQUEST SENSE command completed with a check condition. The original command will be retried a number of times.
.RE

.sp
.ne 2
.mk
.na
\fBLabel says <m> blocks Drive says <n> blocks\fR
.ad
.sp .6
.RS 4n
There is a discrepancy between the label and what the drive returned on the \fBREAD CAPACITY\fR command.
.RE

.sp
.ne 2
.mk
.na
\fBNot enough sense information\fR
.ad
.sp .6
.RS 4n
The request sense data was less than expected.
.RE

.sp
.ne 2
.mk
.na
\fBRequest Sense couldn't get sense data\fR
.ad
.sp .6
.RS 4n
The \fBREQUEST SENSE\fR command did not transfer any data.
.RE

.sp
.ne 2
.mk
.na
\fBReservation Conflict\fR
.ad
.sp .6
.RS 4n
The drive was reserved by another initiator.
.RE

.sp
.ne 2
.mk
.na
\fBSCSI transport failed: reason \fB\&'xxxx'\fR: {retrying|giving up}\fR
.ad
.sp .6
.RS 4n
The host adapter has failed to transport a command to the target for the reason stated. The driver will either retry the command or, ultimately, give up.
.RE

.sp
.ne 2
.mk
.na
\fBUnhandled Sense Key<\fIn\fR>\fR
.ad
.sp .6
.RS 4n
The REQUEST SENSE data included an invalid sense.
.RE

.sp
.ne 2
.mk
.na
\fBUnit not ready. Additional sense code 0x\fR
.ad
.sp .6
.RS 4n
\fI<n>\fR The drive is not ready.
.RE

.sp
.ne 2
.mk
.na
\fBCan't do switch back to mode 1\fR
.ad
.sp .6
.RS 4n
A failure to switch back to read mode 1.
.RE

.sp
.ne 2
.mk
.na
\fBCorrupt label - bad geometry\fR
.ad
.sp .6
.RS 4n
The disk label is corrupted.
.RE

.sp
.ne 2
.mk
.na
\fBCorrupt label - label checksum failed\fR
.ad
.sp .6
.RS 4n
The disk label is corrupted.
.RE

.sp
.ne 2
.mk
.na
\fBCorrupt label - wrong magic number\fR
.ad
.sp .6
.RS 4n
The disk label is corrupted.
.RE

.sp
.ne 2
.mk
.na
\fBDevice busy too long\fR
.ad
.sp .6
.RS 4n
The drive returned busy during a number of retries.
.RE

.sp
.ne 2
.mk
.na
\fBDisk not responding to selection\fR
.ad
.sp .6
.RS 4n
The drive is powered down or died
.RE

.sp
.ne 2
.mk
.na
\fBFailed to handle UA\fR
.ad
.sp .6
.RS 4n
A retry on a Unit Attention condition failed.
.RE

.sp
.ne 2
.mk
.na
\fBI/O to invalid geometry\fR
.ad
.sp .6
.RS 4n
The geometry of the drive could not be established.
.RE

.sp
.ne 2
.mk
.na
\fBIncomplete read/write - retrying/giving up\fR
.ad
.sp .6
.RS 4n
There was a residue after the command completed normally.
.RE

.sp
.ne 2
.mk
.na
\fBNo bp for direct access device format geometry\fR
.ad
.sp .6
.RS 4n
A bp with consistent memory could not be allocated.
.RE

.sp
.ne 2
.mk
.na
\fBNo bp for disk label\fR
.ad
.sp .6
.RS 4n
A bp with consistent memory could not be allocated.
.RE

.sp
.ne 2
.mk
.na
\fBNo bp for fdisk\fR
.ad
.sp .6
.RS 4n
A bp with consistent memory could not be allocated.
.RE

.sp
.ne 2
.mk
.na
\fBNo bp for rigid disk geometry\fR
.ad
.sp .6
.RS 4n
A bp with consistent memory could not be allocated.
.RE

.sp
.ne 2
.mk
.na
\fBNo mem for property\fR
.ad
.sp .6
.RS 4n
Free memory pool exhausted.
.RE

.sp
.ne 2
.mk
.na
\fBNo memory for direct access device format geometry\fR
.ad
.sp .6
.RS 4n
Free memory pool exhausted.
.RE

.sp
.ne 2
.mk
.na
\fBNo memory for disk label\fR
.ad
.sp .6
.RS 4n
Free memory pool exhausted.
.RE

.sp
.ne 2
.mk
.na
\fBNo memory for rigid disk geometry\fR
.ad
.sp .6
.RS 4n
The disk label is corrupted.
.RE

.sp
.ne 2
.mk
.na
\fBNo resources for dumping\fR
.ad
.sp .6
.RS 4n
A packet could not be allocated during dumping.
.RE

.sp
.ne 2
.mk
.na
\fBOffline\fR
.ad
.sp .6
.RS 4n
Drive went offline; probably powered down.
.RE

.sp
.ne 2
.mk
.na
\fBRequeue of command fails\fR
.ad
.sp .6
.RS 4n
Driver attempted to retry a command and experienced a transport error.
.RE

.sp
.ne 2
.mk
.na
\fBsdrestart transport failed()\fR
.ad
.sp .6
.RS 4n
Driver attempted to retry a command and experienced a transport error.
.RE

.sp
.ne 2
.mk
.na
\fBTransfer length not modulo\fR
.ad
.sp .6
.RS 4n
Illegal request size.
.RE

.sp
.ne 2
.mk
.na
\fBTransport of request sense fails()\fR
.ad
.sp .6
.RS 4n
Driver attempted to submit a request sense command and failed.
.RE

.sp
.ne 2
.mk
.na
\fBTransport rejected()\fR
.ad
.sp .6
.RS 4n
Host adapter driver was unable to accept a command.
.RE

.sp
.ne 2
.mk
.na
\fBUnable to read label\fR
.ad
.sp .6
.RS 4n
Failure to read disk label.
.RE

.sp
.ne 2
.mk
.na
\fBUnit does not respond to selection\fR
.ad
.sp .6
.RS 4n
Drive went offline; probably powered down.
.RE

.SH NOTES
.sp
.LP
DVD-ROM media containing DVD-Video data may follow/adhere to the requirements of content scrambling system or copy protection scheme. Reading of copy-protected sector will cause I/O error. Users are advised to use the appropriate playback software to view video contents on DVD-ROM media containing DVD-Video data. 
