Alhadis/Silos/Solaris 11.3/ja_JP.UTF-8/man1/nl.1
'\" te
.\"  Copyright 1989 AT&T Copyright (c) 1995, Sun Microsystems, Inc. All Rights Reserved Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\"  Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation.Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation. In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html. This notice shall appear on any product containing this material.
.TH nl 1 "1995 年 5 月 28 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
nl \- 行番号フィルタ
.SH 形式
.LP
.nf
\fB/usr/bin/nl\fR [\fB-p\fR] [\fB-b\fR [\fItype\fR]] [\fB-d\fR [\fIdelim\fR]] [\fB-f\fR [\fItype\fR]] 
     [\fB-h\fR [\fItype\fR]] [\fB-i\fR [\fIincr\fR]] [\fB-l\fR [\fInum\fR]] [\fB-n\fR [\fIformat\fR]] 
     [\fB-s\fR [\fIsep\fR]] [\fB-w\fR [\fIwidth\fR]] [\fB-v\fR [\fIstartnum\fR]] [\fIfile\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/nl\fR [\fB-p\fR] [\fB-b\fR \fItype\fR] [\fB-d\fR \fIdelim\fR] [\fB-f\fR \fItype\fR] 
     [\fB-h\fR \fItype\fR] [\fB-i\fR \fIincr\fR] [\fB-l\fR \fInum\fR] [\fB-n\fR \fIformat\fR] [\fB-s\fR \fIsep\fR] 
     [\fB-w\fR \fIwidth\fR] [\fB-v\fR \fIstartnum\fR] [\fIfile\fR]
.fi

.SH 機能説明
.sp
.LP
\fBnl\fR ユーティリティーは、指定された \fIfile\fR から行を読み取り (あるいは \fIfile\fR が指定されない場合は標準入力から読み取り)、行を標準出力に再作成します。有効なコマンド行オプションの指定に従って、行の左側に番号が付けられます。
.sp
.LP
\fBnl\fR は、読み取ったテキストを論理ページとして表示します。行番号は、各論理ページの先頭でリセットされます。論理ページは、ヘッダー、本体、およびフッターのセクションで構成されています。空のセクションは有効です。ヘッダー、本体、およびフッターに対して異なる行番号のオプションを別々に使用できます。たとえば、\fB-bt\fR (デフォルト) は、本体セクションのブランク以外の行に番号を付け、ヘッダーセクションおよびフッターセクションの行には番号を付けません。
.sp
.LP
論理ページセクションの開始は、次の区切り文字のみを含む入力行で示されます。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
行の内容次の開始
_
\:\:\:ヘッダー
_
\:\:本体
_
\:フッター
.TE

.sp
.LP
特にオプションで指定されないかぎり、\fBnl\fR では、読み取られるテキストは、単一の論理ページ本体であると想定されます。
.SH オプション
.sp
.LP
コマンドオプションは任意の順序で指定でき、オプションのファイル名を間に入れることもできます。ファイルは 1 つだけ指定できます。コマンド行にオプションが入力されない場合、指定されたデフォルトが使用されます。\fB/usr/xpg4/bin/nl\fR オプションはオプション引数が必要です。\fBスペース\fR文字でオプションとオプション引数を区切ることが\fBできます\fR。\fB/usr/bin/nl\fR オプションにはオプション引数を指定することが\fBできます\fR。\fB/usr/bin/nl\fR オプションのオプション引数が指定されない場合、これらのオプションはデフォルトになります。サポートされているオプションは次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-b\fR\fItype\fR\fR
.ad
.RS 14n
.rt  
番号を付ける論理ページ本体の行を指定します。認識される \fItype\fR およびその意味は次のとおりです。  
.sp
.ne 2
.mk
.na
\fB\fBa\fR\fR
.ad
.RS 8n
.rt  
すべての行に番号を付けます
.RE

.sp
.ne 2
.mk
.na
\fB\fBt\fR\fR
.ad
.RS 8n
.rt  
空白でないすべての行に番号を付けます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBn\fR\fR
.ad
.RS 8n
.rt  
行番号を付けません
.RE

.sp
.ne 2
.mk
.na
\fB\fBp\fIexp\fR\fR\fR
.ad
.RS 8n
.rt  
\fIexp\fR で指定される正規表現を含む行にのみ番号を付けます。 (「注意事項」を参照)
.RE

論理ページ本体のデフォルトの \fItype\fR は \fBt\fR (テキスト行に番号を付ける) です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fItype\fR\fR
.ad
.RS 14n
.rt  
フッターであること以外は \fB-b\fR\fItype\fR と同じです。論理ページフッターのデフォルトの \fItype\fR は \fBn\fR (行番号を付けない) です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fIdelim\fR\fR
.ad
.RS 14n
.rt  
論理ページセクションの開始位置を指定する 2 つの区切り文字を、デフォルトの文字 (\ : ) から 2 つのユーザー指定文字に変更できます。1 文字のみ入力された場合、2 番目の文字はデフォルトの文字 (:) のままになります。\fB-d\fR と区切り文字の間にスペースを含めないでください。バックスラッシュを入力する場合、2 つのバックスラッシュを使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fItype\fR\fR
.ad
.RS 14n
.rt  
ヘッダーであること以外は \fB-b\fR\fItype\fR と同じです。論理ページヘッダーのデフォルトの \fItype\fR は \fBn\fR (行番号を付けない) です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fIincr\fR\fR
.ad
.RS 14n
.rt  
\fIincr\fR は、論理ページの行への番号付けに使用される増分値です。デフォルトの \fIincr\fR は \fB1\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fInum\fR\fR
.ad
.RS 14n
.rt  
\fInum\fR は、1 つとしてみなされる空白行の数です。たとえば、\fB-l2\fR では、隣接する 2 番目の空白にのみ番号が付けられます (適切な \fB-ha\fR、\fB-ba\fR、および/または \fB-fa\fR オプションが設定されている場合)。デフォルトの \fInum\fR は \fB1\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fIformat\fR\fR
.ad
.RS 14n
.rt  
\fIformat\fR は行番号の書式です。認識される値は次のとおりです。  
.sp
.ne 2
.mk
.na
\fB\fBln\fR\fR
.ad
.RS 6n
.rt  
左詰めで、先行するゼロは非表示
.RE

.sp
.ne 2
.mk
.na
\fB\fBrn\fR\fR
.ad
.RS 6n
.rt  
右詰めで、先行するゼロは非表示
.RE

.sp
.ne 2
.mk
.na
\fB\fBrz\fR\fR
.ad
.RS 6n
.rt  
右詰めで、先行するゼロを保持
.RE

デフォルトの \fIformat\fR は \fBrn\fR (右詰め) です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.RS 14n
.rt  
論理ページの区切り文字において番号付けを再開しません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fIsep\fR\fR
.ad
.RS 14n
.rt  
\fIsep\fR は、行番号と対応するテキスト行とを区切るために使用される文字です。デフォルトの \fIsep\fR は \fBTAB\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fIstartnum\fR\fR
.ad
.RS 14n
.rt  
\fIstartnum\fR は、論理ページの行への番号付けに使用される初期値です。デフォルトの \fIstartnum\fR は \fB1\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-w\fR\fIwidth\fR\fR
.ad
.RS 14n
.rt  
\fIwidth\fR は、行番号に使用する文字数です。デフォルトの \fIwidth\fR は \fB6\fR です。
.RE

.SH オペランド
.sp
.LP
次のオペランドを指定できます。
.sp
.ne 2
.mk
.na
\fB\fIfile\fR\fR
.ad
.RS 8n
.rt  
行番号を付けるテキストファイルのパス名。
.RE

.SH 使用例
.LP
\fB例 1 \fRnl コマンドの例
.sp
.LP
次のコマンド

.sp
.in +2
.nf
example% \fBnl -v10 -i10 -d!+ filename1\fR
.fi
.in -2
.sp

.sp
.LP
このコマンドでは、ページ本体の最初の行の番号が \fB10\fR、ページ本体の 2 行目の番号が \fB20\fR、3 行目の番号が \fB30\fR というようになります。論理ページの区切り文字は !+ です。

.SH 環境
.sp
.LP
\fBnl\fR の実行に影響を与える次の環境変数についての詳細は、\fBenviron\fR(5) を参照してください。\fBLANG\fR、\fBLC_ALL\fR、\fBLC_COLLATE\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR、および \fBNLSPATH\fR。
.SH 終了ステータス
.sp
.LP
次の終了ステータスが返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB>\fB0\fR\fR
.ad
.RS 6n
.rt  
エラーが発生した。
.RE

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/locale/\fIlocale\fR/LC_COLLATE/CollTable\fR\fR
.ad
.sp .6
.RS 4n
\fBlocaledef\fR によって生成される照合表
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/locale/\fIlocale\fR/LC_COLLATE/coll.so\fR\fR
.ad
.sp .6
.RS 4n
文字列変換ライブラリルーチンを含む共有オブジェクト
.RE

.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.SS "/usr/bin/nl"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
.TE

.SS "/usr/xpg4/bin/nl"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/xopen/xcu4
_
インタフェースの安定性確実
_
標準T{
\fBstandards\fR(5) を参照してください。
T}
.TE

.SH 関連項目
.sp
.LP
\fBpr\fR(1), \fBattributes\fR(5), \fBenviron\fR(5), \fBregex\fR(5), \fBregexp\fR(5), \fBstandards\fR(5)
.SH 注意事項
.sp
.LP
POSIX および「C」ロケールでは、国際化された正規表現が使用されます。ほかのロケールでは、国際化された正規表現は、次の 2 つの条件が満たされた場合に使用されます。
.RS +4
.TP
.ie t \(bu
.el o
\fB/usr/lib/locale/\fIlocale\fR/LC_COLLATE/CollTable\fR が存在する。
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB/usr/lib/locale/\fIlocale\fR/LC_COLLATE/coll.so\fR が存在しない。
.RE
.sp
.LP
それ以外の場合、単純な正規表現が使用されます。
.sp
.LP
国際化された正規表現については、\fBregex\fR(5) で説明されています。単純な正規表現については、\fBregexp\fR(5) で説明されています。
