Alhadis/Silos/Solaris 11.3/ja_JP.UTF-8/man1/ptree.1
'\" te
.\" Copyright (c) 2005, 2011, Oracle and/or its affiliates. All rights reserved.
.TH ptree 1 "2011 年 3 月 29 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
ptree \- プロセスツリーを表示する
.SH 形式
.LP
.nf
\fB/usr/bin/ptree\fR [\fB-a\fR] [\fB-c\fR] [\fB-z\fR \fIzone\fR] [\fIpid\fR | \fIuser\fR]...
.fi

.SH 機能説明
.sp
.LP
\fBptree\fR ユーティリティーは、指定した \fIpid\fR または \fIuser\fR を含むプロセスツリーを表示します。子プロセスは各親プロセスからインデントされて表示されます。すべて数字の引数はプロセス ID と解釈され、それ以外の場合はユーザーログイン名と見なされます。デフォルトはすべてのプロセスです。
.SH オプション
.sp
.LP
サポートしているオプションは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 11n
.rt  
すべて。プロセス 0 の子を含む、すべてのプロセスを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 11n
.rt  
契約。親子関係に加えて、プロセス契約メンバーシップを表示します。\fBprocess\fR(4) を参照してください。このオプションは、\fB-a\fR オプションの意味を含んでいます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR \fIzone\fR\fR
.ad
.RS 11n
.rt  
ゾーン。指定された \fIzone\fR 内のプロセスだけを表示します。各ゾーン \fBID\fR は、ゾーン名または数値のゾーン \fBID\fR のどちらでも指定できます。 
.sp
このオプションは、グローバルゾーンで実行する場合にのみ便利です。
.RE

.SH オペランド
.sp
.LP
次のオペランドがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fIpid\fR \fR
.ad
.RS 9n
.rt  
プロセス ID またはプロセス ID のリスト。\fBptree\fR では、\fB/proc/\fR\fInnn\fR もプロセス ID として認識されるため、シェル展開 \fB/proc/*\fR を使用すると、システム内のすべてのプロセスを指定できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fIuser\fR \fR
.ad
.RS 9n
.rt  
ユーザー名またはユーザー名のリスト。実効ユーザー ID が指定されたものと一致するプロセスが表示されます。 
.RE

.SH 使用例
.LP
\fB例 1 \fR\fBptree\fR の使用
.sp
.LP
次の例では、コマンド名 \fBssh\fR に一致するプロセスのプロセスツリー (プロセス 0 の子を含む) を表示します。 

.sp
.in +2
.nf
$ ptree -a `pgrep ssh`
        1     /usr/sbin/init
          100909 /usr/lib/ssh/sshd
            569150 /usr/lib/ssh/sshd
              569157 /usr/lib/ssh/sshd
                569159 -ksh
                  569171 bash
                    569173 /bin/ksh
                      569193 bash
.fi
.in -2
.sp

.SH 終了ステータス
.sp
.LP
次の終了ステータスが返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 12n
.rt  
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB0 以外\fR
.ad
.RS 12n
.rt  
エラーが発生しました。
.RE

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/proc/*\fR\fR
.ad
.RS 11n
.rt  
プロセスファイル
.RE

.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
インタフェースの安定性下記を参照。
.TE

.sp
.LP
人間が読める形式の出力は「不確実」です。オプションは「確実」です。
.SH 関連項目
.sp
.LP
\fBgcore\fR(1), \fBldd\fR(1), \fBpargs\fR(1), \fBpgrep\fR(1), \fBpkill\fR(1), \fBplimit\fR(1), \fBpmap\fR(1), \fBpreap\fR(1), \fBproc\fR(1), \fBps\fR(1), \fBppgsz\fR(1), \fBpwd\fR(1), \fBrlogin\fR(1), \fBtime\fR(1), \fBtruss\fR(1), \fBwait\fR(1), \fBfcntl\fR(2), \fBfstat\fR(2), \fBsetuid\fR(2), \fBdlopen\fR(3C), \fBsignal.h\fR(3HEAD), \fBcore\fR(4), \fBproc\fR(4), \fBprocess\fR(4), \fBattributes\fR(5), \fBzones\fR(5)
