Alhadis/Silos/Solaris 11.3/ja_JP.UTF-8/man1/stty.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2009, 2013, Oracle and/or its affiliates. All rights reserved.
.\" Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/. 
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation. In the following statement, the phrase "this text" refers to portions of the system documentation. Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html. This notice shall appear on any product containing this material.
.TH stty 1 "2009 年 5 月 20 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
stty \- 端末用オプションの設定
.SH 形式
.LP
.nf
\fB/usr/bin/stty\fR [\fB-a\fR] [\fB-g\fR]
.fi

.LP
.nf
\fB/usr/bin/stty\fR [\fImodes\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/stty\fR [\fB-a\fR | \fB-g\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/stty\fR [\fImodes\fR]
.fi

.LP
.nf
\fB/usr/xpg6/bin/stty\fR [\fB-a\fR | \fB-g\fR]
.fi

.LP
.nf
\fB/usr/xpg6/bin/stty\fR [\fImodes\fR]
.fi

.SH 機能説明
.sp
.LP
\fBstty\fR コマンドは、現在標準入力に使用しているデバイスに 特定の端末入出力 (I/O) オプションを設定します。引数を指定しないで実行すると、\fBstty\fR は特定のオプションの設定を報告します。
.sp
.LP
この報告で、直前にキャレット (\fB^\fR) を伴う文字がある場合、そのオプションの値は対応する制御文字になります。たとえば、\fB^h\fR は CTRL-H を表します (CTRL-H は Backspace キーと同じ)。\fB^@\fR は、オプションに NULL 値があることを示しています。
.sp
.LP
\fBコントロール\fR\fBモード\fRから\fBローカルモード\fRに表示されているモードの詳細については、\fBtermio\fR(7I) を参照してください。\fBハードウェア\fR\fBフロー\fR\fB制御\fR\fBモード\fRと\fBクロックモード\fRに表示されているモードの詳細については、\fBtermiox\fR(7I) を参照してください。
.sp
.LP
「組み合わせモード」のセクションに示すオペランドを使用するときは、これより前のセクションで説明するオプションが必要です。\fB\fRあまり多くのオプションを組み合わせても意味がありませんが、組み合わせるオプションの数をチェックする機能は特に用意されていません。また、ハードウェアインタフェースの種類によっては、ハードウェアフロー制御オプションやクロックモードオプションがサポートされない場合があります。
.SH オプション
.sp
.LP
サポートしているオプションは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 6n
.rt  
使用端末のオプション設定をすべて標準出力に書き出します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR\fR
.ad
.RS 6n
.rt  
現在の設定を報告します。この報告は、他の \fBstty\fR コマンドの引数として使用できる形式で出力されます。ドライバが termious をサポートしている場合は termios 型、そうでない場合は termio 型の出力になります。
.RE

.SH オペランド
.sp
.LP
次の \fImode\fR オペランドがサポートされています。
.SS "制御モード"
.sp
.ne 2
.mk
.na
\fB\fBparenb\fR(\fB-parenb\fR)\fR
.ad
.RS 24n
.rt  
パリティの生成と検出を有効または無効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBparext\fR(\fB-parext\fR)\fR
.ad
.RS 24n
.rt  
拡張パリティの生成と、マークパリティおよびスペースパリティの検出を有効または無効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBparodd\fR(\fB-parodd\fR)\fR
.ad
.RS 24n
.rt  
奇数 (偶数) パリティーを選択します。\fBparext\fR が有効になっている場合はマーク (スペース) パリティーを選択します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcs5\fR \fBcs6\fR \fBcs7\fR \fB cs8\fR\fR
.ad
.RS 24n
.rt  
文字サイズを選択します (\fBtermio\fR(7I) を参照)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 24n
.rt  
ただちに回線を切断します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBhupcl\fR (\fB-hupcl\fR)\fR
.ad
.RS 24n
.rt  
最終的な終了時に接続を切断するかしないかを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBhup\fR (\fB-hup\fR)\fR
.ad
.RS 24n
.rt  
\fBhupcl\fR (\fB-hupcl\fR) と同じです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcstopb\fR (\fB-cstopb\fR)\fR
.ad
.RS 24n
.rt  
文字ごとに 2 つ (1 つ) の停止ビットを使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcread\fR (\fB-cread\fR)\fR
.ad
.RS 24n
.rt  
受信を有効または無効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcrtscts\fR (\fB-crtscts\fR)\fR
.ad
.RS 24n
.rt  
出力ハードウェアフロー制御を有効にします。\fBRTS\fR (送信依頼) モデム制御回線を立てます。CTS (送信可能) 回線が立てられるまで、出力を保留します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcrtsxoff\fR (\fB-crtsxoff\fR)\fR
.ad
.RS 24n
.rt  
入力ハードウェアフロー制御を有効にします。データ受け取りのため \fBRTS\fR (送信依頼) モデム制御回線を立てます。RTS の信号がオフの場合、入力を保留します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBclocal\fR (\fB-clocal\fR)\fR
.ad
.RS 24n
.rt  
回線でモデム制御が行われていない、または行われているものと想定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdefeucw\fR \fR
.ad
.RS 24n
.rt  
マルチバイト文字の幅を、\fBLC_CTYPE\fR で指定された現在のロケールで定義されている値に設定します。内部的には、文字幅はバイト単位で文字ごとに表現されます。また、スクリーンまたはディスプレイカラムで文字ごとに表現されます。
.RE

.sp
.ne 2
.mk
.na
\fB110 300 600 1200 1800\fR
.ad
.br
.na
\fB2400 4800 9600 19200\fR
.ad
.br
.na
\fB38400 357600 76800 115200\fR
.ad
.br
.na
\fB153600 230400 307200 460800\fR
.ad
.sp .6
.RS 4n
端末ボーレートに指定された可能な数値を設定します。すべてのハードウェアインタフェースがすべての速度をサポートしているわけではありません。
.RE

.sp
.ne 2
.mk
.na
\fBispeed 0 110 300 600 1200\fR
.ad
.br
.na
\fB1800 2400 4800 9600 19200\fR
.ad
.br
.na
\fB38400 57600 76800 115200\fR
.ad
.br
.na
\fB153600 230400 307200 460800\fR
.ad
.sp .6
.RS 4n
端末入力ボーレートに指定された可能な数値を設定します。ただし、すべてのハードウェアが分割ボーレートをサポートしているわけではありません。入力ボーレートを \fB0\fR に設定すると、この値は出力ボーレートの値によって指定されます。
.RE

.sp
.ne 2
.mk
.na
\fBospeed 0 110 300 600 1200\fR
.ad
.br
.na
\fB1800 2400 4800 9600 19200\fR
.ad
.br
.na
\fB38400 57600 76800 115200\fR
.ad
.br
.na
\fB153600 230400 307200 460800\fR
.ad
.sp .6
.RS 4n
端末出力ボーレートに指定された可能な数値を設定します。ただし、すべてのハードウェアが分割ボーレートをサポートしているわけではありません。出力ボーレートを \fB0\fR に設定すると、ただちに回線が切断されます。
.RE

.SS "入力モード"
.sp
.ne 2
.mk
.na
\fB\fBignbrk\fR (\fB-ignbrk\fR)\fR
.ad
.RS 22n
.rt  
入力時のブレークを無視するかどうかを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBbrkint\fR (\fB-brkint\fR)\fR
.ad
.RS 22n
.rt  
ブレーク時に INTR シグナルを送るかどうかを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBignpar\fR (\fB-ignpar\fR)\fR
.ad
.RS 22n
.rt  
パリティエラーを無視するかどうかを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBparmrk\fR (\fB-parmrk\fR)\fR
.ad
.RS 22n
.rt  
パリティエラーをマークするかどうかを指定します (\fBtermio\fR(7I) を参照)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBinpck\fR (\fB-inpck\fR)\fR
.ad
.RS 22n
.rt  
入力パリティチェックを有効または無効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBistrip\fR (\fB-istrip\fR)\fR
.ad
.RS 22n
.rt  
入力文字を 7 ビットにストリップするか、ストリップしないかを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBinlcr\fR (\fB-inlcr\fR)\fR
.ad
.RS 22n
.rt  
入力時に NL を CR に変換するかどうかを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBigncr\fR (\fB-igncr\fR)\fR
.ad
.RS 22n
.rt  
入力時に CR を無視するかどうかを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBicrnl\fR (\fB-icrnl\fR)\fR
.ad
.RS 22n
.rt  
入力時に CR を NL に変換するかどうかを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBiuclc\fR (\fB-iuclc\fR)\fR
.ad
.RS 22n
.rt  
入力時に大文字のアルファベットを小文字のアルファベットに変換するかどうかを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBixon\fR (\fB-ixon\fR)\fR
.ad
.RS 22n
.rt  
START/STOP  出力制御を有効または無効にします。STOP 制御文字を送信することによって出力を停止し、 START 制御文字を送信することによって出力を開始します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBixany\fR (\fB-ixany\fR)\fR
.ad
.RS 22n
.rt  
任意の文字 (DC1 のみ) に出力の再開を許可します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBixoff\fR (\fB-ixoff\fR)\fR
.ad
.RS 22n
.rt  
入力待ち行列がほとんど空であるか、いっぱいになっているときに、システムから START/STOP 文字が送信されるように、またはされないようにします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBimaxbel\fR (\fB-imaxbel\fR)\fR
.ad
.RS 22n
.rt  
入力行が長すぎるときに、\fBBEL\fR をエコーするかしないかを指定します。\fBimaxbel\fR を設定した場合、入力ストリームがオーバーフローすると、\fBASCII BEL\fR の BEL 文字 (16 進数の \fB07\fR) がエコーされます。これ以上の入力は格納されませんが、すでに (入力待ち行列内に) 存在する入力には影響ありません。\fB-imaxbel\fR を設定しなかった場合、入力ストリームがオーバーフローしても、\fBBEL\fR 文字はエコーされず、入力待ち行列内に存在する (読み込まれていない) 入力はすべて破棄されます。 
.RE

.SS "出力モード"
.sp
.ne 2
.mk
.na
\fB\fBopost\fR (\fB-opost\fR)\fR
.ad
.RS 23n
.rt  
出力の後処理を行うかどうかを指定します。後処理を行わない場合は、他のすべての出力モードを無視します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBolcuc\fR (\fB-olcuc\fR)\fR
.ad
.RS 23n
.rt  
出力時に小文字のアルファベットを大文字のアルファベットに変換するかどうかを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBonlcr\fR (\fB-onlcr\fR)\fR
.ad
.RS 23n
.rt  
出力時に NL を CR-NL に変換するかどうかを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBocrnl\fR (\fB-ocrnl\fR)\fR
.ad
.RS 23n
.rt  
出力時に CR を NL に変換するかどうかを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBonocr\fR (\fB-onocr\fR)\fR
.ad
.RS 23n
.rt  
カラム 0 に CR を出力するかどうかを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBonlret\fR (\fB-onlret\fR)\fR
.ad
.RS 23n
.rt  
端末で NL が CR 関数を実行するかどうかを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBofill\fR (\fB-ofill\fR)\fR
.ad
.RS 23n
.rt  
遅延時に fill 文字を使用します。または、タイミングを使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBofdel\fR (\fB-ofdel\fR)\fR
.ad
.RS 23n
.rt  
fill 文字は DEL (NUL) です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcr0 cr1 cr2 cr3\fR\fR
.ad
.RS 23n
.rt  
キャリッジリターンの遅延スタイルを選択します (\fBtermio\fR(7I) を参照)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnl0 nl1\fR\fR
.ad
.RS 23n
.rt  
ラインフィードの遅延スタイルを選択します (\fBtermio\fR(7I) を参照)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtab0 tab1 tab2 tab3\fR\fR
.ad
.RS 23n
.rt  
水平タブの遅延スタイルを選択します (\fBtermio\fR(7I) を参照)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBbs0 bs1\fR\fR
.ad
.RS 23n
.rt  
バックスペースの遅延スタイルを選択します (\fBtermio\fR(7I) を参照)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBff0 ff1\fR\fR
.ad
.RS 23n
.rt  
フォームフィードの遅延スタイルを選択します (\fBtermio\fR(7I) を参照)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvt0 vt1\fR\fR
.ad
.RS 23n
.rt  
垂直タブの遅延スタイルを選択します (\fBtermio\fR(7I) を参照)。
.RE

.SS "ローカルモード"
.sp
.ne 2
.mk
.na
\fB\fBisig\fR(\fB-isig\fR)\fR
.ad
.RS 23n
.rt  
特殊制御文字 INTR、QUIT、SWTCH、SUSP に対する文字のチェックを有効または無効にします。\fBSWTCH\fR については、「\fB注意\fR」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBicanon\fR (\fB-icanon\fR)\fR
.ad
.RS 23n
.rt  
標準的な入力 (ERASE および KILL の処理) を有効または無効にします。\fBMIN\fR や \fBTIME\fR は設定されません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBxcase\fR (\fB-xcase\fR)\fR
.ad
.RS 23n
.rt  
標準的な (未処理の) 大文字/小文字を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBecho\fR (\fB-echo\fR)\fR
.ad
.RS 23n
.rt  
入力されたすべての文字を表示するかどうかを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBechoe\fR (\fB-echoe\fR)\fR
.ad
.RS 23n
.rt  
ERASE 文字を「バックスペース-スペース文字-バックスペース」の文字列として表示するかどうかを指定します。このモードを使用すると、多くの CRT 端末では、ERASE された文字が消去されます。ただし、このときカラム位置は記録されないので、エスケープした文字、タブ、バックスペースの区別が付きにくくなります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBechok\fR(\fB-echok\fR) \fR
.ad
.RS 23n
.rt  
KILL 文字の後の NL を表示するかどうかを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlfkc\fR (\fB-lfkc\fR)\fR
.ad
.RS 23n
.rt  
\fBechok\fR (\fB-echok\fR) と同じです。この指定は廃止されました。
.RE

.sp
.ne 2
.mk
.na
\fB\fBechonl\fR (\fB-echonl\fR)\fR
.ad
.RS 23n
.rt  
NL をエコーするかどうかを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnoflsh\fR (\fB-noflsh\fR)\fR
.ad
.RS 23n
.rt  
INTR、QUIT、SUSP の後のフラッシュを無効または有効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstwrap\fR (\fB-stwrap\fR)\fR
.ad
.RS 23n
.rt  
同期回線で \fB79\fR 文字より長い行の切り捨てを無効または有効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtostop\fR (\fB-tostop\fR)\fR
.ad
.RS 23n
.rt  
バックグラウンドプロセスが端末に書き込むときに、\fBSIGTTOU\fR を送信するかどうかを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBechoctl\fR \fB(\fR\fB-echoctl \fR\fB)\fR\fR
.ad
.RS 23n
.rt  
制御文字を \fB^\fR\fIchar\fR としてエコーし、\fB^?\fR として削除します。または、エコーしません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBechoprt\fR \fB(\fR\fB-echoprt \fR\fB)\fR\fR
.ad
.RS 23n
.rt  
消去文字を、消去されたものとしてエコーするかどうかを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBechoke\fR \fB(\fR\fB-echoke\fR\fB )\fR\fR
.ad
.RS 23n
.rt  
行の削除の際、BS-SP-BS で行全体を削除するかどうかを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBflusho\fR \fB(\fR\fB-flusho\fR\fB )\fR\fR
.ad
.RS 23n
.rt  
出力をフラッシュするかどうかを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBpendin\fR \fB(\fR\fB-pendin\fR\fB )\fR\fR
.ad
.RS 23n
.rt  
次の読み取りまたは入力文字で、保留中の入力を再入力するかどうかを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBiexten\fR \fB(\fR\fB-iexten\fR\fB )\fR\fR
.ad
.RS 23n
.rt  
現在、\fBicanon\fR、\fBisig\fR、\fBixon\fR、\fBixoff\fR のモード指定によって制御できない特殊な制御文字を有効または無効にします。このような特殊文字には、\fBVEOL\fR、\fBVSWTCH\fR、\fBVREPRINT\fR、\fBVDISCARD\fR、\fBVDSUSP\fR、\fBVWERASE\fR、\fBおよび\fR \fBVLNEXT\fR があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstflush\fR \fB(\fR\fB-stflush \fR)\fR
.ad
.RS 23n
.rt  
\fBwrite\fR(2) を実行するたびに、そのあとで同期回線でのフラッシュを有効または無効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBstappl\fR \fB(\fR\fB-stappl\fR) \fR
.ad
.RS 23n
.rt  
同期回線でアプリケーションモードまたは回線モードを使用します。
.RE

.SS "ハードウェアフロー制御モード"
.sp
.ne 2
.mk
.na
\fB\fBrtsxoff\fR (\fB-rtsxoff\fR)\fR
.ad
.RS 22n
.rt  
入力時に RTS ハードウェアフロー制御を有効または無効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBctsxon\fR (\fB-ctsxon\fR)\fR
.ad
.RS 22n
.rt  
出力時の CTS ハードウェアフロー制御を有効または無効にします 。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdtrxoff\fR (\fB-dtrxoff\fR)\fR
.ad
.RS 22n
.rt  
入力時の DTR ハードウェアフロー制御を有効または無効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcdxon\fR (\fB-cdxon\fR)\fR
.ad
.RS 22n
.rt  
出力時の CD ハードウェアフロー制御を有効または無効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBisxoff\fR (\fB-isxoff\fR)\fR
.ad
.RS 22n
.rt  
入力時の等時的なハードウェアフロー制御を有効または無効にします。
.RE

.SS "クロックモード"
.sp
.ne 2
.mk
.na
\fB\fBxcibrg\fR\fR
.ad
.RS 13n
.rt  
内部ボーレートジェネレータから送信クロックを取得します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBxctset\fR\fR
.ad
.RS 13n
.rt  
送信シグナル要素のリードタイミング (DCE ソース)、 CCITT V.24 回線 114、EIA-232-D ピン 15 から送信クロックを取得します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBxcrset\fR\fR
.ad
.RS 13n
.rt  
受信シグナル要素のリードタイミング (DCE ソース)、 CCITT V.24 回線 115、EIA-232-D ピン 17 から送信クロックを取得します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrcibrg\fR\fR
.ad
.RS 13n
.rt  
内部ボーレートジェネレータから受信クロックを取得します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrctset\fR\fR
.ad
.RS 13n
.rt  
送信シグナル要素のリードタイミング (DCE ソース)、CCITT V.24 回線 114、EIA-232-D ピン 15 から受信クロックを取得します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrcrset\fR\fR
.ad
.RS 13n
.rt  
受信シグナル要素のリードタイミング (DCE ソース)、 CCITT V.24 回線 115、EIA-232-D ピン 17 から受信クロックを取得します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtsetcoff\fR\fR
.ad
.RS 13n
.rt  
送信シグナル要素のタイミングクロックが提供されていません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtsetcrbrg\fR\fR
.ad
.RS 13n
.rt  
送信シグナル要素のリードタイミング (DTE ソース)、CCITT V.24 回線 113、EIA-232-D ピン 24 上の受信ボーレートジェネレータを出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtsetctbrg\fR\fR
.ad
.RS 13n
.rt  
受信シグナル要素のリードタイミング (DTE ソース)、CCITT V.24 回線 113、EIA-232-D ピン 24 上の送信ボーレートジェネレータを出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtsetctset\fR\fR
.ad
.RS 13n
.rt  
送信シグナル要素のリードタイミング (DTE ソース)、CCITT V.24 回線 113、EIA-232-D ピン 24 上の送信シグナル要素のタイミング (DCE ソース) を出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtsetcrset\fR\fR
.ad
.RS 13n
.rt  
送信シグナル要素のリードタイミング (DTE ソース)、CCITT V.24 回線 113、EIA-232-D ピン 24 上の受信シグナル要素のタイミング (DCE ソース) を出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrsetcoff\fR\fR
.ad
.RS 13n
.rt  
受信シグナル要素のタイミングクロックが提供されていません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrsetcrbrg\fR\fR
.ad
.RS 13n
.rt  
受信シグナル要素のリードタイミング (DTE ソース)、CCITT V.24 回線 128、非 EIA-232-D ピン上の受信ボーレートジェネレータを出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrsetctbrg\fR\fR
.ad
.RS 13n
.rt  
受信シグナル要素のリードタイミング (DTE ソース)、 CCITT V.24 回線 128、非 EIA-232-D ピン上の送信ボーレートジェネレータを出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrsetctset\fR\fR
.ad
.RS 13n
.rt  
受信シグナル要素のリードタイミング (DTE ソース)、CCITT V.24 回線 128、非 EIA-232-D ピン上の送信シグナル要素のタイミング (DCE ソース) を出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrsetcrset\fR\fR
.ad
.RS 13n
.rt  
受信シグナル要素のリードタイミング (DTE ソース)、CCITT V.24 回線 128、非 EIA-232-D ピン上の受信シグナル要素タイミング (DCE ソース) を出力します。
.RE

.SS "制御の割り当て"
.sp
.ne 2
.mk
.na
\fB\fIcontrol-character\fR \fIc\fR\fR
.ad
.sp .6
.RS 4n
\fIcontrol-character\fR を \fIc\fR に設定します。ここでは: 
.sp
.ne 2
.mk
.na
\fB\fIcontrol-character\fR\fR
.ad
.RS 21n
.rt  
\fBctab\fR、\fBdiscard\fR、\fBdsusp\fR、\fBeof\fR、\fBeol\fR、\fBeol2\fR、\fBerase\fR、\fBintr\fR、\fBkill\fR、\fBlnext\fR、\fBquit\fR、\fBreprint\fR、\fBstart\fR、\fBstop\fR、\fBsusp\fR、\fBswtch\fR、\fBwerase\fR (\fBctab\fR は \fB-stappl\fR とともに使用。\fBtermio\fR(7I) を参照)。\fBswtch\fR については、「注意」の節を参照してください。 
.RE

.sp
.ne 2
.mk
.na
\fB\fIc\fR\fR
.ad
.RS 21n
.rt  
\fIc\fR が単一の文字である場合、制御文字はその文字に設定されます。
.sp
POSIX ロケールでは、\fIc\fR の前にシェルからのエスケープを表すキャレット (\fB^\fR) が付いていて、次の表の \fI^c\fR カラムに表示されているうちの 1 つである場合、その使用されている値 (値カラム) は対応する制御文字です。たとえば、\fB^d\fR は CTRL-D を表し、\fB^?\fR は DEL と解釈されます。また、\fB^-\fR は未定義です。
.RE

.RE

.sp

.sp
.TS
tab() box;
cw(.92i) cw(.92i) cw(.92i) cw(.92i) cw(.92i) cw(.92i) 
lw(.92i) lw(.92i) lw(.92i) lw(.92i) lw(.92i) lw(.92i) 
.
\fB^\fR\fIc\fR\fB値\fR\fB^\fR\fIc\fR\fB値\fR\fB^\fR\fIc\fR\fB値\fR
\fBa\fR, A<SOH>\fBl\fR, L<FF>\fBw\fR, W<ETB>
\fBb\fR, B<STX>\fBm\fR, M<CR>\fBx\fR, X<CAN>
\fBc\fR, C<ETX>\fBn\fR, N<SO>\fBy\fR, Y<EM>
\fBd\fR, D<EOT>\fBo\fR, O<SI>\fBz\fR, Z<SUB>
\fBe\fR, E<ENQ>\fBp\fR, P<DLE>\fB[\fR<ESC>
\fBf\fR, F<ACK>\fBq\fR, Q<DC1>\fB\\fR<FS>
\fBg\fR, G<BEL>\fBr\fR, R<DC2>\fB]\fR<GS>
\fBh\fR, H<BS>\fBs\fR, S<DC3>\fB^\fR<RS>
\fBi\fR, I<HT>\fBt\fR, T<DC4>\fB_\fR<US>
\fBj\fR, J<LF>\fBu\fR, U<NAK>\fB?\fR<DEL>
\fBk\fR, K<VT>\fBv\fR, V<SYN>
.TE

.sp
.ne 2
.mk
.na
\fB\fBmin\fR \fInumber\fR\fR
.ad
.br
.na
\fB\fBtime\fR \fInumber\fR\fR
.ad
.RS 15n
.rt  
\fInumber\fR に \fBmin\fR または \fBtime\fR の値を設定します。\fBMIN\fR と \fBTIME\fR は非標準モードの入力処理 (\fB-icanon\fR) で使用されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBline\fR \fIi\fR\fR
.ad
.RS 15n
.rt  
回線制御手順を \fIi\fR に設定します (\fB0\fR< \fIi\fR <\fB127\fR)。
.RE

.SS "組み合わせモード"
.sp
.ne 2
.mk
.na
\fB\fIsaved\fR \fIsettings\fR\fR
.ad
.sp .6
.RS 4n
現在の端末特性を \fB-g\fR オプションで生成され、保存された設定に変更します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBevenp\fR または \fBparity\fR\fR
.ad
.sp .6
.RS 4n
\fBparenb\fR と \fBcs7\fR を有効にするか、\fBparodd\fR を無効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBoddp\fR\fR
.ad
.sp .6
.RS 4n
\fBparenb\fR、\fBcs7\fR、\fBparodd\fR を有効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBspacep\fR\fR
.ad
.sp .6
.RS 4n
\fBparenb\fR、\fBcs7\fR、\fBparext\fR を有効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmarkp\fR\fR
.ad
.sp .6
.RS 4n
\fBparenb\fR、\fBcs7\fR、\fBparodd\fR、\fBparext\fR を有効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-parity\fR または \fB-evenp\fR\fR
.ad
.sp .6
.RS 4n
\fBparenb\fR を無効にし、\fBcs8\fR を設定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-oddp\fR\fR
.ad
.sp .6
.RS 4n
\fBparenb\fR と \fBparodd\fR を無効にし、\fBcs8\fR を設定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-spacep\fR\fR
.ad
.sp .6
.RS 4n
\fBparenb\fR と \fBparext\fR を無効にし、\fBcs8\fR を設定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-markp\fR\fR
.ad
.sp .6
.RS 4n
\fBparenb\fR、\fBparodd\fR、\fBparext\fR を無効にし、\fBcs8\fR を設定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBraw\fR (\fB-raw\fR または \fBcooked\fR) \fR
.ad
.sp .6
.RS 4n
raw 入力と raw 出力を有効または無効にします。raw モードは次のように設定した場合と同等です。 
.sp
.in +2
.nf
stty cs8 -icanon min 1 time 0 -isig -xcase \e
    -inpck -opost
.fi
.in -2

.RE

.SS "/usr/bin/stty, /usr/xpg6/bin/stty"
.sp
.ne 2
.mk
.na
\fB\fBnl\fR (\fB-nl\fR)\fR
.ad
.RS 12n
.rt  
\fBicrnl\fR と \fBonlcr\fR の設定を解除、または設定します。\fB-nl\fR は、\fBinlcr\fR、\fBigncr\fR、\fBocrnl\fR、\fBonlret\fR の設定も解除します。
.RE

.SS "/usr/xpg4/bin/stty"
.sp
.ne 2
.mk
.na
\fB\fBnl\fR (\fB-nl\fR)\fR
.ad
.sp .6
.RS 4n
\fBicrnl\fR を設定、または設定解除します。\fB-nl\fR は、\fBinlcr\fR、\fBigncr\fR、\fBocrnl\fR、\fBonlret\fR の設定も解除します。つまり、\fB-nl\fR は \fBonlcr\fR を設定し、\fBnl\fR は \fBonlcr\fR の設定を解除します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlcase\fR (\fB-lcase\fR)\fR
.ad
.sp .6
.RS 4n
\fBxcase\fR、\fBiuclc\fR、\fBolcuc\fR を設定、または設定解除します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLCASE\fR (\fB-LCASE\fR)\fR
.ad
.sp .6
.RS 4n
\fBlcase\fR (\fB-lcase\fR) と同じです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtabs\fR (\fB-tabs\fR または \fBtab3\fR)\fR
.ad
.sp .6
.RS 4n
出力時にタブを保存 (スペースを拡張) します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBek\fR\fR
.ad
.sp .6
.RS 4n
ERASE  文字、KILL 文字を、通常の DEL および CTRL-u にそれぞれリセットします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsane\fR\fR
.ad
.sp .6
.RS 4n
すべてのモードを適切な値にリセットします。
.RE

.sp
.ne 2
.mk
.na
\fB\fIterm\fR\fR
.ad
.sp .6
.RS 4n
すべてのモードを端末タイプ \fIterm\fR に合うように設定します。ここで、\fIterm\fR は、\fBtty33\fR、\fBtty37\fR、\fBvt05\fR、\fBtn300\fR、\fBti700\fR、\fBtek\fR のいずれかです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBasync\fR\fR
.ad
.sp .6
.RS 4n
通常の非同期通信 (クロック設定が \fBxcibrg\fR、\fBrcibrg\fR、\fBtsetcoff\fR、\fBrsetcoff\fR) を設定します。
.RE

.SS "ウィンドウサイズ"
.sp
.ne 2
.mk
.na
\fB\fBrows\fR \fIn\fR\fR
.ad
.RS 13n
.rt  
ウィンドウサイズを \fIn\fR 行に設定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcolumns\fR \fIn\fR\fR
.ad
.RS 13n
.rt  
ウィンドウサイズを \fIn\fR カラムに設定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcols\fR \fIn\fR\fR
.ad
.RS 13n
.rt  
ウィンドウサイズを \fIn\fR カラムに設定します。\fBcols\fR は、columns の省略形です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBypixels\fR \fIn\fR\fR
.ad
.RS 13n
.rt  
垂直ウィンドウサイズを \fIn\fR ピクセルに設定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBxpixels\fR \fIn\fR\fR
.ad
.RS 13n
.rt  
水平ウィンドウサイズを \fIn\fR ピクセルに設定します。
.RE

.SH 使用法
.sp
.LP
\fB-g\fR フラグは、シェルレベルから端末状態の保存や復元を行うために 指定します。次に、プログラムの例を示します。 
.sp
.in +2
.nf
saveterm="$(stty -g)"      # save terminal state
stty (new settings)        # set new state
\&...                        # ...
stty $saveterm             # restore terminal state
.fi
.in -2
.sp

.sp
.LP
\fB-a\fR を使用すると、表記が冗長になります。このため、端末設定の保存および復元を行うスクリプトには、\fB-g\fR オプションを使用してください。
.SH 環境
.sp
.LP
\fBstty\fR の実行に影響を与える次の環境変数についての詳細は、\fBenviron\fR(5) を参照してください。\fBLANG\fR、\fBLC_ALL\fR、\fBLC_CTYPE\fR、\fBLC_MESSAGES\fR、および \fBNLSPATH\fR。
.SH 終了ステータス
.sp
.LP
次の終了ステータスが返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB>\fB0\fR\fR
.ad
.RS 6n
.rt  
エラーが発生した。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.SS "/usr/bin/stty"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
.TE

.SS "/usr/xpg4/bin/stty"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/xopen/xcu4
_
インタフェースの安定性確実
_
標準T{
\fBstandards\fR(5) を参照してください。
T}
.TE

.SS "/usr/xpg6/bin/stty"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/xopen/xcu6
_
インタフェースの安定性確実
_
標準T{
\fBstandards\fR(5) を参照してください。
T}
.TE

.SH 関連項目
.sp
.LP
\fBtabs\fR(1), \fBioctl\fR(2), \fBwrite\fR(2), \fBgetwidth\fR(3C), \fBattributes\fR(5), \fBenviron\fR(5), \fBstandards\fR(5), \fBldterm\fR(7M), \fBtermio\fR(7I), \fBtermiox\fR(7I)
.SH 注意事項
.sp
.LP
Solaris は System V リリース 4 の \fBsxt\fR ドライバが使用していた \fBswtch\fR のアクションをサポートしません。Solaris は、\fBswtch\fR 値を設定または出力できますが、\fBswtch\fR のアクションは実行できません。
.sp
.LP
Solaris 上のジョブ切り替え機能は、実際には、ジョブ制御により処理されます。これに対する正しい設定は \fBsusp\fR です。 
