Alhadis/Silos/Solaris 11.3/ja_JP.UTF-8/man1/userattr.1
'\" te
.\" Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
.TH userattr 1 "2010 年 7 月 15 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
userattr \- ユーザーまたは役割に付与された属性値の出力
.SH 形式
.LP
.nf
\fBuserattr\fR [\fB-v\fR] \fIattribute_name\fR [\fIuser\fR]
.fi

.SH 機能説明
.sp
.LP
\fBuserattr\fR コマンドは、属性 \fBattribute_name\fR で最初に見つかった値を標準出力に出力します。ユーザーが指定されていない場合、ユーザーはプロセスの実際のユーザー ID から取得されます。属性名は、\fBuser_attr\fR(4) および \fBprof_attr\fR(4) で定義されている中で見つかるものになります。ユーザーにプロファイルが割り当てられている場合は、\fBprofiles\fR(1) コマンドを使用します。ユーザーに承認が割り当てられている場合は、\fBauths\fR(1) コマンドを使用します。検索の順序は、ユーザーの \fBuser_attr\fR エントリのあとにユーザーのプロファイルが続きます。
.sp
.LP
属性 \fIattribute_name\fR がユーザーに割り当てられていない場合にエラーが発生すると、\fBuserattr\fR は 0 以外の終了コードを返します。\fB\fRそれ以外の場合、\fBuserattr\fR は \fB0\fR の終了コードを返します。
.sp
.LP
\fB-v\fR オプションを使用すると、属性が見つかった場所が追加で出力されます。
.SH 使用例
.LP
\fB例 1 \fR\fBuserattr\fR の使用
.sp
.in +2
.nf
example% userattr lock_after_retries root
no
.fi
.in -2
.sp

.SH ファイル
.sp
.LP
\fB/etc/user_attr\fR
.sp
.LP
\fB/etc/security/policy.conf\fR
.sp
.LP
\fB/etc/security/prof_attr\fR
.SH 終了ステータス
.sp
.LP
次の終了ステータスが返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
正常終了。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
エラーが発生した。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
インタフェースの安定性下記を参照。
.TE

.sp
.LP
終了コードは「確実」です。\fB-v\fR オプションの出力は「非インタフェース」です。
.SH 関連項目
.sp
.LP
\fBauths\fR(1), \fBprofiles\fR(1), \fBpolicy.conf\fR(4), \fBprof_attr\fR(4), \fBuser_attr\fR(4), \fBattributes\fR(5)
