Alhadis/Silos/Solaris 11.3/ja_JP.UTF-8/man1/zlogin.1
'\" te
.\" Copyright (c) 2006, 2013, Oracle and/or its affiliates.All rights reserved.
.TH zlogin 1 "2013 年 12 月 12 日" "SunOS 5.11" "ユーザーコマンド"
.SH 名前
zlogin \- ゾーンにログインする
.SH 形式
.LP
.nf
\fBzlogin\fR [\fB-dCETU\fR] [\fB-e\fR \fIc\fR] [\fB-l\fR \fIusername\fR] \fIzonename\fR
.fi

.LP
.nf
\fBzlogin\fR [\fB-ESTU\fR] [\fB-e\fR \fIc\fR] [\fB-l\fR \fIusername\fR] \fIzonename\fR \fIutility\fR 
     [\fIargument\fR]...
.fi

.SH 機能説明
.sp
.LP
\fBzlogin\fR ユーティリティーは、オペレーティングシステムゾーンにログインするために使用します。このユーティリティーは、大域システムゾーンで操作しているユーザーのみが使用できますが、すべての特権で実行する必要があります。さらに、ユーザーは「オプション」セクションで説明されている、特定のオプションを使用することが承認されている必要があります。\fB\fR
.sp
.LP
\fBzlogin\fR は、前にスラッシュ文字が付き、接尾辞として指定された \fBzonename\fR に任意で含まれる承認文字列をチェックします。省略すると、承認はすべてのゾーンと一致します。
.sp
.LP
\fBzlogin\fR は、次の 3 つのモードのいずれかで動作します。
.sp
.ne 2
.mk
.na
\fB対話型モード\fR
.ad
.RS 28n
.rt  
ユーティリティーの引数を指定せず、\fBzlogin\fR プロセスの標準入力ファイル記述子が tty デバイスの場合、\fBzlogin\fR は\fB対話型モード\fRで動作します。このモードの \fBzlogin\fR は、ログインセッションで使用するための新しい仮想端末を作成します。tty デバイスを必要とするプログラム (\fBvi\fR(1) など) は、このモードで正しく動作します。このモードの \fBzlogin\fR は、\fBlogin\fR(1) を呼び出すことで適切なログインセッションを生成します。
.RE

.sp
.ne 2
.mk
.na
\fB非対話型モード\fR
.ad
.RS 28n
.rt  
ユーティリティーを指定した場合、\fBzlogin\fR は\fB非対話型モード\fRで動作します。このモードで使用した場合でも、\fB標準入力\fR、\fB標準出力\fR、および\fB標準エラー出力\fRを使用することができ、終了時に \fIutility\fR の終了ステータスが返されるので、スクリプトを作成するときにも利用できます。このモードの \fBzlogin\fR は、ユーザーの環境を設定するために \fBsu\fR(1M) を呼び出して、ログイン環境を生成します。
.sp
指定されたコマンドは文字列として渡され、非大域ゾーンで実行されているシェルによって解釈されます。\fBrsh\fR(1) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fBコンソールモード\fR
.ad
.RS 28n
.rt  
\fB-C\fR オプションを指定した場合、ゾーンコンソールデバイスに接続され、\fBzlogin\fR は\fBコンソールモード\fRで動作します。ゾーンコンソールは、そのゾーンがインストール済みの状態になると使用可能になります。コンソールへの接続は、ゾーンをリブートしても切断されることはありません。
.RE

.SH オプション
.sp
.LP
サポートしているオプションは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-C\fR\fR
.ad
.RS 15n
.rt  
ゾーンコンソールに接続します。ゾーンコンソールにアクセスするには、承認 \fBzone.manage/\fIzonename\fR\fR が必要です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 15n
.rt  
ゾーンが停止している場合は、コンソールから切断します。このオプションは、\fB-C\fR とともにのみ指定できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR \fIc\fR\fR
.ad
.RS 15n
.rt  
拡張機能にアクセスしたり、ログインから切断したりするためのキーシーケンスを使用する場合は、別のエスケープ文字 \fIc\fR を指定します。デフォルトのエスケープ文字はチルド (\fB~\fR) です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-E\fR\fR
.ad
.RS 15n
.rt  
エスケープシーケンス文字を使用して拡張機能にアクセスしたり、ログインから切断したりする機能を無効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIusername\fR\fR
.ad
.RS 15n
.rt  
ゾーンログイン時のユーザー名として別の名前 (\fIusername\fR) を指定します。このオプションを使用しない場合、使用されるゾーンのユーザー名は \fBroot\fR です。このオプションは、\fB-C\fR オプションを指定した場合には無効になります。
.sp
ユーザー名は、ゾーン内で有効である必要があります。対話型ログインでは、\fBsolaris.zone.login/\fIzonename\fR\fR の承認が必要であり、パスワード承認がゾーンで実行されます。非対話型ログインの場合、またはパスワード承認を省略する場合は、\fBsolaris.zone.manage/\fIzonename\fR\fR の承認が必要です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR\fR
.ad
.RS 15n
.rt  
「安全な」ログインモード。\fB\fR\fBzlogin\fR は、\fBlogin\fR(1) や \fBsu\fR(1M) を呼び出さずに、最小限の処理を行います。ゾーンのユーザー名は \fBroot\fR に設定されます。\fB-l\fR オプションを使用してユーザー名を指定した場合は、\fB-S\fR オプションを使用できません。このモードは、コンソールログインでは使用できません。このモードは、ほかの形式のログインを使用できなくなったときに、破損したゾーンを回復するためだけに使用してください。
.sp
このオプションを使用するには、\fBsolaris.zone.manage/\fIzonename\fR\fR の承認が必要です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-T\fR \fR
.ad
.RS 15n
.rt  
不変なゾーンを「トラステッドパスドメイン」メンバーとして入力します。このセッションは、通常は不変であるファイルを変更できます。そのようなプロセスは、保護されていないファイルを読み取れません。\fB-T\fR オプションはコンソールログインでは使用できません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-U\fR\fR
.ad
.RS 15n
.rt  
\fB-T\fR オプションに似ていますが、「unsafe」モードをオンにします。
.RE

.SS "エスケープシーケンス"
.sp
.LP
端末から入力した行がチルド (\fB~\fR) で始まっている場合、その行はエスケープシーケンスと見なされます。\fB-e\fR オプションを使って、エスケープ文字をチルド以外に変更することもできます。
.sp
.ne 2
.mk
.na
\fB\fB~.\fR\fR
.ad
.RS 6n
.rt  
ゾーンから切断します。この操作はログアウトとは異なります。ローカルホストが接続を切断しても、ゾーンが終了するという警告は通知されません。
.RE

.SH セキュリティ
.sp
.LP
大域ゾーン以外のゾーンに実装されたプロセスは、そのゾーンを変更することはできず、すべての子プロセスもゾーンを変更できません。
.SH オペランド
.sp
.LP
次のオペランドがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fIzonename\fR\fR
.ad
.RS 15n
.rt  
ログインするゾーンの名前。
.RE

.sp
.ne 2
.mk
.na
\fB\fIutility\fR \fR
.ad
.RS 15n
.rt  
指定したゾーンで実行するユーティリティー。
.RE

.sp
.ne 2
.mk
.na
\fB\fIargument...\fR\fR
.ad
.RS 15n
.rt  
ユーティリティーに渡す引数。
.RE

.SH 終了ステータス
.sp
.LP
対話型モードおよび非対話型モードでは、非大域ゾーンでコマンドまたはシェルが終了すると、\fBzlogin\fR ユーティリティーは終了します。非対話型モードでは、リモートプログラムの終了ステータスは \fBzlogin\fR の終了ステータスとして返されます。対話型モードとコンソールログインモードでは、終了ステータスは返されません。\fBzlogin\fR は、接続関連のエラーが発生した場合を除いて、終了ステータスとして \fB0\fR を返します。
.sp
.LP
すべてのモードについて、ゾーンへの接続を確立できなかった場合には、予期しないステータスで接続に失敗するか、または要求した操作を実行するために必要な特権がユーザーにないために、\fBzlogin\fR はステータス \fB1\fR で終了します。
.sp
.LP
要約すると、次の終了値が返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 7n
.rt  
ログインに成功しました。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 7n
.rt  
アクセス権が拒否されたか、またはゾーンへのログインに失敗しました。
.RE

.sp
.ne 2
.mk
.na
\fBAny\fR
.ad
.RS 7n
.rt  
ユーティリティー、または \fBsu\fR(1M) (非対話型モードで操作している場合) からコードが返される。
.sp
\fBsolaris-kz\fR ブランドゾーンで、新しいターミナルドライバインスタンスを作成し、必要に応じて、シェルを生成する zvlogin というスタブプロセスを起動することによって、コンソール以外のログインが実装されます。そのため、zlogin を機能させるため、ゾーンを特定のポイントでブートする必要があります (svc:/system/sysevent:default サービスが実行するように)。ほかのすべての点で、目に見える動作は同じです。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/zones
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBlogin\fR(1), \fBrsh\fR(1), \fBvi\fR(1), \fBsu\fR(1M), \fBzoneadm\fR(1M), \fBzonecfg\fR(1M), \fBattributes\fR(5), \fBtpd\fR(5), \fBzones\fR(5)
.SH 注意事項
.sp
.LP
\fBzlogin\fR は、このユーティリティーが開いているファイルまたはユーティリティーのアドレス空間の一部が NFS ファイルに対応している場合、失敗します。この問題は、実行可能ファイル自体または共有ライブラリも関係します。
