Alhadis/Silos/Solaris-11.3/zh_CN.UTF-8/man5/dhcp.5
'\" te
.\" Copyright (c) 2001, 2011, Oracle and/or its affiliates.All rights reserved.
.TH dhcp 5 "2011 年 6 月 23 日" "SunOS 5.11" "标准、环境和宏"
.SH 名称
dhcp \- 动态主机配置协议
.SH 描述
.sp
.LP
通过动态主机配置协议 (Dynamic Host Configuration Protocol, \fBDHCP\fR)，可以在 \fBTCP/IP\fR 网络中的主机系统引导时为该网络自动配置这些系统。\fBDHCP\fR 使用客户机/服务器机制：服务器存储客户机的配置信息，并在客户机请求时提供该信息。该信息可以包含客户机的 \fBIP\fR 地址，以及有关客户机可使用的网络服务的信息。 
.sp
.LP
本手册页提供 Oracle Solaris \fBDHCP\fR 实现的简短摘要。
.SS "Oracle Solaris DHCP 客户机"
.sp
.LP
Oracle Solaris DHCP 客户机作为后台守护进程 \fBdhcpagent\fR(1M) 来实现。
.sp
.LP
对于 IPv4，如果 \fB/etc\fR 中至少存在一个 \fBdhcp.\fR\fIinterface\fR 文件，此守护进程在引导期间将自动启动。仅具有相应 \fB\fR\fB/etc/dhcp.\fR\fB\fI interface\fR\fR 文件的接口才会在引导期间自动配置。 
.sp
.LP
对于 IPv6，此守护进程将在 \fBin.ndpd\fR（基于 IPv6 路由通告消息）发出命令时自动启动。不需要任何 \fB/etc/dhcp\fR.\fIinterface\fR 文件，但此类文件可用于将某个接口指定为“主接口”，条件是 IPv4 DHCP 也在使用中。
.sp
.LP
将通过使用 \fBdhcpinfo\fR(1) 命令从守护进程收到的信息中提取引导期间系统配置所需的网络参数。可通过更改 \fB/etc/default/dhcpagent\fR 文件中的可调参数来更改守护进程的缺省行为。守护进程由 \fBifconfig\fR(1M)实用程序控制。使用 \fBnetstat\fR(1M) 和 \fBifconfig\fR(1M) 命令检查守护进程的状态。 
.SS "Oracle Solaris DHCP 服务器"
.sp
.LP
Oracle Solaris \fBDHCP\fR 服务器作为后台守护进程 \fBin.dhcpd\fR(1M) 来实现。此守护进程可以将网络配置信息传输到 \fBBOOTP\fR 或 \fBDHCP\fR 客户机。Oracle Solaris \fBDHCP\fR 服务可使用 \fBdhcpmgr\fR(1M) \fBGUI\fR 进行管理，或使用命令行实用程序 \fBdhcpconfig\fR(1M)、\fBdhtadm\fR(1M) 和 \fBpntadm\fR(1M) 进行管理。
.sp
.LP
Oracle Solaris DHCP 服务器已过时。改用 ISC DHCP 服务器。请参见 \fBusr/share/man/man5/isc-dhcp.5\fR
.SS "DHCP 配置表"
.sp
.LP
Oracle Solaris \fBDHCP\fR 服务器将客户机配置信息存储在以下两种类型的表中： 
.sp
.ne 2
.mk
.na
\fB\fBdhcptab\fR 表\fR
.ad
.RS 18n
.rt  
包含宏和选项（也称为符号），用于构建要发送到每个 \fBDHCP\fR 客户机的配置信息包。\fBDHCP\fR 服务仅存在一个 \fBdhcptab\fR。可使用 \fBdhtadm\fR(1M) 命令或 \fBdhcpmgr\fR(1M) 图形实用程序查看和修改 \fBdhcptab\fR(4)。有关 \fBdhcptab\fR 记录的语法的更多信息，请参见 \fBdhcptab\fR(4)。有关 \fBDHCP\fR 选项和符号的更多信息，请参见 \fBdhcp_inittab\fR(4)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBDHCP\fR 网络表\fR
.ad
.RS 18n
.rt  
\fBDHCP\fR 网络表，其中包含客户机 \fBID\fR 到 \fBIP\fR 地址的映射和与这些地址关联的参数。网络表以网络的 \fBIP\fR 地址命名，可以使用 \fBpntadm\fR 命令或 \fBdhcpmgr\fR 图形实用程序创建、查看和修改。有关网络表的更多信息，请参见 \fBdhcp_network\fR(4)。
.RE

.SH 另请参见
.sp
.LP
\fBdhcpinfo\fR(1)、\fBdhcpagent\fR(1M)、\fBdhcpconfig\fR(1M)、\fBdhcpmgr\fR(1M)、\fBdhtadm\fR(1M)、\fBifconfig\fR(1M)、\fBin.dhcpd\fR(1M)、\fBin.ndpd\fR(1M)、\fBnetstat\fR(1M)、\fBpntadm\fR(1M)、\fBsyslog\fR(3C)、\fBdhcp_network\fR(4)、\fBdhcptab\fR(4)、\fBdhcpsvc.conf\fR(4)、\fBdhcp_inittab\fR(4)、\fBndpd.conf\fR(4)、\fBdhcp_modules\fR(5)
.sp
.LP
\fBusr/share/man/man5/isc-dhcp.5\fR
.sp
.LP
\fI《Working With DHCP in Oracle Solaris 11.3》\fR
.sp
.LP
由 Alexander, S. 和 R.Droms. 合著的《\fIDHCP Options and BOOTP Vendor Extensions\fR》，RFC 2132。Silicon Graphics, Inc. 与 Bucknell University 出版，1997 年 3 月。
.sp
.LP
由 Droms, R. 编著的《\fIInteroperation Between DHCP and BOOTP\fR》，RFC 1534。Bucknell University 出版。1993 年 10 月。
.sp
.LP
由 Droms, R. 编著的《\fIDynamic Host Configuration Protocol\fR》，RFC 2131。Bucknell University 出版。1997 年 3 月。
.sp
.LP
由 Wimer, W. 编著的《\fIClarifications and Extensions for the Bootstrap Protocol\fR》，RFC 1542。Carnegie Mellon University 出版。1993 年 10 月。
.sp
.LP
由 Lemon, T. 和 B. Sommerfeld. 合著的《\fINode-specific Client Identifiers for Dynamic Host Configuration Protocol Version Four (DHCPv4)\fR》，RFC 4361。Nominum 和 Sun Microsystems 出版。2006 年 2 月。
.sp
.LP
由 Droms, R. 编著的《\fIDynamic Host Configuration Protocol for IPv6 (DHCPv6)\fR》，RFC 3315。Cisco Systems 出版。2003 年 7 月。
