Alhadis/Silos/Solaris-11.3/zh_CN.UTF-8/man5/grub.5
'\" te
.\" Copyright (c) 2005, 2012, Oracle and/or its affiliates.All rights reserved.
.TH grub 5 "2012 年 5 月 25 日" "SunOS 5.11" "标准、环境和宏"
.SH 名称
grub \- Oracle Solaris 上的 GRand Unified Bootloader 2 软件
.SH 描述
.sp
.LP
Oracle Solaris 操作系统的当前发行版附带了 GRUB (GRand Unified Bootloader) 2 软件。GRUB 由自由软件基金会开发并提供支持。
.sp
.LP
GRUB 手册概述（可从 \fBwww.gnu.org\fR 访问）对 GRUB 进行了介绍：
.sp
.LP
简单地说，引导装载程序就是在计算机启动时最先运行的软件程序。引导装载程序负责装入控件并将其传输到操作系统内核软件（如 Linux 或 GNU Mach），而内核又会初始化操作系统（例如，GNU [编辑注释：或 Solaris] 系统）的其余部分。
.sp
.LP
GNU GRUB 是一种十分强大的引导装载程序，可通过链式装入的方式装入各种免费以及专用的操作系统。GRUB 设计用于解决引导个人计算机的复杂性问题；该程序和此手册均与 GNU 计算机平台紧密相关，但将来可能会解决移植到其他平台的问题。注意：Oracle 已将 GRUB 移植到 Solaris 操作系统。
.sp
.LP
灵活性是 GRUB 的主要特点之一；GRUB 可识别文件系统和内核可执行文件格式，这使您可以随意装入任意操作系统，无需记录内核在磁盘上的物理位置。因此，您只需指定内核的文件名以及内核所在的驱动器和分区即可装入内核。
.sp
.LP
在 Solaris 计算机中，x86 平台上支持 GRUB。Solaris 附带的 GRUB 软件新增了一个实用程序，它们未在开源分发软件中提供：
.sp
.ne 2
.mk
.na
\fB\fBbootadm\fR(1M)\fR
.ad
.RS 15n
.rt  
用于管理引导归档文件以及更改 GRUB 菜单。
.RE

.sp
.LP
除了此 Solaris 特定的实用程序之外，在 GRUB 手册中还对 GRUB 软件进行了介绍，可从 Oracle Web 站点获取该手册的 PDF 版本。
.sp
.LP
因为 \fBbootadm\fR(1M) 提供了用于修改 GRUB 菜单的接口，所以大多数管理员无需手动执行 GRUB 实用程序（在具有 BIOS 固件的系统中位于 \fB/usr/lib/grub2/bios\fR，在具有 64 位 UEFI 固件的系统中位于 \fB/usr/lib/grub2/uefi64\fR）。
.sp
.LP
管理员不应手动编辑 GRUB 配置文件 \fBgrub.cfg\fR，该文件位于系统根池中顶层 ZFS 数据集的 \fB/boot/grub\fR 子目录中（即 \fB/rpool/boot/grub\fR）。当管理员使用 \fBbootadm\fR(1M) 更改引导配置时，会自动生成此文件。要直接创建 GRUB 菜单项的高级管理员必须编辑补充 GRUB 配置文件 \fBnamed custom.cfg\fR，该文件与 \fBgrub.cfg\fR 文件存储在同一目录中。请注意，在刚安装的系统上不存在此文件，因此管理员需要对其进行创建。
.SH 另请参见
.sp
.LP
\fBboot\fR(1M)、\fBbootadm\fR(1M)、\fBinstallgrub\fR(1M)
.sp
.LP
\fI《Installing Oracle Solaris 11.3 Systems》\fR
.sp
.LP
\fIIntroduction to Oracle Solaris 11.3                 Administration\fR
.sp
.LP
http://www.gnu.org/software/grub
.SH 附注
.sp
.LP
Solaris 的以前版本介绍了使用 \fBinstallgrub\fR(1M) 命令安装 GRUB 引导装载程序的方法。此命令已过时，提供此命令只为方便使用或用于灾难恢复和降级到 GRUB Legacy 作为系统引导装载程序的 Solaris 引导环境。有关更多详细信息，请参考“引导和关闭 Oracle Solaris”文档。
