Alhadis/Silos/Solaris-11.3/zh_CN.UTF-8/man5/iconv.5
'\" te
.\"  Copyright 1989 AT&T Copyright (c) 2001, Sun Microsystems, Inc. All Rights Reserved Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\"  Sun Microsystems, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation.Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/.
.\" The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation.In the following statement, the phrase "this text" refers to portions of the system documentation.Portions of this text are reprinted and reproduced in electronic form in the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group.In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document.The original Standard can be obtained online at http://www.opengroup.org/unix/online.html.This notice shall appear on any product containing this material. 
.TH iconv 5 "2001 年 12 月 5 日" "SunOS 5.11" "标准、环境和宏"
.SH 名称
iconv \- 代码集转换表
.SH 描述
.sp
.LP
支持以下代码集转换：
.sp
.in +2
.nf
               Code Set Conversions Supported

Code           Symbol   Target Code    Symbol   Target Output

ISO 646        646      ISO 8859-1     8859     US ASCII
ISO 646de      646de    ISO 8859-1     8859     German
ISO 646da      646da    ISO 8859-1     8859     Danish
ISO 646en      646en    ISO 8859-1     8859     English ASCII
ISO 646es      646es    ISO 8859-1     8859     Spanish
ISO 646fr      646fr    ISO 8859-1     8859     French
ISO 646it      646it    ISO 8859-1     8859     Italian
ISO 646sv      646sv    ISO 8859-1     8859     Swedish
ISO 8859-1     8859     ISO 646        646      7 bit ASCII
ISO 8859-1     8859     ISO 646de      646de    German
ISO 8859-1     8859     ISO 646da      646da    Danish
ISO 8859-1     8859     ISO 646en      646en    English ASCII
ISO 8859-1     8859     ISO 646es      646es    Spanish
ISO 8859-1     8859     ISO 646fr      646fr    French
ISO 8859-1     8859     ISO 646it      646it    Italian
ISO 8859-1     8859     ISO 646sv      646sv    Swedish
ISO 8859-16    iso16    ISO 8859-2     iso2     ISO Latin 2
ISO 8859-2     iso2     ISO 8859-16    iso16    ISO Latin 10
ISO 8859-16    iso16    IBM 850        ibm850   IBM 850 code page
ISO 8859-16    iso16    IBM 870        ibm870   IBM 870 code page
ISO 8859-2     iso2     MS 1250        win2     Windows Latin 2
ISO 8859-2     iso2     MS 852         dos2     MS-DOS Latin 2
ISO 8859-2     iso2     Mazovia        maz      Mazovia
IBM 850        ibm850   ISO 8859-16    iso16    ISO Latin 10
IBM 870        ibm870   ISO 8859-16    iso16    ISO Latin 10
MS 1250        win2     DHN            dhn      Dom Handlowy Nauki
MS 852         dos2     ISO 8859-2     iso2     ISO Latin 2
MS 852         dos2     MS 1250        win2     Windows Latin 2
MS 852         dos2     Mazovia        maz      Mazovia
MS 852         dos2     DHN            dhn      Dom Handlowy Nauki
Mazovia        maz      ISO 8859-2     iso2     ISO Latin 2
Mazovia        maz      MS 1250        win2     Windows Latin 2
Mazovia        maz      MS 852         dos2     MS-DOS Latin 2
Mazovia        maz      DHN            dhn      Dom Handlowy Nauki
DHN            dhn      ISO 8859-2     iso2     ISO Latin 2
DHN            dhn      MS 1250        win2     Windows Latin 2
DHN            dhn      MS 852         dos2     MS-DOS Latin 2
DHN            dhn      Mazovia        maz      Mazovia
ISO 8859-5     iso5     KOI8-R         koi8     KOI8-R
ISO 8859-5     iso5     PC Cyrillic    alt      Alternative PC Cyrillic
ISO 8859-5     iso5     MS 1251        win5     Windows Cyrillic
ISO 8859-5     iso5     Mac Cyrillic   mac      Macintosh Cyrillic
KOI8-R         koi8     ISO 8859-5     iso5     ISO 8859-5 Cyrillic
KOI8-R         koi8     PC Cyrillic    alt      Alternative PC Cyrillic
KOI8-R         koi8     MS 1251        win5     Windows Cyrillic
KOI8-R         koi8     Mac Cyrillic   mac      Macintosh Cyrillic
PC Cyrillic    alt      ISO 8859-5     iso5     ISO 8859-5 Cyrillic
PC Cyrillic    alt      KOI8-R         koi8     KOI8-R
PC Cyrillic    alt      MS 1251        win5     Windows Cyrillic
PC Cyrillic    alt      Mac Cyrillic   mac      Macintosh Cyrillic
MS 1251        win5     ISO 8859-5     iso5     ISO 8859-5 Cyrillic
MS 1251        win5     KOI8-R         koi8     KOI8-R
MS 1251        win5     PC Cyrillic    alt      Alternative PC Cyrillic
MS 1251        win5     Mac Cyrillic   mac      Macintosh Cyrillic
Mac Cyrillic   mac      ISO 8859-5     iso5     ISO 8859-5 Cyrillic
Mac Cyrillic   mac      KOI8-R         koi8     KOI8-R
Mac Cyrillic   mac      PC Cyrillic    alt      Alternative PC Cyrillic
Mac Cyrillic   mac      MS 1251        win5     Windows Cyrillic
.fi
.in -2
.sp

.SH 转换
.sp
.LP
转换是根据下面的“转换代码表索引”中交叉引用的手册页中所包含的相应表而执行的\fB\fR。
.sp

.sp
.TS
tab() box;
cw(1.83i) |cw(1.83i) |cw(1.83i) 
lw(1.83i) |lw(1.83i) |lw(1.83i) 
.
\fB转换代码表索引\fR
_
\fB代码\fR\fB目标代码\fR\fB需要参考的手册页\fR
_
ISO 646ISO 8859-1iconv_646 (5)
_
ISO 646deISO 8859-1
_
ISO 646daISO 8859-1
_
ISO 646enISO 8859-1
_
ISO 646esISO 8859-1
_
ISO 646frISO 8859-1
_
ISO 646itISO 8859-1
_
ISO 646svISO 8859-1
_
ISO 8859-1ISO 646iconv_8859-1 (5)
_
ISO 8859-1ISO 646de
_
ISO 8859-1ISO 646da
_
ISO 8859-1ISO 646en
_
ISO 8859-1ISO 646es
_
ISO 8859-1ISO 646fr
_
ISO 8859-1ISO 646it
_
ISO 8859-1ISO 646sv
_
ISO 8859-2MS 1250iconv_8859-2 (5)
_
ISO 8859-2MS 852
_
ISO 8859-2Mazovia
_
ISO 8859-2DHN
_
MS 1250ISO 8859-2iconv_1250 (5)
_
MS 1250MS 852
_
MS 1250Mazovia
_
MS 1250DHN
_
MS 852ISO 8859-2iconv_852 (5)
_
MS 852MS 1250
_
MS 852Mazovia
_
MS 852DHN
_
MazoviaISO 8859-2iconv_maz (5)
_
MazoviaMS 1250
_
MazoviaMS 852
_
MazoviaDHN
.TE

.sp

.sp
.TS
tab() box;
cw(1.83i) |cw(1.83i) |cw(1.83i) 
lw(1.83i) |lw(1.83i) |lw(1.83i) 
.
\fB转换代码表索引\fR
_
\fB代码\fR\fB目标代码\fR\fB需要参考的手册页\fR
_
DHNISO 8859-2 iconv_dhn (5)
_
DHNMS 1250
_
DHNMS 852
_
DHNMazovia
_
ISO 8859-5KOI8-R iconv_8859-5 (5)
_
ISO 8859-5PC Cyrillic
_
ISO 8859-5MS 1251
_
ISO 8859-5Mac Cyrillic
_
KOI8-RISO 8859-5iconv_koi8-r (5)
_
KOI8-RPC Cyrillic
_
KOI8-RMS 1251
_
KOI8-RMac Cyrillic
_
PC CyrillicISO 8859-5iconv_pc_cyr (5)
_
PC CyrillicKOI8-R
_
PC CyrillicMS 1251
_
PC CyrillicMac Cyrillic
_
MS 1251ISO 8859-5iconv_1251 (5)
_
MS 1251KOI8-R
_
MS 1251PC Cyrillic
_
MS 1251Mac Cyrillic
_
Mac CyrillicISO 8859-5iconv_mac_cyr (5)
_
Mac CyrillicKOI8-R
_
Mac CyrillicPC Cyrillic
_
Mac CyrillicMS 1251
.TE

.SH 文件
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/*.so\fR\fR
.ad
.sp .6
.RS 4n
转换模块
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/*.t\fR\fR
.ad
.sp .6
.RS 4n
转换表
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/geniconvtbl/binarytables/*.bt\fR\fR
.ad
.sp .6
.RS 4n
转换二进制表。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/iconv/iconv_data\fR\fR
.ad
.sp .6
.RS 4n
转换表所支持的转换的列表。
.RE

.SH 另请参见
.sp
.LP
\fBiconv\fR(1)、\fBiconv\fR(3C)、\fBiconv_1250\fR(5)、\fBiconv_1251\fR(5)、\fBiconv_646\fR(5)、\fBiconv_852\fR(5)、\fBiconv_8859-1\fR(5)、\fBiconv_8859-2\fR(5)、\fBiconv_8859-5\fR(5)、\fBiconv_dhn\fR(5)、\fBiconv_koi8-r\fR(5)、\fBiconv_mac_cyr\fR(5)、\fBiconv_maz\fR(5)、\fBiconv_pc_cyr\fR(5)、\fBiconv_unicode\fR(5) 
