Alhadis/Silos/Solaris-11.3/zh_CN.UTF-8/man5/labels.5
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.TH labels 5 "2007 年 7 月 20 日" "SunOS 5.11" "标准、环境和宏"
.SH 名称
labels \- Solaris Trusted Extensions 标签属性
.SH 描述
.sp
.LP
标签是在强制策略决策中使用的属性。标签显式或隐式地与所有主体（通常是进程）以及主体可访问的对象（通常是包含数据的东西，如文件）关联。缺省的 Trusted Extensions 强制策略标签是由站点的安全管理员在 \fBlabel_encodings\fR(4) 中定义的。
.SS "强制策略"
.sp
.LP
在 Solaris Trusted Extensions 的生命周期内可能会提供各种强制策略。
.sp
.LP
Trusted Extensions 的缺省强制策略是一种强制访问控制 (Mandatory Access Control, MAC) 策略，等效于“Bell-LaPadula 点阵模型”(Bell-LaPadula Model of the Lattice)、“简单安全属性”(Simple Security Property) 和“星属性”(*-Property) 的缺省强制策略，但向上写入受限。该缺省强制策略还等效于“Goguen 和 Mesegeur 非干涉模型”(Goguen and Mesegeur model of Non-Interference)。
.sp
.LP
此 MAC 策略始终定义两个标签：\fBadmin_low\fR 和 \fBadmin_high\fR。站点的安全管理员在 \fBlabel_encodings\fR(4) 中定义其他所有标签。\fBadmin_low\fR 与所有正常用户可读（可查看）的 Trusted Extensions 对象关联。\fBadmin_high\fR 与其他所有 Trusted Extensions 对象关联。只有管理用户有 \fBadmin_high\fR 对象的 MAC 读取（查看）访问权限，并且只有管理用户有 \fBadmin_low\fR 对象或 \fBadmin_high\fR 对象的 MAC 写入（修改）访问权限。
.SS "用户可读的标签"
.sp
.LP
用户将标签作为字符串进行交互。图形用户界面和命令行界面按 \fBlabel_encodings\fR(4) 中的定义呈现字符串。用户可读标签按其所代表的标签进行分类。因此，标签 \fBA\fR 的字符串仅能被其标签允许对该标签进行读取（查看）访问的主体读取（查看、转换为用户可读的内容或者从用户可读的内容转换为不透明的 \fBm_label_t\fR）。
.SS "内部文本标签"
.sp
.LP
要将标签存储在可公开访问的 (\fBadmin_low\fR) 名称服务数据库中，将使用未分类的内部文本格式。这种文本格式本来是不应在随创建了这种标签文本格式的 Trusted Extensions 软件发行版所提供的界面之外使用的。
.SS "标签和应用程序"
.sp
.LP
应用程序将标签作为不透明 (\fBm_label_t\fR) 结构进行交互。这些不透明结构的语义被字符串定义为 \fBm_label_t\fR 转换。此转换在 \fBlabel_encodings\fR(4) 中定义。各种应用程序编程接口 (Application Programming Interface, API) 进行字符串和 \fBm_label_t\fR 结构之间的转换。各种 API 测试与主体相关的标签对与对象相关的标签的访问权限。
.SH 属性
.sp
.LP
有关下列属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
接口稳定性请参见下文。
.TE

.sp
.LP
标签实现对于实现 \fBlabel_encodings\fR(4) 的国防情报局 (Defense Intelligence Agency, DIA) MAC 策略的系统为 "Committed"（已确定）。其他策略可能会出现在未来的 Trusted Extensions 发行版中，这可能会导致过时的或补充的 \fBlabel_encodings\fR。
.sp
.LP
内部文本标签不是接口，可能会随 Trusted Extensions 发行版而变化。它们应该仅用于相同发行版的 Trusted Extensions 软件上的输入和生成。
.sp
.LP
作为 Trusted Solaris 8 应用程序的潜在移植帮助，不透明的结构名称 \fBbslabel_t\fR、\fBblevel_t\fR 和 \fBbclear_t\fR 被定义为等效于 \fBm_label_t\fR。像 \fBm_label_t\fR 一样，这些类型必须作为不透明指针进行移植。必须对各种 Trusted Solaris 8 标签接口执行同样的操作。这些 Trusted Solaris 8 结构和接口已过时，可能会在未来的 Trusted Extensions 发行版中删除。
.SH 另请参见
.sp
.LP
\fBchk_encodings\fR(1M)、\fBblcompare\fR(3TSOL)、\fBlabel_to_str\fR(3TSOL)、\fBm_label_alloc\fR(3TSOL)、\fBm_label_dup\fR(3TSOL)、\fBm_label_free\fR(3TSOL)、\fBstr_to_label\fR(3TSOL)、\fBlabel_encodings\fR(4)、\fBattributes\fR(5)
.sp
.LP
由 Bell, D.E. 和 aPadula, L. J. 合著的《\fISecure Computer Systems: Unified Exposition and Multics Interpretation\fR》，MTR-2997 第 2 版，MITRE Corp.（马萨诸塞州贝德福德）出版，1976 年 3 月。NTIS AD-A023 588/7.
.sp
.LP
由 Goguen, J.A. 和 Mesegeur, J.合著的《\fISecurity Policies and Security Models\fR》（1982 年关于安全和隐私的座谈会的备忘录），IEEE Computer Society Press 出版，1982 年，第 11-20 页。
.sp
.LP
由 Goguen, J.A. 和 Mesegeur, J.合著的《\fIUnwinding and Interference Control\fR》,（1984 年关于安全和隐私的座谈会的备忘录），IEEE Computer Society Press 出版，1984 年，第 75-86 页。
.sp
.LP
\fI《Compartmented Mode Workstation Labeling: Encodings Format》\fR
.SH 附注
.sp
.LP
仅当系统配置有 Trusted Extensions 时，本手册页中介绍的功能才可用。
