Alhadis/Silos/Solaris-11.3/zh_CN.UTF-8/man5/solaris10.5
'\" te
.\" Copyright (c) 2009, 2015, Oracle and/or its affiliates.All rights reserved.
.TH solaris10 5 "2015 年 7 月 14 日" "SunOS 5.11" "标准、环境和宏"
.SH 名称
solaris10 \- Solaris 10 标记区域
.SH 描述
.sp
.LP
\fBsolaris10\fR 标记使用 \fBbrands\fR(5) 中介绍的标记区域框架，使得 Solaris 10 二进制应用程序无需经过修改即可在具有最新 Solaris 操作系统内核的计算机上运行。
.sp
.LP
Oracle Solaris 10 区域是用于承载在 Oracle Solaris 11 内核上运行的 x86 和 SPARC Solaris 10 9/10（或以后发行的 Oracle Solaris 10 更新）用户环境的 solaris10 标记区域。
.sp
.LP
请注意，如果首先在原始系统上安装内核修补程序 142909-17 (SPARC) 或 142910-17 (x86/x64) 或更高版本，则可以使用较早的 Oracle Solaris 10 发行版。
.sp
.LP
\fBsolaris10\fR 标记包括将 Solaris 10 系统映像安装到非全局区域所必需的工具。它还支持将 Solaris 10 本地区域迁移到 \fBsolaris10\fR 标记区域所必需的工具。该标记支持在运行最新 Solaris 操作系统的 SPARC 或 x86 计算机上执行 32 位和 64 位 Solaris 10 应用程序。
.SS "配置与管理"
.sp
.LP
\fBsolaris10\fR 标记支持完全根非全局区域模型。所有必需的 Solaris 10 软件及任何其他软件包都安装在区域的专用文件系统中。 
.sp
.LP
区域只能位于其自己的 \fBzfs\fR(1M) 数据集中并且仅支持 ZFS。在安装或连接区域时，将自动创建 ZFS 数据集。如果无法创建 ZFS 数据集，区域也无法安装或连接。 
.sp
.LP
\fBzonecfg\fR(1M) 实用程序可用于配置 \fBsolaris10\fR 标记区域。在创建区域时可以使用 \fBSYSsolaris10\fR 模板，也可以手动设置配置。一旦安装了标记区域，便不能更改或删除该区域的标记。\fBzoneadm\fR(1M) 实用程序可用于报告区域的标记类型和管理区域。\fBzlogin\fR(1) 实用程序可用于登录到区域。
.sp
.LP
当前对委托 ZFS 数据集配置的支持是试验性的，尚未经过测试。无法在标记区域中配置 \fB/dev/sound\fR 设备。此外，在全局区域中用于检查 \fBsolaris10\fR 标记区域中执行的进程时，\fBmdb\fR(1) 和 \fBdtrace\fR(1M) 无法完全正常运行。
.sp
.LP
此标记不支持以下 \fBzoneadm\fR(1M) 资源和属性：
.sp
.in +2
.nf
autoshutdown=suspend
anet:id
device:id
net:id
virtual-cpu
anet:mac
ib-vhca
ib-vhca:port
.fi
.in -2

.sp
.LP
对于 \fBsolaris\fR 标记，实时区域重新配置支持以下 \fBzoneadm\fR(1M) 资源和属性：
.sp
.in +2
.nf
anet (with exceptions stated below)
capped-memory
dedicated-cpu
device
fs
net (with exceptions stated below)
pool
scheduling-class
zone.* rctls
.fi
.in -2

.sp
.LP
对于 \fBsolaris\fR 标记，实时区域重新配置不支持以下 \fBzoneadm\fR(1M) 资源和属性：
.sp
.in +2
.nf
anet:allowed-address
anet:configure-allowed-address
anet:defrouter
dataset
file-mac-profile
fs-allowed
hostid
limitpriv
global-time
net:allowed-address
net:configure-allowed-address
net:defrouter
npiv
tenant
zpool
.fi
.in -2

.sp
.LP
如果在持久配置中更改了列出的不支持的资源和属性并将更改应用于正在运行的区域，实时区域重新配置将忽略这些更改。
.sp
.LP
如果尝试在实时配置中修改列出的不支持的资源和属性，这些修改都将被拒绝。
.sp
.LP
\fBsolaris10\fR 标记安装程序支持通过已安装的 Solaris 10 系统的映像安装区域。这可以是完整的 \fBcpio\fR(1) 或 \fBpax\fR(1) \fBxustar\fR 归档文件。\fBcpio\fR 归档文件可以使用 \fBgzip(1)\fR 或 \fBbzip2(1)\fR 进行压缩。此映像也可以是级别为 0 的 \fBufsdump\fR(1M)，或者是到 Solaris 10 系统根目录树顶级的路径。不能从标准的 Solaris 10 分发介质中安装区域。 
.sp
.LP
从 Solaris 10 进行迁移时，可以将区域配置为 \fBsparseroot\fR 区域。这种情况下，在生成归档文件前，应该在主机上已配置好区域。这样可以确保在归档文件中包含继承的目录。
.sp
.LP
此标记不支持以下 \fBzonecfg\fR(1M) 资源和属性：
.sp
.in +2
.nf
autoshutdown
anet:evs
anet:vport
device:id
file-mac-profile
net:id
tenant
virtual-cpu
anet:mac
.fi
.in -2

.sp
.LP
\fBsolaris10\fR 标记支持的属性具有如下所列的特定缺省值：
.sp
.in +2
.nf
Resource                Property                    Default Value
global                  zonepath                    /system/zones/%{zonename}
                        autoboot                    false
                        global-time                 false
                        ip-type                     exclusive
                        auto-shutdown               shutdown
net                     configure-allowed-address   true
anet                    mac-address                 auto
                        lower-link                  auto
                        link-protection             mac-nospoof
.fi
.in -2

.sp
.LP
存在 ZFS 数据集 \fBcom.oracle.zones.solaris10:activebe\fR 用户属性以支持 Solaris 10 标记区域的多引导环境。要激活引导环境，用户必须在区域的根数据集上设置 \fBcom.oracle.zones.solaris10:activebe\fR 属性，如下所示：
.sp
.in +2
.nf
# \fBzfs set com.oracle.zones.solaris10:activebe=\
\fIboot environment name\fR \fIzone's ROOT dataset\fR\fR
.fi
.in -2
.sp

.sp
.LP
具有多个引导环境的已安装 Solaris 10 区域需要设置 \fBactivebe\fR 属性。如果未设置该属性，或者将其设置为缺失或无效的引导环境名称，则该区域将在下一次区域或系统引导时转换为不可用状态。要解决此问题，必须更正 activebe 属性，并且区域必须与 \fBzoneadm attach\fR 连接。有关更多信息，请参见示例 4 和示例 5。
.SH 子命令
.sp
.LP
支持 \fBzoneadm\fR(1M) 标记特定子命令的下列参数： 
.sp
.ne 2
.mk
.na
\fB\fBattach\fR [\fB-c\fR \fI sysidcfg\fR]\fR
.ad
.sp .6
.RS 4n
将指定的 Solaris 10 本地区域映像连接到标记区域。
.RE

.sp
.ne 2
.mk
.na
\fB\fBclone\fR [\fB-c\fR \fB sysidcfg\fR]\fR
.ad
.sp .6
.RS 4n
安装某个区域时，可直接复制现有的已安装区域。该子命令是一种备选的区域安装方法。
.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fBsysidcfg\fR\fR
.ad
.RS 15n
.rt  
提供取消配置克隆的区域后将应用的 \fIsysidcfg\fR 文件。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBinstall\fR [\fB-a\fR \fI archive\fR] [\fB-d\fR \fIpath\fR] [\fB-p\fR] [\fB-s\fR] [\fB-u\fR] [\fB-v \fR] \\fR
.ad
.br
.na
\fB[\fB-c\fR \fBsysidcfg\fR] \fR
.ad
.sp .6
.RS 4n
将指定的 Solaris 10 系统映像安装到区域中。要求使用 \fB-u\fR 或 \fB-p\fR 选项\fB以及\fR\fB-a\fR 或 \fB-d\fR 选项。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fIarchive\fR\fR
.ad
.sp .6
.RS 4n
到已安装的 Solaris 10 系统、已安装的 Solaris 10 本地区域或 Solaris 10 标记区域的统一归档文件 \fBcpio\fR(1)、\fBpax\fR(1) \fBxustar\fR、\fBzfs\fR 归档文件或级别 \fB0\fR \fBufsdump\fR(1M) 的路径。\fBcpio\fR 和 \fBzfs\fR 归档文件可以使用 \fBgzip\fR 或 \fBbzip2\fR 进行压缩。 
.sp
\fBarchiveadm\fR(1M) 在 Solaris 10 上不存在。必须从全局区域创建包含 Solaris 10 标记区域的统一归档文件。统一归档文件的存在形式可以为路径或文件名、http 或 https URI。如果使用了 https，则可以使用 \fB-x\fR 选项指定 https 安全参数。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIsysidcfg\fR\fR
.ad
.sp .6
.RS 4n
提供安装后将应用的 \fIsysidcfg\fR 文件。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIpath\fR\fR
.ad
.sp .6
.RS 4n
到已安装的 Solaris 10 系统的根目录的路径。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.sp .6
.RS 4n
在安装区域后保留系统配置。当从统一归档文件进行安装且归档文件是恢复归档文件时，将默示使用 \fB-p\fR，但是可以使用 \fB-u\fR 进行覆盖。
.sp
.in +2
.nf
-x cert=\fB/path/cert\fR.pem
-x cacert=\fB/path/cacert\fR.pem
-x key=\fB/path/key\fR.pem
.fi
.in -2

使用指定的证书、CA 证书和/或密钥可以通过 https 访问统一归档文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.sp .6
.RS 4n
无提示安装。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.sp .6
.RS 4n
安装区域后对区域运行 \fBsys-unconfig\fR。当从统一归档文件进行安装且归档文件不是恢复归档文件时，默示使用 \fB-u\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
安装过程的详细输出。
.RE

.RE

.SS "应用程序支持"
.sp
.LP
\fBsolaris10\fR 区域只支持用户级的 Solaris10 应用程序。不能使用 \fBsolaris10\fR 区域中的 Solaris 10 设备驱动程序或 Solaris 10 内核模块。不过，取决于内核模块，您可能能够将最新的 Solaris 内核模块版本用于 Solaris 10 用户级应用程序。
.SH 示例
.LP
\fB示例 1 \fR创建用于安装的 ZFS Flash 归档文件
.sp
.LP
以下示例显示了如何为物理到虚拟 (P2V) 迁移创建归档文件。这是在运行 Solaris 10 的系统的全局区域中执行的。在 Solaris 10 系统中绝对不能配置、安装或运行任何非全局区域。Solaris 10 系统可以使用 ZFS 或 UFS 作为其根文件系统。

.sp
.in +2
.nf
# flarcreate -n s10box -c /net/somehost/p2v/s10box.flar
.fi
.in -2
.sp

.LP
\fB示例 2 \fR使用 Flash 归档文件安装 \fBsolaris10\fR 标记区域
.sp
.LP
以下示例使用示例 1 中的归档文件安装区域。它假设已使用 \fBzonecfg\fR(1M) 配置了区域并将 brand 属性设置为 \fBsolaris10\fR。

.sp
.in +2
.nf
# zoneadm -z s10p2v install -a /net/somehost/p2v/s10box.flar -p
.fi
.in -2
.sp

.LP
\fB示例 3 \fR创建用于安装的 ZFS 归档文件
.sp
.LP
以下示例显示了如何为虚拟到虚拟 (V2V) 迁移创建归档文件。它假设 \fBsolaris10\fR 标记区域的 \fBzonepath\fR 为 \fB/zones/v2vzone\fR。

.sp
.LP
首先，确定 \fBzonepath dataset\fR 的名称。

.sp
.in +2
.nf
# dataset=$(zfs list -H -o name /zones/v2vzone)
.fi
.in -2
.sp

.sp
.LP
然后，创建区域数据集的快照。

.sp
.in +2
.nf
# zfs snapshot -r $dataset@v2v
.fi
.in -2
.sp

.sp
.LP
最后，生成使用 \fBbzip2\fR 压缩的 ZFS 自包含递归流。

.sp
.in +2
.nf
# zfs send -rc $dataset@v2v | bzip2 > /net/somehost/v2v/v2v.zfs.bz2
.fi
.in -2
.sp

.LP
\fB示例 4 \fR使用 ZFS 归档文件安装区域
.sp
.LP
以下示例使用 ZFS 归档文件安装区域。它假设已使用 \fBzonecfg\fR(1M) 配置了区域并将 brand 属性设置为 \fBsolaris10\fR。

.sp
.in +2
.nf
# zoneadm -z v2vzone install -a /net/somehost/v2v/v2v.zfs.bz2
.fi
.in -2
.sp

.LP
\fB示例 5 \fR从全局区域设置区域的活动引导环境
.sp
.in +2
.nf
# \fBzfs set com.oracle.zones.solaris10:activebe=zbe-1 \\fR
    \fBrpool/export/zones/branded_zones/S10_zone/rpool/ROOT\fR
.fi
.in -2
.sp

.LP
\fB示例 6 \fR从 Solaris10 标记区域创建新引导环境
.sp
.LP
以下示例从 Solaris10 标记区域创建了一个新的引导环境。该示例还展示了如何修补、激活和引导到新的引导环境。

.RS +4
.TP
1.
创建新的引导环境。
.sp
.in +2
.nf
# \fBzfs snapshot rpool/ROOT/zbe-0@snap\fR
.fi
.in -2
.sp

.sp
.in +2
.nf
# \fBzfs clone -o mountpoint=/ -o canmount=noauto \
    rpool/ROOT/zbe-0@snap rpool/ROOT/zbe-1\fR
.fi
.in -2
.sp

.sp
.in +2
.nf
# \fBzfs promote rpool/ROOT/zbe-1\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
2.
修补引导环境。
.sp
.in +2
.nf
# \fBzfs mount -o mountpoint=/mnt rpool/ROOT/zbe-1\fR
.fi
.in -2
.sp

.sp
.in +2
.nf
# \fBpatchadd -R /mnt -d /var/tmp/999999-01\fR
.fi
.in -2
.sp

.sp
.in +2
.nf
# \fBzfs unmount rpool/ROOT/zbe-1\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
3.
激活新引导环境并引导到该环境。
.sp
.in +2
.nf
# \fBzfs set com.oracle.zones.solaris10:activebe=zbe-1 rpool/ROOT\fR
.fi
.in -2
.sp

.sp
.in +2
.nf
# \fBshutdown -y -g 0 -r\fR
.fi
.in -2
.sp

.RE
.SH 属性
.sp
.LP
有关以下属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/zones/brand/brand-solaris10
_
接口稳定性Committed（已确定）
.TE

.SH 另请参见
.sp
.LP
\fBcpio\fR(1)、\fBmdb\fR(1), \fBpax\fR(1)、\fBzlogin\fR(1)、\fBdtrace\fR(1M), \fBufsdump\fR(1M)、\fBzfs\fR(1M), \fBzoneadm\fR(1M)、\fBzonecfg\fR(1M)、\fBattributes\fR(5)、\fBbrands\fR(5)、\fBzones\fR(5)
