Alhadis/Silos/Solaris 11.3/zh_CN.UTF-8/man5/filesystem.5
'\" te
.\" Copyright 1989 AT&T
.\" Portions Copyright (c) 2008, 2015, Oracle and/or its affiliates.All rights reserved.
.TH filesystem 5 "2015 年 3 月 11 日" "SunOS 5.11" "标准、环境和宏"
.SH 名称
filesystem \- 文件系统组织
.SH 用法概要
.LP
.nf
/
.fi

.SH 描述
.sp
.LP
文件系统是由后代文件系统和目录组成的分层结构，用于组织 Oracle Solaris OS 中与系统相关的组件和二进制文件以及与系统不相关的组件和起始目录。缺省情况下，根系统文件安装在 ZFS 根池中，具体而言，该文件系统是一个 ZFS 文件系统，其中包括由与系统相关的组件组成的各个目录，例如，\fBetc\fR、\fBusr\fR 和 \fBvar\fR，要使系统正常运行，这些目录必须可用。安装系统后，将挂载 Solaris 文件系统的根目录，这意味着可以访问文件和目录。
.sp
.LP
Oracle Solaris OS 中根文件系统的所有子目录（除 \fB/var\fR 之外）必须包含在与根文件系统相同的文件系统中。此外，所有打包软件都必须驻留在根池中，但交换设备和转储设备除外。安装系统后，在根池中会自动创建缺省交换设备和转储设备，并将其作为 ZFS 卷。 
.sp
.LP
以下文件系统内容说明会使用“平台”、“与平台相关”、“与平台不相关”以及“特定于平台”这几种术语。“平台”是指由 \fBuname -i\fR 命令返回的系统指令集体系结构或处理器类型。“与平台相关”是指安装在所有平台上而内容会随平台不同而不同的文件。与此类似，与平台不相关的文件也会安装在所有平台上。然而，与平台不相关的文件的内容在所有平台上都相同。例如，经过编译的可执行程序就是与平台相关的文件。标准配置文件则是与平台不相关的文件的一个示例，例如 \fB/etc/hosts\fR。而特定于平台的文件仅安装在所支持的一部分平台上，这一点与前两种类型的文件不同。大部分特定于平台的文件都集中在 \fB/platform\fR 和 \fB/usr/platform\fR 下。
.SS "根文件系统"
.sp
.LP
根文件系统包含对系统操作至关重要的目录和文件，如内核、设备驱动程序和用于引导系统的程序。下面介绍了这些组件。根 (\fB/\fR) 目录还包含挂载点目录，可以在这些目录中将本地文件系统和远程文件系统附加到文件系统分层结构。
.sp
.ne 2
.mk
.na
\fB\fB/\fR\fR
.ad
.sp .6
.RS 4n
整个文件系统名称空间的根目录。该目录是在系统引导时由内核挂载的特殊文件系统。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/Boot\fR\fR
.ad
.sp .6
.RS 4n
该目录包含引导系统所需的文件和可执行程序。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/bin\fR\fR
.ad
.sp .6
.RS 4n
一种符号链接，指向包含系统可执行文件和脚本的 \fB/usr/bin\fR 目录。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev\fR\fR
.ad
.sp .6
.RS 4n
该目录包含特殊设备文件。通常，构建设备文件的目的是为了与系统的内核和硬件配置相匹配。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/devices\fR\fR
.ad
.sp .6
.RS 4n
\fBdevfs\fR 文件系统的挂载点目录，用于管理设备名称空间。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc\fR\fR
.ad
.sp .6
.RS 4n
该目录包含与平台相关的管理和配置文件及数据库，这些文件和数据库不会在系统之间共享。该目录用于定义系统标识。经过批准的随附 Solaris 软件安装位置。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/export/home\fR 或 \fB/home\fR\fR
.ad
.sp .6
.RS 4n
用户起始目录的目录或文件系统挂载点，用于存储用户文件。缺省情况下，\fB/home\fR 目录是自动挂载的文件系统。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel\fR\fR
.ad
.sp .6
.RS 4n
由与平台相关的可装入内核模块组成的目录，这些模块在引导过程中是必需的。其中包括与平台不相关的核心内核的通用部分 \fB/kernel/genunix\fR。请参见 \fBkernel\fR(1M)。经过批准的随附 Solaris 软件和附加系统软件安装位置。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/lib\fR\fR
.ad
.sp .6
.RS 4n
包含核心系统库的目录。以前，该目录包含系统启动时的重要库组件。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/media\fR\fR
.ad
.sp .6
.RS 4n
该目录用于访问自动挂载的可移除介质。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/mnt\fR\fR
.ad
.sp .6
.RS 4n
文件系统的缺省临时挂载点目录。此空目录用于临时挂载文件系统。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/net\fR\fR
.ad
.sp .6
.RS 4n
由自动挂载程序挂载的文件系统的临时挂载点目录。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/opt\fR\fR
.ad
.sp .6
.RS 4n
非随附应用程序软件包的目录。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/platform\fR\fR
.ad
.sp .6
.RS 4n
该目录包含需要驻留在根文件系统中的特定于平台的对象。其中包含一系列目录，每个受支持的平台对应一个目录。该系列目录的语义等同于 \fB/\fR（根）。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/proc\fR\fR
.ad
.sp .6
.RS 4n
进程文件系统的挂载点目录。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/root\fR\fR
.ad
.sp .6
.RS 4n
root 用户的起始目录。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/rpool\fR\fR
.ad
.sp .6
.RS 4n
与 ZFS 引导相关的组件的挂载点目录。缺省情况下，根池在安装过程中会命名为 \fBrpool\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/sbin\fR\fR
.ad
.sp .6
.RS 4n
指向 \fB/usr/sbin\fR 目录的符号链接。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/system\fR\fR
.ad
.sp .6
.RS 4n
合同 (\fBCTFS\fR) 和对象 (\fBOBJFS\fR) 文件系统的挂载点目录。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/system/zones\fR\fR
.ad
.sp .6
.RS 4n
该目录可在多个引导环境之间共享，并驻留在包含引导环境的 zpool 下的单独数据集中。这是 zonepath 的缺省父项。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/tmp\fR\fR
.ad
.sp .6
.RS 4n
该目录包含引导操作期间删除的临时文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr\fR\fR
.ad
.sp .6
.RS 4n
该目录包含与平台相关和与平台不相关的二进制程序和文件。\fB/usr/share\fR 子目录包含与平台不相关的文件。\fB/usr\fR 目录的其余部分包含与平台相关的文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/bin\fR\fR
.ad
.sp .6
.RS 4n
该目录包含用户调用的且与平台相关的可执行文件。这些命令是用户预计会在常规 \fB$PATH\fR 中运行的命令。经过批准的随附 Oracle Solaris 软件安装位置。非随附系统软件或应用程序的类似位置为 \fB/opt/packagename/bin\fR。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/sunos\fR\fR
.ad
.sp .6
.RS 4n
为实现与较旧 Solaris 发行版的兼容性而保留的 \fB/usr/bin\fR 命令版本。可执行文件位于 \fB/usr/sunos/bin\fR 中，如果希望使用较旧的版本，可以在 \fB$PATH\fR 中将该路径置于 \fB/usr/bin\fR 之前。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/gnu\fR\fR
.ad
.sp .6
.RS 4n
命令的 GNU 版本，这些命令版本不用作缺省 Solaris 实现，提供它们只是为了便于通晓其他平台。可执行文件位于 \fB/usr/gnu/bin\fR 中，如果希望使用 GNU 版本，可以在 \fB$PATH\fR 中将该路径置于 \fB/usr/bin\fR 之前。另外，此目录树中的所有命令都将可以通过符号链接（以 \fB\&'g'\fR 字符为前缀的命令名）从 \fB/usr/bin\fR 中进行访问。例如：
.sp
.in +2
.nf
/usr/bin/ggrep -> ../gnu/bin/grep.
.fi
.in -2
.sp

如果停用了 GNU 兼容性侧面，则会从 \fB/usr/bin\fR 中删除所有 \fBg*\fR 符号链接。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib\fR\fR
.ad
.sp .6
.RS 4n
该目录扩充了 \fB/lib\fR 的内容，其中包含更多系统库以及程序在运行时所需的其他支持文件。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/java\fR\fR
.ad
.sp .6
.RS 4n
该目录包含 Java 文件和可执行程序。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/sbin\fR\fR
.ad
.sp .6
.RS 4n
包含引导过程中以及手动系统恢复过程中使用的重要可执行文件。以前，在挂载 \fB/usr\fR 文件系统之前，需要使用该目录来恢复系统。在此 Oracle Solaris 发行版中，\fB/usr\fR 是一个目录，而不是一个单独的文件系统，该目录会在挂载根文件系统后可用。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var\fR\fR
.ad
.sp .6
.RS 4n
该目录或文件系统包含各种文件，这些文件对于某个系统来说是唯一的，但其大小可以任意增大。例如，日志文件。经过批准的随附 Oracle Solaris 软件安装位置。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/share\fR\fR
.ad
.sp .6
.RS 4n
该目录可在多个引导环境之间共享，并驻留在包含引导环境的 \fBzpool\fR 下的单独数据集中。软件包不应在此处提供内容，因为给定引导环境中的软件包元数据可能并不反映 \fB/var/share\fR 的最新内容。
.sp
软件包可以向 \fB/var/.migrate\fR 中提供目录，该目录会在引导期间自动创建在 \fB/var/share\fR 下。有关如何在引导环境之间共享数据的说明，请参见 \fBpkg\fR(5) 和 IPS 开发者指南。
.sp
缺省情况下会共享以下目录：
.sp
.in +2
.nf
/var/share/audit
/var/share/cores
/var/share/crash
/var/share/mail
.fi
.in -2

在 \fB/var\fR 中会提供符号链接以指向每个共享目录。
.sp
如果现有数据集尝试挂载在其中的一个符号链接上（例如，用户具有一个现有数据集，而该数据集通常挂载在 \fB/var/mail\fR 上），则这些数据集将挂载在 \fB/var/share\fR 下，因为文件系统挂载会遍历符号链接。该数据集仍可通过原始挂载点访问。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/tmp\fR\fR
.ad
.sp .6
.RS 4n
该目录包含常规系统操作期间大小或存在状态会发生变化的文件。此目录中的内容不会在引导操作期间被删除。通过设置 \fBrmtmpfiles\fR 服务的 \fBclean_vartmp\fR 属性值，可以更改 \fB/var/tmp\fR 的缺省行为，以清除编辑器临时文件以外的所有文件。可通过以下命令执行此操作： 
.sp
.in +2
.nf
# svccfg -s svc:/system/rmtmpfiles setprop\e
            options/clean_vartmp = "true"
# svcadm refresh svc:/system/rmtmpfiles:default
.fi
.in -2
.sp

需要 \fBsolaris.smf.value.rmtmpfiles\fR 授权才能修改此属性。
.RE

.SH 另请参见
.sp
.LP
\fBisainfo\fR(1)、\fBsvcs\fR(1)、\fBuname\fR(1)、\fBautomount\fR(1M)、\fBautomountd\fR(1M)、\fBboot\fR(1M)、\fBinit\fR(1M)、\fBkernel\fR(1M)、\fBmount\fR(1M)、\fBsvcadm\fR(1M)、\fBsvccfg\fR(1M)、\fBzfs\fR(1M)、\fBzpool\fR(1M)、\fBmount\fR(2)、\fBIntro\fR(4)、\fBproc\fR(4)、\fBterminfo\fR(4)、\fBpkg\fR(5)、\fBctfs\fR(7FS)、\fBdevfs\fR(7FS)、\fBobjfs\fR(7FS) 
