Alhadis/Silos/Solaris 11.3/zh_CN.UTF-8/man5/nwam.5
'\" te
.\" Copyright (c) 2010, 2012, Oracle and/or its affiliates.All rights reserved.
.TH nwam 5 "2012 年 5 月 31 日" "SunOS 5.11" "系统管理命令"
.SH 名称
nwam \- 网络自动配置管理
.SH 描述
.sp
.LP
可以根据系统定义的缺省策略规则或用户定义的策略规则自动管理网络配置。此管理由 \fBnwamd\fR 守护进程执行。
.sp
.LP
NWAM 工具由 \fBnetwork/physical:default\fR SMF 服务提供。如果 \fBnetcfg/active_ncp\fR 属性设置为反应性 NCP 名称，则会启用 NWAM 配置管理。或者，如果 \fBnetcfg/active_ncp\fR 属性设置为 \fBDefaultFixed\fR，则会执行传统的网络配置。
.SS "操作"
.sp
.LP
在自动 NCP 中实施的缺省配置策略用于让所有以物理方式连接的以太网链路处于活动状态；如果未提供以太网链路，则使单个无线链路处于活动状态。DHCP 用于获取所有活动链路的 IP 地址。可以通过创建备用网络配置文件 (Network Configuration Profiles, NCP) 更改该缺省策略。\fBnwam-manager\fR GUI 工具或 \fBnwamd\fR(1M) 命令可用于创建和修改 NCP。
.sp
.LP
NWAM 管理也可用于高层网络配置，如名称服务和网络安全协议。此配置在位置配置文件中指定。
.sp
.LP
可使用 \fBnetcfg\fR(1M) 管理配置文件。这是用于针对所有反应性配置文件指定激活策略的主要工具。它也可用于指定位置以及简单 NCP 组件。
.sp
.LP
使用 \fBdladm\fR(1M) 或 \fBipadm\fR(1M) 所进行的配置更改会应用于当前活动的 NCP，而不论 NCP 是反应性的（即，由 \fBnwamd\fR 主动管理）还是固定的。
.sp
.LP
位置可管理一组更广泛的配置对象。这些对象的活动系统配置位于 SMF 中；而 NWAM 工具通过以下方式管理配置：在配置文件系统信息库中存储设置以及在激活位置时将这些设置应用于 SMF 系统信息库。
.sp
.LP
对于反应性位置，禁用位置时会丢失位置处于活动状态时对 SMF 系统信息库所进行的更改；所以，应使用 \fBnetcfg\fR 对 NWAM 配置文件进行更改。这些更改将保存至 NWAM 系统信息库，并且还会应用于活动系统配置（如果更改当前处于活动状态的位置）。
.sp
.LP
对于 DefaultFixed 位置，对 SMF 系统信息库所进行的更改将在禁用位置时保存至 NWAM 系统信息库。因此，将在下次启用 DefaultFixed 位置时恢复这些更改。
.SS "服务属性"
.sp
.LP
以下列表的格式为：
.sp
.ne 2
.mk
.na
\fB\fIproperty_group/property_name\fR \fIproperty_type\fR \fIdefault_value\fR\fR
.ad
.sp .6
.RS 4n
说明
.RE

.sp
.ne 2
.mk
.na
\fB\fBnwamd/debug\fR boolean \fBfalse\fR\fR
.ad
.sp .6
.RS 4n
使用 \fBdaemon.debug\fR 启用调试日志。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnwamd/autoconf\fR boolean \fBfalse\fR\fR
.ad
.sp .6
.RS 4n
指示在没有更好（更优）选择的情况下是否应自动连接打开的 WLAN。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnwamd/ncu_wait_time\fR count \fB60\fR\fR
.ad
.sp .6
.RS 4n
在尝试下一个可用 NCU 之前等待 NCU（或链路/接口 NCU 对，视需要而定）启动的秒数。初启活动不会被取消，并且最终可能会成功，此时会根据指定的配置条件激活更优的 NCU 并可能会禁用备用 NCU。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnwamd/condition_check_interval\fR count \fB120\fR\fR
.ad
.sp .6
.RS 4n
对有条件激活对象执行定期条件检查的间隔秒数。最小值为 30 秒。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnwamd/scan_interval\fR count \fB120\fR\fR
.ad
.sp .6
.RS 4n
执行定期无线扫描的间隔秒数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnwamd/scan_level\fR astring \fBweak\fR\fR
.ad
.sp .6
.RS 4n
一个信号强度阈值；如果当前连接的 AP 低于此信号级别并以更高的信号强度提供了对等 AP（属于同一 ESSID），则将断开现有连接以便于连接到信号更强的 AP。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnwamd/strict_bssid\fR boolean \fBfalse\fR\fR
.ad
.sp .6
.RS 4n
如果为 true，则必须同时匹配 ESSID 和 BSSID 才能连接到以前连接的 WLAN。如果为 false，则只需匹配 ESSID。
.RE

.sp
.ne 2
.mk
.na
\fB\fBnetcfg/active_ncp\fR astring \fBAutomatic\fR\fR
.ad
.sp .6
.RS 4n
当前活动的 NCP。此属性不应由用户设置；它由 NWAM 服务在内部使用以在多次重新启动之间保持持久性。更改当前活动 NCP 的正确用户界面是使用 \fBnwam-manager\fR GUI 或 \fBnetadm \fR 命令的 \fBenable\fR 子命令。
.RE

.sp
.LP
如果启用保留的 NCP 名称 \fBDefaultFixed\fR，将禁用 NWAM 自动配置管理，并启用传统的固定网络配置。
.SH 属性
.sp
.LP
有关下列属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
可用性system/core-os
_
接口稳定性Volatile（可变）
.TE

.SH 另请参见
.sp
.LP
\fBsvcs\fR(1)、\fBdladm\fR(1M)、\fBipadm\fR(1M)、\fBnetcfg\fR(1M)、\fBnetcfgd\fR(1M)、\fBnwamd\fR(1M)、\fBsvadm\fR(1M)、\fBattributes\fR(5)、\fBsmf\fR(5)
.sp
.LP
另请参见 JDS/GNOME 手册页集合中的 \fBnwam-manager(1M)\fR。
.SH 附注
.sp
.LP
联网服务由服务管理工具 \fBsmf\fR(5) 管理，其服务标识符为：
.sp
.in +2
.nf
svc:/network/physical:default
.fi
.in -2
.sp

.sp
.LP
可以使用 \fBsvadm\fR(1M) 来对此服务执行管理操作（如启用、禁用或请求重新启动）。可以使用 \fBsvcs\fR(1) 命令来查询服务的状态。
