Alhadis/Silos/Solaris 11.3/zh_CN.UTF-8/man5/pam_tsol_account.5
'\" te
.\" Copyright (c) 2007, 2013, Oracle and/or its affiliates.All rights reserved.
.TH pam_tsol_account 5 "2012 年 5 月 22 日" "SunOS 5.11" "标准、环境和宏"
.SH 名称
pam_tsol_account \- Trusted Extensions 的 PAM 帐户管理模块
.SH 用法概要
.LP
.nf
\fB/usr/lib/security/pam_tsol_account.so.1\fR
.fi

.SH 描述
.sp
.LP
\fBPAM\fR 的 Solaris Trusted Extensions 服务模块 \fB/usr/lib/security/pam_tsol_account.so.1\fR 检查与标签相关的帐户限制。\fBpam_tsol_account.so.1\fR 模块是一个共享目标文件，可以动态装入以按需提供必要的功能。其路径在 \fBPAM\fR 配置文件中指定。
.sp
.LP
\fBpam_tsol_account.so.1\fR 中包含执行帐户管理的函数 \fBpam_sm_acct_mgmt()\fR。该函数检查用户的允许标签范围。允许的标签范围通过 \fBlabel_encodings\fR(4) 文件中的缺省值设置。这些缺省值可以被 \fBuser_attr\fR(4) 数据库中的条目覆盖。
.sp
.LP
缺省情况下，此模块要求连接到全局区域的远程主机必须为 CIPSO 主机类型。要禁用此策略，请将 \fBallow_unlabeled\fR 关键字作为一个选项添加到 \fBpam.conf\fR(4) 中的相应条目中，例如：
.sp
.in +2
.nf
other  account required    pam_tsol_account allow_unlabeled
.fi
.in -2
.sp

.sp
.LP
\fB/etc/pam.d/\fR 中的等效 PAM 配置将是 \fB/etc/pam.d/other\fR 中的以下条目：
.sp
.in +2
.nf
account required           pam_tsol_account allow_unlabeled
.fi
.in -2
.sp

.SH 选项
.sp
.LP
可将以下选项传送到该模块：
.sp
.ne 2
.mk
.na
\fB\fBallow_unlabeled\fR\fR
.ad
.RS 19n
.rt  
允许从无标签模板类型的主机进行远程连接。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdebug\fR\fR
.ad
.RS 19n
.rt  
提供 \fBLOG_DEBUG\fR 级别的调试信息。请参见 \fBsyslog\fR(3C)。
.RE

.SH 返回值
.sp
.LP
将返回以下值：
.sp
.ne 2
.mk
.na
\fB\fBPAM_SUCCESS\fR\fR
.ad
.RS 19n
.rt  
该帐户此时可在此标签下使用。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPAM_PERM_DENIED\fR\fR
.ad
.RS 19n
.rt  
当前进程标签在用户的标签范围之外、进程的标签信息不可用或者远程主机类型无效。
.RE

.sp
.ne 2
.mk
.na
\fB其他值\fR
.ad
.RS 19n
.rt  
返回与典型 PAM 操作一致的错误代码。有关与错误相关的返回值的信息，请参见 \fBpam\fR(3PAM) 手册页。
.RE

.SH 属性
.sp
.LP
有关下列属性的说明，请参见 \fBattributes\fR(5)：
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性类型属性值
_
接口稳定性Committed（已确定）
_
MT 级别T{
MT-Safe with exceptions（多线程安全，但存在异常）
T}
.TE

.sp
.LP
\fBlibpam\fR(3LIB) 中的接口仅在多线程应用程序中的每个线程都使用自己的 PAM 句柄时才是多线程安全的。
.SH 另请参见
.sp
.LP
\fBkeylogin\fR(1)、\fBlibpam\fR(3LIB)、\fBpam\fR(3PAM)、\fBpam_sm_acct_mgmt\fR(3PAM)、\fBpam_start\fR(3PAM)、\fBsyslog\fR(3C)、\fBlabel_encodings\fR(4)、\fBpam.conf\fR(4)、\fBuser_attr\fR(4)、\fBattributes\fR(5)
.sp
.LP
Chapter 1, \fI"Using Pluggable Authentication Modules,"\fR in \fI《Managing Kerberos and Other Authentication Services in Oracle Solaris 11.3》\fR
.SH 附注
.sp
.LP
仅当系统配置有 Trusted Extensions 时，本手册页中介绍的功能才可用。
