Alhadis/Silos/Solaris 11.3/zh_CN.UTF-8/man5/trusted_extensions.5
'\" te
.\" Copyright (c) 2007, 2013, Oracle and/or its affiliates.All rights reserved.
.TH trusted_extensions 5 "2007 年 11 月 12 日" "SunOS 5.11" "标准、环境和宏"
.SH 名称
trusted_extensions \- Solaris Trusted Extensions 
.SH 描述
.sp
.LP
Oracle Solaris 的 Trusted Extensions 功能为本地对象和进程、桌面和窗口系统、区域和文件系统以及网络通信提供标签。这些标签用于实现多级别安全性 (MLS) 策略，以便根据标签关系来限制信息流。与基于所有权的自主访问控制 (DAC) 相反，Trusted Extensions 实施的 MLS 策略是强制访问控制 (MAC) 的一个示例。
.sp
.LP
缺省情况下，Trusted Extensions 软件是禁用的。可通过 \fBlabeladm\fR(1M) 命令来启用和禁用（但不是完全配置）该软件，该软件与 \fBlabeld\fR(1M) 服务（由 FMRI 模式标识）关联：
.sp
.in +2
.nf
svc:/system/labeld:*
.fi
.in -2
.sp

.sp
.LP
有关使用前必须执行的 Trusted Extensions 软件配置的信息，请参见下文列出的管理员指南。
.SH 另请参见
.sp
.LP
\fBlabeld\fR(1M)、\fBlabel_encodings\fR(4)、\fBlabels\fR(5)
.sp
.LP
\fI《Trusted Extensions Configuration and Administration》\fR
.sp
.LP
\fI《Trusted Extensions User\&'s Guide》\fR
