Alhadis/Silos/Solaris 11.3/ja_JP.UTF-8/man1m/cfgadm_ib.1m
'\" te
.\" Copyright (c) 2004, 2013, Oracle and/or its affiliates.All rights reserved.
.TH cfgadm_ib 1M "2013 年 11 月 22 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
cfgadm_ib \- cfgadm の InfiniBand ハードウェア固有のコマンド
.SH 形式
.LP
.nf
\fB/usr/sbin/cfgadm\fR \fB-f\fR [\fB-y\fR | \fB-n\fR] [\fB-v\fR] \fB-c\fR \fIfunction\fR \fIap_id\fR...
.fi

.LP
.nf
\fB/usr/sbin/cfgadm\fR [\fB-f\fR] [\fB-y\fR | \fB-n\fR] [\fB-v\fR] [\fB-o\fR \fIhardware_options\fR]
     \fB-x\fR \fIhardware_function\fR \fIap_id\fR...
.fi

.LP
.nf
\fB/usr/sbin/cfgadm\fR \fB-v\fR [\fB-a\fR] [\fB-s\fR \fIlisting_option\fR] [-] [\fIap_id\fR | \fIap_type...\fR]
.fi

.LP
.nf
\fB/usr/sbin/cfgadm\fR \fB-v\fR \fB-h\fR [\fIap_id\fR]...
.fi

.SH 機能説明
.sp
.LP
InfiniBand ハードウェア固有のライブラリ \fB/usr/lib/cfgadm/ib.so.1\fR は、\fBcfgadm\fR(1M) ユーティリティーを使用してファブリックを管理する機能を提供します。\fBcfgadm\fR は、接続点で実行されます。\fBcfgadm\fR(1M) を参照してください。 
.sp
.LP
InfiniBand (\fBIB\fR) デバイスは、IB デバイスマネージャー (IBDM)に基づいて IB 連結ドライバ \fBib\fR(7D) によって列挙されます。
.sp
.LP
IB 連結ドライバは、5 種類の子デバイスノードを作成して初期化します。
.RS +4
.TP
.ie t \(bu
.el o
IB Port デバイス
.RE
.RS +4
.TP
.ie t \(bu
.el o
IB HCA サービス (HCA-SVC) デバイス
.RE
.RS +4
.TP
.ie t \(bu
.el o
IB 仮想物理接続点 (VPPA) デバイス 
.RE
.RS +4
.TP
.ie t \(bu
.el o
入出力コントローラ (IOC)
.RE
.RS +4
.TP
.ie t \(bu
.el o
IB 擬似デバイス
.RE
.sp
.LP
IB Port、IB VPPA、および IB HCA-SVC デバイスの列挙の詳細については、\fBib\fR(7D) を参照してください。IBDM についての追加情報は、\fBibdm\fR(7D) を参照してください。IB 擬似デバイスについての詳細は、\fBib\fR(4) を参照してください。
.sp
.LP
IB 管理では、特定のホストで認識されるように、ファブリック管理用に 2 種類の静的接続点が作成されます。静的接続点 \fBib\fR が 1 つあり、ファブリックの IB デバイス (IOC、ポート、VPPA、HCA-SVC、または擬似デバイス) はすべてここから分離される動的接続点として表現されます。ホストの各ホストチャネルアダプタ (HCA) には、そのノードのグローバル一意識別子 (GUID) 値に基づく別の静的接続点があります。
.sp
.LP
接続点には、ap_id を通じて名前が付けられます。論理 ap_id と物理 ap_id の 2 種類の ap_id が定義されます。物理 ap_id は、物理パス名に基づきます。IB ファブリックの場合、\fB/devices/ib:fabric\fR です。論理 ap_id は、より短く、ユーザーにわかりやすい名前を持ちます。
.sp
.LP
IB ファブリックの静的 ap_id は \fBib\fR です。IB デバイスは動的接続点であり、物理 ap_id はありません。IOC の論理 ap_id に含まれる GUID は \fBib::\fR\fIIOC-GUID\fR です。IOC ap_id の例は \fBib::80020123456789a \fR です。擬似デバイスの論理 ap_id (詳細は ib(4) を参照) の形式は \fBib::\fR\fIdriver_name\fR\fB,\fR\fIunit-address\fR です。擬似 ap_id の例は \fBib::sdp,0\fR です。ここで、「\fBsdp\fR」はドライバ名、「\fB0\fR」はその \fIunit-address\fR プロパティーです。ポート、VPPA、および HCA-SVC デバイスの論理 ap_id には、パーティションキー (\fIP_Key\fR)、\fIPort GUID\fR / \fINode GUID\fR、および通信に関する service-name が含まれます。ap_id の形式は次のとおりです。
.sp
.ne 2
.mk
.na
\fBポートデバイス\fR
.ad
.sp .6
.RS 4n
\fBib::\fR\fIPORT_GUID\fR\fB,\fR\fI0\fR\fB,\fR\fIservice-name\fR
.RE

.sp
.ne 2
.mk
.na
\fBVPPA デバイス\fR
.ad
.sp .6
.RS 4n
\fBib::\fR\fIPORT_GUID\fR\fB,\fR\fIP_Key\fR\fB,\fR\fIservice-name\fR
.RE

.sp
.ne 2
.mk
.na
\fBHCA-SVC デバイス\fR
.ad
.sp .6
.RS 4n
\fBib::\fR\fIHCA_GUID\fR\fB,\fR0\fB,\fR\fIservicename\fR
.RE

.sp
.LP
Port デバイスおよび HCA-SVC デバイスの場合、パーティションキー (\fIP_Key\fR) は \fB0\fR です。\fIP_Key\fR は、VPPA デバイスノード用にこのポートが属するパーティションを特定する際に役立ちます。ポートには複数の \fIP_Key\fR がある場合があります。VPPA デバイスの論理 ap_id ポイントの例は \fBib::80245678,ffff,ipib\fR です。\fIport-GUID\fR は \fB80245678\fR、\fIP_Key\fR は \fB0xffff\fR、サービス名は \fBipib\fR です。service-name 情報は、service-name 文字列が含まれるファイル \fB/etc/driver/drv/ib.conf\fR から取得されます。HCA の論理 ap_id に含まれるノード GUID 値は hca:HCA-GUID です。例は \fBhca:21346543210a987\fR です。
.sp
.LP
IB 接続点の一覧には、ホストで参照されず、使用されるように構成されていない場合でも、ファブリック内のすべての IB デバイス (IBDM および IB 連結ドライバで参照される IOC、VPPA、HCA-SVC、Pseudo、および Port デバイス) に関する情報が含まれます。 
.sp
.LP
次の一覧は、5 つの IB デバイス (2 つの IOC、1 つの VPPA、1 つの Port、1 つの HCA-SVC) と 1 つの HCA を示しています。
.sp
.in +2
.nf
example# cfgadm -al 
Ap_Id                    Type       Receptacle   Occupant      Condition
hca:21346543210a987      IB-HCA     connected    configured    ok
ib                       IB-FABRIC  connected    configured    ok
ib::80020123456789a      IB-IOC     connected    configured    ok
ib::802abc9876543        IB-IOC     connected    unconfigured  unknown
ib::80245678,ffff,ipib   IB-VPPA    connected    configured    ok
ib::12245678,0,nfs       IB-PORT    connected    configured    ok
ib::21346543,0,hnfs      IB-HCA-SVC connected    configured    ok
ib::sdp,0                IB-PSEUDO  connected    configured    ok
.fi
.in -2
.sp

.sp
.LP
ap_id \fBib::802abc9876543\fR は、ホストで使用されるように構成されていない、または明示的な操作によって事前にオフラインにされていない IOC デバイスを 
.sp
.in +2
.nf
cfgadm \fB-c\fR unconfigure
.fi
.in -2
.sp

.sp
.LP
示しています。\fBCondition\fR 列に表示される情報で区別されます。P_Key と HCA GUID がゼロの IB デバイスは HCA-SVC デバイスです。接続点の一覧表示については、\fBcfgadm\fR(1M) を参照してください。
.sp
.LP
接続点の受容体の状態は、次の意味を持ちます。
.sp
.ne 2
.mk
.na
\fBconnected\fR
.ad
.sp .6
.RS 4n
IOC/VPPA/Port/Pseudo/HCA-SVC デバイスでは、\fBconnected\fR はホストで参照されていることを意味します。デバイスは Solaris で使用されるように構成されてない場合もあります。 
.sp
HCA 接続点では、\fBconnected\fR はデバイスが構成されていて、使用中であることを意味します。 
.sp
すべての IB ap_id は、常に connected と表示されます。
.RE

.sp
.LP
接続点の占有装置の状態は、次の意味を持ちます。 
.sp
.ne 2
.mk
.na
\fBconfigured\fR
.ad
.sp .6
.RS 4n
IB デバイスおよび HCA ap_id が構成され、Solaris で使用可能です。
.RE

.sp
.ne 2
.mk
.na
\fBunconfigured\fR
.ad
.sp .6
.RS 4n
ap_id の IB デバイスは \fBcfgadm\fR \fB-c\fR \fBunconfigure\fR を使用して明示的にオフラインにされましたが、正常に構成されませんでした。これは、デバイスが Solaris で使用されるように正常に構成されなかったか (ドライバがない、またはデバイスの問題のため)、IB 連結ドライバで使用されるように構成されなかったことが原因になっている可能性があります。 
.sp
HCA 接続点では、\fBunconfigured\fR 操作はサポートされていません。システムに IB ハードウェアがない場合は、IB の静的 apid (\fBib\fR) は unconfigured と表示されます。
.RE

.sp
.LP
接続点の条件は次のとおりです。
.sp
.ne 2
.mk
.na
\fBfailed\fR
.ad
.sp .6
.RS 4n
使用されていません。
.RE

.sp
.ne 2
.mk
.na
\fBfailing\fR
.ad
.sp .6
.RS 4n
使用されていません。
.RE

.sp
.ne 2
.mk
.na
\fBok\fR
.ad
.sp .6
.RS 4n
通常の状態です。使用できます。
.RE

.sp
.ne 2
.mk
.na
\fBunknown\fR
.ad
.sp .6
.RS 4n
この状態は、IBDM で検索されたものの、Solaris で使用されるように構成されていない IB デバイスでのみ有効です。また、\fBcfgadm\fR \fB-c\fR \fBunconfigure\fR 操作で明示的にオフラインになったデバイスにも表示されます。この状況は、HCA 接続点には適用されません。
.RE

.sp
.ne 2
.mk
.na
\fBunusable\fR
.ad
.sp .6
.RS 4n
使用されていません。
.RE

.SH オプション
.sp
.LP
サポートしているオプションは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIfunction\fR\fR
.ad
.sp .6
.RS 4n
IB ハードウェア固有のライブラリでは、2 つの汎用コマンド (\fI関数\fR) がサポートされています。これらのコマンドは、静的接続点 (つまり、HCA ap_id および IB の静的 \fBib\fR ap_id) ではサポートされていません。
.sp
次の汎用コマンドがサポートされています。 
.sp
.ne 2
.mk
.na
\fBconfigure\fR
.ad
.sp .6
.RS 4n
Solaris で使用されるように IB デバイスを構成します。
.RE

.sp
.ne 2
.mk
.na
\fBunconfigure\fR
.ad
.sp .6
.RS 4n
IB デバイスの構成を解除します。正常に完了した場合、\fBcfgadm\fR ではこの \fBap_id\fR の状況が \fBunknown\fR と報告されます。\fB\fR
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
サポートされていません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR \fIap_id\fR\fR
.ad
.sp .6
.RS 4n
IB 接続点に関する IB 固有のヘルプを取得します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
IB 接続点の状態および状況を一覧表示します。\fB-l\fR オプションは、\fBcfgadm\fR(1M) で説明されているように機能します。 
.sp
\fB-a\fR オプションとともに使用すると、動的接続点 (IOC、VPPA、ポート、擬似、および HCA-SVC デバイス) も同様に表示されます。 
.sp
\fB-v\fR オプションとともに使用すると、ap_id に関する詳細データが表示されます。IOC の場合、出力の \fBInfo\fR フィールドには、 
.sp
.in +2
.nf
cfgadm \fB-avl\fR
.fi
.in -2
.sp

IOCControllerProfile にある VendorID、IOCDeviceID、DeviceVersion、SubsystemVendorID、SubsystemID、Class、Subclass、Protocol、ProtocolVersion、および IDString に関する情報が表示されます。ID 文字列が指定されていない場合、その場所には何も表示されません。これらのフィールドは、『InfiniBand Specification Volume 1』(http://www.infinibandta.org) に定義されています。 
.sp
VPPA、ポート、または HCA-SVC デバイスの場合、\fBcfgadm -lav\fR の \fBInfo\fR フィールドには、このデバイスがバインドされたサービス名に関する情報が表示されます。このような情報が存在しない場合は、何も表示されません。
.sp
擬似デバイス \fBcfgadm -alv\fR の場合、ドライバ名とその \fBunit-address\fR 情報が表示されます。HCA の場合、詳細一覧には VendorID、HCA の ProductID、ポートの数、およびそのポートの PortGUID 値が表示されます。「\fB使用例\fR」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIhardware_option\fR\fR
.ad
.sp .6
.RS 4n
このオプションは、現在定義されていません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIlisting_option\fR\fR
.ad
.sp .6
.RS 4n
select サブオプションを使用すると、クラス ib の接続点を一覧表示できます。詳細は、\fBcfgadm\fR(1M) のマニュアルページを参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fIhardware_function\fR\fR
.ad
.sp .6
.RS 4n
ハードウェア固有の関数を実行します。\fIname\fR は 4 文字よりも長くできないことに注意してください。
.sp
次のハードウェア固有の関数がサポートされています。 
.sp
.ne 2
.mk
.na
\fB\fBadd_service\fR \fB-ocomm\fR\fB=[port|vppa|hca-svc],service=\fR\fIname\fR\fR
.ad
.sp .6
.RS 4n
このハードウェア固有の関数は、静的 \fBIB\fR 接続点でサポートされています。これを使用すると、新しいサービスを \fB/etc/driver/drv/ib.conf\fR ファイルに追加したり、\fBib\fR(7D) ドライバを更新したりできます。 
.sp
新しいサービスが追加されるように指定するには、\fBservice=\fR\fIname\fR オプションを使用する必要があります。\fBname\fR サービスを \fB/etc/driver/drv/ib.conf\fR ファイルの \fBport-svc-list\fR または \fBhca-svc-list\fR に追加するには、\fBcomm=[port|vppa|hca-svc]\fR オプションを使用する必要があります。「\fB使用例\fR」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdelete_service\fR \fB-ocomm\fR\fB=[port|vppa|hca-svc],service=\fR\fIname\fR\fR
.ad
.sp .6
.RS 4n
このハードウェア固有の関数は、静的 \fBIB\fR 接続点でのみサポートされています。これを使用すると、既存のサービスを \fB/etc/driver/drv/ib.conf\fR ファイルから削除したり、\fBib\fR(7D) ドライバのデータベースから削除したりできます。削除するサービスを指定するには、\fBservice=name\fR オプションを使用する必要があります。このサービスを \fB/etc/driver/drv/ib.conf\fR ファイルの \fBport-svc-list\fR、\fBvppa-svc-list\fR、または \fBvppa-svc-list\fR から削除するには、\fBcomm=[port|vppa|hca-svc]\fR オプションを使用する必要があります。「\fB使用例\fR」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBlist_clients\fR\fR
.ad
.sp .6
.RS 4n
\fBHCA\fR 接続点でサポートされています。この \fBHCA\fR を使用して、すべてのカーネル IB クライアントを表示します。また、これらのカーネル IB クライアントおよび代替 \fBHCA\fR デバイス (開いている場合) の各 ap_id も表示されます。「\fB使用例\fR」を参照してください。
.sp
\&. 
.sp
特定のカーネル IB クライアントに有効な ap_id がない場合は、その列に \fB-\fR が表示されます。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBlist_services\fR\fR
.ad
.sp .6
.RS 4n
このハードウェア固有の関数は、静的 \fBIB\fR 接続点でのみサポートされています。\fB/etc/driver/drv/ib.conf\fR ファイルから読み取られるすべてのポートおよび VPPA サービスが一覧表示されます。「\fB使用例\fR」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBunconfig_clients\fR\fR
.ad
.sp .6
.RS 4n
このハードウェア固有の関数は、静的 HCA 接続点でのみサポートされています。これを使用すると、この特定 HCA のすべてのカーネル IB クライアントを構成解除できます。代替 HCA がないカーネル IB クライアントのみが構成解除されます。「\fB使用例\fR」を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBupdate_ioc_config\fR\fR
.ad
.sp .6
.RS 4n
このハードウェア固有の関数は、静的 IB 接続点および IOC 接続点でサポートされています。\fBib\fR APID の場合、この関数はすべての IOC デバイスノードのプロパティーを更新します。IOC APID の場合、この関数は指定された IOC デバイスノードのプロパティーを更新します。このコマンドは \fBport-list\fR、\fBport-entries\fR、\fBservice-id\fR、および \fBservice-name\fR IOC ノードプロパティーを更新します。
.sp
\fBib\fR(7D) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBupdate_pkey_tbls\fR\fR
.ad
.sp .6
.RS 4n
静的 \fBib\fR 接続点でサポートされています。\fBIBTL\fR 内部の \fBPKEY\fR 情報を更新します。\fBIBTL\fR は、ホストに存在する各 \fBHCA\fR 上のすべてのポートについて \fBP_Key\fR テーブルを再度読み取ります。 
.sp
\fBibtl\fR(7D) を参照してください。 
.RE

.RE

.SH 使用例
.LP
\fB例 1 \fRIB デバイスの状態および状況の一覧表示
.sp
.LP
次のコマンドは、システム上の IB デバイスの状態および状況を一覧表示します。静的接続点のみが表示されます。

.sp
.in +2
.nf
example# cfgadm
hca:21346543210a987        IB-HCA      connected    configured   ok
ib                         IB-FABRIC   connected    configured   ok
.fi
.in -2
.sp

.sp
.LP
\fB-a\fR オプションは、すべての接続点を表示します。次の例では、\fB-a\fR オプションを使用して、すべての接続点を一覧表示します。

.sp
.in +2
.nf
example# cfgadm -a
hca:21346543210a987          IB-HCA      connected    configured   ok
ib                           IB-FABRIC   connected    configured   ok
ib::80020123456789a          IB-IOC      connected    unconfigured ok
ib::80245678,ffff,ipib       IB-VPPA     connected    configured   ok
ib::21346543,0,hnfs          IB-hca-svc  connected    configured   ok
ib::12245678,0,nfs           IB-PORT     connected    configured   ok
ib::sdp,0                    IB-PSEUDO   connected    configured   ok
.fi
.in -2
.sp

.LP
\fB例 2 \fRIB VPPA デバイスの詳細ステータスの一覧表示
.sp
.LP
次のコマンドは、IB VPPA デバイスの詳細ステータスを一覧表示します。

.sp
.in +2
.nf
example# cfgadm -alv ib::80245678,ffff,ipib      
Ap_Id                   Receptacle Occupant   Condition Information
When         Type     Busy  Phys_Id
ib::80245678,ffff,ipib    connected    configured   ok        ipib
unavailable  IB-VPPA  n     /devices/ib:fabric::80245678,ffff,ipib
.fi
.in -2
.sp

.sp
.LP
IOC の詳細一覧には、追加情報が表示されます。次のコマンドは、詳細一覧を表示します。

.sp
.in +2
.nf
example# cfgadm -alv ib::80020123456789a
Ap_Id      Receptacle   Occupant     Condition Information
When       Type     Busy  Phys_Id
ib::80020123456789a     connected    configured   ok         VID: 0xeaea
DEVID: 0xeaea VER: 0x5 SUBSYS_VID: 0x0 SUBSYS_ID: 0x0 CLASS: 0xffff
SUBCLASS: 0xff PROTO: 0xff PROTOVER: 0x1 ID_STRING: Sample Host Adapter
unavailable IB-IOC   n     /devices/ib:fabric::80020123456789a
.fi
.in -2
.sp

.sp
.LP
擬似デバイスの詳細一覧は、次のものを表示します。

.sp
.in +2
.nf
example# cfgadm -alv ib::sdp,0
Ap_Id                 Receptacle  Occupant   Condition Information
When       Type   Busy  Phys_Id
ib::sdp,0         connected   configured   ok       Driver = "sd
p" Unit-address = "0"
unavailable  IB-PSEUDO   n  /devices/ib:fabric::sdp,0
.fi
.in -2
.sp

.sp
.LP
HCA の詳細一覧は、次のものを表示します。 

.sp
.in +2
.nf
example# cfgadm -alv hca:21346543210a987
Ap_Id               Receptacle   Occupant     Condition Information
When       Type    Busy  Phys_Id
hca:21346543210a987  connected    configured   ok         VID: 0x15b3,
PID: 0x5a44, #ports: 0x2, port1 GUID: 0x80245678, port2 GUID: 0x80245679
unavailable  IB-HCA     n  /devices/ib:21346543210a987
.fi
.in -2
.sp

.sp
.LP
このような \fBcfgadm\fR クラスおよびフィールドの selection オプション (\fB\fR\fB-s\fR \fB"select=class(ib),cols=ap_id:info"\fR) を指定すると、ユーザーにわかりやすい出力を取得できます。

.sp
.LP
次のコマンドは、IB ap_id のみを表示します。出力には、\fBap_id\fR および \fBInformation\fR フィールドのみが含まれます。

.sp
.in +2
.nf
 
# cfgadm -al -s "cols=ap_id:info"  ib::80245678,ffff,ipib
Ap_Id                                Information
ib::80245678,ffff,ipib               ipib
.fi
.in -2
.sp

.LP
\fB例 3 \fR既存の IB IOC の構成解除
.sp
.LP
次のコマンドは、\fBib::80020123456789a\fR に接続された IB IOC を構成解除してから、\fBap_id\fR のステータスを表示します。

.sp
.in +2
.nf
# cfgadm -c unconfigure ib::80020123456789a
Unconfigure the device: /devices/ib:fabric::80020123456789a 
This operation will suspend activity on the IB device
Continue (yes/no)?
.fi
.in -2
.sp

.sp
.LP
「\fBy\fR」を入力します。

.sp
.in +2
.nf
IB device unconfigured successfully. 
# cfgadm -al ib::80020123456789a
Ap_Id                  Type      Receptacle  Occupant     Condition
ib::80020123456789     IB-IOC    connected   unconfigured unknown
#
.fi
.in -2
.sp

.sp
.LP
状況 unknown は、デバイスノードがすでに存在せず、この IB デバイスの存在が IB デバイスマネージャーにしか認識されていないことを意味します。

.LP
\fB例 4 \fRIB IOC の構成
.sp
.LP
次の一連のコマンドは、\fBib::80020123456789a\fR に接続された IB デバイスを構成します。

.sp
.in +2
.nf
# cfgadm -yc configure ib::80020123456789a
# cfgadm -al ib::80020123456789a
Ap_Id                  Type        Receptacle   Occupant     Condition
ib::80020123456789a    IB-IOC      connected    configured   ok       
.fi
.in -2
.sp

.LP
\fB例 5 \fRHCA のすべてのカーネル IB クライアントの一覧表示
.sp
.LP
次のコマンドは、\fBhca:21346543210a987\fR に接続された HCA のすべてのカーネル IB クライアントを一覧表示します。

.sp
.in +2
.nf
# cfgadm -x list_clients hca:21346543210a987
Attachment Point       Clients                Alternate HCA
ib::80020123456789a    ioc1                   Yes
ib::80245678,ffff,ipib ipib                   No
ib::21346543,0,hnfs    hnfs                   No
-                      ibdm                   No
-                      ibmf                   No
.fi
.in -2
.sp

.LP
\fB例 6 \fRポートサービスの追加
.sp
.LP
次のコマンドは、\fBsrp\fR という新しいポートサービスを追加します。

.sp
.in +2
.nf
 # cfgadm -o comm=port,service=srp -x add_service ib
.fi
.in -2
.sp

.LP
\fB例 7 \fRVPPA サービスの削除
.sp
.LP
次のコマンドは、\fBibd\fR VPPA サービス \fBibd\fR を削除します。 

.sp
.in +2
.nf
# cfgadm -o comm=vppa,service=ipib -x delete_service ib
.fi
.in -2
.sp

.LP
\fB例 8 \fRポート、VPPA、HCA-SVC サービスの一覧表示
.sp
.LP
次のコマンドは、すべてのポート、VPPA、および HCA-SVC サービスを一覧表示します。

.sp
.in +2
.nf
# cfgadm -x list_services ib
Port communication services:
         srp

VPPA communication services:
         ipib
         nfs

HCA-SVC communication services:
         hnfs
.fi
.in -2
.sp

.LP
\fB例 9 \fRIOC デバイスの再検索
.sp
.LP
次のコマンドは、すべての IOC デバイスノードを再検索します。

.sp
.in +2
.nf
# cfgadm -x update_ioc_config ib
This operation can update properties of IOC devices.
Continue (yes/no)?

Enter: y

#
.fi
.in -2
.sp

.LP
\fB例 10 \fRHCA のすべてのカーネルクライアントの構成解除
.sp
.LP
次のコマンドは、HCA のすべてのカーネルクライアントを構成解除します。

.sp
.in +2
.nf
# cfgadm -x unconfig_clients hca:21346543
 This operation will unconfigure clients of this HCA.
 Continue (yes/no)?

 Enter: y
.fi
.in -2
.sp

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/cfgadm/ib.so.1\fR\fR
.ad
.sp .6
.RS 4n
汎用 InfiniBand デバイス管理のためのハードウェア固有ライブラリ
.RE

.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/library
.TE

.SH 関連項目
.sp
.LP
\fBcfgadm\fR(1M), \fBconfig_admin\fR(3CFGADM), \fBlibcfgadm\fR(3LIB), \fBib\fR(4), \fBattributes\fR(5), \fBib\fR(7D), \fBibdm\fR(7D), \fBibtl\fR(7D)
.sp
.LP
InfiniBand Specification Volume 1 (http://www.infinibandta.org)
.SH 注意事項
.sp
.LP
一覧表示 (\fBcfgadm\fR \fB-l\fR または \fBcfgadm\fR \fB-x\fR \fBlist_clients\fR) を除いて、接続点ではスーパーユーザーのみが関数を実行できます。
