Alhadis/Silos/Solaris 11.3/ja_JP.UTF-8/man1m/eeprom.1m
'\" te
.\" Copyright (c) 2009, 2015, Oracle and/or its affiliates.All rights reserved.
.TH eeprom 1M "2015 年 3 月 26 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
eeprom \- EEPROM 表示およびロードユーティリティー
.SH 形式
.LP
.nf
\fB/usr/sbin/eeprom\fR [\fB-\fR] [\fB-f\fR \fIdevice\fR] [\fIparameter\fR[=\fIvalue\fR]]
.fi

.LP
.nf
\fB/usr/sbin/eeprom\fR \fB-u\fR [\fB-i\fR] [\fB-x\fR] [\fB-\fR] [\fIuefi-variable\fR[=\fIvalue\fR]] ... 
.fi

.LP
.nf
\fB/usr/sbin/eeprom\fR \fB-u\fR \fB-d\fR \fIuefi-variable\fR ... 
.fi

.SH 機能説明
.sp
.LP
\fBeeprom\fR は、\fBEEPROM\fR のパラメータの値を表示または変更します。パラメータを指定された順序で処理します。\fBeeprom\fR は、\fIparameter\fR と \fIvalue\fR の組み合わせを処理する際には、その指定された変更を \fBEEPROM\fR に対して行い、そうでない場合はその \fIparameter\fR の値を表示します。パラメータの指定子が 1 つも指定されなかった場合、\fBeeprom\fR はすべての \fBEEPROM\fR パラメータの値を表示します。「 -」(ハイフン) フラグは、標準入力からパラメータと値を読み取ることを指定します (行ごとに \fIparameter\fR または \fIparameter\fR\fB=\fR\fIvalue\fR を 1 つずつ)。\fB\fR
.sp
.LP
\fBEEPROM\fR の内容を変更できるのは、スーパーユーザーだけです。
.sp
.LP
\fBeeprom\fR は、\fBEEPROM\fR のチェックサムを検証し、不正な場合にはメッセージを表示します。
.sp
.LP
\fIplatform-name\fR はプラットフォームの実装名であり、この名前を確認するには、\fBuname\fR(1) の \fB-i\fR オプションを使用します。
.SS "SPARC"
.sp
.LP
\fBSPARC\fR ベースのシステムでは、\fBeeprom\fR の \fBsecurity-mode\fR、\fBsecurity-password\fR、および \fBsecurity-#badlogins\fR プロパティーを使用してファームウェアのパスワード保護が実装されています。
.SS "x86"
.sp
.LP
\fBEEPROM\fR の記憶領域は、プラットフォーム固有のブート領域に存在するファイルを使用してシミュレートされます。\fB/boot/solaris/bootenv.rc\fR ファイルが \fBEEPROM\fR の記憶領域をシミュレートします。
.sp
.LP
x86 ベースのシステムでは通常、システムの \fBBIOS\fR 内でパスワード保護が実装されているため、\fBeeprom\fR プログラムにはパスワード保護のサポートはありません。x86 ベースのシステムで \fBsecurity-mode\fR、\fBsecurity-password\fR、および \fBsecurity-#badlogins\fR プロパティーを設定することも可能ですが、それらのプロパティーは、x86 ベースのシステムでは特別な意味や動作は持ちません。
.SS "UEFI"
.sp
.LP
EEPROM ストレージをシミュレートすることに加えて、UEFI に対応した x86 システムは、UEFI 仕様によって定義された、UEFI 環境に固有の変数のための NVRAM ストレージを実装します。UEFI 変数の読み取りおよび書き込みの両方に対するすべての特権が必要です。
.SH オプション
.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIdevice\fR\fR
.ad
.sp .6
.RS 4n
\fIdevice\fR を \fBEEPROM\fR デバイスとして使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.sp .6
.RS 4n
Solaris システム変数ではなく UEFI 変数にアクセスします。単独で使用された場合、すべての UEFI 変数を出力します。それ以外の場合は、個々の変数は、Solaris システム変数と同じフォーマットスタイルを使用して、コマンド行に一覧を出力または書き込むことができます。
.sp
ほとんどの UEFI 変数はバイナリ形式であり、人間が判読可能な形式に変換されます。変換が可能でない場合、hexdump が出力されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR \fIuefi-variable\fR\fR
.ad
.sp .6
.RS 4n
変換を試行せずに、指定された UEFI 変数の hexdump を出力します。セット操作に使用された場合、効果はありません。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIuefi-variable\fR\fR
.ad
.sp .6
.RS 4n
コマンド行で指定された UEFI 変数を削除します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR \fB-\fR\fR
.ad
.sp .6
.RS 4n
\fB-u\fR オプションで使用された場合の「-」は、現在では UEFI 変数に対して動作することを除けば、通常の \fBeeprom\fR コマンドと一緒に使用された場合と同じように機能します。
.RE

.SH オペランド
.SS "x86 のみ"
.sp
.ne 2
.mk
.na
\fB\fIacpi-user-options\fR\fR
.ad
.sp .6
.RS 4n
電源管理仕様 Advanced Configuration and Power Interface (ACPI) の使用を制御する構成変数。この変数で使用可能な値は、使用する Solaris オペレーティングシステムのリリースによって異なります。
.sp
Solaris 10 と Solaris 11 のすべてのリリースで、値 \fB0x0\fR は、システム上で ACPI が使用可能な場合にその使用が試みられることを意味します。値 \fB0x2\fR を使用すると、ACPI の使用が無効化されます。
.sp
Solaris 10 1/06 リリースの場合、値 \fB0x8\fR は、システム上で ACPI が使用可能な場合に Solaris 10 の以前のリリースと互換性のあるモードで ACPI の使用が試みられることを意味します。Solaris 10 1/06 のデフォルトは \fB0x8\fR です。
.sp
Solaris 10 の 1/06 以降のリリースおよび Solaris 11 のデフォルトは、\fB0x0\fR です。
.sp
ほとんどのユーザーは、安全にデフォルト値を受け入れることができます。デフォルト値では、ACPI が使用可能な場合には有効化されます。Solaris 1/06 以降の Solaris リリースで ACPI の使用に関わる問題が発生していると考えられる場合には、まず値 \fB0x8\fR を試し、それで満足する結果が得られないときには、\fB0x02\fR を使用することをお勧めします。
.RE

.sp
.ne 2
.mk
.na
\fB\fIconsole\fR\fR
.ad
.sp .6
.RS 4n
コンソールデバイスを指定します。指定できる値は、\fBttya\fR、\fBttyb\fR、\fBtext\fR、\fBgraphics\fR、および \fBforce-text\fR です。\fBtext\fR モードでは、コンソールの出力はフレームバッファーに送信され、入力はキーボードから取得されます。テキストモードのバリエーションである \fBgraphics\fR は、キーが押されるか、あるいはコンソールログイン、\fBsulogin\fR、または \fBkmdb\fR によってコンソールの対話処理が必要になるまで、アニメーション付きのイメージを表示します。\fBtext\fR の追加のバリエーションである \fBforce-text\fR は、VGA アダプタを VGA テキストモードに設定して、ビットマップデバイスとして使用しないようにします。このプロパティーが存在しない場合、コンソールデバイスは \fBinput-device\fR と \fBoutput-device\fR で指定されたデバイスになります。\fBconsole\fR プロパティー、\fBinput-device\fR と \fBoutput-device\fR のプロパティーペアのどちらも存在しない場合、コンソールはデフォルトでフレームバッファーとキーボードになります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBscreen-\fR\fI#columns\fR \fBscreen-\fR\fI#rows\fR\fR
.ad
.sp .6
.RS 4n
ビットマップデバイスで \fBscreen\fR が \fBgraphics\fR または \fBtext\fR に設定されている場合、\fBscreen-\fR\fI#columns\fR および \fBscreen-\fR\fI#rows\fR によってテキストの列と行を必要な数だけ指定できます。それらはデフォルトでそれぞれ \fB80\fR と \fB24\fR に設定されます。
.RE

.SS "UEFI のみ"
.sp
.ne 2
.mk
.na
\fB\fBBootOrder\fR\fR
.ad
.sp .6
.RS 4n
順序付きのブートオプションロードリスト。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBootNext\fR\fR
.ad
.sp .6
.RS 4n
次回のブート限定のブートオプション。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBootCurrent\fR\fR
.ad
.sp .6
.RS 4n
現在のブート用に選択されたブートオプション。
.RE

.sp
.ne 2
.mk
.na
\fB\fBBoot\fR\fI####\fR\fR
.ad
.sp .6
.RS 4n
ブートロードオプション。\fI####\fR は出力される 16 進数値。16 進数値には \fB0x\fR も \fBh\fR も含まれません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBConIn\fR\fR
.ad
.sp .6
.RS 4n
デフォルトの入力コンソールのデバイスパス。
.RE

.sp
.ne 2
.mk
.na
\fB\fBConOut\fR\fR
.ad
.sp .6
.RS 4n
デフォルトの出力コンソールのデバイスパス。
.RE

.sp
.ne 2
.mk
.na
\fB\fBConInDev\fR\fR
.ad
.sp .6
.RS 4n
使用可能なすべてのコンソール入力デバイスのデバイスパス。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBConOutDev\fR\fR
.ad
.sp .6
.RS 4n
使用可能なすべてのコンソール出力デバイスのデバイスパス。
.RE

.sp
.ne 2
.mk
.na
\fB\fBErrOut\fR\fR
.ad
.sp .6
.RS 4n
デフォルトのエラー出力デバイスのデバイスパス。 
.RE

.sp
.ne 2
.mk
.na
\fB\fBErrOutDev\fR\fR
.ad
.sp .6
.RS 4n
使用可能なすべてのエラー出力デバイスのデバイスパス。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLang\fR\fR
.ad
.sp .6
.RS 4n
システムが構成される言語コード。この値は非推奨です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPlatformLang\fR\fR
.ad
.sp .6
.RS 4n
システムが構成される言語コード。
.RE

.sp
.ne 2
.mk
.na
\fB\fBLangCodes\fR\fR
.ad
.sp .6
.RS 4n
ファームウェアがサポートする言語コード。この値は非推奨です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBPlatformLangCodes\fR\fR
.ad
.sp .6
.RS 4n
ファームウェアがサポートする言語コード。
.RE

.sp
.ne 2
.mk
.na
\fB\fBTimeout\fR\fR
.ad
.sp .6
.RS 4n
デフォルトのブート選択を開始するまでの、ファームウェアのブートマネージャーのタイムアウトの秒数。
.RE

.SH NVRAM の構成パラメータ
.sp
.LP
OpenBoot システムの中には、一部のパラメータをサポートしていないものもあります。デフォルトは、システムや \fBPROM\fR のリビジョンによって異なります。システムのデフォルトを確認するには、\fBok\fR (OpenBoot) プロンプトで \fBprintenv\fR コマンドを入力し、その「Default Value」列の出力を参照してください。
.sp
.ne 2
.mk
.na
\fBauto-boot?\fR
.ad
.sp .6
.RS 4n
\fBtrue\fR の場合、電源投入後やリセット後に自動的にブートします。デフォルトは \fBtrue\fR です。x86 の場合、このパラメータは GRUB メニューファイルによって制御されます。\fBinstallgrub\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fBansi-terminal?\fR
.ad
.sp .6
.RS 4n
端末エミュレータの動作を制御するために使用される構成変数。値 \fBfalse\fR が設定されると、端末エミュレータは \fBANSI\fR エスケープシーケンスを解釈しなくなり、代わりにその情報を出力デバイスにエコーするようになります。デフォルトは \fBtrue\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBboot-args\fR
.ad
.sp .6
.RS 4n
ブートサブシステムに渡される引数の文字列を保持します。たとえば、カスタム JumpStart インストールを要求するには、\fBboot-args=' - install dhcp'\fR を使用します。\fBboot\fR(1M)、\fBkmdb\fR(1)、および \fBkernel\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fBboot-command\fR
.ad
.sp .6
.RS 4n
\fBauto-boot?\fR が \fBtrue\fR の場合に実行されるコマンド。デフォルトは \fBboot\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBboot-device\fR
.ad
.sp .6
.RS 4n
ブート元となるデバイス。\fIboot-device\fR には、0 個以上のデバイス指定子をスペースで区切って含めることができます。各デバイス指定子は、PROM デバイス別名、PROM デバイスパスのいずれかになります。ブート PROM はリスト内の連続する各デバイス指定子のオープンを順次試みますが、その際、先頭のデバイス指定子から順に試みます。最初にオープンに成功したデバイス指定子が、ブート元のデバイスとして使用されます。デフォルトは \fBdisk net\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBboot-device-index\fR
.ad
.sp .6
.RS 4n
デバイスのインデックスを \fBboot-device\fR 変数に記録します。
.RE

.sp
.ne 2
.mk
.na
\fBboot-file\fR
.ad
.sp .6
.RS 4n
ブートするファイル (空の文字列を指定した場合はセカンダリブートプログラムがデフォルトを選択する)。デフォルトは空の文字列です。
.RE

.sp
.ne 2
.mk
.na
\fBboot-from\fR
.ad
.sp .6
.RS 4n
ブートデバイスとブートファイル (OpenBoot PROM バージョン 1.\fIx\fR のみ)。デフォルトは \fBvmunix\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBboot-from-diag\fR
.ad
.sp .6
.RS 4n
診断用のブートデバイスとブートファイル (OpenBoot PROM バージョン 1.\fIx\fR のみ)。デフォルトは \fBle( )unix\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBboot-ncpus\fR
.ad
.sp .6
.RS 4n
システムブート時に使用されるプロセッサの数を制御する構成変数。デフォルトでは、システムブート時に、サポートされる最大数のプロセッサが使用されます。
.RE

.sp
.ne 2
.mk
.na
\fBboot-pool-list\fR
.ad
.sp .6
.RS 4n
プラットフォームが、ブートプールとして使用される専用デバイス (ブートデバイス以外のデバイスからルートファイルシステムをマウントできるオペレーティングシステムでシステムをブートするために使用される専用 ZFS プール) をサポートする場合、この変数は、ブートプールを作成するためにオペレーティングシステムが使用できるストレージデバイスへのデバイスパスの空白で区切られたリストになります。
.RE

.sp
.ne 2
.mk
.na
\fBcom\fIX\fR-noprobe\fR
.ad
.sp .6
.RS 4n
\fIX\fR はシリアルポートの番号。シリアルポート \fIX\fR でのデバイスの検索を行いません。
.RE

.sp
.ne 2
.mk
.na
\fBdiag-device\fR
.ad
.sp .6
.RS 4n
診断ブート元デバイス。デフォルトは \fBnet\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBdiag-file\fR
.ad
.sp .6
.RS 4n
診断モードのブート元となるファイル。デフォルトは空の文字列です。
.RE

.sp
.ne 2
.mk
.na
\fBdiag-level\fR
.ad
.sp .6
.RS 4n
診断レベル。値には \fBoff\fR、\fBmin\fR、\fBmax\fR、\fBmenus\fR が含まれます。プラットフォーム固有の値が追加されている可能性があります。\fBoff\fR に設定すると、\fBPOST\fR は呼び出されません。\fBPOST\fR が呼び出されると、この値は引数として使用可能になり、\fBPOST\fR によって解釈されます。デフォルトは \fBplatform-dependent\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBdiag-switch?\fR
.ad
.sp .6
.RS 4n
\fBtrue\fR の場合、診断モードで実行されます。デフォルトは、大部分のデスクトップシステムでは \fBfalse\fR、大部分のサーバーでは \fBtrue\fR になります。
.RE

.sp
.ne 2
.mk
.na
\fBerror-reset-recovery\fR
.ad
.sp .6
.RS 4n
エラーリセットトラップ後に復旧します。デフォルトは、プラットフォーム固有の設定になります。
.sp
この変数をサポートするプラットフォームでは、\fBwatchdog-reboot?\fR\fBwatchdog-sync?\fR、\fBredmode-reboot?\fR、\fBredmode-sync?\fR、\fBsir-sync?\fR、\fBxir-sync?\fR の各パラメータがこの変数で置き換えられます。 
.sp
オプションは、次のとおりです。
.sp
.ne 2
.mk
.na
\fBnone\fR
.ad
.sp .6
.RS 4n
リセットトラップを記述するメッセージを出力したあと、OpenBoot PROM のユーザーインタフェース、\fBつまり\fR \fBOK\fR プロンプトを表示します。
.RE

.sp
.ne 2
.mk
.na
\fBsync\fR
.ad
.sp .6
.RS 4n
リセットトラップ後に OpenBoot PROM の \fBsync\fR ワードを呼び出します。これは、一部のプラットフォームでは、外部強制リセット (\fBXIR\fR) トラップ後の \fBnone\fR として処理されることがあります。
.RE

.sp
.ne 2
.mk
.na
\fBboot\fR
.ad
.sp .6
.RS 4n
リセットトラップ後にリブートします。これは、一部のプラットフォームでは、\fBXIR\fR トラップ後の \fBnone\fR として処理されることがあります。
.RE

.RE

.sp
.ne 2
.mk
.na
\fBfcode-debug?\fR
.ad
.sp .6
.RS 4n
\fBtrue\fR の場合、プラグインデバイス FCode の名前パラメータを含めます。デフォルトは \fBfalse\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBhardware-revision\fR
.ad
.sp .6
.RS 4n
システムのバージョン情報。
.RE

.sp
.ne 2
.mk
.na
\fBinput-device\fR
.ad
.sp .6
.RS 4n
電源投入時に使用される入力デバイス (通常は \fBkeyboard\fR、\fBttya\fR、または \fBttyb\fR のいずれか)。デフォルトは \fBkeyboard\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBkeyboard-click?\fR
.ad
.sp .6
.RS 4n
\fBtrue\fR の場合、キーボードクリックを有効にします。デフォルトは \fBfalse\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBkeyboard-layout\fR
.ad
.sp .6
.RS 4n
非自己識別キーボード (タイプ 7c) のレイアウト名を指定する文字列。使用可能なレイアウト名のリストを取得するには、\fBkbd\fR \fB-s\fR を呼び出します。\fBkbd\fR(1) を参照してください。 
.RE

.sp
.ne 2
.mk
.na
\fBkeymap\fR
.ad
.sp .6
.RS 4n
カスタムキーボードのキーマップ。
.RE

.sp
.ne 2
.mk
.na
\fBlast-hardware-update\fR
.ad
.sp .6
.RS 4n
システムの更新情報。
.RE

.sp
.ne 2
.mk
.na
\fBload-base\fR
.ad
.sp .6
.RS 4n
クライアントプログラムのデフォルトのロードアドレス。デフォルトの値は \fB16384\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBlocal-mac-address?\fR
.ad
.sp .6
.RS 4n
true の場合、ネットワークドライバはシステムではなくそれ自体の MAC アドレスを使用します。デフォルトは \fBfalse\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBmfg-mode\fR
.ad
.sp .6
.RS 4n
\fBPOST\fR の工場出荷時モード引数。指定可能な値には、\fBoff\fR および \fBchamber\fR が含まれます。この値は \fBPOST\fR に引数として渡されます。デフォルトは \fBoff\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBmfg-switch?\fR
.ad
.sp .6
.RS 4n
true の場合、STOP-A で中断するまでシステムセルフテストを繰り返します。デフォルトは \fBfalse\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBmultipath-boot?\fR
.ad
.sp .6
.RS 4n
true の場合、\fBboot-device\fR 変数で指定された I/O デバイスのリストを、リスト内のデバイスを使用して正常なブートが実行されるまで繰り返します。
.RE

.sp
.ne 2
.mk
.na
\fBnvramrc\fR
.ad
.sp .6
.RS 4n
NVRAMRC の内容。デフォルトは空です。
.RE

.sp
.ne 2
.mk
.na
\fBnetwork-boot-arguments\fR
.ad
.sp .6
.RS 4n
ネットワークブート時に PROM によって使用される引数。デフォルトは空の文字列です。\fBnetwork-boot-arguments\fR を使用すると、使用されるブートプロトコル (RARP/DHCP) や、プロセス中に使用されるさまざまなシステム情報を指定できます。
.sp
ネットワークブートでサポートされる引数の構文は、次のとおりです。
.sp
.in +2
.nf
[\fIprotocol\fR,] [\fIkey\fR=\fIvalue\fR,]*
.fi
.in -2
.sp

すべての引数はオプションであり、指定する順序にも制限はありません。ただし、リストの末尾でない限り、引数の後にはコンマが必要です。ここで指定した引数は、すべてのデフォルト値よりも優先されるほか、DHCP を使ってブートする場合には、それらの引数に対応する DHCP サーバーから提供される構成情報よりも優先されます。
.sp
前述の \fIprotocol\fR  には、使用するアドレス検索プロトコルを指定します。
.sp
\fIkey\fR=\fIvalue\fR 属性ペアには、以下の構成パラメータを指定します。
.sp
.ne 2
.mk
.na
\fB\fBtftp-server\fR\fR
.ad
.sp .6
.RS 4n
TFTP サーバーの IP アドレス。
.RE

.sp
.ne 2
.mk
.na
\fB\fBfile\fR\fR
.ad
.sp .6
.RS 4n
TFTP を使ってダウンロードするファイルの名前、または WANブートの URL。
.RE

.sp
.ne 2
.mk
.na
\fB\fBhost-ip\fR\fR
.ad
.sp .6
.RS 4n
クライアントの IP アドレス (ドット区切り 10 進表記)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBrouter-ip\fR\fR
.ad
.sp .6
.RS 4n
デフォルトのルーターの IP アドレス (ドット区切り 10 進表記)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBsubnet-mask\fR\fR
.ad
.sp .6
.RS 4n
サブネットマスク (ドット区切り 10 進表記)。
.RE

.sp
.ne 2
.mk
.na
\fB\fBclient-id\fR\fR
.ad
.sp .6
.RS 4n
DHCP クライアント識別子。
.RE

.sp
.ne 2
.mk
.na
\fB\fBhostname\fR\fR
.ad
.sp .6
.RS 4n
DHCP トランザクションで使用するホスト名。
.RE

.sp
.ne 2
.mk
.na
\fB\fBhttp-proxy\fR\fR
.ad
.sp .6
.RS 4n
HTTP プロキシサーバー指定 (IPADDR[: PORT])。
.RE

.sp
.ne 2
.mk
.na
\fB\fBtftp-retries\fR\fR
.ad
.sp .6
.RS 4n
TFTP の最大リトライ回数。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdhcp-retries\fR\fR
.ad
.sp .6
.RS 4n
DHCP の最大リトライ回数。
.RE

パラメータが 1 つも指定されなかった場合 (つまり、\fBnetwork-boot-arguments\fR が空の文字列だった場合)、PROM はプラットフォーム固有のデフォルトアドレス検索プロトコルを使用します。
.sp
プロトコルパラメータを指定せずにほかの構成パラメータを指定した場合、暗黙的に手動構成が選択されます。
.sp
手動構成の場合、ブートに必要なすべての情報をクライアントに提供する必要があります。手動構成を使用する場合、PROM が二次ブートプログラムをロードするために必要な情報については、\fBnetwork-boot-arguments\fR に指定する必要がありますが、二次ブートプログラムで必要になる情報については、\fBboot\fR プログラムの引数として指定することも、\fBboot\fR プログラムの対話型コマンドインタプリタ経由で指定することもできます。
.sp
手動構成の使用時に PROM で必要になる情報は、ブート対象クライアントの IP アドレス、ブートファイルの名前、およびブートファイルイメージを提供するサーバーのアドレスです。ネットワーク構成によっては、使用するサブネットマスクやデフォルトルーターのアドレスも指定しなければならない場合があります。
.RE

.sp
.ne 2
.mk
.na
\fBoem-banner\fR
.ad
.sp .6
.RS 4n
カスタム OEM バナー (\fBoem-banner?\fR を \fBtrue\fR に設定すると有効になる)。デフォルトは空の文字列です。
.RE

.sp
.ne 2
.mk
.na
\fBoem-banner?\fR
.ad
.sp .6
.RS 4n
\fBtrue\fR の場合、カスタム \fBOEM\fR バナーを使用します。デフォルトは \fBfalse\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBoem-logo\fR
.ad
.sp .6
.RS 4n
バイト配列のカスタム OEM ロゴ (\fBoem-logo?\fR を \fBtrue\fR に設定すると有効になる)。16 進数で表示されます。
.RE

.sp
.ne 2
.mk
.na
\fBoem-logo?\fR
.ad
.sp .6
.RS 4n
\fBtrue\fR の場合、カスタム OEM ロゴを使用します (それ以外の場合は Sun のロゴを使用する)。デフォルトは \fBfalse\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBos-root-device\fR
.ad
.sp .6
.RS 4n
設定した場合、1 つ以上のルートファイルシステムとルートプールの格納に使用されるデバイスの全体を説明します。ファームウェアから直接アクセスできない (たとえば、ルートデバイスにアクセスできるコードを伴う FCode または ROM がない) ストレージからルートプールをインポートするプラットフォームでは、この変数は初期の Solaris カーネルブートでルートデバイスとファイルシステムを構成するために使用されます。このプロパティーの値はオペレーティングシステム (Solaris など) によってのみ解釈されます。
.sp
OS ルートデバイスの一般的な形式は、セミコロン (\fB;\fR) で区切られたキーと値のペアのセットです。複数のルート記述子はダブルセミコロン (\fB;;\fR) で区切ります。
.sp
例 (単一ルート記述子 (再アセンブルされ、1 行の連続したテキストを形成します)):
.sp
.in +2
.nf
osroot-type=ZFS/iSCSI/IPv4/IPoIB;osroot-iscsi-port=3260;\            
osroot-iscsi-target-ip=141.141.1.2;osroot-iscsi-partition=a;\        
osroot-iscsi-lun=2;osroot-iscsi-target-name=iqn.1986-03.\            
com.sun:02:3a9d3d74-b3ec-43ac-ed6f-c9358c98a366;\                    
osroot-subnet-mask=255.255.255.0;osroot-host-ip=\                    
141.141.1.1;osroot-path=/pci@301/pci@1/pciex15b3,1003@0:\            
port=1,pkey=FFFF,protocol=ip
.fi
.in -2
.sp

別の例 (複数のルート記述子 (再アセンブルされ、1 行の連続したテキストを形成します)):
.sp
.in +2
.nf
osroot-type=ZFS/iSCSI/IPv4/IPoIB;osroot-iscsi-port=3260;\            
osroot-iscsi-target-ip=141.141.1.2;osroot-iscsi-partition=a;\        
osroot-iscsi-lun=2;osroot-iscsi-target-name=iqn.1986-03.\            
com.sun:02:3a9d3d74-b3ec-43ac-ed6f-c9358c98a366;\                    
osroot-subnet-mask=255.255.255.0;osroot-host-ip=\                    
141.141.1.1;osroot-path=/pci@301/pci@1/pciex15b3,1003@0:\            
port=1,pkey=FFFF,protocol=ip;;\                                      
osroot-type=ZFS/iSCSI/IPv4/IPoIB;osroot-iscsi-port=3260;\            
osroot-iscsi-target-ip=141.141.1.2;osroot-iscsi-partition=a;\        
osroot-iscsi-lun=2;osroot-iscsi-target-name=iqn.1986-03.\            
com.sun:02:3a9d3d74-b3ec-43ac-ed6f-c9358c98a366;\                    
osroot-subnet-mask=255.255.255.0;osroot-host-ip=\                    
141.141.1.1;osroot-path=/pci@315/pci@2/pciex15b3,1003@0:\            
port=2,pkey=FFFF,protocol=ip
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fBpci-mem64?\fR
.ad
.sp .6
.RS 4n
true の場合、OpenBoot PROM は、64 ビットアドレスをサポート可能な PCI デバイスに 64 ビット PCI メモリーアドレスを割り当てます。
.sp
この変数は SPARC プラットフォームでのみ使用可能であり、オプションです。SunOS の一部のバージョンでは PCI \fBMEM64\fR アドレスがサポートされていないため、それらのバージョンで OpenBoot PROM が PCI \fBMEM64\fR アドレスを割り当てると、予期しない方法で処理が失敗します。
.sp
デフォルト値はシステムに依存します。この変数が存在する場合、そのデフォルト値は、特定のプラットフォームに付属する SunOS のバージョンのうちでもっとも低いものに適した値になります。
.RE

.sp
.ne 2
.mk
.na
\fBoutput-device\fR
.ad
.sp .6
.RS 4n
電源投入時に使用される出力デバイス (通常は \fBscreen\fR、\fBttya\fR、または \fBttyb\fR のいずれか)。デフォルトは \fBscreen\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBredmode-reboot?\fR
.ad
.sp .6
.RS 4n
redmode リセットトラップ後にリブートする場合は、\fBtrue\fR を指定します。デフォルトは \fBtrue\fR です。(Sun Enterprise 10000 のみ。)
.RE

.sp
.ne 2
.mk
.na
\fBredmode-sync?\fR
.ad
.sp .6
.RS 4n
redmode リセットトラップ後に OpenBoot PROM の \fBsync\fR ワードを呼び出す場合は、\fBtrue\fR を指定します。デフォルトは \fBfalse\fR です。(Sun Enterprise 10000 のみ。)
.RE

.sp
.ne 2
.mk
.na
\fBrootpath\fR
.ad
.sp .6
.RS 4n
オペレーティングシステムのルートデバイスを指定します。
.RE

.sp
.ne 2
.mk
.na
\fBsbus-probe-list\fR
.ad
.sp .6
.RS 4n
どの SBus スロットをどのような順序で検索するかを指定します。デフォルトは \fB0123\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBscreen-#columns\fR
.ad
.sp .6
.RS 4n
画面上の列の数 (1 行の文字数)。デフォルトは \fB80\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBscreen-#rows\fR
.ad
.sp .6
.RS 4n
画面上の行の数 (行数)。デフォルトは \fB34\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBscsi-initiator-id\fR
.ad
.sp .6
.RS 4n
ホストアダプタの \fBSCSI\fR バスアドレスで、範囲は 0 から 7 です。デフォルトは \fB7\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBsd-targets\fR
.ad
.sp .6
.RS 4n
\fBSCSI\fR ディスクユニットをマップします (OpenBoot PROM バージョン 1.\fIx\fR のみ)。デフォルトは \fB31204567\fR ですが、これは、ユニット 0 がターゲット \fB3\fR にマップされ、ユニット 1 がターゲット \fB1\fR にマップされ、といったようになることを意味します。
.RE

.sp
.ne 2
.mk
.na
\fBsecurity-#badlogins\fR
.ad
.sp .6
.RS 4n
セキュリティーパスワードの不正試行回数を報告します。\fBeeprom security-#badlogins=0\fR は値をリセットします。x86 ベースのシステムでは、このプロパティーは特別な意味や動作を持ちません。
.RE

.sp
.ne 2
.mk
.na
\fBsecurity-mode\fR
.ad
.sp .6
.RS 4n
ファームウェアのセキュリティーレベル (オプションは、\fBnone\fR、\fBcommand\fR、または \fBfull\fR)。\fBcommand\fR または \fBfull\fR に設定すると、システムから \fBPROM\fR セキュリティーパスワードの入力を求められます。デフォルトは \fBnone\fR です。x86 ベースのシステムでは、このプロパティーは特別な意味や動作を持ちません。
.RE

.sp
.ne 2
.mk
.na
\fBsecurity-password\fR
.ad
.sp .6
.RS 4n
ファームウェアのセキュリティーパスワード (表示されない)。\fBsecurity-mode\fR が \fBcommand\fR または \fBfull\fR に設定された場合にのみ設定可能です。x86 ベースのシステムでは、このプロパティーは特別な意味や動作を持ちません。
.sp
.in +2
.nf
example# eeprom security-password=
Changing PROM password:
New password:
Retype new password:
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fBselftest-#megs\fR
.ad
.sp .6
.RS 4n
テストする \fBRAM\fR のメガバイト数。\fBdiag-switch?\fR を \fBtrue\fR に設定した場合は無視されます。デフォルトは \fB1\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBsir-sync?\fR
.ad
.sp .6
.RS 4n
ソフトウェア起動リセット (\fBSIR\fR) トラップ後に OpenBoot PROM の \fBsync\fR ワードを呼び出す場合は、\fBtrue\fR を指定します。デフォルトは \fBfalse\fR です。(Sun Enterprise 10000 のみ。)
.RE

.sp
.ne 2
.mk
.na
\fBskip-vme-loopback?\fR
.ad
.sp .6
.RS 4n
\fBtrue\fR の場合、POST は VMEbus ループバックテストを行いません。デフォルトは \fBfalse\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBst-targets\fR
.ad
.sp .6
.RS 4n
\fBSCSI\fR テープユニットをマップします (OpenBoot PROM バージョン 1.\fIx\fR のみ)。デフォルトは \fB45670123\fR ですが、これは、ユニット 0 がターゲット \fB4\fR にマップされ、ユニット 1 がターゲット \fB5\fR にマップされ、といったようになることを意味します。
.RE

.sp
.ne 2
.mk
.na
\fBsunmon-compat?\fR
.ad
.sp .6
.RS 4n
\fBtrue\fR の場合、制限モニタープロンプト ( >) を表示します。デフォルトは \fBfalse\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBtboot-list\fR
.ad
.sp .6
.RS 4n
プラットフォームが、フォールバックブートメカニズム (プライマリブートデバイスの障害イベントでシステムがブートできるようにするブート可能イメージを保持するストレージデバイスを表すデバイスまたはデバイスセット) をサポートする場合、この変数は、オペレーティングシステムがブートデバイス変数に追加する (通常は末尾でプライマリブートデバイスの後) 必要のあるデバイスパスの空白で区切られたリストを保持します。
.RE

.sp
.ne 2
.mk
.na
\fBtestarea\fR
.ad
.sp .6
.RS 4n
読み取り/書き込みテストで使用可能な 1 バイトのスクラッチフィールド。デフォルトは \fB0\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBtpe-link-test?\fR
.ad
.sp .6
.RS 4n
内蔵されている、より対線 Ethernet に対する 10baseT リンクテストを有効にします。デフォルトは \fBtrue\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBttya-mode\fR
.ad
.sp .6
.RS 4n
\fBTTYA\fR (ボーレート、ビット数、パリティー、ストップ数、ハンドシェーク)。デフォルトは \fB9600,8,n,1,-\fR です。
.sp
各フィールドは次のとおりです (左から右へ)。 
.sp
.ne 2
.mk
.na
\fBボーレート:\fR
.ad
.sp .6
.RS 4n
110、300、1200、4800、9600 . . . 
.RE

.sp
.ne 2
.mk
.na
\fBデータビット数:\fR
.ad
.sp .6
.RS 4n
5、6、7、8
.RE

.sp
.ne 2
.mk
.na
\fBパリティー:\fR
.ad
.sp .6
.RS 4n
n(none)、e(even)、o(odd)、m(mark)、s(space)
.RE

.sp
.ne 2
.mk
.na
\fBストップビット数:\fR
.ad
.sp .6
.RS 4n
1、1.5、2
.RE

.sp
.ne 2
.mk
.na
\fBハンドシェーク:\fR
.ad
.sp .6
.RS 4n
-(none)、h(hardware:rts/cts)、s(software:xon/xoff)
.RE

.RE

.sp
.ne 2
.mk
.na
\fBttyb-mode\fR
.ad
.sp .6
.RS 4n
\fBTTYB\fR (ボーレート、ビット数、パリティー、ストップ数、ハンドシェーク)。デフォルトは \fB9600,8,n,1,-\fR です。
.sp
各フィールドは次のとおりです (左から右へ)。 
.sp
.ne 2
.mk
.na
\fBボーレート:\fR
.ad
.sp .6
.RS 4n
110、300、1200、4800、9600 . . . 
.RE

.sp
.ne 2
.mk
.na
\fBデータビット数:\fR
.ad
.sp .6
.RS 4n
5、6、7、8
.RE

.sp
.ne 2
.mk
.na
\fBストップビット数:\fR
.ad
.sp .6
.RS 4n
1、1.5、2
.RE

.sp
.ne 2
.mk
.na
\fBパリティー:\fR
.ad
.sp .6
.RS 4n
n(none)、e(even)、o(odd)、m(mark)、s(space)
.RE

.sp
.ne 2
.mk
.na
\fBハンドシェーク:\fR
.ad
.sp .6
.RS 4n
-(none)、h(hardware:rts/cts)、s(software:xon/xoff)
.RE

.RE

.sp
.ne 2
.mk
.na
\fBttya-ignore-cd\fR
.ad
.sp .6
.RS 4n
\fBtrue\fR の場合、オペレーティングシステムは TTYA でのキャリア検出を無視します。デフォルトは \fBtrue\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBttyb-ignore-cd\fR
.ad
.sp .6
.RS 4n
\fBtrue\fR の場合、オペレーティングシステムは TTYB でのキャリア検出を無視します。デフォルトは \fBtrue\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBttya-rts-dtr-off\fR
.ad
.sp .6
.RS 4n
\fBtrue\fR の場合、オペレーティングシステムは TTYA で DTR と RTS を表明しません。デフォルトは \fBfalse\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBttyb-rts-dtr-off\fR
.ad
.sp .6
.RS 4n
\fBtrue\fR の場合、オペレーティングシステムは TTYB で DTR と RTS を表明しません。デフォルトは \fBfalse\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBuse-nvramrc?\fR
.ad
.sp .6
.RS 4n
\fBtrue\fR の場合、システムの起動中に \fBNVRAMRC\fR 内のコマンドを実行します。デフォルトは \fBfalse\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBverbosity\fR
.ad
.sp .6
.RS 4n
PROM メッセージの詳細レベルを制御します。\fBdebug\fR、\fBmax\fR、\fBnormal\fR、\fBmin\fR、または \fBnone\fR のいずれかを指定できます。デフォルトは \fBnormal\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBversion2?\fR
.ad
.sp .6
.RS 4n
\fBtrue\fR の場合、ハイブリッド (1.\fIx\fR/2.\fIx\fR) PROM がバージョン 2.\fIx\fR で起動されます。デフォルトは \fBtrue\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBwatchdog-reboot?\fR
.ad
.sp .6
.RS 4n
\fBtrue\fR の場合、ウォッチドッグリセット後にリブートします。デフォルトは \fBfalse\fR です。
.RE

.sp
.ne 2
.mk
.na
\fBwatchdog-sync?\fR
.ad
.sp .6
.RS 4n
ウォッチドッグリセットトラップ後に OpenBoot PROM の \fBsync\fR ワードを呼び出す場合は、\fBtrue\fR を指定します。デフォルトは \fBfalse\fR です。(Sun Enterprise 10000 のみ。)
.RE

.sp
.ne 2
.mk
.na
\fBxir-sync?\fR
.ad
.sp .6
.RS 4n
\fBXIR\fR トラップ後に OpenBoot PROM の \fBsync\fR ワードを呼び出す場合は、\fBtrue\fR を指定します。デフォルトは \fBfalse\fR です。(Sun Enterprise 10000 のみ。)
.RE

.SH 使用例
.LP
\fB例 1 \fRRAM のメガバイト数の変更
.sp
.LP
次の例は、システムがテストする \fBRAM\fR のメガバイト数を 1 から 2 に変更する方法を示しています。

.sp
.in +2
.nf
example# \fBeeprom selftest-#megs\fR
selftest-#megs=1

example# eeprom selftest-#megs=2

example# \fBeeprom selftest-#megs\fR
selftest-#megs=2
.fi
.in -2
.sp

.LP
\fB例 2 \fR\fBauto-boot?\fR パラメータを \fBtrue\fR に設定する。
.sp
.LP
次の例は、\fBauto-boot?\fR パラメータを \fBtrue\fR に設定する方法を示しています。

.sp
.in +2
.nf
example# \fBeeprom auto-boot?=true\fR
.fi
.in -2
.sp

.sp
.LP
\fBeeprom\fR コマンドをユーザーモードで実行する場合、末尾に疑問符 (?) の付くパラメータを二重引用符 (“ “) で囲み、その疑問符がシェルによって解釈されないようにする必要があります。疑問符がシェルによって解釈されないようにするには、疑問符の前にエスケープ文字 (\fB\\fR) を付けてもかまいません。

.sp
.in +2
.nf
\fBexample% eeprom "auto-boot?"=true\fR
.fi
.in -2
.sp

.LP
\fB例 3 \fR\fBnetwork-boot-arguments\fR の使用
.sp
.LP
DHCP をブートプロトコルとして使用し、ネットワークブート時にホスト名 \fBabcd.example.com\fR を使用するには、\fBnetwork-boot-arguments\fR 内でこれらの値を次のように設定します。

.sp
.in +2
.nf
example# \fBeeprom network-boot-arguments="dhcp,hostname=abcd.example.com"\fR
.fi
.in -2
.sp

.sp
.LP
そして、次のコマンドを使用してブートします。

.sp
.in +2
.nf
ok \fBboot net\fR
.fi
.in -2
.sp

.sp
.LP
PROM コマンド行からネットワークブート引数を指定すると、\fBnetwork-boot-arguments\fR の内容が無視されます。たとえば、\fBnetwork-boot-arguments\fR が前述のように設定された状態で次の \fBboot\fR コマンドを実行します。

.sp
.in +2
.nf
ok \fBboot net:dhcp\fR
.fi
.in -2
.sp

.sp
.LP
このとき、DHCP は使用されますが、\fBnetwork-boot-arguments\fR に指定された \fBhostname\fR はネットワークブート時に使用されません。

.LP
\fB例 4 \fR補助デバイスへのシステムコンソールの設定
.sp
.LP
次のコマンドは、デバイス \fB/dev/term/a\fR をシステムのコンソールデバイスとして割り当てます。そのような割り当ては、\fBtip\fR(1) を使用してホストへの \fBtip\fR 接続を確立する前に行います。

.sp
.LP
SPARC マシンの場合:

.sp
.in +2
.nf
# \fBeeprom output-device=/dev/term/a\fR
.fi
.in -2
.sp

.sp
.LP
x86 マシンの場合:

.sp
.in +2
.nf
# \fBeeprom console=ttya\fR
.fi
.in -2
.sp

.sp
.LP
SPARC マシンの場合、コンソールを補助デバイスに割り当てるには、前述のコマンドで十分です。x86 マシンの場合はさらに、シリアル回線の特性を設定しなければいけない可能性がありますが、その方法については、そのマシンの BIOS のドキュメントを参照する必要があります。また、一部の x86 マシンでは、前述のデバイス \fBa\fR 以外のデバイスを使用する可能性もあります。たとえば、2 つ目のシリアル回線が存在する場合は、コンソールを \fBttyb\fR に設定することもできます。

.LP
\fB例 5 \fRSPARC システムでの \fBkmdb\fR を使用したブートの指定
.sp
.LP
SPARC マシンが \fBkmdb\fR(1) を使用してブートするように指定するには、次のコマンドを入力します。

.sp
.in +2
.nf
# \fBeeprom boot-command="boot -k"\fR
.fi
.in -2
.sp

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/boot/solaris/bootenv.rc\fR\fR
.ad
.sp .6
.RS 4n
x86 マシンで \fBeeprom\fR 値を格納するファイル。
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/openprom\fR\fR
.ad
.sp .6
.RS 4n
デバイスファイル
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/platform/\fR\fIplatform-name\fR\fB/sbin/eeprom\fR\fR
.ad
.sp .6
.RS 4n
プラットフォーム固有のバージョンの \fBeeprom\fR。\fIplatform-name\fR を取得するには \fBuname\fR \fB-i\fR を使用します。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
.TE

.SH 関連項目
.sp
.LP
\fBkmdb\fR(1), \fBpasswd\fR(1), \fBsh\fR(1), \fBsvcs\fR(1), \fBtip\fR(1), \fBuname\fR(1), \fBboot\fR(1M), \fBkernel\fR(1M), \fBinit\fR(1M), \fBsvcadm\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
.sp
.LP
『\fIOpenBoot 3.x Command Reference Manual\fR』
.sp
.LP
\fI『ONC+ RPC Developer\&'s Guide』\fR 
