Alhadis/Silos/Solaris 11.3/ja_JP.UTF-8/man1m/halt.1m
'\" te
.\" Copyright (c) 2004, 2012, Oracle and/or its affiliates. All rights reserved.
.TH halt 1M "2012 年 2 月 28 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
halt, poweroff \- プロセッサの停止
.SH 形式
.LP
.nf
\fB/usr/sbin/halt\fR [\fB-dlnqy\fR]
.fi

.LP
.nf
\fB/usr/sbin/poweroff\fR [\fB-dlnqy\fR]
.fi

.SH 機能説明
.sp
.LP
\fBhalt\fR および \fBpoweroff\fR ユーティリティは、保留されている情報をディスクに書き出してから、プロセッサを停止させます。\fBpoweroff\fR ユーティリティは、可能であれば、マシンの電源を自動的に切断します。
.sp
.LP
\fBhalt\fR および \fBpoweroff\fR ユーティリティーは通常、システムシャットダウンをシステムログデーモン \fBsyslogd\fR(1M) に送信し、ログインアカウントファイル \fB/var/adm/wtmpx\fR にシャットダウン情報を記録します。これらの処理を抑制するには、\fB-n\fR または \fB-q\fR オプションを指定します。
.SH オプション
.sp
.LP
サポートしているオプションは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 6n
.rt  
リブートする前に、システムクラッシュダンプを行います。システムクラッシュダンプの構成については、\fBdumpadm\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 6n
.rt  
\fBhalt\fR を実行したユーザーに関するメッセージを、システムログデーモン \fBsyslogd\fR(1M) に送信しないようにします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 6n
.rt  
停止前の \fBsync\fR(1M) を行いません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR\fR
.ad
.RS 6n
.rt  
即時停止。通常のシャットダウンを実行しません。
.RE

.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/var/adm/wtmp\fR \fR
.ad
.RS 18n
.rt  
ユーザーアクセスと管理情報の履歴
.RE

.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
.TE

.SH 関連項目
.sp
.LP
\fBdumpadm\fR(1M), \fBinit\fR(1M), \fBreboot\fR(1M), \fBshutdown\fR(1M), \fBsync\fR(1M), \fBsyslogd\fR(1M), \fBinittab\fR(4), \fBattributes\fR(5), \fBsmf\fR(5)
.SH 注意事項
.sp
.LP
\fBhalt\fR および \fBpoweroff\fR ユーティリティーは、\fBsmf\fR(5) サービスを正常にシャットダウンしません。また、\fB/etc/rc\fInum\fR.d\fR のスクリプトや \fBinittab\fR(4) のシャットダウン処理も実行しません。システムサービスが完全にシャットダウンされるようにするには、\fBshutdown\fR(1M) または \fBinit\fR(1M) を使用して Solaris システムをリブートします。
