Alhadis/Silos/Solaris 11.3/ja_JP.UTF-8/man1m/ilbd.1m
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.TH ilbd 1M "2009 年 11 月 9 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
ilbd \- ILB デーモン
.SH 形式
.LP
.nf
\fB/usr/lib/inet/ilbd\fR
.fi

.SH 機能説明
.sp
.LP
統合ロードバランサ (ILB) デーモン \fBilbd\fR は、ILB のユーザーレベルのサービスを提供します。サービス管理機能 (\fBsmf\fR(5) を参照) によって起動されるシステムデーモンです。障害管理リソース識別子 (FMRI) は次のとおりです。
.sp
.in +2
.nf
svc:/network/loadbalancer/ilb:default
.fi
.in -2
.sp

.sp
.LP
\fBilbd\fR はコンソリデーション専用の非公開インタフェースです。\fBattributes\fR(5) を参照してください。
.sp
.LP
\fBilbd\fR では管理インタフェースは提供されません。ILB の管理はすべて \fBilbadm\fR(1M) またはプログラミングライブラリ \fBlibilb\fR(3LIB) を介して行うようにしてください。
.SH オプション
.sp
.LP
\fBilbd\fR デーモンにオプションはありません。
.SH 使用例
.LP
\fB例 1 \fRILB サービスの有効化
.sp
.LP
次のコマンドは、ILB サービスを有効にします。

.sp
.in +2
.nf
# \fBsvcadm enable svc:/network/loadbalancer/ilb:default\fR
.fi
.in -2
.sp

.LP
\fB例 2 \fRILB サービスの無効化
.sp
.LP
次のコマンドは、ILB サービスを無効にします。

.sp
.in +2
.nf
# \fBsvcadm disable svc:/network/loadbalancer/ilb:default\fR
.fi
.in -2
.sp

.SH エラー
.sp
.LP
\fBilbd\fR デーモンは \fBsyslog\fR(3C) を使用してステータスおよびエラーメッセージを報告します。すべてのメッセージは、\fBLOG_DAEMON\fR 機能を使用して記録されます。エラーメッセージは \fBLOG_ERR\fR および \fBLOG_NOTICE\fR 優先度で記録され、情報メッセージは \fBLOG_INFO\fR 優先度で記録されます。\fB/etc/syslog.conf\fR ファイルのデフォルトのエントリでは、\fBilbd\fR デーモンのすべてのエラーメッセージが \fB/var/adm/messages\fR ログに記録されます。
.SH ファイル
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/inet/ilbd\fR\fR
.ad
.sp .6
.RS 4n
ILB デーモンのバイナリ
.RE

.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件service/network/load-balancer/ilb
_
インタフェースの安定性プロジェクト非公開
.TE

.SH 関連項目
.sp
.LP
\fBsvcs\fR(1), \fBilbadm\fR(1M), \fBsvcadm\fR(1M), \fBsyslog\fR(3C), \fBlibilb\fR(3LIB), \fBsyslog.conf\fR(4), \fBattributes\fR(5), \fBsmf\fR(5)
.SH 注意事項
.sp
.LP
\fBilbd\fR サービスは、サービス管理機能 \fBsmf\fR(5) によって、次の障害管理リソース識別子 (FMRI) の下で管理されます。
.sp
.in +2
.nf
svc:/network/loadbalancer/ilb:default
.fi
.in -2
.sp

.sp
.LP
有効化、無効化、または再起動要求など、このサービスに関する管理操作は、\fBsvcadm\fR(1M) を使用して実行できます。サービスステータスを照会するには、\fBsvcs\fR(1) コマンドを使用します。サービスを管理するには、承認 \fBsolaris.smf.manage.ilb\fR が付与されている必要があります。または、権利プロファイル「ILB Management」を付与する方法もあります。
.sp
.LP
\fBilbadm\fR(1M) コマンドやその他の \fBlibilb\fR(3LIB) クライアントアプリケーションが正しく機能するには、ILB サービスが有効になっている必要があります。
