Alhadis/Silos/Solaris 11.3/ja_JP.UTF-8/man1m/installadm.1m
'\" te
.\" Copyright (c) 2008, 2015, Oracle and/or its affiliates.All rights reserved.
.TH installadm 1M "2015 年 4 月 7 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
installadm \- ネットワーク上の自動インストールの管理
.SH 形式
.LP
.nf
/usr/sbin/installadm [\fIsubcommand\fR] [-h|--help]
.fi

.LP
.nf
installadm help [\fIsubcommand\fR]
.fi

.LP
.nf
\fBinstalladm create-service\fR [\fB-n\fR <\fIsvcname\fR>]
        [\fB-p\fR <\fIprefix\fR>=<\fIorigin\fR>
        [\fB-K\fR <\fIkeypath\fR> \fB-C\fR <\fIcertpath\fR>]]
        [\fB-a\fR <\fIarchitecture\fR>]
        [\fB-s\fR <\fIFMRI/ISO\fR> |
         \fB-t\fR <\fIexisting_service\fR>]
        [\fB-b\fR <\fIboot property\fR>=<\fIvalue\fR>,... | \fB-G\fR <\fIgrub.cfg\fR>]
        [\fB-i\fR <\fIdhcp_ip_start\fR> \fB-c\fR <\fIcount_of_ipaddr\fR>]
        [\fB-B\fR <\fIserver_ipaddr\fR>]
        [\fB-M\fR <\fImanifest file\fR>]
        [\fB-d\fR <\fIimagepath\fR>]
        [\fB-y\fR]
.fi

.LP
.nf
\fBinstalladm set-service\fR [\fBoptions\fR] \fB-n\fR <\fIsvcname\fR>
        [\fB-t\fR <\fIexisting_service\fR>]
        [\fB-M\fR <\fImanifest name\fR>]
        [\fB-d\fR <\fIimagepath\fR>]
        [\fB-e\fR | \fB-D\fR]
        [\fB-G\fR [\fBnone\fR|<\fIgrub.cfg\fR>]
        [\fB-b\fR [\fBnone\fR|<\fIproperty\fR>=<\fIvalue\fR>[,... ]]
        [\fB-p\fR <\fIpolicy\fR>]]
        [\fB-x\fR [\fB--hash\fR <\fIca-hash\fR>]]
        [\fB-A\fR <\fIca-certfile\fR>...]
        [\fB-C\fR <\fIcertfile\fR> \fB-K\fR <\fIkeyfile\fR>]
        [\fB-g\fR] [\fB-E\fR] [\fB-H\fR]
.fi

.LP
.nf
installadm update-service [\fB-s\fR \fIFMRI\fR]
        [\fB-p\fR <\fIpublisher\fR>=<\fBorigin\fR>
            [\fB-K\fR <\fIkeypath\fR> \fB-C\fR <\fIcertpath\fR>]]
        \fB-n\fR <\fIsvcname\fR>
.fi

.LP
.nf
\fBinstalladm rename-service\fR \fB-n\fR <\fIsvcname\fR> \fB-N\fR <\fInewsvcname\fR>
.fi

.LP
.nf
\fBinstalladm enable\fR \fB-n\fR <\fIsvcname\fR>
.fi

.LP
.nf
\fBinstalladm disable\fR \fB-n\fR <\fIsvcname\fR>
.fi

.LP
.nf
\fBinstalladm delete-service\fR [\fB-r\fR] [\fB-y\fR] \fB-n\fR <\fIsvcname\fR>
.fi

.LP
.nf
installadm list [-a|--all | -s|--server -c|--client -m|--manifest -p|--profile]
                [-v|--verbose] [-n|--service <\fIsvcname\fR>]
.fi

.LP
.nf
installadm list [-v|--verbose] -e|--macaddr <\fImacaddr\fR>
.fi

.LP
.nf
installadm create-manifest [\fIoptions\fR] [\fIsource_options\fR] 
              -n|--service <\fIsvcname\fR>
.fi

.LP
.nf
installadm update-manifest -n <\fIsvcname\fR> -m <\fImanifest\fR>
.fi

.LP
.nf
installadm update-manifest -n <\fIsvcname\fR> -f <\fIfilename\fR>
               [-m <\fImanifest\fR>] [-e]
.fi

.LP
.nf
\fBinstalladm delete-manifest\fR \fB-n\fR <\fIsvcname\fR> \fB-m\fR <\fImanifest\fR>
.fi

.LP
.nf
\fBinstalladm create-profile\fR \fB-n\fR <\fIsvcname\fR> \fB-f\fR <\fIfilename\fR> ...
         [\fB-p\fR <\fIprofile\fR>]
         [\fB-c\fR <\fIcriteria\fR>=<\fIvalue|list|range\fR> ... |
         \fB-C\fR <\fIcriteriafile\fR>]
          [-e install|system|all[,...] ]
.fi

.LP
.nf
installadm set-profile -n <\fIsvcname\fR> -p <\fIprofile name\fR> 
                 [-P <\fInew profile name\fR>] 
                 [-e install|system|all[,...] ]
.fi

.LP
.nf
\fBinstalladm update-profile\fR \fB-n\fR <\fIsvcname\fR> \fB-f\fR <\fIfilename\fR>
        [\fB-p\fR <\fIprofile\fR>]
.fi

.LP
.nf
\fBinstalladm delete-profile\fR \fB-n\fR <\fIsvcname\fR> \fB-p\fR <\fIprofile\fR> ...
.fi

.LP
.nf
\fBinstalladm export\fR [\fB-o\fR <\fIpath\fR>] \fB-n\fR <\fIsvcname\fR>
        [\fB-m\fR <\fImanifest name\fR>]...  [\fB-p\fR <\fIprofile name\fR>]...
.fi

.LP
.nf
\fBinstalladm export\fR [\fB-o\fR <\fIpath\fR>]
        \fB-n\fR <\fIsvcname\fR> | \fB-e\fR <\fImacaddr\fR>
        \fB-G\fR
.fi

.LP
.nf
\fBinstalladm export\fR [\fB-o\fR <\fIpath\fR>]
        \fB-s\fR | \fB-n\fR <\fIsvcname\fR> | \fB-c\fR | \fB-e\fR <\fImacaddr\fR>
        [\fB-C\fR] [\fB-K\fR] [\fB-A\fR]
.fi

.LP
.nf
\fBinstalladm validate\fR \fB-n\fR <\fIsvcname\fR>
        [\fB-M\fR <\fImanifest_path\fR>]...
        [\fB-m\fR <\fImanifest_name\fR>]...
        [\fB-P\fR <\fIprofile_path\fR>]...
        [\fB-p\fR <\fIprofile_name\fR>]...
.fi

.LP
.nf
\fBinstalladm set-criteria\fR \fB-n\fR <\fIsvcname\fR>
        [\fB-m\fR <\fImanifest\fR>] [\fB-p\fR <\fBprofile\fR>]...
        [[\fB-c\fR <\fIcriteria\fR>=<\fIvalue|list|range\fR>]... |
         [\fB-C\fR <\fIcriteria.xml\fR>] |
         [\fB-a\fR <\fIcriteria\fR>=<\fIvalue|list|range\fR>]... |
         [\fB-d\fR <\fIcriteria\fR>]... |
         [\fB-D\fR]]
.fi

.LP
.nf
\fBinstalladm create-client\fR \fB-n\fR <\fIsvcname\fR>
        \fB-e\fR <\fImacaddr\fR>
        [\fB-b\fR <\fIproperty\fR>=<\fIvalue\fR>,...]
        [\fB-G\fR <\fIgrub.cfg\fR>]
.fi

.LP
.nf
\fBinstalladm set-client\fR \fB-e\fR <\fImacaddr\fR>
        [\fB-n\fR <\fIsvcname\fR>]
        [\fB-b\fR [\fBnone\fR|<\fIproperty>=<value\fR>,... ]]
        [\fB-G\fR [\fBnone\fR|<\fIgrub.cfg\fR>]
        [\fB-g\fR]
        [\fB-x\fR [\fB-y\fR] [\fB--hash\fR <\fIca-hash\fR>]
        [\fB-A\fR <\fIca-certfile\fR>]...
        [\fB-C\fR <\fIcertfile\fR> \fB-K\fR <\fIkeyfile\fR>]
        [\fB-E\fR]
        [\fB-H\fR]
.fi

.LP
.nf
\fBinstalladm set-server\fR
        [\fB-i\fR <\fIdhcp_ip_start\fR> \fB-c\fR <\fIcount_of_ipaddr\fR>]
        [\fB-p\fR <\fIport\fR>]
        [\fB-P\fR <\fIsecure_port\fR>]
        [\fB-d\fR <\fIdirectory\fR>]
        [\fB-l all\fR|<\fICIDR\fR>[,...] | [\fB-L none\fR|<\fICIDR\fR>[,...]]]
        [\fB-m | -M\fR]
        [\fB-u | -U\fR]
        [\fB-z | -Z\fR]
        [\fB-s | -S\fR]
        [[\fB-D\fR]
         [\fB-x\fR [\fB-r\fR] [\fB--hash\fR <\fIca-hash\fR>]]
         [\fB-g\fR]
         [\fB-A\fR <\fIca-certfile\fR>...]
         [\fB-C\fR <\fIcertfile\fR> \fB-K\fR <\fIkeyfile\fR>]
         [\fB-E\fR]
         [\fB-H\fR]]
.fi

.LP
.nf
\fBinstalladm execute\fR \fB-f\fR <\fIfile\fR>
.fi

.SH 機能説明
.sp
.LP
\fBinstalladm\fR は対話形式で個々のサブコマンドを使って呼び出すことも、一連のサブコマンドが含まれているコマンドファイルを指定して呼び出すこともできます。
.sp
.LP
自動インストーラ (AI) は、1 つ以上の SPARC および x86 システムにネットワーク経由で Oracle Solaris OS を自動インストールするために使用します。
.sp
.LP
ネットワーク経由で AI を使用するために必要なマシントポグラフィーは、インストールサーバー、DHCP サーバー (これはインストールサーバーと同じシステムでもよい)、およびインストールクライアントです。インストールサーバーでは、AI ブートイメージ (クライアントがネットワーク経由でブートするために提供される)、入力仕様 (AI マニフェストと派生したマニフェストスクリプトのいずれかがクライアント用に選択される)、およびサービス管理機能 (SMF) 構成プロファイル (このうちゼロ個以上がクライアント用に選択される) が含まれるようにインストールサービスが設定されます。
.sp
.LP
AI ブートイメージの内容は、パッケージ \fBinstall-image/solaris-auto-install\fR として公開され、\fBcreate-service\fR サブコマンドでインストールされます。 \fBcreate-service\fR サブコマンドを使用すると、AI ブートイメージを作成する AI ISO ファイルを受け入れて、展開することもできます。
.sp
.LP
インストールサービスはデフォルトの AI マニフェストを使用して作成されますが、\fBcreate-manifest\fR サブコマンドを使用して、カスタマイズされたマニフェストまたは派生したマニフェストスクリプト (今後は「スクリプト」と呼びます) をインストールサービスに追加できます。マニフェストおよび派生したマニフェストスクリプトの作成方法についての詳細は、\fI『Installing Oracle Solaris 11.3 Systems』\fRを参照してください。マニフェストは、対話型マニフェストエディタ CLI を使用して編集することもできます。マニフェストエディタ CLI は対話型のインタフェースであり、\fBcreate-manifest\fR および \fBupdate-manifest\fR サブコマンドを使用して呼び出すことができ、AI マニフェストの内容を、対話型のインタフェースのプロンプトで入力するサブコマンドを使用して操作できるオブジェクトおよびプロパティーのセットとして表します。これにより、XML ドキュメントを確認したり理解したりしなくても、マニフェストを編集できます (後述の「マニフェストエディタ CLI」のセクションを参照)。\fBcreate-manifest\fR サブコマンドを使用して、インストールクライアント用に選択するマニフェストまたはスクリプトを決定する際に使用される条件を指定することもできます。すでにマニフェストまたはスクリプトに関連付けられている条件は、\fBset-criteria\fR サブコマンドを使用して変更できます。
.sp
.LP
マニフェストには、ターゲットデバイス、パーティション情報、パッケージの一覧、その他のパラメータなどの情報を含めることができます。スクリプトには、実行中の AI クライアントシステムを照会し、検索した情報に基づいてカスタムマニフェストを作成するコマンドが含まれています。スクリプトで AI が起動されると、AI はそのスクリプトを最初のタスクとして実行し、マニフェストを生成します。
.sp
.LP
クライアントがブートすると、クライアントのマシン条件に一致するマニフェストまたはスクリプトの検索が開始されます。一致するマニフェストまたはスクリプトが見つかると、一致するマニフェストファイルの仕様、または一致するスクリプトから派生したマニフェストファイルの仕様に従って、クライアントに Oracle Solaris リリースがインストールされます。各クライアントは、マニフェストまたはスクリプトを 1 つだけ使用できます。
.sp
.LP
各サービスには、デフォルトのマニフェストまたはスクリプトが 1 つ含まれています。このデフォルトは、インストールされるシステムに一致するマニフェストまたはスクリプトの条件がほかに存在しない場合に使用されます。任意のマニフェストまたはスクリプトをデフォルトとして指定できます。デフォルトマニフェストは関連付けられた条件を持つことができ、これを使って一致するマニフェストの検索が試みられますが、ほかに一致するマニフェストが見つからない場合には、これがデフォルトとして返されます。条件が関連付けられていないマニフェストまたはスクリプトは、デフォルトのマニフェストまたはスクリプトとしてのみ使用できます。条件がないマニフェストまたはスクリプトは、別のマニフェストまたはスクリプトがデフォルトに指定されると非アクティブになります。
.sp
.LP
システム構成プロファイルは、インストールの仕様も含むという点で、マニフェストやスクリプトを補完するものです。プロファイルは、特にユーザー名、ユーザーパスワード、タイムゾーン、ホスト名、IP アドレスなどの構成情報を指定するために使用されます。プロファイルには、インストール時に、インストールされるクライアントに適した値に置き換えられる変数が含まれていることがあります。このように、単一のプロファイルファイルで、さまざまなクライアントにさまざまな構成パラメータを設定できます。「使用例」のセクションを参照してください。
.sp
.LP
システム構成プロファイルは \fBsmf\fR(5) によって処理され、ドキュメント形式 \fBservice_bundle\fR(4) に準拠しています。システム構成プロファイルの詳細は、\fBsysconfig\fR(1M) およびChapter 11, \fI「Configuring the Client System,」\fR in \fI『Installing Oracle Solaris 11.3 Systems 』\fRを参照してください。各クライアントは、任意の数のシステム構成プロファイルを使用できます。特定の SMF プロパティーは、クライアントシステムごとに 1 回しか指定できません。
.sp
.LP
特定のクライアントが特定のインストールサービスを使用する場合は、\fBcreate-client\fR サブコマンドを使用してクライアントをサービスに関連付けることができます。\fBset-client\fR を使用して既存のクライアントを変更することもできます。
.sp
.LP
自動インストールは、TLS (Transport Layer Security) プロトコルを使用してセキュリティー保護できます。個人証明書と鍵ペアおよび認証局 (CA) 証明書をインストールサーバーやクライアントに割り当てることができます。SPARC クライアントのブートファイルのネットワークダウンロードは、OBP ハッシュダイジェストおよび暗号化鍵を使用してさらにセキュリティー保護されます。自動インストールは、次の方法でセキュリティー保護できます。
.RS +4
.TP
.ie t \(bu
.el o
サーバー認証: サーバーの識別情報を確認できます。
.RE
.RS +4
.TP
.ie t \(bu
.el o
クライアント認証: クライアントの識別情報を確認できます。
.RE
.RS +4
.TP
.ie t \(bu
.el o
自動インストールへのアクセスを制御できます。
.RE
.RS +4
.TP
.ie t \(bu
.el o
サーバーデータへのアクセスを制御できます。
.RE
.RS +4
.TP
.ie t \(bu
.el o
クライアントデータは、すべてのクライアントに対して、または指定されたクライアントに対して個別に保護できます。
.RE
.RS +4
.TP
.ie t \(bu
.el o
データがネットワーク経由で読み取られることがないようにデータを暗号化できます。
.RE
.RS +4
.TP
.ie t \(bu
.el o
セキュアな IPS パッケージリポジトリにアクセスできます。
.RE
.RS +4
.TP
.ie t \(bu
.el o
ユーザー指定のディレクトリを、Web サーバーによってセキュアに公開できます。このディレクトリにアクセスするには、クライアント認証が必要です。
.RE
.sp
.LP
\fBinstalladm\fR ユーティリティーを使用して次のタスクを実行できます。
.RS +4
.TP
.ie t \(bu
.el o
AI サーバー SMF サービスの構成
.RE
.RS +4
.TP
.ie t \(bu
.el o
インストールサービスおよび別名の設定
.RE
.RS +4
.TP
.ie t \(bu
.el o
特定のインストールサービスのネットイメージを更新する
.RE
.RS +4
.TP
.ie t \(bu
.el o
インストールイメージの設定
.RE
.RS +4
.TP
.ie t \(bu
.el o
クライアントの設定または削除
.RE
.RS +4
.TP
.ie t \(bu
.el o
マニフェストおよびスクリプトの追加、更新、または削除
.RE
.RS +4
.TP
.ie t \(bu
.el o
マニフェストまたはスクリプトに対する条件の指定または変更
.RE
.RS +4
.TP
.ie t \(bu
.el o
マニフェストおよびスクリプトのエクスポート
.RE
.RS +4
.TP
.ie t \(bu
.el o
システム構成プロファイルの追加または削除
.RE
.RS +4
.TP
.ie t \(bu
.el o
プロファイルの検証
.RE
.RS +4
.TP
.ie t \(bu
.el o
プロファイルに対する条件の指定または変更
.RE
.RS +4
.TP
.ie t \(bu
.el o
プロファイルのエクスポート
.RE
.RS +4
.TP
.ie t \(bu
.el o
インストールサービスの有効化または無効化
.RE
.RS +4
.TP
.ie t \(bu
.el o
インストールサービスの一覧表示
.RE
.RS +4
.TP
.ie t \(bu
.el o
インストールサービスのクライアントの一覧表示
.RE
.RS +4
.TP
.ie t \(bu
.el o
インストールサービスのマニフェストおよびスクリプトの一覧表示
.RE
.RS +4
.TP
.ie t \(bu
.el o
インストールサービスのプロファイルの一覧表示
.RE
.RS +4
.TP
.ie t \(bu
.el o
インストールサーバーと AI クライアントの間のセキュアなデータ転送を行います
.RE
.RS +4
.TP
.ie t \(bu
.el o
セキュリティーの有効化または無効化
.RE
.RS +4
.TP
.ie t \(bu
.el o
サブコマンドのバッチを実行する
.RE
.SH オプション
.sp
.LP
\fBinstalladm\fR コマンドには、次のオプションがあります。
.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.br
.na
\fB\fB--help\fR\fR
.ad
.sp .6
.RS 4n
すべてのサブコマンドの使用法のメッセージを表示します。
.sp
サブコマンドが続く場合は、そのサブコマンドの使用法のメッセージのみを表示します。
.RE

.SH サブコマンド
.sp
.LP
\fBinstalladm\fR コマンドには、次に示すサブコマンドがあります。後述の「使用例」のセクションを参照してください。 
.sp
.ne 2
.mk
.na
\fB\fBinstalladm help [\fIsubcommand\fR] \fR\fR
.ad
.sp .6
.RS 4n
使用可能なコマンドのサマリーを表示します。
.sp
.ne 2
.mk
.na
\fB\fB\fIsubcommand\fR\fR\fR
.ad
.sp .6
.RS 4n
指定されたサブコマンドのヘルプをさらに表示します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBinstalladm create-service\fR [\fB-n\fR <\fIsvcname\fR>]\fR
.ad
.br
.na
\fB[\fB-p\fR <\fIprefix\fR>=<\fIorigin\fR>\fR
.ad
.br
.na
\fB[\fB-K\fR <\fIkeypath\fR> \fB-C\fR <\fIcertpath\fR>]]\fR
.ad
.br
.na
\fB[\fB-a\fR <\fIarchitecture\fR>]\fR
.ad
.br
.na
\fB[\fB-s\fR <\fIFMRI/ISO\fR> |\fR
.ad
.br
.na
\fB \fB-t\fR <\fIexisting_service\fR>]\fR
.ad
.br
.na
\fB[\fB-b\fR <\fIboot property\fR>=<\fIvalue\fR>,... | \fB-G\fR <\fIgrub.cfg\fR>]\fR
.ad
.br
.na
\fB[\fB-i\fR <\fIdhcp_ip_start\fR>\fR
.ad
.br
.na
\fB \fB-c\fR <\fIcount_of_ipaddr\fR>]\fR
.ad
.br
.na
\fB[\fB-B\fR <\fIserver_ipaddr\fR>]\fR
.ad
.br
.na
\fB[\fB-M\fR <\fImanifest file\fR>]\fR
.ad
.br
.na
\fB[\fB-d\fR <\fIimagepath\fR>]\fR
.ad
.br
.na
\fB[\fB-y\fR]\fR
.ad
.sp .6
.RS 4n
このサブコマンドは、指定された \fIimagepath\fR ディレクトリにネットワークブートイメージ (ネットイメージ) を設定し、ネットイメージからブートされたクライアントのインストール方法を指定するインストールサービスを作成します。
.sp
AI ブートイメージの内容は、パッケージ \fBinstall-image/solaris-auto-install\fR として公開されています。 \fB-s\fR オプションが指定されない場合は、そのパッケージのインスタンスが記載されているシステムのパブリッシャー設定一覧の 1 番目のパブリッシャーからパッケージがインストールされます。 \fB-s\fR オプションは、\fBpkg\fR の指定を完全な FMRI またはイメージ ISO ファイルの場所として受け入れます。ネットイメージは最終的に \fIimagepath\fR に配置されます。このネットイメージを使用してクライアントインストールを実行できます。
.sp
.LP
次の仕様に注意してください。
.RS +4
.TP
.ie t \(bu
.el o
指定されたアーキテクチャーの最初のインストールサービスがインストールサーバー上で作成されると、そのサービスの別名 (\fBdefault-i386\fR または \fBdefault-sparc\fR) が自動的に作成されます。このデフォルトサービスは、\fBcreate-client\fR サブコマンドを使用して明示的にインストールサーバーに追加されなかったアーキテクチャーのクライアントへのすべてのインストールで使用されます。\fBdefault-\fIarch\fR\fR サービスに別名が設定されたサービスを変更するには、\fBset-service\fR サブコマンドを使用します。\fBdefault-\fI arch\fR\fR サービスを更新するには、\fBupdate-service\fR サブコマンドを使用します。
.sp
\fBdefault-\fIarch\fR\fR の別名が新しいインストールサービスに変更されたときに、ローカル ISC DHCP 構成が見つかった場合は、このデフォルトの別名ブートファイルが、そのアーキテクチャーのデフォルトの DHCP サーバー全体のブートファイルとして設定されます。
.RE
.RS +4
.TP
.ie t \(bu
.el o
クライアントがそのアーキテクチャーのデフォルト以外のインストールサービスを使用する場合は、\fBcreate-client\fR サブコマンドを使用してクライアント固有の構成を作成する必要があります。
.RE
オプションは、次のいずれかです。
.sp
.ne 2
.mk
.na
\fB\fB-n <\fIsvcname\fR>\fR\fR
.ad
.br
.na
\fB\fB--service <\fIsvcname\fR>\fR\fR
.ad
.sp .6
.RS 4n
オプション: システムによって生成されたサービス名の代わりに、このインストールサービス名を使用します。<\fIsvcname\fR> は、英数字、アンダースコア (\fB_\fR)、ハイフン (\fB-\fR) で構成できます。<\fIsvcname\fR> の最初の文字をハイフンにすることはできません。\fIsvcname\fR の長さは 63 文字を超えることはできません。 
.sp
\fB-n\fR オプションが指定されなかった場合は、自動的にサービス名が生成されます。デフォルトの名前には、アーキテクチャーや OS バージョン情報が含まれます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s <\fIsource\fR>\fR\fR
.ad
.br
.na
\fB\fB--source <\fIsource\fR>\fR\fR
.ad
.sp .6
.RS 4n
オプション: ネットイメージのデータソースを指定します。これは次のいずれかです。
.RS +4
.TP
.ie t \(bu
.el o
IPS AI ネットイメージパッケージの FMRI。これはデフォルトです。\fB-s\fR オプションが指定されていない場合、入手可能な最新バージョンの \fBinstall-image/solaris-auto-install\fR パッケージが使用されます。パッケージは、\fB-p\fR オプションで指定された発行元から、またはパッケージのインスタンスが記載されているインストールサーバーの発行元設定一覧の最初の発行元から取得します。
.RE
.RS +4
.TP
.ie t \(bu
.el o
AI ISO イメージへのパス
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p <\fIpublisher\fR>=<\fI origin\fR>\fR\fR
.ad
.br
.na
\fB\fB--publisher <\fIpublisher \fR>=<\fIorigin\fR>\fR\fR
.ad
.sp .6
.RS 4n
オプション: サービスが IPS パッケージから作成されるときに限り適用されます。\fBinstall-image/solaris-auto-install\fR パッケージを取得する IPS パッケージリポジトリを指定します。たとえば、\fBsolaris=http://pkg.oracle.com/solaris/release/\fR です。
.sp
\fB-p\fR オプションが指定されなかった場合、使用される発行元は、パッケージのインスタンスが記載されているインストールサーバーの発行元設定一覧の最初の発行元です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--key\fR \fIkeypath\fR\fR
.ad
.sp .6
.RS 4n
オプション: サービスが IPS パッケージから作成されるときに限り適用されます。セキュリティー保護されている IPS パブリッシャーの PEM 形式の鍵へのパスを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--cert\fR \fIcertpath\fR\fR
.ad
.sp .6
.RS 4n
オプション: サービスが IPS パッケージから作成されるときに限り適用されます。セキュリティー保護されている IPS パブリッシャーの PEM 形式の証明書へのパスを指定します。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-a \fI<architecture>\fR\fR\fR
.ad
.br
.na
\fB\fB--arch \fI<architecture>\fR\fR\fR
.ad
.sp .6
.RS 4n
オプション: サービスが IPS パッケージから作成されるときに限り適用されます。このサービスとともにインストールするクライアントのアーキテクチャーを指定します。値は \fBi386\fR または \fBsparc\fR のいずれかです。デフォルトは、インストールサーバーのアーキテクチャーです。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d <\fIimagepath\fR>\fR\fR
.ad
.br
.na
\fB\fB--imagepath <\fIimagepath\fR>\fR\fR
.ad
.sp .6
.RS 4n
オプション: ネットイメージを作成するパスを指定します。指定しない場合、イメージは、\fBall_services/default_imagepath_basedir \fR プロパティーの値で定義された場所にある <\fIsvcname\fR> ディレクトリに作成されます。このプロパティーのデフォルト値については、「インストールサーバー構成のプロパティー」を参照してください。\fB-y\fR も指定しなければ、確認プロンプトが表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-y\fR\fR
.ad
.br
.na
\fB\fB--noprompt\fR\fR
.ad
.sp .6
.RS 4n
オプション: 確認プロンプトを非表示にして、指定されたオプションとデフォルト値を使用してサービスの作成を続行します (\fB-d\fR を参照)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t <\fIaliasof\fR>\fR\fR
.ad
.br
.na
\fB\fB--aliasof <\fIaliasof\fR>\fR\fR
.ad
.sp .6
.RS 4n
オプション: この新規サービスは、\fIaliasof\fR インストールサービスの代替名です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-M\fR <\fImanifest file\fR>\fR
.ad
.br
.na
\fB\fB--default-manifest\fR <\fImanifest file\fR>\fR
.ad
.sp .6
.RS 4n
オプション: サービスで使用されるデフォルトマニフェストまたは派生マニフェストスクリプトへのパスを指定するために使用されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-b <\fIproperty\fR>=<\fI value\fR>,...\fR\fR
.ad
.br
.na
\fB\fB--boot-args <\fIproperty \fR>=<\fIvalue\fR>,...\fR\fR
.ad
.sp .6
.RS 4n
オプション: x86 クライアント専用。サービスイメージ内のサービス固有のブート構成ファイルにプロパティー値を設定します。このオプションを使用して、このサービスに固有のブートプロパティーを設定します。このオプションには、コンマで区切られた複数の \fIproperty\fR=\fI value\fR ペアを指定できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-G\fR \fInone\fR|<\fIgrub.cfg\fR>\fR
.ad
.br
.na
\fB\fB--grub-cfg\fR \fInone\fR|<\fIgrub.cfg\fR>\fR
.ad
.sp .6
.RS 4n
オプション: 新しい GRUB2 メニューファイルを割り当てるか、'none' が指定されている場合には削除します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR <\fIdhcp_ip_start\fR> \fB-c\fR <\fIcount_of_ipaddr\fR>\fR
.ad
.br
.na
\fB\fB--ip-start\fR <\fIdhcp_ip_start\fR> \fB--ip-count\fR <\fIcount_of_ipaddr\fR>\fR
.ad
.sp .6
.RS 4n
廃止: これらのオプションは、このコンテキストでの使用が廃止されているため、今後は \fBset-server\fR と同等のものを使用してください。詳細は、\fBset-server\fR のドキュメントを参照してください。
.sp
AI サーバーが DHCP を管理するように事前に構成されていない場合、これらのオプションは失敗します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-B\fR <\fIserver_ipaddr\fR>\fR
.ad
.br
.na
\fB\fB--bootfile-server\fR <\fIserver_ipaddr\fR>\fR
.ad
.sp .6
.RS 4n
廃止: このオプションは、このコンテキストでの使用が廃止されているため、今後は \fBset-server\fR と同等のものを使用してください。詳細は、\fBset-server\fR のドキュメントを参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBinstalladm set-service\fR [\fBoptions\fR] \fB-n\fR|\fB--service\fR <\fIsvcname\fR>\fR
.ad
.sp .6
.RS 4n
このサブコマンドは、既存のサービスの変更を可能にします。これらのオプションを 1 つ以上指定する必要があります。
.sp
.ne 2
.mk
.na
\fB\fB-t\fR <\fIexisting_service\fR>\fR
.ad
.br
.na
\fB\fB--aliasof\fR <\fIexisting_service\fR>\fR
.ad
.sp .6
.RS 4n
<\fIsvcname\fR> を <\fIexisting_service\fR> インストールサービスの別名にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-M\fR <\fImanifest name\fR>\fR
.ad
.br
.na
\fB\fB--default-manifest-name\fR <\fImanifest name\fR>\fR
.ad
.sp .6
.RS 4n
指定されたサービスにすでに登録されている特定のマニフェストまたは派生マニフェストスクリプトを、そのサービスのデフォルトマニフェストまたは派生マニフェストスクリプトに指定します。このサービスに登録されているマニフェストおよび派生マニフェストスクリプトの一覧を表示するには、\fBinstalladm list\fR コマンドを使用します。
.sp
.in +2
.nf
$ \fBinstalladm list -n <svcname> -m\fR
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR <\fIimagepath\fR>\fR
.ad
.br
.na
\fB\fB--imagepath\fR <\fIimagepath\fR>\fR
.ad
.sp .6
.RS 4n
イメージを新しいイメージパスに再配置します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR|\fB--enable\fR | \fB-D\fR|\fB--disable\fR\fR
.ad
.sp .6
.RS 4n
サービスを有効または無効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-G\fR \fBnone\fR|<\fIgrub.cfg\fR>\fR
.ad
.br
.na
\fB\fB--grub-cfg\fR \fBnone\fR|<\fIgrub.cfg\fR>\fR
.ad
.sp .6
.RS 4n
新しい GRUB2 メニューファイルを割り当てるか、'none' が指定されている場合には削除します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-b\fR \fBnone\fR|<\fIproperty\fR>=<\fIvalue\fR>[,... ]\fR
.ad
.br
.na
\fB\fB--boot-args\fR \fBnone\fR|<\fIproperty\fR>=<\fIvalue\fR>[,... ]\fR
.ad
.sp .6
.RS 4n
GRUB メニューのブート引数を設定するか、'none' が指定されている場合には削除します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR <\fIpolicy\fR>\fR
.ad
.br
.na
\fB\fB--security-policy\fR <\fIpolicy\fR>\fR
.ad
.sp .6
.RS 4n
インストールサービスには、次のいずれかのセキュリティー設定のみを割り当てることができます。<\fIpolicy\fR> は、次の、セキュリティーの高い順に示されたセキュリティーポリシー設定のいずれかにできます。
.sp
.ne 2
.mk
.na
\fBrequire-client-auth\fR
.ad
.RS 23n
.rt  
AI クライアントの識別情報を確認します。指定されたサービスのすべてのクライアントにクライアントおよびサーバー認証が必要です。このサービスのすべての SPARC クライアントに定義済みの OBP 鍵が必要です。
.RE

.sp
.ne 2
.mk
.na
\fBrequire-server-auth\fR
.ad
.RS 23n
.rt  
AI インストールサーバーの識別情報を確認します。指定されたサービスのすべてのクライアントでサーバー認証を実行する必要があります。クライアント認証はオプションですが、割り当てられたクライアント資格は、すべて指定する必要があります。このサービスのすべての SPARC クライアントに定義済みの OBP 鍵が必要です。
.RE

.sp
.ne 2
.mk
.na
\fBoptional\fR
.ad
.RS 23n
.rt  
認証されたクライアントと認証されていないクライアントの両方がインストールサービスにアクセスできるようにします。クライアント認証はオプションですが、割り当てられたクライアント資格は、すべて指定する必要があります。これはデフォルトの動作です。
.RE

.sp
.ne 2
.mk
.na
\fBencr-only\fR
.ad
.RS 23n
.rt  
x86 インストールサービスでの SSL/TLS のエンドツーエンドの暗号化を有効にします。認証は実行されません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdisable\fR\fR
.ad
.RS 23n
.rt  
指定されたサービスのすべてのクライアントのすべてのセキュリティーを無効にします。
.RE

.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR [\fB-y\fR|\fB--noprompt\fR] [\fB--hash\fR <\fIca-hash\fR>]\fR
.ad
.br
.na
\fB\fB--delete-security\fR [\fB-y\fR|\fB--noprompt\fR] [\fB--hash\fR <\fIca-hash\fR>]\fR
.ad
.sp .6
.RS 4n
サービスの任意のセキュリティー構成か、\fB--hash\fR が指定されている場合には特定の CA を削除します。\fB-y\fR を指定すると、確認を求めるプロンプトは表示されません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR\fR
.ad
.br
.na
\fB\fB--generate-all-certs\fR\fR
.ad
.sp .6
.RS 4n
X.509 のすべてのセキュリティー資格を自動的に生成して割り当て、OBP 鍵を生成します。CA 証明書と OBP 鍵は、それらがまだ存在していない場合にのみ生成されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-A\fR <\fIca-certfile\fR>...\fR
.ad
.br
.na
\fB\fB--ca-cert\fR <\fIca-certfile\fR>...\fR
.ad
.sp .6
.RS 4n
パス <\fIca-certfile\fR> にある、ユーザー指定の PEM エンコードされた X.509 認証局 (CA) 証明書を割り当てます。各 CA 信頼チェーンは 1 回だけ指定する必要があります。CA チェーンに複数の CA 証明書ファイルが含まれる場合は、複数の \fB-A\fR オプションを使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR <\fIcertfile\fR> \fB-K\fR <\fIkeyfile\fR>\fR
.ad
.br
.na
\fB\fB--cert\fR <\fIcertfile\fR> \fB--key\fR <\fIkeyfile\fR>\fR
.ad
.sp .6
.RS 4n
\fB-C\fR は、パス <\fIcertfile\fR> にある、ユーザー指定の PEM エンコードされた X.509 証明書を割り当てます。
.sp
\fB-K\fR は、パス <\fIkeyfile\fR> にある、ユーザー指定の PEM エンコードされた X.509 非公開鍵を割り当てます。<\fIkeyfile\fR> は、パスフレーズがすべて削除されている必要があります。
.sp
\fB-C\fR オプションは、\fB-K\fR オプションとともに使用する必要があります。\fB-C\fR および \fB-K\fR オプションのみを指定する場合は、関連付けられた CA 証明書が事前に割り当てられている必要があります。
.sp
\fB-A\fR オプションも指定する場合、これらの CA 証明書に対してこの証明書および鍵が検証されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-E\fR\fR
.ad
.br
.na
\fB\fB--generate-encr-key\fR\fR
.ad
.sp .6
.RS 4n
SPARC OBP ファームウェアのセキュリティー暗号化鍵を再生成します。既存の鍵をすべて無効にします。
.sp
\fB-g\fR、\fB-C\fR、\fB-K\fR、または \fB-A\fR オプションを使用すると、OBP 鍵がまだ存在していない場合に OBP 鍵が自動的に生成されます。これらの鍵が生成されたら、\fB-E\fR および \fB-H\fR オプションを使用すると既存の鍵を置き換えることができます。OBP 鍵が存在する前に \fB-E\fR または \fB-H\fR オプションを指定すると、エラーになります。両方の OBP 鍵オプションを指定することも、\fB-E\fR または \fB-H\fR のどちらかを指定することもできます。すでに存在する OBP 鍵は無効にされ、新しく生成された値に置き換えられます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.br
.na
\fB\fB--generate-hmac-key\fR\fR
.ad
.sp .6
.RS 4n
SPARC OBP ファームウェアのセキュリティーハッシュ鍵 (HMAC) を再生成します。既存の鍵をすべて無効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBinstalladm update-service\fR [\fBoptions\fR] \fB-n\fR|\fB--service\fR <\fIsvcname\fR>\fR
.ad
.sp .6
.RS 4n
<\fIsvcname\fR> に関連付けられたイメージを更新します。<\fIsvcname\fR> は、IPS AI ネットイメージパッケージを使用して作成されたサービスの別名です。更新されたイメージを使用して新規サービスが作成され、新規サービスに別名として <\fIsvcname\fR> が設定されます。
.sp
必須の引数は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-n\fR <\fIsvcname\fR>\fR
.ad
.br
.na
\fB\fB--service\fR <\fIsvcname\fR>\fR
.ad
.RS 23n
.rt  
更新するインストールサービスの名前を指定します。これは、IPS ネットイメージパッケージを使用して作成されたサービスの別名である必要があります。
.RE

[\fBoptions\fR] は次の 1 つ以上になります。
.sp
.ne 2
.mk
.na
\fB\fB-p\fR <\fIpublisher\fR>=<\fIorigin\fR>\fR
.ad
.br
.na
\fB\fB--publisher\fR <\fIpublisher\fR>=<\fIorigin\fR>\fR
.ad
.sp .6
.RS 4n
<\fI svcname\fR> イメージを更新する IPS パッケージリポジトリ。次に値の例を示します。
.sp
.in +2
.nf
solaris=http://pkg.oracle.com/solaris/release/
.fi
.in -2
.sp

.RE

証明書と鍵をパブリッシャーに指定するには、次のオプションを使って、使用する鍵と証明書ファイルへのパスを指定します。
.sp
.ne 2
.mk
.na
\fB\fB-K\fR|\fB--key\fR <\fIkeypath\fR>\fR
.ad
.br
.na
\fB\fB-C\fR|\fB--cert\fR <\fIcertpath\fR>\fR
.ad
.RS 24n
.rt  
\fB-p\fR オプションが指定されていない場合、<\fIsvcname\fR> が別名であるサービスのイメージの作成に使用されたパブリッシャーが使用されます。パッケージパブリッシャーは、そのサービスの詳細出力で表示できます。
.RE

.sp
.ne 2
.mk
.na
\fB-s <FMRI>\fR
.ad
.br
.na
\fB--source <FMRI>\fR
.ad
.RS 24n
.rt  
更新用ネットイメージパッケージの FMRI。
.sp
\fB-s\fR オプションが指定されていない場合、入手可能な最新バージョンの \fBinstall-image/solaris-auto-install\fR パッケージが、\fB-p\fR オプションの記述子で指定された発行元から使用されます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBinstalladm rename-service\fR \fB-n\fR <\fIsvcname\fR> \fB-N\fR <\fInewsvcname\fR>\fR
.ad
.sp .6
.RS 4n
インストールサービス <\fIsvcname\fR> の名前を <\fInewsvcname\fR> に変更します。
.sp
<\fInewsvcname\fR> は、英数字、アンダースコア (_)、ハイフン (-) で構成できます。<\fInewsvcname\fR> の最初の文字をハイフンにすることはできません。<\fInewsvcname\fR> の長さは 63 文字を超えることはできません。
.RE

.sp
.ne 2
.mk
.na
\fB\fBinstalladm enable \fB-n\fR <\fIsvcname\fR>\fR\fR
.ad
.sp .6
.RS 4n
廃止: このサブコマンドは \fBset-service\fR サブコマンドの \fB--enable\fR オプションよりも優先して廃止されています。
.sp
\fIsvcname\fR インストールサービスを有効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBinstalladm disable \fB-n\fR <\fIsvcname\fR>\fR\fR
.ad
.sp .6
.RS 4n
廃止: このサブコマンドは \fBset-service\fR サブコマンドの \fB--enable\fR オプションよりも優先して廃止されています。
.sp
\fIsvcname\fR インストールサービスを無効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fBinstalladm delete-service\fR [\fBoptions\fR] \fB-n\fR|\fB--service\fR <\fIsvcname\fR>\fR
.ad
.sp .6
.RS 4n
インストールサービスを削除します。
.RS +4
.TP
.ie t \(bu
.el o
このインストールサービスのマニフェスト、プロファイル、クライアント構成ファイル、および Web サーバー構成を削除します。
.RE
.RS +4
.TP
.ie t \(bu
.el o
サービスをインスタンス化するために使用されたイメージを削除します。
.RE
.RS +4
.TP
.ie t \(bu
.el o
次の条件が存在する場合、このサービスに関連付けられたブートファイルは ISC DHCP 構成から削除されます:
.RS +4
.TP
.ie t \(bu
.el o
このサービスはデフォルトの別名です。
.RE
.RS +4
.TP
.ie t \(bu
.el o
ローカル ISC DHCP 構成が存在します。
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBall_services/manage_dhcp\fR プロパティー値は \fBtrue\fR です。
.RE
.RE
必須の引数は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-n\fR <\fIsvcname\fR>\fR
.ad
.br
.na
\fB\fB--service\fR <\fIsvcname\fR>\fR
.ad
.RS 23n
.rt  
削除するインストールサービス名を指定します。
.RE

[\fBoptions\fR] は次の 1 つ以上になります。
.sp
.ne 2
.mk
.na
\fB\fB-r\fR|\fB--autoremove\fR\fR
.ad
.sp .6
.RS 4n
指定された場合は、このサービスに割り当てられたクライアント、およびこのサービスに別名が設定されたサービスも削除されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-y\fR|\fB--noprompt\fR\fR
.ad
.sp .6
.RS 4n
確認プロンプトを非表示にして、サービスの削除を続行します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBinstalladm list\fR [\fB-v\fR] [\fB-s\fR | \fB-e\fR <\fImacaddr\fR> | [\fB-a\fR | \fB-cmp\fR] [\fB-n\fR <\fIsvcname\fR>]]\fR
.ad
.sp .6
.RS 4n
オプションなしの場合、AI サーバー上のすべてのサービスのサマリーを一覧表示します。次のオプションを使用できます。
.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.br
.na
\fB\fB--verbose\fR\fR
.ad
.sp .6
.RS 4n
より詳細な一覧を生成します
.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.br
.na
\fB\fB--all\fR\fR
.ad
.sp .6
.RS 4n
AI サーバーの構成、および AI サーバー上のサーバー、サービス、クライアント、マニフェスト、およびプロファイルに関する情報をツリー状の出力に一覧表示します。
.sp
\fB-v\fR または \fB-n\fR オプションと組み合わせる場合にのみ使用できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR <\fIsvcname\fR>\fR
.ad
.br
.na
\fB\fB-service\fR <\fIsvcname\fR>\fR
.ad
.sp .6
.RS 4n
フィルタのように動作し、サーバー上の指定した <\fIsvcname\fR> のクライアント、マニフェスト、またはプロファイルのみを表示します。
.sp
このオプションは、\fB-a\fR、\fB-c\fR、\fB-m\fR、または \fB-p\fR オプションのフィルタ処理に使用できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR <\fImacaddress\fR>\fR
.ad
.br
.na
\fB\fB--macaddr\fR <\fImacaddress\fR>\fR
.ad
.sp .6
.RS 4n
指定された <\fImacaddress\fR> の特定情報のみを一覧表示します。
.sp
\fB-v\fR オプションとの組み合わせでのみ使用できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.br
.na
\fB\fB--server\fR\fR
.ad
.sp .6
.RS 4n
サーバー構成に関する情報を一覧表示します。
.sp
\fB-n\fR オプションと同時には使用できません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.br
.na
\fB\fB--client\fR\fR
.ad
.sp .6
.RS 4n
ローカルサーバー上のインストールサービスのクライアントを一覧表示します。
.sp
\fB-n\fR オプションと組み合わせて使用する場合は、指定されたサービスのマニフェストとスクリプトのみを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.br
.na
\fB\fB--manifest\fR\fR
.ad
.sp .6
.RS 4n
各マニフェストの条件を含む、ローカルサーバー上のインストールサービスに関連付けられたマニフェストおよび派生マニフェストスクリプトを表示します。アクティブでないマニフェストにはラベルが付けられます。アクティブでないマニフェストは、関連する条件を持たず、そのサービスのデフォルトマニフェストではありません。
.sp
\fB-n\fR オプションと組み合わせて使用する場合は、指定されたサービスのマニフェストとスクリプトのみを表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.br
.na
\fB\fB--profile\fR\fR
.ad
.sp .6
.RS 4n
各プロファイルの条件を含む、ローカルサーバー上のインストールサービスに関連付けられたプロファイルを表示します。
.sp
\fB-n\fR オプションと組み合わせて使用する場合は、指定されたサービスのプロファイルのみを表示します。
.RE

一覧の出力にユーザーがアクセスできないフィールドが含まれている (つまり、ユーザーが十分な認証を取得していない) 場合、これらのフィールドは常に出力で非表示になります。この種のフィールドの例としては、セキュリティーが有効か無効か、セキュリティー資格などに関連したフィールドが挙げられます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBinstalladm create-manifest\fR [\fBoptions\fR] \fB-n\fR|\fB--service\fR <\fIsvcname\fR> \fB-f\fR|\fB--file\fR <\fIfilename\fR>\fR
.ad
.sp .6
.RS 4n
特定のインストールサービスのマニフェストまたは派生したマニフェストスクリプトを作成します (したがって、サービスの作成とは別に、マニフェストまたはスクリプトをネットワーク上で使用可能にします)。デフォルト以外のマニフェストまたはスクリプトは、条件が関連付けられている場合にのみ使用できます (アクティブにできます)。条件は、コマンド行で (\fB-c\fR)、または条件 XML ファイルで (\fB-C\fR) 入力できます。
.sp
作成するマニフェストまたは派生マニフェストスクリプトは、ファイル (\fB-f\fR) またはインストールサービス (\fB-M\fR) の既存のマニフェストからコピーできます。また、\fB-e\fR を指定すると、ユーザーはインストールサービスに保存する前にマニフェストを編集できます。作成するマニフェストがスクリプトではない場合、ユーザーは対話型のインタフェースに入れられます。このインタフェースは、AI マニフェストの内容を、対話型のインタフェースのプロンプトで入力するサブコマンドを使用して操作できる XML 以外のオブジェクトとプロパティーのセットとして表し、ユーザーがインストールサービスに保存する前にマニフェストを編集できるようにします。作成するマニフェストがスクリプトの場合、ユーザーは、環境変数 \fBVISUAL\fR によって指定したエディタに入れられます。\fBVISUAL\fR が定義されていない場合、代わりに \fBEDITOR\fR が使用されます。どちらも定義されていない場合は、デフォルトエディタ \fBvi\fR(1) が使用されます。
.sp
\fB-f\fR と \fB-M\fR のどちらも指定しない場合、ユーザーは、あとでインストールサービスに保存する新しいマニフェストの入力 (一部の値はあらかじめ妥当なデフォルト値で埋められています) を対話形式で指定するために、対話型のインタフェースに入れられます。対話型のインタフェースの詳細は、後述の「マニフェストエディタ CLI」のセクションを参照してください。
.sp
.LP
マニフェストの名前は次の順序で決定されます。
.RS +4
.TP
1.
\fB-m\fR オプションで指定された \fImanifest\fR 名 (存在する場合)。
.RE
.RS +4
.TP
2.
\fBai_instance\fR \fBname\fR 属性の値 (マニフェストに存在する場合)。
.RE
.RS +4
.TP
3.
\fIfilename\fR のベース名。
.RE
必須の引数は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-n\fR <\fIsvcname\fR>\fR
.ad
.br
.na
\fB\fB--service\fR <\fIsvcname\fR>\fR
.ad
.RS 23n
.rt  
このマニフェストまたはスクリプトが関連付けられるインストールサービスの名前を指定します。
.RE

[\fIsource_options\fR] は次のいずれかにできます。
.sp
.ne 2
.mk
.na
\fB\fB-f\fR|\fB--file\fR <\fIfilename\fR> [\fB-e\fR|\fB--edit\fR]\fR
.ad
.sp .6
.RS 4n
追加するマニフェストまたは派生マニフェストスクリプトのパス名を指定します。
.sp
\fB-e\fR も指定すると、ユーザーはインストールサービスに保存する前にマニフェストを編集できます。作成するマニフェストがスクリプトではない場合、ユーザーは対話型のインタフェースに入れられます。作成するマニフェストがスクリプトの場合、ユーザーは、環境変数 \fBVISUAL\fR によって指定したエディタに入れられます。\fBVISUAL\fR が定義されていない場合、代わりに \fBEDITOR\fR が使用されます。どちらも定義されていない場合は、デフォルトエディタ \fBvi\fR(1) が使用されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-M\fR|\fB--existing\fR <\fIexisting manifest\fR> [\fB-e\fR|\fB--edit\fR]\fR
.ad
.sp .6
.RS 4n
<\fIsvcname\fR> に既存のマニフェストまたは派生マニフェストスクリプトの名前を指定して、新しいマニフェスト用にコピーします。
.sp
\fB-e\fR も指定すると、ユーザーはインストールサービスに保存する前にマニフェストを編集できます。作成するマニフェストがスクリプトではない場合、ユーザーは対話型のインタフェースに入れられます。作成するマニフェストがスクリプトの場合、ユーザーは、環境変数 \fBVISUAL\fR によって指定したエディタに入れられます。\fBVISUAL\fR が定義されていない場合、代わりに \fBEDITOR\fR が使用されます。どちらも定義されていない場合は、デフォルトエディタ \fBvi\fR(1) が使用されます。
.RE

\fB-f\fR と \fB-M\fR のどちらも指定しない場合、ユーザーは、あとでインストールサービスに保存する新しいマニフェストの入力 (一部の値はあらかじめ妥当なデフォルト値で埋められています) を対話形式で指定するために、対話型のインタフェースに入れられます。新しいマニフェストに名前を付ける場合、\fB-m\fR オプションは必須です。
.sp
[\fBoptions\fR] は、次の 1 つ以上にできます。
.sp
.ne 2
.mk
.na
\fB\fB-m\fR <\fImanifest\fR>\fR
.ad
.br
.na
\fB\fB--manifest\fR <\fImanifest\fR>\fR
.ad
.sp .6
.RS 4n
マニフェストまたは派生マニフェストスクリプトの AI インスタンス名を指定します。マニフェストの \fBai_instance\fR 要素の \fBname\fR 属性を \fImanifest\fR に設定します。このマニフェストまたはスクリプトは、以降の \fBinstalladm\fR コマンドおよび \fBinstalladm list\fR 出力の \fImanifest\fR で参照されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR <\fIcriteria\fR>=<\fI value\fR|\fIlist\fR|\fIrange\fR>...\fR
.ad
.br
.na
\fB\fB--criteria\fR <\fIcriteria\fR>=<\fI value\fR|\fIlist\fR|\fIrange\fR>...\fR
.ad
.sp .6
.RS 4n
追加されたマニフェストまたはスクリプトに関連付けられる条件を指定します。後述の「条件」のセクションを参照してください。\fB-c\fR オプションは複数回指定できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR <\fIcriteriafile\fR>\fR
.ad
.br
.na
\fB\fB\fB--criteria-file\fR <\fIcriteriafile\fR>\fR\fR
.ad
.sp .6
.RS 4n
追加されたマニフェストまたはスクリプトに関連付けられる条件を含む条件 XML ファイルのパス名を指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.br
.na
\fB\fB--default\fR\fR
.ad
.sp .6
.RS 4n
このマニフェストまたはスクリプトがサービスの新しいデフォルトのマニフェストまたはスクリプトであることを指定します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBinstalladm update-manifest\fR \fB-n\fR|\fB--service\fR <\fIsvcname\fR> \fB-m\fR|\fB--manifest\fR <\fImanifest\fR>\fR
.ad
.br
.na
\fB\fBinstalladm update-manifest\fR \fB-n\fR|\fB--service\fR <\fIsvcname\fR> \fB-f\fR|\fB--file\fR <\fIfilename\fR> [\fB-m\fR|\fB--manifest\fR <\fImanifest\fR>] [\fB-e\fR|\fB--edit\fR]\fR
.ad
.sp .6
.RS 4n
ユーザーを対話型のインタフェースまたはエディタのいずれかに入れて、ユーザーが <\fImanifest name\fR> によって指定されたマニフェストを編集できるようにします。マニフェストがスクリプトではない場合、ユーザーは対話型のインタフェースに入れられます。このインタフェースは、<\fImanifest\fR> の内容を、対話型のインタフェースのプロンプトで入力するサブコマンドを使用して操作できる XML 以外のオブジェクトとプロパティーのセットとして表し、ユーザーがマニフェストを編集できるようにします。マニフェストがスクリプトの場合、ユーザーは、環境変数 \fBVISUAL\fR によって指定したエディタに入れられます。\fBVISUAL\fR が定義されていない場合、代わりに \fBEDITOR\fR が使用されます。どちらも定義されていない場合は、デフォルトエディタ \fBvi\fR(1) が使用されます。
.sp
\fB-f\fR <\fImanifest file\fR> を指定した場合、マニフェストは完全に <\fImanifest file\fR> に置き換えられます。また、\fB-e\fR オプションを指定すると、ユーザーは前述のようにエディタまたは対話型のインタフェースに入れられ、ユーザーがインストールサービスに保存する前にマニフェストを編集できるようになります。
.sp
対話型のインタフェースの詳細は、後述の「マニフェストエディタ CLI」のセクションを参照してください。
.sp
マニフェストまたはスクリプトの条件やデフォルトステータスは更新後もそのままです。
.sp
.LP
マニフェストの名前は次の順序で決定されます。
.RS +4
.TP
1.
\fB-m\fR オプションで指定された \fImanifest\fR (存在する場合)。
.RE
.RS +4
.TP
2.
\fBai_instance\fR \fBname\fR 属性の値 (変更されたマニフェストに存在する場合、および既存のマニフェストの \fBai_instance\fR \fBname\fR 値と一致する場合)。
.RE
.RS +4
.TP
3.
\fIfilename\fR のベース名 (既存のマニフェストの \fBai_instance\fR \fBname\fR 属性値と一致する場合)、または \fBinstalladm list\fR で指定された名前 (既存のスクリプトの名前と一致する場合)。
.RE
必須の引数は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-n\fR <\fIsvcname\fR>\fR
.ad
.br
.na
\fB\fB--service\fR <\fIsvcname\fR>\fR
.ad
.sp .6
.RS 4n
更新するマニフェストまたはスクリプトのインストールサービスの名前を指定します。
.sp
次の引数も指定できます。
.sp
.ne 2
.mk
.na
\fB\fB-f \fIfilename\fR\fR\fR
.ad
.br
.na
\fB\fB--file \fIfilename\fR\fR\fR
.ad
.RS 23n
.rt  
置換用のマニフェストまたは派生マニフェストスクリプトのパス名を指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m \fImanifest\fR\fR\fR
.ad
.br
.na
\fB\fB--manifest \fImanifest\fR\fR\fR
.ad
.RS 23n
.rt  
編集するマニフェストの名前、または置換用のマニフェストまたはスクリプトの AI インスタンス名を指定します。\fB-f\fR <\fIfilename\fR> を指定しない場合には必須です。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.br
.na
\fB\fB--edit\fR\fR
.ad
.RS 23n
.rt  
\fB-f\fR <\fIfilename\fR> と組み合わせて、ユーザーがインストールサービスに保存する前にマニフェストを編集できるようにします。コピーされたファイルの内容がスクリプトではない場合、ユーザーは対話型のインタフェースに入れられます。内容がスクリプトの場合、ユーザーは、環境変数 \fBVISUAL\fR によって指定したエディタに入れられます。\fBVISUAL\fR が定義されていない場合、代わりに \fBEDITOR\fR が使用されます。どちらも定義されていない場合は、デフォルトエディタ \fBvi\fR(1) が使用されます。
.RE

.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBinstalladm delete-manifest -n|--service <\fIsvcname\fR>\fR\fR
.ad
.br
.na
\fB\fB-m|--manifest \fImanifest\fR\fR\fR
.ad
.sp .6
.RS 4n
特定のインストールサービスで公開されたマニフェストまたは派生マニフェストスクリプトを削除します。デフォルトのマニフェストまたはスクリプトは削除できません。
.sp
必須の引数は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-n <\fIsvcname\fR>\fR\fR
.ad
.br
.na
\fB\fB--service <\fIsvcname\fR>\fR\fR
.ad
.sp .6
.RS 4n
削除するマニフェストまたはスクリプトのインストールサービスの名前を指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m \fImanifest\fR\fR\fR
.ad
.br
.na
\fB\fB--manifest \fImanifest\fR\fR\fR
.ad
.sp .6
.RS 4n
\fB-n\fR オプションを付けた \fBinstalladm list\fR で出力されるマニフェストまたは派生マニフェストスクリプトの AI インスタンス名を指定します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBinstalladm create-profile\fR [\fBoptions\fR] \fB-n\fR|\fB--service\fR <\fIsvcname\fR>\fR
.ad
.br
.na
\fB \fB-f\fR|\fB--file\fR \fIfilename\fR...\fR
.ad
.sp .6
.RS 4n
特定のインストールサービスのプロファイルを作成します。必要に応じて、条件をコマンド行で入力する (\fB-c\fR) か、または条件 XML ファイルに入力する (\fB-C\fR) ことで、プロファイルに条件を関連付けることができます。条件なしで作成されたプロファイルは、サービスのすべてのクライアントに関連付けられます。
.sp
.LP
プロファイルの名前は次の順序で決定されます。
.RS +4
.TP
1.
\fB-p\fR オプションで指定された \fIprofile\fR (存在する場合)。
.RE
.RS +4
.TP
2.
\fIfilename\fR のベース名。
.RE
プロファイル名は AI サービスで一意である必要があります。複数の \fB-f\fR オプションを使用して同じ条件を持つ複数のプロファイルを作成すると、\fB-p\fR オプションは無効になり、プロファイルの名前はファイル名から派生します。
.sp
必須の引数は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-n <\fIsvcname\fR>\fR\fR
.ad
.br
.na
\fB\fB--service <\fIsvcname\fR>\fR\fR
.ad
.sp .6
.RS 4n
必須: 作成するプロファイルのインストールサービスの名前を指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f \fIfilename\fR...\fR\fR
.ad
.br
.na
\fB\fB--file \fIfilename\fR...\fR\fR
.ad
.sp .6
.RS 4n
必須: プロファイルを追加するために使用するファイルのパス名を指定します。複数のプロファイルを指定できます。
.RE

[\fBoptions\fR] は、次の 1 つ以上にできます。
.sp
.ne 2
.mk
.na
\fB\fB-p \fIprofile\fR\fR\fR
.ad
.br
.na
\fB\fB--profile \fIprofile\fR\fR\fR
.ad
.sp .6
.RS 4n
オプション: 作成するプロファイルの名前を指定します。1 つのプロファイルを作成する場合にのみ有効です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c \fIcriteria\fR=\fI value\fR|\fIlist\fR|\fIrange\fR... \fR\fR
.ad
.br
.na
\fB\fB--criteria \fIcriteria\fR=\fI value\fR|\fIlist\fR|\fIrange\fR... \fR\fR
.ad
.sp .6
.RS 4n
オプション: プロファイルに関連付ける条件を指定します。後述の「条件」のセクションを参照してください。複数の \fB-c\fR オプションを指定できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C \fIcriteriafile\fR\fR\fR
.ad
.br
.na
\fB\fB--criteria-file \fIcriteriafile\fR\fR\fR
.ad
.sp .6
.RS 4n
オプション: 指定されたプロファイルに関連付けられる条件を含む条件 XML ファイルのパス名を指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR \fBinstall\fR|\fBsystem\fR|\fBall\fR[,...]\fR
.ad
.br
.na
\fB\fB--environment\fR \fBinstall\fR|\fBsystem\fR|\fBall\fR[,...]\fR
.ad
.sp .6
.RS 4n
オプション: プロファイルを適用する必要がある環境のコンマ区切りリストを指定します。\fBinstall\fR を指定することは、プロファイルをインストール環境に適用する必要があることを示します。\fBsystem\fR を指定することは、プロファイルをインストール済みのシステム環境に適用する必要があることを示します。\fBall\fR の指定は、プロファイルを両方の環境に指定する必要があることを示す場合に便利です。デフォルトでは、プロファイルは system 値のみを使用して作成されます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBinstalladm set-profile\fR [\fIoptions\fR] \fB-n\fR|\fB--service\fR <\fIsvcname\fR> \fB-p\fR|\fB--profile\fR <\fIprofile name\fR>\fR
.ad
.sp .6
.RS 4n
特定のインストールサービスのプロファイルの設定を変更します。プロファイルは、\fB-e\fR オプションを使用してインストール環境またはインストール済みのシステム環境に適用されるように指定できます。\fB-P\fR オプションを使用して、プロファイルの名前を変更することもできます。
.sp
必須の引数は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-n\fR <\fIsvcname\fR>\fR
.ad
.br
.na
\fB\fB--service\fR <\fIsvcname\fR>\fR
.ad
.RS 28n
.rt  
必須: 変更するプロファイルのインストールサービスの名前を指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR <\fIprofile name\fR>\fR
.ad
.br
.na
\fB\fB--profile\fR <\fIprofile name\fR>\fR
.ad
.RS 28n
.rt  
必須: 変更するプロファイルの名前を指定します。
.RE

[\fIoptions\fR] は、次の 1 つ以上にできます。
.sp
.ne 2
.mk
.na
\fB\fB-P\fR <\fInew profile name\fR>\fR
.ad
.br
.na
\fB\fB--new-name\fR <\fInew profile name\fR>\fR
.ad
.sp .6
.RS 4n
オプション: プロファイルの名前を指定された名前に変更します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR \fBinstall\fR|\fBsystem\fR|\fBall\fR[,...]\fR
.ad
.br
.na
\fB\fB--environment\fR \fBinstall\fR|\fBsystem\fR|\fBall\fR[,...]\fR
.ad
.br
.na
\fB\fR
.ad
.sp .6
.RS 4n
オプション: プロファイルを適用する必要がある環境のコンマ区切りリストを指定します。\fBinstall\fR を指定することは、プロファイルをインストール環境に適用する必要があることを示します。\fBsystem\fR を指定することは、プロファイルをインストール済みのシステム環境に適用する必要があることを示します。\fBall\fR の指定は、プロファイルを両方の環境に指定する必要があることを示す場合に便利です。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBinstalladm update-profile\fR \fB-n\fR|\fB--service\fR <\fIsvcname\fR>\fR
.ad
.br
.na
\fB\fB-f\fR|\fB--file\fR \fIfilename\fR [\fB-p\fR|\fB--profile\fR \fIprofile\fR]\fR
.ad
.sp .6
.RS 4n
<\fIsvcname\fR> インストールサービスから指定されたプロファイルを更新します。指定されたプロファイルを \fIfilename\fR の内容で置き換えます。プロファイルの条件は更新後もそのままです。
.sp
.LP
更新するプロファイルは、次の順序で決定されます:
.RS +4
.TP
1.
\fB-p\fR オプションで指定された \fIprofile\fR (存在する場合)。
.RE
.RS +4
.TP
2.
\fIfilename\fR のベース名。
.RE
.sp
.ne 2
.mk
.na
\fB\fB-n <\fIsvcname\fR>\fR\fR
.ad
.br
.na
\fB\fB--service <\fIsvcname\fR>\fR\fR
.ad
.sp .6
.RS 4n
必須: 更新するプロファイルのインストールサービスの名前を指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f \fIfilename\fR\fR\fR
.ad
.br
.na
\fB\fB--file \fIfilename\fR\fR\fR
.ad
.sp .6
.RS 4n
必須: プロファイルを追加するために使用するファイルのパス名を指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p \fIprofile\fR\fR\fR
.ad
.br
.na
\fB\fB--profile \fIprofile\fR\fR\fR
.ad
.sp .6
.RS 4n
オプション: 更新するプロファイルの名前を指定します。更新するプロファイルの名前が \fIfilename\fR のベース名と異なる場合は、このオプションを使用します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBinstalladm delete-profile -n|--service <\fIsvcname\fR>\fR\fR
.ad
.br
.na
\fB\fB-p|--profile \fIprofile \fR...\fR\fR
.ad
.sp .6
.RS 4n
\fIprofile\fR プロファイルを <\fIsvcname\fR> インストールサービスから削除します。
.sp
必須の引数は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-n <\fIsvcname\fR>\fR\fR
.ad
.br
.na
\fB\fB--service <\fIsvcname\fR>\fR\fR
.ad
.sp .6
.RS 4n
プロファイルが削除されるインストールサービスの名前を指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p \fIprofile\fR...\fR\fR
.ad
.br
.na
\fB\fB--profile \fIprofile\fR...\fR\fR
.ad
.sp .6
.RS 4n
削除するプロファイルの名前を指定します。複数の \fB-p\fR オプションを指定できます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBinstalladm export\fR [\fB-o\fR <\fIpath\fR>] [\fIselector\fR] [\fIitems\fR]\fR
.ad
.sp .6
.RS 4n
\fBexport\fR コマンドには、有効なオプションの組み合わせがいくつかあります。最初の要素 [\fIselector\fR] では、出力する項目のソースであるオブジェクトを選択します。
.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.br
.na
\fB\fB--server\fR\fR
.ad
.RS 23n
.rt  
セキュリティー鍵または証明書のソースとして使用するサーバーオブジェクトを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n <\fIsvcname\fR>\fR\fR
.ad
.br
.na
\fB\fB--service <\fIsvcname\fR>\fR\fR
.ad
.RS 23n
.rt  
マニフェスト、プロファイル、GRUB メニュー、セキュリティー鍵や証明書のソースとして使用する特定のサービスを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.br
.na
\fB\fB--default-client\fR\fR
.ad
.RS 23n
.rt  
セキュリティー鍵または証明書のエクスポートで使用するサーバーのデフォルトクライアントセキュリティーを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR <\fImacaddr\fR>\fR
.ad
.br
.na
\fB\fB-macaddr\fR <\fImacaddr\fR>\fR
.ad
.RS 23n
.rt  
セキュリティー鍵または証明書のソースとして使用するクライアントを、MAC アドレスで指定します。
.RE

次の要素 [\fIitems\fR] では、出力する 1 つまたは複数の項目を指定します。
.sp
.ne 2
.mk
.na
\fB\fB-m\fR <\fImanifest name\fR>\fR
.ad
.br
.na
\fB\fB--manifest\fR <\fImanifest name\fR>\fR
.ad
.sp .6
.RS 4n
指定されたサービスからエクスポートするマニフェストまたは派生マニフェストの名前を指定します。複数の \fB-m\fR オプションを指定できます。
.LP
注 - 
.sp
.RS 2
これは、\fB-n\fR オプションとの組み合わせでのみ使用できます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR <\fIprofile name\fR>\fR
.ad
.br
.na
\fB\fB--profile\fR <\fIprofile name\fR>\fR
.ad
.sp .6
.RS 4n
指定されたサービスからエクスポートするプロファイルの名前を指定します。複数の \fB-p\fR オプションを指定できます。
.LP
注 - 
.sp
.RS 2
これは、\fB-n\fR オプションとの組み合わせでのみ使用できます。
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fB-G\fR\fR
.ad
.br
.na
\fB\fB--grub-cfg\fR\fR
.ad
.sp .6
.RS 4n
サーバーまたはクライアントで使用中の GRUB2 メニュー (\fBgrub.cfg\fR) ファイルを出力します。
.sp
これは、\fB-n\fR または \fB-e\fR オプションとの組み合わせでのみ使用できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.br
.na
\fB\fB--cert\fR\fR
.ad
.sp .6
.RS 4n
指定されたサーバー、サービス、またはクライアントの PEM エンコードされた X.509 証明書を出力します。
.sp
これは、選択オプション \fB-n\fR、\fB-e\fR、\fB-s\fR、\fB-c\fR のいずれかと組み合わせて使用できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-K\fR\fR
.ad
.br
.na
\fB\fB--key\fR\fR
.ad
.sp .6
.RS 4n
指定されたサーバー、サービス、またはクライアントの PEM エンコードされた X.509 非公開鍵を出力します。
.sp
これは、選択オプション \fB-n\fR、\fB-e\fR、\fB-s\fR、\fB-c\fR のいずれかと組み合わせて使用できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-A\fR <\fIhash\fR> ...\fR
.ad
.br
.na
\fB\fB--ca-cert\fR <\fIhash\fR> ...\fR
.ad
.sp .6
.RS 4n
PEM エンコードされた X.509 認証局 (CA) 証明書、および指定された <\fIhash\fR> 値を出力します。
.sp
このオプションは、繰り返すことで複数の CA 証明書をエクスポートすることも、選択オプション \fB-n\fR、\fB-e\fR、\fB-s\fR、\fB-c\fR のいずれかと組み合わせて使用することもできます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBinstalladm validate\fR [\fBoptions\fR] \fB-n\fR|\fB--service\fR <\fIsvcname\fR>\fR
.ad
.sp .6
.RS 4n
指定されたプロファイルまたはマニフェストを検証します。\fBvalidate\fR サブコマンドは、データベース内のプロファイルを検証する (\fB-p\fR) か、データベースへの入力前に開発中のプロファイル (\fB-P\fR) またはマニフェスト (\fB-M\fR) を検証するために使用できます。
.sp
必須の引数は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-n\fR <\fIsvcname\fR>\fR
.ad
.br
.na
\fB\fB--service\fR <\fIsvcname\fR>\fR
.ad
.RS 23n
.rt  
プロファイルまたはマニフェストが関連付けられていて、検証が実行されるサービスを指定します。
.RE

[\fBoptions\fR] は、次の 1 つ以上になります。
.sp
.ne 2
.mk
.na
\fB\fB-M\fR <\fImanifest_path\fR>\fR
.ad
.br
.na
\fB\fB--manifest\fR <\fImanifest_path\fR>\fR
.ad
.sp .6
.RS 4n
指定されたサービスに対して検証を実行する外部マニフェストファイルを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR <\fImanifest_name\fR>\fR
.ad
.br
.na
\fB\fB--manifest\fR <\fImanifest_name\fR>\fR
.ad
.sp .6
.RS 4n
指定されたサービスに対して検証を実行する既存のマニフェストの名前を指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR <\fIprofile_path\fR>\fR
.ad
.br
.na
\fB\fB--profile-file\fR <\fIprofile_path\fR>\fR
.ad
.sp .6
.RS 4n
指定されたサービスに対して検証を実行する外部プロファイルファイルを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR <\fIprofile_name\fR>\fR
.ad
.br
.na
\fB\fB--profile-file\fR <\fIprofile_name\fR>\fR
.ad
.sp .6
.RS 4n
指定されたサービスに対して検証を実行する既存のプロファイルの名前を指定します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBinstalladm set-criteria\fR [\fBoptions\fR] \fB-n\fR <\fIsvcname\fR>\fR
.ad
.br
.na
\fB[\fB-m\fR <\fImanifest\fR>] [\fB-p\fR <\fIprofile\fR>]...\fR
.ad
.sp .6
.RS 4n
すでに公開されているマニフェスト、派生マニフェストスクリプト、またはプロファイルの条件を更新します。条件はコマンド行または条件 XML ファイルで指定できます。
.sp
有効な条件については、\fBcreate-manifest\fR サブコマンドで説明しています。
.sp
必須の引数は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB\fB-n\fR <\fIsvcname\fR\fR>\fR
.ad
.br
.na
\fB\fB\fB--service\fR <\fIsvcname\fR>\fR\fR
.ad
.RS 23n
.rt  
プロファイルまたはマニフェストが関連付けられたサービスを指定します。
.RE

および次の 1 つ以上です。
.sp
.ne 2
.mk
.na
\fB\fB-m\fR <\fImanifest name\fR>\fR
.ad
.br
.na
\fB\fB--manifest\fR <\fImanifest name\fR>\fR
.ad
.RS 30n
.rt  
マニフェストまたは派生マニフェストスクリプトの AI インスタンス名を指定します。
.sp
同じ条件が割り当てられた複数のマニフェストを保持することはできないため、指定できるマニフェストは 1 つだけです。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR <\fIprofile_name\fR>\fR
.ad
.br
.na
\fB\fB--profile\fR <\fIprofile_name\fR>\fR
.ad
.RS 30n
.rt  
プロファイルの名前を指定します。
.RE

[\fBoptions\fR] は、次のバリエーションのいずれかです。
.sp
.ne 2
.mk
.na
\fB\fB-c\fR <\fIcriteria=value|list|range\fR> ...\fR
.ad
.br
.na
\fB\fB--criteria\fR <\fIcriteria=value|list|range\fR> ...\fR
.ad
.sp .6
.RS 4n
マニフェスト、スクリプト、またはプロファイルに対する既存のすべての条件の代わりに使用する条件を指定します。指定可能な値については、後述の「条件」のセクションを参照してください。
.sp
複数の \fB-c\fR オプションを指定できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR <\fIcriteria.xml\fR>\fR
.ad
.br
.na
\fB\fB--criteria-file\fR <\fIcriteria.xml\fR>\fR
.ad
.sp .6
.RS 4n
マニフェスト、スクリプト、またはプロファイルに対する既存のすべての条件の代わりに使用する条件を含む条件 XML ファイルのパス名を指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR\fR
.ad
.br
.na
\fB\fB--delete-all-criteria\fR\fR
.ad
.sp .6
.RS 4n

.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR <\fIcriteria=value|list|range\fR> ...\fR
.ad
.br
.na
\fB\fB--append-criteria\fR <\fIcriteria=value|list|range\fR> ...\fR
.ad
.sp .6
.RS 4n
マニフェスト、スクリプト、またはプロファイルに対する既存の条件に追加する条件を指定します。指定可能な値については、後述の「条件」のセクションを参照してください。指定された条件がすでに存在する場合は、その条件の \fBvalue|list|range\fR が指定された \fBvalue|list|range\fR で置換されます。
.sp
 複数の \fB-a\fR オプションを指定できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR <\fIcriteria\fR> ...\fR
.ad
.br
.na
\fB\fB--delete-criteria\fR <\fIcriteria\fR> ...\fR
.ad
.sp .6
.RS 4n
マニフェスト、スクリプト、またはプロファイルに対する既存の条件から削除する条件を指定します。指定可能な値については、後述の「条件」のセクションを参照してください。
.sp
複数の \fB-d\fR オプションを指定できます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBinstalladm create-client\fR [\fBoptions\fR]\fR
.ad
.br
.na
\fB\fB-e\fR|\fB--macaddr\fR <\fImacaddr\fR> \fB-n\fR|\fB--service\fR <\fIsvcname\fR>\fR
.ad
.sp .6
.RS 4n
\fBcreate-service\fR サブコマンドで使用されるデフォルト設定とは異なるカスタムクライアント設定を指定するため、指定されたクライアントの省略可能な設定タスクを実行します。ユーザーは、クライアントにデフォルト以外のサービス名およびブート引数または GRUB2 メニューを指定できます。
.sp
既存のクライアントは、\fBinstalladm set-client\fR サブコマンドを使用して変更可能です。
.sp
.LP
次の条件が存在する場合、クライアントは ISC DHCP 構成で構成されます:
.RS +4
.TP
.ie t \(bu
.el o
クライアントが x86 システムです。
.RE
.RS +4
.TP
.ie t \(bu
.el o
ローカル ISC DHCP 構成が存在します。
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBall_services/manage_dhcp\fR プロパティー値は \fBtrue\fR です。
.RE
必須の引数は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-n <\fIsvcname\fR>\fR\fR
.ad
.br
.na
\fB\fB--service <\fIsvcname\fR>\fR\fR
.ad
.sp .6
.RS 4n
クライアントインストール用のインストールサービスを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR \fImacaddr\fR\fR
.ad
.br
.na
\fB\fB--macaddr\fR \fImacaddr\fR\fR
.ad
.sp .6
.RS 4n
クライアントの MAC アドレスを指定します。
.sp
x86 クライアントの場合のみ、[\fBoptions\fR] を次のいずれかにできます。
.sp
.ne 2
.mk
.na
\fB\fB-b <\fIproperty\fR>=<\fIvalue\fR>,...\fR\fR
.ad
.br
.na
\fB\fB--boot-args <\fIproperty\fR>=<\fIvalue\fR>,...\fR\fR
.ad
.sp .6
.RS 4n
クライアント固有のブート構成ファイル内でプロパティー値を設定します。このオプションを使用して、このクライアントに固有のブートプロパティーを設定します。このオプションには、プロパティー = 値ペアを複数指定することも、何回も繰り返して指定することもできます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-G\fR <\fIgrub.cfg\fR>\fR
.ad
.br
.na
\fB\fB--grub-cfg\fR <\fIgrub.cfg\fR>\fR
.ad
.sp .6
.RS 4n
クライアントのブート時に使用するカスタム GRUB2 メニュー (\fBgrub.cfg\fR) ファイルを指定します。
.RE

.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBinstalladm set-client\fR \fB-e\fR <\fImacaddr\fR>\fR
.ad
.br
.na
\fB[\fB-n\fR <\fIsvcname\fR>]\fR
.ad
.br
.na
\fB[\fB-b\fR [\fBnone\fR|<\fIproperty\fR>=<\fIvalue\fR>,... ] |\fR
.ad
.br
.na
\fB\fB-G\fR [\fBnone\fR|<\fIgrub.cfg\fR>]]\fR
.ad
.br
.na
\fB[\fB-g\fR]\fR
.ad
.br
.na
\fB[\fB-x\fR [\fB-y\fR] [\fB--hash\fR <\fIca-hash\fR>]\fR
.ad
.br
.na
\fB[\fB-A\fR <\fIca-certfile\fR>]...\fR
.ad
.br
.na
\fB[\fB-C\fR <\fIcertfile\fR> \fB-K\fR <\fIkeyfile\fR>]\fR
.ad
.br
.na
\fB[\fB-E\fR]\fR
.ad
.br
.na
\fB[\fB-H\fR]\fR
.ad
.sp .6
.RS 4n
必須の引数は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-e\fR \fImacaddr\fR\fR
.ad
.br
.na
\fB\fB--macaddr\fR \fImacaddr\fR\fR
.ad
.RS 21n
.rt  
クライアントの MAC アドレスを指定します。
.RE

[\fBoptions\fR] は、次のいずれかです。
.sp
.ne 2
.mk
.na
\fB\fB-n\fR|\fB--service\fR <\fIsvcname\fR>\fR
.ad
.sp .6
.RS 4n
関連付けられている既存のサービスとは異なる場合、このサービスにクライアントを移動します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR\fR
.ad
.br
.na
\fB\fB--generate-all-certs\fR\fR
.ad
.sp .6
.RS 4n
SPARC の暗号化鍵およびハッシュを含む、CA 証明書、クライアント証明書および鍵の新しいセットがまだ存在しない場合に、生成します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.br
.na
\fB\fB--delete-security\fR\fR
.ad
.sp .6
.RS 4n
クライアントのセキュリティー情報を削除します。これは、次のオプションを使用してさらに変更できます。
.sp
.ne 2
.mk
.na
\fB\fB-y\fR|\fB--noprompt\fR\fR
.ad
.RS 20n
.rt  
確認を求めるプロンプトの非表示を指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB--hash\fR <\fIca-hash\fR>\fR
.ad
.RS 20n
.rt  
コマンドが、この値に一致する CA 証明書だけを削除するように制限します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-A\fR <\fIca-certfile\fR>...\fR
.ad
.br
.na
\fB\fB--ca-cert\fR <\fIca-certfile\fR>...\fR
.ad
.sp .6
.RS 4n
パス <\fIca-certfile\fR> にある、ユーザー指定の PEM エンコードされた X.509 認証局 (CA) 証明書を割り当てます。各 CA 信頼チェーンは 1 回だけ指定する必要があります。CA チェーンに複数の CA 証明書ファイルが含まれる場合は、複数の \fB-A\fR オプションを使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR <\fIcertfile\fR> \fB-K\fR <\fIkeyfile\fR>\fR
.ad
.br
.na
\fB\fB--cert\fR <\fIcertfile\fR> \fB--key\fR <\fIkeyfile\fR>\fR
.ad
.sp .6
.RS 4n
\fB-C\fR は、パス <\fIcertfile\fR> にある、ユーザー指定の PEM エンコードされた X.509 証明書を割り当てます。
.sp
\fB-K\fR は、パス <\fIkeyfile\fR> にある、ユーザー指定の PEM エンコードされた X.509 非公開鍵を割り当てます。<\fIkeyfile\fR> は、パスフレーズがすべて削除されている必要があります。
.sp
\fB-C\fR オプションは、\fB-K\fR オプションとともに使用する必要があります。\fB-C\fR および \fB-K\fR オプションのみを指定する場合は、関連付けられた CA 証明書が事前に割り当てられている必要があります。
.sp
\fB-A\fR オプションも指定する場合、これらの CA 証明書に対してこの証明書および鍵が検証されます。
.RE

SPARC クライアントの場合のみ、[\fBoptions\fR] を次のいずれかにできます。
.sp
.ne 2
.mk
.na
\fB\fB-E\fR\fR
.ad
.br
.na
\fB\fB--generate-encr-key\fR\fR
.ad
.RS 23n
.rt  
SPARC OBP ファームウェアのセキュリティー暗号化鍵を再生成します。既存の鍵をすべて無効にします。
.sp
\fB-g\fR、\fB-C\fR、\fB-K\fR、または \fB-A\fR オプションを使用すると、OBP 鍵がまだ存在していない場合に OBP 鍵が自動的に生成されます。これらの鍵が生成されたら、\fB-E\fR および \fB-H\fR オプションを使用すると既存の鍵を置き換えることができます。OBP 鍵が存在する前に \fB-E\fR または \fB-H\fR オプションを指定すると、エラーになります。両方の OBP 鍵オプションを指定することも、\fB-E\fR または \fB-H\fR のどちらかを指定することもできます。すでに存在する OBP 鍵は無効にされ、新しく生成された値に置き換えられます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR\fR
.ad
.br
.na
\fB\fB--generate-hmac-key\fR\fR
.ad
.RS 23n
.rt  
SPARC OBP ファームウェアのセキュリティーハッシュ鍵 (HMAC) を再生成します。既存の鍵をすべて無効にします。
.RE

x86 クライアントの場合のみ、[\fBoptions\fR] を次のいずれかにできます。
.sp
.ne 2
.mk
.na
\fB\fB-b\fR|\fB--boot-args\fR \fBnone\fR|<\fIproperty\fR>=<\fIvalue\fR>,...\fR
.ad
.sp .6
.RS 4n
x86 クライアントの場合のみ、GRUB メニューのブート引数を設定するか、'none' が指定されている場合には削除して、サービスの GRUB 構成を復元します。
.sp
このクライアントにカスタム GRUB2 メニューがすでに存在する場合、このオプションは失敗します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-G\fR|\fB--grub-cfg\fR \fBnone\fR|<\fIgrub.cfg\fR>\fR
.ad
.sp .6
.RS 4n
x86 クライアントの場合のみ、新しい GRUB2 メニューファイルを割り当てるか、'none' が指定されている場合には削除します。
.sp
新しい GRUB2 メニューを追加すると、このクライアント用に指定された既存の \fBboot-args\fR が置換されます。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBinstalladm delete-client\fR \fB-e\fR|\fB--macaddr\fR \fImacaddr\fR\fR
.ad
.sp .6
.RS 4n
\fBcreate-client\fR サブコマンドを使用して事前に設定された既存のクライアントの特定のサービス情報を削除します。
.sp
.LP
次の条件が存在する場合、クライアントは ISC DHCP 構成で未構成です:
.RS +4
.TP
.ie t \(bu
.el o
クライアントが x86 システムです。
.RE
.RS +4
.TP
.ie t \(bu
.el o
ローカル ISC DHCP 構成が存在します。
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBall_services/manage_dhcp\fR プロパティー値は \fBtrue\fR です。
.RE
必須の引数は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-e\fR \fImacaddr\fR\fR
.ad
.br
.na
\fB\fB--macaddr\fR \fImacaddr\fR\fR
.ad
.RS 21n
.rt  
削除するクライアントの MAC アドレスを指定します。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBinstalladm set-server\fR [\fBoptions\fR] [\fBsec_options\fR]\fR
.ad
.sp .6
.RS 4n
サーバー構成を変更します。
.sp
 次の仕様に注意してください。
.RS +4
.TP
.ie t \(bu
.el o
\fB-i\fR および \fB-c\fR オプションを使用し、かつ DHCP サーバーが未構成である場合は、ISC DHCP サーバーが構成されます。
.sp
ISC DHCP サーバーがすでに構成されている場合は、その DHCP サーバーが更新されます。
.sp
\fB-i\fR および \fB-c\fR 引数が指定され、DHCP が構成されている場合でも、作成されるインストールサービスと IP 範囲との間に結合は存在しません。\fB-i\fR と \fB-c\fR が渡され、\fBall_services\fR/\fBmanage_dhcp\fR の値が true の場合は、IP 範囲が設定され、必要に応じて新しい DHCP サーバーが作成され、その DHCP サーバーは使用するすべてのインストールサービスとすべてのクライアントのために実行された状態のままになります。DHCP サーバーに指定されたネットワーク情報には、作成されるサービスとの特定の関係はありません。
.RE
.RS +4
.TP
.ie t \(bu
.el o
インストールサーバーが直接接続され、インストールサーバーがマルチホームになっているサブネット上に要求された IP 範囲が存在しない場合は、\fB-B\fR オプションを使用してブートファイルサーバーのアドレス (通常はこのシステム上の IP アドレス) を指定します。これは、インストールサーバー上で複数の IP アドレスが構成され、DHCP リレーが採用されている場合にのみ必要です。その他のすべての構成では、ソフトウェアでこれを自動的に決定できます。
.RE
[\fBoptions\fR] は、次の 1 つ以上になります。
.sp
.ne 2
.mk
.na
\fB\fB-p\fR <\fIport\fR>\fR
.ad
.br
.na
\fB\fB--port\fR <\fIport\fR>\fR
.ad
.sp .6
.RS 4n
AI インストールサービス Web サーバーをホストするポートを指定します。デフォルトでは、Web サーバーはポート 5555 でホストされます。
.sp
デフォルトとは異なるポート番号を使用する場合は、インストールサービスを作成する前にportプロパティーをカスタマイズしてください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR <\fIsecure_port\fR>\fR
.ad
.br
.na
\fB\fB--secure-port\fR <\fIsecure_port\fR>\fR
.ad
.sp .6
.RS 4n
セキュアな AI インストールサービス Web サーバーをホストするポートを指定します。デフォルトでは、Web サーバーはポート 5556 でホストされます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR <\fIdirectory\fR>\fR
.ad
.br
.na
\fB\fB--imagepath-basedir\fR <\fIdirectory\fR>\fR
.ad
.sp .6
.RS 4n
\fBinstalladm create-service\fR コマンドによって作成されるイメージのデフォルトの場所を指定します。イメージは、\fB<directory>/service_name\fR にあります。このプロパティーのデフォルト値は \fB/export/auto_install\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR|\fB--enable-webui\fR\fR
.ad
.sp .6
.RS 4n
AI マニフェストウィザード Web UI を有効にします (\fB-U\fR オプションと一緒には使用できません)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-U\fR|\fB--disable-webui\fR\fR
.ad
.sp .6
.RS 4n
AI マニフェストウィザード Web UI を無効にします (\fB-U\fR オプションと一緒には使用できません)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR|\fB--enable-wizard-save\fR\fR
.ad
.sp .6
.RS 4n
AI マニフェストウィザードが、生成されたマニフェストを AI サーバー上の一時的な場所に書き込めるようにして、\fBinstalladm\fR を利用したサービスの追加を容易にする機能を有効にします。\fB-Z\fR オプションと一緒には使用できません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Z\fR|\fB--disable-wizard-save\fR\fR
.ad
.sp .6
.RS 4n
AI マニフェストウィザードが、生成されたマニフェストを AI サーバー上の一時的な場所に書き込めるようにして、\fBinstalladm\fR を利用したサービスの追加を容易にする機能を無効にします。\fB-z\fR オプションと一緒には使用できません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fBall\fR|<\fICIDR\fR>[,...]\fR
.ad
.br
.na
\fB\fB--include-networks\fR \fBall\fR|<\fICIDR\fR>[,...]\fR
.ad
.sp .6
.RS 4n
許可するネットワークのカンマ区切りのリストを CIDR 形式 (たとえば、\fI192.168.56.0/24\fR) で受け取ります。
.sp
このネットワーク一覧を使用して、このインストールサーバーで処理されるクライアントを指定します。このオプションを使用すると、\fB-l\fR or \fB-L\fR オプションを使ってすでに構成されているすべてのネットワークが置換されます。
.sp
このオプションを使用すると、AI インストールサーバー SMF \fBall_services\fR/\fBnetworks\fR および \fBall_services/exclude_networks\fR の値が設定されます。具体的には、これにより \fBall_services/exclude_networks\fR プロパティーが false に設定されます。
.sp
デフォルトでは、AI インストールサーバーがマルチホームになっている場合は、そのサーバーが接続されているすべてのネットワーク上のインストールクライアントを処理するよう構成されます。この状態に戻す場合、ここで特殊な 'all' 値を使用できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR \fBnone\fR|<\fICIDR\fR>[,...]\fR
.ad
.br
.na
\fB\fB--exclude-networks\fR \fBnone\fR|<\fICIDR\fR>[,...]\fR
.ad
.sp .6
.RS 4n
サービスの提供先を決定する際、サーバーに対しこれらのネットワークを除外するように指示します (\fB-l\fR オプションと一緒には使用できません)。このオプションを使用すると、\fB-l\fR or \fB-L\fR オプションを使ってすでに構成されているすべてのネットワークが置換されます。
.sp
許可しないネットワークのカンマ区切りのリストを CIDR 形式 (たとえば、\fI192.168.56.0/24\fR) で受け取ります。
.sp
このオプションを使用すると、AI インストールサーバー SMF \fBall_services/networks\fR および \fBall_services/exclude_networks\fR の値が設定されます。具体的には、これにより \fBall_services/exclude_networks\fR プロパティーが true に設定されます。
.sp
デフォルトでは、AI インストールサーバーがマルチホームになっている場合は、そのサーバーが接続されているすべてのネットワーク上のインストールクライアントを処理するよう構成されます。この状態に戻す場合、ここで特殊な 'none' 値を使用できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.br
.na
\fB\fB--manage-dhcp\fR\fR
.ad
.sp .6
.RS 4n
DHCP 構成をローカルで管理するように、AI サーバーのプロパティーを構成します。設定する場合、クライアントとサービス構成がインストールサーバーで変更されると、AI サーバーはローカル ISC DHCP 構成を自動的に更新します。
.sp
既存の ISC DHCP 構成が存在しない場合は、管理するアドレス範囲を定義するため、\fB-i\fR および \fB-c\fR オプションも指定する必要があります。
.sp
\fB-M\fR オプションと一緒には使用できません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-M\fR\fR
.ad
.br
.na
\fB\fB--unmanage-dhcp\fR\fR
.ad
.sp .6
.RS 4n
DHCP 構成をローカルで管理しないように AI サーバーのプロパティーを構成して、クライアントまたはサービス構成の変更時に AI サーバーが自動的に ISC DHCP 構成を管理することがないようにします。
.sp
\fB-m\fR オプションと一緒には使用できません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR <\fIdhcp_ip_start\fR> \fB-c\fR <\fIcount_of_ipaddr\fR>\fR
.ad
.br
.na
\fB\fB--ip-start\fR <\fIdhcp_ip_start\fR> \fB--ip-count\fR <\fIcount_of_ipaddr\fR>\fR
.ad
.sp .6
.RS 4n
DHCP を管理する場合に、DHCP 構成を変更します (\fB-i\fR および \fB-c\fR オプションも一緒に指定する必要があります)。
.sp
まだ DHCP を管理していない場合は、これを有効にするために \fB-m\fR オプションも指定する必要があります。
.sp
これらのオプションを使用して、ローカル DHCP 構成に追加する範囲内の開始 IP アドレスを指定します。
.sp
IP アドレスの数は、\fB-c\fR オプションで指定されます。ローカルの ISC DHCP 構成が存在せず、かつ \fB-m\fR も指定されている場合、ISC DHCP サーバーが開始されます。
.sp
ローカルの ISC DHCP 構成がすでに存在する場合、重複していないのであれば、これらのアドレスが既存の管理対象のアドレスセットに追加されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-B\fR <\fIserver_ipaddr\fR>\fR
.ad
.br
.na
\fB\fB--bootfile-server\fR <\fIserver_ipaddr\fR>\fR
.ad
.sp .6
.RS 4n
クライアントがブートファイルを要求するブートサーバーの IP アドレスを指定するために使用します。ほかの方法ではこの IP アドレスを決定できない場合にのみ必要です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.br
.na
\fB\fB--enable-security\fR\fR
.ad
.sp .6
.RS 4n
-S オプションと一緒には使用できません。
.sp
\fB--disable-security\fR オプションを使用してセキュリティーを無効にしたあと、サーバー全体にわたるセキュリティーの適用をふたたび有効にします。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR\fR
.ad
.br
.na
\fB\fB--disable-security\fR\fR
.ad
.sp .6
.RS 4n
\fB-s\fR オプションと一緒には使用できません。
.sp
サーバー全体にわたるセキュリティーの適用を無効にします。セキュリティーが無効になっている間は、クライアントに資格が発行されず、クライアントからも資格が要求されません。セキュリティーが無効になっている間は、AI クライアントに提供されるどの AI ファイルにも HTTPS ネットワークによる保護が提供されません。AI Web サーバーが処理しているユーザー指定のセキュアなファイルは、セキュリティーが無効になっている間はアクセスできません。
.sp
セキュリティーが無効になっている間も、引き続きセキュリティーを構成できます。変更内容はすべて、セキュリティーがふたたび有効になったときに反映されます。
.sp
すでにインストールサービスが構成されたシステムのセキュリティーを無効にするときは注意してください。セキュアな AI サービスデータへのアクセスに認証が不要になり、認証されていないクライアントが AI を使用して Oracle Solaris をインストールできるようになります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR\fR
.ad
.br
.na
\fB\fB--default-client-security\fR\fR
.ad
.sp .6
.RS 4n
[\fBsec_options\fR] を、サーバーのセキュリティー設定ではなく、デフォルトクライアントセキュリティーの変更のみに制限します。
.RE

[\fBsec_options\fR] は、次のいずれかにできます。デフォルトでは、\fB-D\fR|\fB--default-client-security\fR オプションが指定されている場合を除き、これらはサーバーに適用されます。
.sp
.ne 2
.mk
.na
\fB\fB-x\fR [\fB--hash\fR <\fIca-hash\fR> [\fB-r\fR]]\fR
.ad
.br
.na
\fB\fB--delete-security\fR [\fB--hash\fR <\fIca-hash\fR> [\fB--recursive\fR]]\fR
.ad
.sp .6
.RS 4n
構成済みのセキュリティーを削除します。\fB--hash\fR が指定されている場合は、そのハッシュを持つ CA 証明書だけが削除されます。
.sp
\fB-r\fR なしの場合、以前にインストールサーバー (\fB-D\fR が指定されている場合はデフォルトクライアント) に割り当てられた CA 証明書を削除します。
.sp
\fB-r\fR ありの場合、指定された CA 証明書を使用するサーバーおよびクライアントの CA 証明書を削除します。
.sp
インストールサーバー、指定されたクライアント、デフォルトのクライアントに以前に割り当てられた CA 証明書を削除します。
.sp
<\fIca-hash\fR の値は、証明書の X.509 サブジェクトのハッシュ値です。CA 証明書のハッシュを表示するには、\fBlist -v\fR サブコマンドを使用します。 
.sp
クライアントの CA 証明書が削除されると、そのクライアントを認証できなくなります。指定された CA 証明書を使用して証明書を生成しようとしても、\fBinstalladm\fR コマンドは証明書を生成できません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR\fR
.ad
.br
.na
\fB\fB--generate-all-certs\fR\fR
.ad
.sp .6
.RS 4n
X.509 のすべてのセキュリティー資格を自動的に生成して割り当て、OBP 鍵を生成します。CA 証明書と OBP 鍵は、それらがまだ存在していない場合にのみ生成されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-A\fR <\fIca-certfile\fR>...\fR
.ad
.br
.na
\fB\fB--ca-cert\fR <\fIca-certfile\fR>...\fR
.ad
.sp .6
.RS 4n
パス <\fIca-certfile\fR> にある、ユーザー指定の PEM エンコードされた X.509 認証局 (CA) 証明書を割り当てます。各 CA 信頼チェーンは 1 回だけ指定する必要があります。CA チェーンに複数の CA 証明書ファイルが含まれる場合は、複数の \fB-A\fR オプションを使用します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR <\fIcertfile\fR> \fB-K\fR <\fIkeyfile\fR>\fR
.ad
.br
.na
\fB\fB--cert\fR <\fIcertfile\fR> \fB--key\fR <\fIkeyfile\fR>\fR
.ad
.sp .6
.RS 4n
\fB-C\fR は、パス <\fIcertfile\fR> にある、ユーザー指定の PEM エンコードされた X.509 証明書を割り当てます。
.sp
\fB-K\fR は、パス <\fIkeyfile\fR> にある、ユーザー指定の PEM エンコードされた X.509 非公開鍵を割り当てます。<\fIkeyfile\fR> は、パスフレーズがすべて削除されている必要があります。
.sp
\fB-C\fR オプションは、\fB-K\fR オプションとともに使用する必要があります。\fB-C\fR および \fB-K\fR オプションのみを指定する場合は、関連付けられた CA 証明書が事前に割り当てられている必要があります。
.sp
\fB-A\fR オプションも指定する場合、これらの CA 証明書に対してこの証明書および鍵が検証されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-E\fR\fR
.ad
.br
.na
\fB\fB--generate-encr-key\fR\fR
.ad
.sp .6
.RS 4n
SPARC OBP ファームウェアのセキュリティー暗号化鍵を再生成します。既存の鍵をすべて無効にします。
.sp
\fB-g\fR、\fB-C\fR、\fB-K\fR、または \fB-A\fR オプションを使用すると、OBP 鍵がまだ存在していない場合に OBP 鍵が自動的に生成されます。これらの鍵が生成されたら、\fB-E\fR および \fB-H\fR オプションを使用すると既存の鍵を置き換えることができます。OBP 鍵が存在する前に \fB-E\fR または \fB-H\fR オプションを指定すると、エラーになります。両方の OBP 鍵オプションを指定することも、\fB-E\fR または \fB-H\fR のどちらかを指定することもできます。すでに存在する OBP 鍵は無効にされ、新しく生成された値に置き換えられます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-H\fR\fR
.ad
.br
.na
\fB\fB--generate-hmac-key\fR\fR
.ad
.sp .6
.RS 4n
SPARC OBP ファームウェアのセキュリティーハッシュ鍵 (HMAC) を再生成します。既存の鍵をすべて無効にします。
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBinstalladm execute\fR \fB-f\fR <\fIfile\fR>\fR
.ad
.sp .6
.RS 4n
<\fIfile\fR> からのサブコマンドのリストを、バッチジョブとして順番に実行します。
.sp
また、バッチの実行が完了するまで、SMF サービスのリフレッシュ/再起動をそのままにしておくという利点もあります。
.sp
必須の引数は次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-f\fR <\fIfile\fR>\fR
.ad
.br
.na
\fB\fB--file\fR <\fIfile\fR>\fR
.ad
.RS 17n
.rt  
実行するサブコマンドのリストを含むファイルで、サブコマンドごとに 1 行が使用されます。
.sp
空白行または '#' で始まる行は無視されます。
.RE

.RE

.SH 対話型モード
.sp
.LP
対話側モードでは、サブコマンドを次々に入力可能なところで、\fBinstalladm\fR プロンプトが提供されます。対話型モードの主な利点を次に示します。
.RS +4
.TP
.ie t \(bu
.el o
サブコマンド形式のみを使用して複数のコマンドを入力する場合、特に sudo または pfexec を使用し、追加の権限または承認で \fBinstalladm\fR を実行する場合に有用です。
.RE
.RS +4
.TP
.ie t \(bu
.el o
サブコマンドのタブ補完。
.RE
.sp
.LP
対話型モードでは、単一コマンドの実行時には使用されないその他のコマンドを活用できます。
.sp
.ne 2
.mk
.na
\fB\fBshell [<command>]\fR\fR
.ad
.RS 21n
.rt  
これを指定すると、環境変数 SHELL の値に基づき、サブシェル内で <\fIcommand\fR> が実行されます。
.sp
パラメータなしの場合、対話的に使用するサブシェルが開始されます。
.sp
このコマンドの短縮形式 '\fB!\fR' もあり、\fBls\fR コマンドを実行する場合に "\fB!ls\fR" のように使用できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBquit\fR\fR
.ad
.RS 21n
.rt  
対話形式のプロンプトを終了します。
.RE

.SH 条件
.sp
.LP
マニフェスト、派生マニフェストスクリプト、およびプロファイルを使用すると、特定の特性または条件に従って AI クライアントを異なる方法で構成できます。1 つのマニフェストまたはスクリプトのみを特定のクライアントに関連付けることができます。任意の数のプロファイルを特定のクライアントに関連付けることができます。
.sp
.LP
条件の値は、起動中の AI クライアントによって決定されます。
.sp
.LP
コマンド行で条件を指定する方法については、「使用例」のセクションを参照してください。条件ファイルの作成についての詳細は、\fI『Installing Oracle Solaris 11.3 Systems』\fRを参照してください。
.sp

.sp
.TS
tab();
cw(1.38i) cw(4.13i) 
lw(1.38i) lw(4.13i) 
.
条件説明
\fBarch\fRT{
\fBuname -m\fR ごとのアーキテクチャー。
T}
\fBcpu\fR\fBuname -p\fR ごとの CPU クラス。
\fBhostname\fR割り当てられたホスト名。
\fBipv4\fRT{
IP バージョン 4 のネットワークアドレス。
T}
\fBmac\fRT{
コロン (:) で区切られた 16 進数の MAC アドレス。
T}
\fBmem\fRT{
\fBprtconf\fR(1M) ごとのメモリーサイズ (M バイト単位)。
T}
\fBnetwork\fRT{
IP バージョン 4 のネットワーク番号。
T}
\fBplatform\fRT{
\fBuname -i\fR (x86システム) および \fBprtconf -b\fR (SPARCシステム) によって返されるプラットフォーム名。
T}
\fBzonename\fR\fBzones\fR(5) ごとのゾーン名。
.TE

.sp
.LP
\fBipv4\fR、\fBmac\fR、\fBmem\fR、および \fBnetwork\fR の指定は、ハイフン (\fB-\fR) で区切られた範囲値で表現できます。範囲の一端に制限なしを指定するには、\fBunbounded\fR を使用します。一致するマニフェストの判定時には、範囲の一致よりも特定値の一致が優先されます。
.sp
.LP
\fBarch\fR、\fBcpu\fR、\fBhostname\fR、\fBplatform\fR、および \fBzonename\fR の指定は、スペースで区切られた値の引用符付きリストとして表現されます。
.SH インストールサーバー構成のプロパティー
.sp
.LP
SMF サービス \fBsvc:/system/install/server:default\fR の次のプロパティーは、インストールサーバーを構成する際に使用されます。
.sp
.LP
これらの大半は、更新用の優先メカニズムである \fBset-server\fR サブコマンドを使用して構成可能です。
.sp
.ne 2
.mk
.na
\fB\fBall_services/networks\fR\fR
.ad
.sp .6
.RS 4n
\fBall_services/exclude_networks\fR プロパティーの設定に応じて、許可または却下する CIDR 形式のネットワーク (たとえば、\fI192.168.56.0/24\fR) の一覧。
.sp
このネットワーク一覧を使用して、このインストールサーバーで処理されるクライアントを指定します。デフォルトでは、AI インストールサーバーがマルチホームになっている場合は、そのサーバーが接続されているすべてのネットワーク上のインストールクライアントを処理するよう構成されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBall_services/exclude_networks\fR\fR
.ad
.sp .6
.RS 4n
ブール値。true の場合、このインストールサーバーによる処理対象から、\fBall_services/networks\fR プロパティーで指定されたネットワークを除外します。false の場合、\fBall_services/networks\fR プロパティーで指定されたネットワークを含めます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBall_services/port\fR\fR
.ad
.sp .6
.RS 4n
AI インストールサービス Web サーバーをホストするポートを指定します。デフォルトでは、Web サーバーはポート 5555 でホストされます。
.sp
デフォルトとは異なるポート番号を使用する場合は、インストールサービスを作成する前にportプロパティーをカスタマイズしてください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBall_services/secure_port\fR\fR
.ad
.sp .6
.RS 4n
セキュアな AI インストールサービス Web サーバーをホストするポートを指定します。デフォルトでは、Web サーバーはポート 5556 でホストされます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBall_services/webserver_files_dir\fR\fR
.ad
.sp .6
.RS 4n
AI Web サーバーがその標準ポート (\fBall_services/port\fR プロパティーによって定義される) を使用して処理するローカルシステム上のディレクトリを指定します。このディレクトリには、次の場所でアクセスできます。
.sp
\fBhttp://server:port/files\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fBall_services/webserver_secure_files_dir\fR\fR
.ad
.sp .6
.RS 4n
AI Web サーバーがセキュアポート (\fBall_services/secure_port\fR プロパティーによって定義される) を使用して処理するローカルシステム上のディレクトリを指定します。このディレクトリには、次の場所でアクセスできます。
.sp
\fBhttps://server:secure_port/secure_files\fR
.sp
このディレクトリには、認証されたクライアントのみがアクセスできます。最高のセキュリティーを確保するために、\fBwebserver_secure_files_dir\fR ディレクトリ内のファイルをユーザー webservd およびグループ webservd が所有するようにし、どこからでもアクセス可能にしないでください。
.RE

.sp
.ne 2
.mk
.na
\fB\fBall_services/default_imagepath_basedir\fR\fR
.ad
.sp .6
.RS 4n
\fBinstalladm create-service\fR コマンドによって作成されるイメージのデフォルトの場所を指定します。イメージは、\fBall_services/default_imagepath_basedir/service_name\fR にあります。このプロパティーのデフォルト値は \fB/export/auto_install\fR です。
.RE

.sp
.ne 2
.mk
.na
\fB\fBall_services/manage_dhcp\fR\fR
.ad
.sp .6
.RS 4n
ブール値。true の場合、クライアントとサービス構成がインストールサーバーで変更されるとローカル ISC DHCP 構成を自動的に更新します。false の場合、ISC DHCP 構成を自動的に維持しません。
.RE

.SH マニフェストエディタ CLI
.sp
.LP
マニフェストエディタ CLI は対話型のインタフェースであり、AI マニフェストの内容を、対話型のインタフェースのプロンプトで入力するサブコマンドを使用して操作できるオブジェクトまたはプロパティーのセットとして表します。これにより、XML ドキュメントを確認したり理解したりしなくても、\fBcreate-manifest\fR または \fBupdate-manifest\fR 中にマニフェストを対話形式で編集できます。
.sp
.LP
このインタフェースは、マニフェスト内のオブジェクトとプロパティーを視覚的に表現します。オブジェクトには、設定、削除、または追加できるプロパティーと、トラバース、追加、削除、または移動できるサブオブジェクト (それ自体がオブジェクト) を含めることができます。
.sp
.LP
このインタフェース内で使用できるサブコマンドは次のとおりです。
.sp
.ne 2
.mk
.na
\fB操作のサブコマンド\fR
.ad
.sp .6
.RS 4n
\fBset\fR、\fBadd\fR、\fBdelete\fR、および \fBmove\fR
.RE

.sp
.ne 2
.mk
.na
\fBナビゲーションのサブコマンド\fR
.ad
.sp .6
.RS 4n
\fBselect\fR、\fBcancel\fR、および \fBend\fR
.RE

.sp
.ne 2
.mk
.na
\fB追加のサブコマンド\fR
.ad
.sp .6
.RS 4n
\fBhelp\fR、\fBinfo\fR、\fBwalk\fR、\fBcommit\fR、\fBexit\fR、\fBvalidate\fR、および \fBshell\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fBhelp\fR [\fIsubcommand\fR]\fR
.ad
.sp .6
.RS 4n
パラメータなしの場合、使用可能なサブコマンドのリストを提供します。サブコマンドを指定した場合は、その特定のサブコマンドのヘルプが提供されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBinfo\fR [\fB-v\fR|\fB--verbose\fR]\fR
.ad
.sp .6
.RS 4n
デフォルトでは、1 つ下のレベルまでのすべてのプロパティーとオブジェクトを表示します。2 つ以上下のレベルのオブジェクトの場合、サマリー行に続けて「 ...」が表示されます。2 つ以上下のレベルのオブジェクトの詳細を表示するには、\fB-v \fR オプションを使用します。指定されたオブジェクトが複数存在する場合、その順序は <\fIobject\fR>[<\fIposition\fR#>] (たとえば、disk[3]) によって指定されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBselect\fR <\fIobject\fR>\fR
.ad
.br
.na
\fB\fBselect\fR <\fIobject\fR>[<\fIposition\fR#>]\fR
.ad
.br
.na
\fB\fBselect\fR <\fIobject\fR> <\fIproperty\fR>=<\fIvalue\fR> \fR
.ad
.sp .6
.RS 4n
オブジェクトを選択し、そのレベルに移動します。オブジェクトは \fIposition#\fR またはプロパティーの値によってさらに指定できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcancel\fR\fR
.ad
.sp .6
.RS 4n
現在のレベルで行なった変更を破棄し、1 つ上のレベルに移動します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBend\fR\fR
.ad
.sp .6
.RS 4n
現在のレベルで行なった変更を検証し、検証エラーが発生しなかった場合は、1 つ上のレベルに移動します。トップレベルでは、「\fBexit\fR」と同じです。
.RE

.sp
.ne 2
.mk
.na
\fB\fBset\fR <\fIproperty\fR>=<\fIvalue\fR>\fR
.ad
.sp .6
.RS 4n
オブジェクトの <\fIproperty\fR> の値を <\fIvalue\fR> に設定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fBadd\fR [\fB-w\fR|\fB--walk\fR] <\fIobject\fR>\fR
.ad
.br
.na
\fB\fBadd\fR <\fIproperty\fR>=<\fIvalue\fR>\fR
.ad
.sp .6
.RS 4n
オブジェクトまたはプロパティーを追加します。オブジェクトに対して \fB-w\fR を指定すると、そのオブジェクトが追加され、「\fBwalk\fR」が起動されます。\fB-w\fR を指定しない場合は、自動的に新しいオブジェクトの「\fBinfo\fR」が表示され、追加されたオブジェクトのプロパティー/デフォルト値が表示されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBdelete\fR <\fIproperty\fR>\fR
.ad
.br
.na
\fB\fBdelete\fR <\fIproperty\fR>=<\fIvalue\fR>\fR
.ad
.br
.na
\fB\fBdelete\fR <\fIobject\fR>\fR
.ad
.br
.na
\fB\fBdelete\fR <\fIobject\fR>[<\fIposition\fR#>]\fR
.ad
.br
.na
\fB\fBdelete\fR <\fIobject\fR> <\fIproperty\fR>=<\fIvalue\fR>\fR
.ad
.sp .6
.RS 4n
オブジェクトまたはプロパティーを削除します。プロパティーは値によって指定でき、オブジェクトは \fIposition#\fR またはプロパティーの値によって指定できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBmove\fR <\fIobject\fR> <\fIold position#\fR> <\fInew position#\fR>\fR
.ad
.sp .6
.RS 4n
オブジェクトを別の位置に移動します。移動する有効なオブジェクトは、「[<\fIposition#\fR>]」による「\fBinfo\fR」の出力に指定されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBwalk\fR\fR
.ad
.sp .6
.RS 4n
現在のオブジェクトに関連付けられたすべての設定可能なプロパティーの入力を求めます。プロパティーごとに名前と現在の値を表示し、新しい値を入力できるようにします。サブオブジェクトを再帰的に下に移動して、新しいサブオブジェクトの追加を許可します。\fBCtrl\fR-\fBD\fR キーで中断できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBvalidate\fR\fR
.ad
.sp .6
.RS 4n
現在のレベルで設定を検証します。これはオプションのサブコマンドです。サブコマンド、「\fBend\fR」および「\fBexit\fR」は、暗黙的に検証を行います。
.RE

.sp
.ne 2
.mk
.na
\fB\fBcommit\fR\fR
.ad
.sp .6
.RS 4n
変更を検証し、マニフェストを保存して、編集を続行します。トップレベルでのみ有効です。正常に確定したあと、新しいベースラインが設定され、前に行なった変更を \fBcancel\fR で元に戻すことはできなくなります。
.RE

.sp
.ne 2
.mk
.na
\fB\fBexit\fR\fR
.ad
.sp .6
.RS 4n
マニフェストを保存して終了する (変更は検証されます) か、確定されていない変更を保存しないで終了するか、編集を続行するかの確認を求めます。
.RE

.sp
.ne 2
.mk
.na
\fB\fBshell\fR <\fIsolaris command\fR>\fR
.ad
.br
.na
\fB!<\fIsolaris command\fR>\fR
.ad
.sp .6
.RS 4n
環境変数 \fBSHELL\fR の値に基づき、サブシェル内で <\fIcommand\fR> が実行されます。パラメータなしの場合、対話的に使用するサブシェルが開始されます。インタフェース内から簡単にシステムコマンドを実行したりシステム情報を表示したりするために使用できます。
.RE

.SS "マニフェストエディタ CLI の例"
.LP
\fB例 1 \fR新しいマニフェストを作成し、ローカルリポジトリを指すようにパブリッシャーを変更する
.sp
.in +2
.nf
# \fBinstalladm create-manifest -n sol_11_3 -m mymanifest\fR 
    Type help to see list of subcommands. 
    installadm:mymanifest> info
       http-proxy: <not specified>
       auto-reboot: false
       create-swap: true
       create-dump: true
       software:
          type: IPS
          name: <not specified>
          facet[1]: facet.locale.*=false ...
          <other facets removed for brevity>
          facet[20]: facet.locale.zh_TW=true ...
          publisher: name=solaris ...
          pkg-list: action=install ...
       disk: Section not specified
       pool:
          action: create
          name: rpool
          is-root: true
          mountpoint: <not specified>
          pool-option: Section not specified
          dataset-option: Section not specified
          be-option: Section not specified
          vdev: Section not specified
          filesystem[1]: name=export ...
             option: Section not specified
          filesystem[2]: name=export/home ...
             option: Section not specified
          volume: Section not specified
       boot-mods: Section not specified
       configuration: Section not specified
    installadm:mymanifest> select software 
    installadm:mymanifest:software> select publisher 
    installadm:mymanifest:software:publisher> set origin=http://myrepo.example.com/solaris 
    installadm:mymanifest:software:publisher> info 
       name: solaris
       key: <not specified>
       cert: <not specified>
       ca-cert: <not specified>
       origin: http://myrepo.example.com/solaris
       mirror: <not specified>
    installadm:mymanifest:software:publisher> end 
    installadm:mymanifest:software> end 
    installadm:mymanifest> exit 
    1. Save manifest and exit 
    2. Exit without saving uncommitted changes 
    3. Continue editing 
    Please select choice: 1
    100% : Created Manifest: 'mymanifest' 
    # 
.fi
.in -2
.sp

.LP
\fB例 2 \fR事前に作成したマニフェストに基づいてインストールサービス用の 2 番目のマニフェストを作成する
.sp
.LP
次の例では、例 1 で作成したマニフェストに基づいてインストールサービス用の 2 番目のマニフェストを作成しますが、さらに新しいパッケージをインストールするパッケージのリストに追加します。

.sp
.in +2
.nf
# installadm 
    installadm> create-manifest -n sol_11_3 -m newmanifest -M mymanifest -e 
    Type help to see list of subcommands. 
    installadm:newmanifest> select software
    installadm:newmanifest:software> select pkg-list
    installadm:newmanifest:software:pkg-list> add name=pkg:/my/new/pkg 
    installadm:newmanifest:software:pkg-list> exit
    1. Save manifest and exit 
    2. Exit without saving uncommitted changes 
    3. Continue editing 
    Please select choice: 1 
    Created Manifest: 'newmanifest' 
    installadm>
.fi
.in -2
.sp

.LP
\fB例 3 \fRマニフェストの内容を置き換える
.sp
.LP
次の例では、マニフェスト、oldmanifest の内容を \fB/tmp/replace.xml\fR の内容と置き換えて、さらに、\fBwalk\fR を使用して必要なパブリッシャープロパティーを設定することで、\fBauto-reboot\fR プロパティーを false から true に変更し、新しいパブリッシャーを追加します。

.sp
.in +2
.nf
# installadm update-manifest -n sol_11_3 -m oldmanifest \
    -f /tmp/replace.xml -e
    installadm:oldmanifest> select software
    installadm:oldmanifest:software> add -w publisher
      * To terminate walk, use Ctrl-D *
       name [<not specified>]: newpublisher
       key [<not specified>]: 
       cert [<not specified>]: 
       ca-cert [<not specified>]: 
       origin [<not specified>]: http://myrepo.example.com/solaris
       origin [<not specified>]: 
       mirror [<not specified>]: 
    installadm:oldmanifest:software:publisher> end
    installadm:oldmanifest:software> end
    installadm:oldmanifest> set auto-reboot=true 
    installadm:oldmanifest> exit
    1. Save manifest and exit 
    2. Exit without saving uncommitted changes 
    3. Continue editing 
    Please select choice: 1
    Changed Manifest: 'oldmanifest' 
    # 
.fi
.in -2
.sp

.LP
\fB例 4 \fR既存のマニフェストを更新する
.sp
.LP
次の例では、既存のマニフェスト、testmanifest を更新して、ディスクが ctd 名では選択されなくなり、サイズで選択されるようにします。

.sp
.in +2
.nf
# installadm update-manifest -n sol_11_3 -m testmanifest
    installadm:testmanifest> select disk
    installadm:testmanifest:disk> info
       in-zpool: rpool
       in-vdev: <not specified>
       name:
          name: c0t0d0
          name-type: ctd
       disk-selection-props: Section not specified
       keyword: Section not specified
       iscsi: Section not specified
       gpt-partition: Section not specified
       partition: Section not specified
       slice: Section not specified
    installadm:testmanifest:disk> delete name
    Are you sure you want to remove 'name'? [y|N]: y
    Object 'name' deleted.
    installadm:testmanifest:disk> add disk-selection-props
       type: <not specified>
       vendor: <not specified>
       chassis: <not specified>
       size: <not specified>
    installadm:testmanifest:disk:disk-selection-props> set size=750gb
    installadm:testmanifest:disk:disk-selection-props> end
    installadm:testmanifest:disk> info
       in-zpool: rpool
       in-vdev: <not specified>
       name: Section not specified
       disk-selection-props:
          type: <not specified>
          vendor: <not specified>
          chassis: <not specified>
          size: 750gb
       keyword: Section not specified
       iscsi: Section not specified
       gpt-partition: Section not specified
       partition: Section not specified
       slice: Section not specified
    installadm:testmanifest:disk> end
    installadm:testmanifest> end
    1. Save manifest and exit
    2. Exit without saving uncommitted changes
    3. Continue editing
    Please select choice: 1
    100% : Changed Manifest: 'testmanifest'
.fi
.in -2
.sp

.SH 使用例
.LP
\fB例 5 \fRパッケージリポジトリから新しい x86 インストールサービスを設定する
.sp
.LP
インストールサーバーと x86 インストールサービスをはじめて設定します。

.sp
.LP
AI クライアントの構成に SPARC OBP の network-boot-arguments 変数を使用していない場合は、DHCP サーバーを構成して AI サービス構成を指定する必要があります。OBP または DHCP サーバーを構成済みの場合、この段階はスキップできます。それ以外の場合、\fBinstalladm\fR は、AI クライアントのブート元であるローカルの ISC DHCP サーバーを設定および管理できます。これを構成する場合に、\fBset-server\fR サブコマンドを使用できます。

.sp
.LP
\fBset-server\fR サブコマンドを使用して、DHCP サーバーを構成するための開始 IP アドレスおよび IP アドレスの総数を設定します。

.sp
.in +2
.nf
# \fBinstalladm set-server -i 172.0.0.10 -c 10\fR
.fi
.in -2
.sp

.sp
.LP
開始 IP アドレス \fI172.0.0.10\fR と 10 個の IP アドレスがローカル ISC DHCP 構成に追加されます。ローカル ISC DHCP 構成が存在しない場合は、ISC DHCP サーバーが起動されます。

.sp
.LP
ネットイメージのソースを指定しない場合、次の例に示すように、IPS パッケージが使用されます。

.sp
.in +2
.nf
# \fBinstalladm create-service -y\fR
.fi
.in -2
.sp

.sp
.LP
このコマンドは、x86 インストールサーバー上で、\fBall_services/default_imagepath_basedir\fR プロパティーの値で指定したイメージの場所のディレクトリに x86 ネットイメージとデフォルトの名前のインストールサービスを設定します。このプロパティーのデフォルト値については、「インストールサーバー構成のプロパティー」を参照してください。\fB-y\fR オプションは、デフォルトの場所が使用可能であることを確認します。アーキテクチャーが指定されていないため、作成されるサービスはインストールサーバーと同じアーキテクチャーのサービスです。このコマンドでは、インストールサーバーの \fBpkg publisher\fR 一覧にあるパッケージリポジトリに \fBinstall-image/solaris-auto-install\fR パッケージが含まれることが前提となっています。

.sp
.LP
このコマンドは、デフォルトのイメージパスおよびサービス名 \fB/export/auto_install/sol-11_1-i386\fR を使用して、ネットイメージおよびインストールサービスを設定します。

.sp
.LP
これは最初に作成される x86 サービスであるため、default-i386サービスが自動的に作成され、このサービスに別名が設定されます。default-i386 の別名は操作可能であり、PXE 経由でブートしたクライアントは、create-client を使用して具体的に構成していない場合に、default-i386 サービスからブートおよびインストールを実行します。

.LP
\fB例 6 \fRパッケージリポジトリから新しい SPARC インストールサービスを設定する
.sp
.LP
x86 インストールサーバーへの SPARC サービスの作成を指定するには、\fB-a\fR オプションを使用します。

.sp
.in +2
.nf
# \fBinstalladm create-service -y -a sparc\fR
.fi
.in -2
.sp

.sp
.LP
ネットイメージのソースを指定しない場合、デフォルトで IPS パッケージが使用されます。

.sp
.LP
このネットイメージを使用して SPARC クライアントのインストールを実行できます。

.sp
.LP
これは最初に作成される SPARC サービスであるため、\fBdefault-sparc\fR サービスが自動的に作成され、このサービスに別名が設定されます。別名 \fBdefault-sparc\fR は稼働しており、SPARC クライアントは \fBdefault-sparc\fR サービスからブートおよびインストールします。

.LP
\fB例 7 \fR異なるパッケージリポジトリから x86 インストールサービスを設定する
.sp
.LP
デフォルトでは、\fBsolaris-auto-install\fR パッケージはシステムで構成されたパブリッシャーから取得されます。

.sp
.LP
\fBsolaris-auto-install\fR パッケージの代替パッケージリポジトリを指定するには、\fB-p\fR オプションを使用します。たとえば、\fIhttp://example.company.com:4281\fR にある ai-image パブリッシャーを \fBsolaris-auto-install\fR パッケージのパブリッシャーとして指定するには、次のコマンドを使用します。

.sp
.in +2
.nf
# \fBinstalladm create-service -y \
-p ai-image=http://example.company.com:4281\fR
.fi
.in -2
.sp

.LP
\fB例 8 \fRISO ファイルから新しい x86 インストールサービスを設定する
.sp
.LP
次を使用して、ISO イメージから x86 インストールサービスを作成できます。

.sp
.in +2
.nf
# \fBinstalladm create-service -n sol-11_1-i386 \
-s /export/isos/sol-11_1-ai-x86.iso \
-y\fR
.fi
.in -2
.sp

.sp
.LP
AI ISO イメージは \fB/export/auto_install/sol-11_1-sparc\fR にあります。このコマンドは、AI ISO イメージに基づいた \fB/export/images/sol-11_1-i386 \fR にあるネットイメージとインストールサービスを設定します。このネットイメージを使用してクライアントインストールを実行できます。

.LP
\fB例 9 \fRISO ファイルから新しい SPARC インストールサービスを設定する
.sp
.LP
ISO イメージからの SPARC インストールサービスは、次のコマンドを使用して作成できます。

.sp
.in +2
.nf
\fB# installadm create-service -n sol-11_1-sparc \
-s /export/isos/sol-11_1-ai-sparc.iso \
-d /export/images/sol-11_1-sparc\fR
.fi
.in -2
.sp

.sp
.LP
AI ISO イメージは \fB/export/isos/sol-11_1-ai-sparc.iso\fR にあります。このコマンドは、AI ISO イメージに基づいた \fB/export/images/sol-11_1-sparc\fR にあるネットイメージとインストールサービスを設定します。このネットイメージを使用してクライアントインストールを実行できます。

.LP
\fB例 10 \fRクライアントをインストールサービスに関連付ける
.sp
.LP
クライアントを特定のインストールサービスに関連付けるには、次のサンプルコマンドを使用します。インストールサービスはすでに存在している必要があります。

.sp
.in +2
.nf
# \fBinstalladm create-client -b "console=ttya" \\fR
\fB-e 0:e0:81:5d:bf:e0 -n sol-11_1-i386\fR
.fi
.in -2
.sp

.sp
.LP
この例のコマンドは、MAC アドレスが \fB0:e0:81:5d:bf:e0\fR であるシステムのためにクライアント固有の設定を作成します。このクライアントは、事前に設定された \fBsol-11_1-i386\fR という名前のインストールサービスと、そのサービスに関連付けられたネットイメージを使用します。このコマンドは、\fB/etc/netboot\fR にあるクライアント固有のブート構成ファイルにブートプロパティー \fBconsole=ttya\fR を設定します。

.LP
\fB例 11 \fRデフォルトサービスを変更せずに新しいインストールサービスを追加する
.sp
.LP
\fBsol-11-sparc\fR という名前の新しいサービスを追加するときに、既存のサービスを保持し、既存のデフォルトを変更しないようにするには、次のサンプルコマンドを使用します。

.sp
.in +2
.nf
# \fBinstalladm create-service -n sol-11-sparc \\fR
\fB-s /export/isos/sol-11-1111-ai-sparc.iso \\fR
\fB-d /export/ai/sol-11-sparc\fR
.fi
.in -2
.sp

.LP
\fB例 12 \fR\fBdefault-i386\fR サービスを更新する
.sp
.LP
入手可能な最新のイメージに関連付ける \fBdefault-i386\fR 別名サービスを更新するには、次のサンプルコマンドを使用します。\fBinstalladm list\fR コマンドは、コマンドの前および後のサービスを表示します。この例では、更新されたネットイメージパッケージが、\fBdefault-i386\fR サービス別名の作成に最初に使用された発行元から使用可能であることを想定しています。

.sp
.in +2
.nf
# \fBinstalladm list\fR
Service Name    Base Service        Status Arch  Type Ali Cli Man Pro
------------    --------        ------ ----  ---- --- --- --- ---
default-i386    solaris11-i386  on     i386  pkg  0   1   1   0
solaris11-i386  -               on     i386  pkg  1   0   1   0
# \fBinstalladm update-service default-i386\fR
\&...
Creating new i386 service: solaris11_1-i386
Aliasing default-i386 to solaris11_1-i386 ...
\&...
# \fBinstalladm list\fR
Service Name      Base Service          Status Arch  Type Ali Cli Man Pro
------------      --------          ------ ----  ---- --- --- --- ---
default-i386      solaris11_1-i386  on     i386  pkg  0   1   1   0
solaris11-i386    -                 on     i386  pkg  0   0   1   0
solaris11_1-i386  -                 on     i386  pkg  1   0   1   0
.fi
.in -2
.sp

.LP
\fB例 13 \fR新しいインストールサービスを追加して \fBdefault-sparc\fR サービスを更新する
.sp
.LP
\fBmy-sparc-service\fR という名前の新しいサービスを追加するときに、既存のサービスを保持し、新しいサービスを SPARC クライアントのデフォルトにするには、次の 2 つのサンプルコマンドを使用します。

.sp
.in +2
.nf
# \fBinstalladm create-service -n solaris11_1-sparc \\fR
\fB-s /export/isos/sol-11_1-ai-sparc.iso \\fR
\fB-d /export/ai/solaris11_1-sparc\fR
# \fBinstalladm set-service \\fR
\fB--aliasof=solaris11_1-sparc default-sparc\fR
.fi
.in -2
.sp

.LP
\fB例 14 \fRカスタムのデフォルト AI マニフェストをインストールサービスに追加する
.sp
.LP
新しいマニフェストを \fBsol-11_1-i386\fR インストールサービスに追加し、それをサービスのデフォルトマニフェストにするには、次のサンプルコマンドを使用します。マニフェストのデータは \fBmy_default.xml\fR にあります。以降の \fBinstalladm\fR コマンドでは、このマニフェストが \fBmy_default\fR として参照されます。\fB-d\fR オプションを指定すると、これがサービスのデフォルトマニフェストになります。 

.sp
.in +2
.nf
# \fBinstalladm create-manifest -d -f my_default.xml \\fR
\fB-m my_default -n sol-11_1-i386\fR
.fi
.in -2
.sp

.LP
\fB例 15 \fR派生したマニフェストスクリプトをインストールサービスに追加する
.sp
.LP
\fBmy_script\fR という名前の派生したマニフェストスクリプトを \fBsolaris11_1-i386\fR という名前の既存のインストールサービスに追加するには、次のサンプルコマンドを使用します。スクリプトはマニフェストの追加と同じ方法で追加されます。

.sp
.in +2
.nf
# \fBinstalladm create-manifest -f my_script.py \\fR
\fB-m my_script -n solaris11_1-i386\fR
.fi
.in -2
.sp

.sp
.LP
派生マニフェストスクリプトを作成する方法については、\fI『Installing Oracle Solaris 11.3 Systems 』\fR を参照してください。

.LP
\fB例 16 \fRインストールサービスのデフォルト AI マニフェストを置換する
.sp
.LP
既存のインストールサービス \fBsol-11_1-sparc\fR のデフォルトマニフェストを、\fBcustom_manifest\fR としてすでにサービスに追加されているカスタムマニフェストに置換するには、次のサンプルコマンドを使用します。このマニフェストは、\fBcreate-manifest\fR サブコマンドに \fB-m custom_manifest\fR を指定することによってサービスに追加されました。

.sp
.in +2
.nf
# \fBinstalladm set-service \\fR
\fB--default-manifest=custom_manifest sol-11_1-sparc\fR
.fi
.in -2
.sp

.LP
\fB例 17 \fRインストールサービスの一覧表示
.sp
.LP
ローカルサーバー上のインストールサービスを一覧表示するには、次のサンプルコマンドを使用します。

.sp
.in +2
.nf
# \fBinstalladm list\fR
Service Name            Base Service                Status  Arch  Type Ali Cli Man Pro
------------            --------                ------  ----  ---- --- --- --- ---
default-i386            solaris11_1_6_2_0-i386  on      i386  pkg  0   1   1   0
default-sparc           solaris11_1_6_2_0-sparc on      sparc pkg  0   0   1   0
solaris11_1_6_2_0-i386  -                       on      i386  pkg  1   0   1   0
solaris11_1_6_2_0-sparc -                       on      sparc pkg  1   0   1   0
.fi
.in -2
.sp

.LP
\fB例 18 \fRインストールサービスに関連付けられたクライアントを一覧表示する
.sp
.LP
ローカルサーバー上の特定のインストールサービスのクライアントを一覧表示するには、次のサンプルコマンドを使用します。

.sp
.in +2
.nf
$ \fBinstalladm list -c -n default-i386\fR
Service Name Client Address    Arch Secure Custom Args Custom Grub
------------ --------------    ---- ------ ----------- -----------
default-i386 00:11:22:33:44:55 i386 no     yes         no
             AA:BB:CC:DD:EE:FF i386 no     no          no
.fi
.in -2
.sp

.LP
\fB例 19 \fRインストールサービスに関連付けられたマニフェストを一覧表示する
.sp
.LP
ローカルサーバー上の特定のインストールサービスに関連付けられたマニフェストおよび派生マニフェストスクリプトを表示するには、次のサンプルコマンドを使用します。

.sp
.in +2
.nf
$ \fBinstalladm list -m -n default-sparc\fR
Service Name  Manifest Name   Type    Status            Criteria 
------------  -------------   ----    ------            --------
default-sparc mem             xml     active            mem = 4086 MB
              custom_manifest xml     default / active  mem = 512 - 
                                                        1024 MB 
              orig_manfiest   xml     inactive          none
              test_derived    derived inactive          none 
.fi
.in -2
.sp

.sp
.LP
この例では、次の出力が表示されます。
.RS +4
.TP
.ie t \(bu
.el o
条件付きのデフォルト以外のマニフェスト (\fBmem\fR)
.RE
.RS +4
.TP
.ie t \(bu
.el o
引き続きアクティブであることを示す条件付きのデフォルトマニフェスト (\fBcustom_manifest\fR)
.RE
.RS +4
.TP
.ie t \(bu
.el o
条件がなく、デフォルトでないために非アクティブとマークされているデフォルト以外のマニフェスト (\fBorig_default\fR)
.RE
.RS +4
.TP
.ie t \(bu
.el o
条件がなく、デフォルトでないために非アクティブとマークされているデフォルト以外の派生マニフェスト
.RE
.LP
\fB例 20 \fRプロファイルを一覧表示する
.sp
.LP
ローカルサービス上のすべてのインストールサービスのシステム構成プロファイルを一覧表示するには、次のサンプルコマンドを使用します。

.sp
.in +2
.nf
$ \fBinstalladm list -p\fR
Service Name            Profile Name       Criteria
------------            ------------       --------
solaris11_1_6_2_0-i386  sc_all-i386.xml    none
solaris11_1_6_2_0-sparc sc_all-sparc.xml   none
                        sc_network.xml     ipv4    = 10.0.2.100 - 10.0.2.199
                                           network = 10.0.0.0
.fi
.in -2
.sp

.LP
\fB例 21 \fR名前なしのカスタム AI マニフェストをインストールサービスに追加する
.sp
.LP
MAC アドレスが \fBaa:bb:cc:dd:ee:ff\fR と等しいという条件で \fB/export/my_manifest.xml\fR のマニフェストを \fBsol-11_1-i386\fR に追加するには、次のサンプルコマンドを使用します。

.sp
.in +2
.nf
# \fBinstalladm create-manifest \\fR
\fB-f /export/my_manifest.xml -n sol-11_1-i386 \\fR
\fB-c mac="aa:bb:cc:dd:ee:ff"\fR
.fi
.in -2
.sp

.sp
.LP
この例では、マニフェストに名前属性が含まれないため、マニフェスト名はファイル名から取得されます。

.sp
.in +2
.nf
$ \fBinstalladm list -m -n sol-11_1-i386\fR
Service Name  Manifest Name   Type Status   Criteria
------------  -------------   ---- ------   --------
sol-11_1-i386 my_manifest.xml xml  active   mac = AA:BB:CC:DD:EE:FF
              orig_default    xml  default  none
.fi
.in -2
.sp

.LP
\fB例 22 \fRカスタム名付きのカスタム AI マニフェストをインストールサービスに追加する
.sp
.LP
IPv4 範囲が 10.0.2.100 から 10.0.2.199 までという条件付きで \fB/export/my_manifest.xml\fR のマニフェストを \fBsol-11_1-i386\fR に追加するには、次のサンプルコマンドを使用します。

.sp
.in +2
.nf
# \fBinstalladm create-manifest \\fR
\fB-f /export/my_manifest.xml \\fR
\fB-n sol-11_1-i386 -m custom_name \\fR
\fB-c ipv4="10.0.2.100-10.0.2.199"\fR
.fi
.in -2
.sp

.sp
.LP
この例では、マニフェスト名は \fB-m\fR オプションから取得されます。

.sp
.in +2
.nf
$ \fBinstalladm list -m -n sol-11_1-i386\fR
Service Name  Manifest Name   Type Status   Criteria
------------  -------------   ---- ------   --------
sol-11_1-i386 custom_name     xml  active   ipv4 = 10.0.2.100 - 10.0.2.199
              orig_default    xml  default  none
.fi
.in -2
.sp

.LP
\fB例 23 \fRマニフェストに指定された名前付きのカスタム AI マニフェストを追加する
.sp
.LP
メモリーが 2048M バイト以上あり、アーキテクチャーが \fBi86pc\fR であるという条件付きで \fB/export/manifest3.xml\fR のマニフェストを \fBsol-11_1-i386\fR に追加するには、次のサンプルコマンドを使用します。

.sp
.in +2
.nf
# \fBinstalladm create-manifest \\fR
\fB-f /export/manifest3.xml -n sol-11_1-i386 \\fR
\fB-c mem="2048-unbounded" -c arch=i86pc\fR
.fi
.in -2
.sp

.sp
.LP
この例では、次の部分的なマニフェストで示すように、マニフェスト名はマニフェストの \fBai_instance\fR 要素の \fBname\fR 属性から取得されます。

.sp
.in +2
.nf
<auto_install>
    <ai_instance name="my_name" />
</auto_install>
.fi
.in -2

.sp
.in +2
.nf
$ \fBinstalladm list -m -n sol-11_1-i386\fR
Service Name Manifest Name Type Status  Criteria
------------ ------------- ---- ------  --------
sol-11_1-i386 my_name       xml  active  arch = i86pc
                                         mem  = 2048 - unbounded
              orig_default  xml  default none
.fi
.in -2
.sp

.LP
\fB例 24 \fRシステム構成プロファイルをインストールサービスに追加する
.sp
.LP
ホスト名のいずれかが \fBmyhost1\fR、\fBhost3\fR、または \fBhost6\fR であるという条件付きで \fB/export/profile4.xml\fR のプロファイルを \fBsol-11_1-i386\fR に追加するには、次のサンプルコマンドを使用します。

.sp
.in +2
.nf
# \fBinstalladm create-profile \\fR
\fB-f /export/profile4.xml -n sol-11_1-i386 -p profile4 \\fR
\fB-c hostname="myhost1 host3 host6"\fR
$ \fBinstalladm list -p -n sol-11_1-i386\fR
Service Name  Profile Name Criteria
------------  ------------ --------
sol-11_1-i386 profile4     hostname = myhost1, host3, host6
.fi
.in -2
.sp

.LP
\fB例 25 \fRすべてのクライアント用のシステム構成プロファイルを追加する
.sp
.LP
条件を指定しなかった場合、そのプロファイルは指定されたインストールサービスを使用するすべてのクライアントによって使用されます。次の例では、作成されたプロファイルが \fBsol-11_1-i386\fR サービスを使用するすべてのクライアントによって使用されます。

.sp
.in +2
.nf
# \fBinstalladm create-profile -f /export/locale.xml \\fR
\fB-n sol-11_1-i386\fR
$ \fBinstalladm list -p -n sol-11_1-i386\fR
Service Name  Profile Name Criteria
------------  ------------ --------
sol-11_1-i386 profile4     hostname = myhost1, host3, host6
              locale.xml   none
.fi
.in -2
.sp

.LP
\fB例 26 \fRインストール環境にシステム構成プロファイルを適用する
.sp
.LP
システム構成プロファイルがインストール環境に適用されるように指定するには、次のサンプルコマンドを使用します。

.sp
.in +2
.nf
# \fBinstalladm set-profile -p profile4 -e install -n sol-11_1-i386\fR 
# \fBinstalladm list -p -n sol-11_1-i386\fR 
Service Name  Profile Name Environment Criteria 
------------  ------------ ----------- -------- 
sol-11_1-i386 profile4     install     hostname = myhost1, host3, host6 
              locale.xml   system      none 
.fi
.in -2
.sp

.LP
\fB例 27 \fR変数を含むシステム構成プロファイルを追加する
.sp
.LP
プロファイルは、クライアントのインストール時にカスタムクライアント構成情報と置き換えられる変数を使用できます。そのような変数を使用すると、さまざまなシステムでプロファイルファイルを再利用できます。

.sp
.LP
この例では、1 つのシステム構成プロファイルファイルを使用して、各インストールクライアントに固有のホスト名を割り当てます。\fBhostname.xml\fR ファイルには次の行が含まれます。

.sp
.in +2
.nf
<propval name="nodename" value="{{AI_HOSTNAME}}"/>
.fi
.in -2

.sp
.LP
インストール時に、\fB{{AI_HOSTNAME}}\fR はそのシステムの実際のホスト名に置き換えられます。たとえば、\fBhostname.xml\fR を使用して、ホスト名 \fBmyhost1\fR を持つクライアントを構成するときは、\fBhostname.xml\fR プロファイルには次の行が含まれています:

.sp
.in +2
.nf
<propval name="nodename" value="myhost1"/>
.fi
.in -2

.sp
.LP
プロファイルでの置換タグの使用の詳細は、\fI「Using System Configuration Profile Templates」\fR in \fI『Installing Oracle Solaris 11.3 Systems 』\fRを参照してください。

.LP
\fB例 28 \fR条件を既存のマニフェストに追加する
.sp
.LP
メモリーが 4096M バイト以上あるという条件を \fBsol-11_1-i386\fR の \fBmanifest2\fR の条件に追加するには、次のサンプルコマンドを使用します。

.sp
.in +2
.nf
# \fBinstalladm set-criteria -m manifest2 \\fR
\fB-n sol-11_1-i386 -a mem="4096-unbounded"\fR
.fi
.in -2
.sp

.LP
\fB例 29 \fR既存のマニフェストに対する条件を置換する
.sp
.LP
\fBsol-11_1-i386\fR の \fBmanifest2\fR の条件を \fB/tmp/criteria.xml\fR ファイルに指定された条件で置換するには、次のサンプルコマンドを使用します。

.sp
.in +2
.nf
# \fBinstalladm set-criteria -m manifest2 \\fR
\fB-n sol-11_1-i386 -C /tmp/criteria.xml\fR
.fi
.in -2
.sp

.sp
.LP
条件 XML ファイルの内容についての詳細は、\fI『Installing Oracle Solaris 11.3 Systems』\fRを参照してください。

.LP
\fB例 30 \fR開発中のプロファイルファイルを検証する
.sp
.LP
\fBmyprofdir/myprofile.xml\fR および \fByourprofdir/yourprofile.xml \fR ファイルに格納されたプロファイルを開発中に検証するには、次のサンプルコマンドを使用します。

.sp
.in +2
.nf
# \fBinstalladm validate -P myprofdir/myprofile.xml \e\fR
\fB-P yourprofdir/yourprofile.xml -n sol-11_1-i386\fR
.fi
.in -2
.sp

.LP
\fB例 31 \fRプロファイルの内容をエクスポートする
.sp
.LP
サービス \fBsol-11_1-i386\fR のプロファイル \fBmyprofile.xml\fR をエクスポートするには、次のサンプルコマンドを使用します。

.sp
.in +2
.nf
# \fBinstalladm export -p myprofile -n sol-11_1-i386\fR
.fi
.in -2
.sp

.LP
\fB例 32 \fR既存の AI マニフェストの内容を置換する
.sp
.LP
\fBspec\fR というマニフェスト名 (または AI インスタンス名) を持つサービス \fBsol-11_1-i386\fR のマニフェストを \fB/home/admin/new_spec.xml\fR ファイルのマニフェストの内容で更新するには、次のサンプルコマンドを使用します。

.sp
.in +2
.nf
# \fBinstalladm update-manifest -n sol-11_1-i386 \e\fR
\fB-f /home/admin/new_spec.xml -m spec\fR
.fi
.in -2
.sp

.LP
\fB例 33 \fR既存の AI マニフェストをエクスポートして更新する
.sp
.LP
サービス \fBsol-11_1-i386\fR の \fBspec\fR という名前の既存のマニフェストのデータをエクスポートし、そのマニフェストを変更済みの内容で更新するには、次のサンプルコマンドを使用します。

.sp
.in +2
.nf
# \fBinstalladm export -n sol-11_1-i386 -m spec \e\fR
\fB-o /home/admin/spec.xml\fR
.fi
.in -2
.sp

.sp
.LP
\fB/home/admin/spec.xml\fR を変更します。

.sp
.in +2
.nf
$ \fBpfexec installadm update-manifest -n sol-11_1-i386 \e\fR
\fB-f /home/admin/spec.xml -m spec\fR
.fi
.in -2
.sp

.LP
\fB例 34 \fR既存のプロファイルをエクスポートして更新する
.sp
.LP
サービス \fBsol-11_1-i386\fR の \fBprof1\fR という名前の既存のプロファイルのデータをエクスポートし、そのプロファイルを変更済みの内容で更新するには、次のサンプルコマンドを使用します。

.sp
.in +2
.nf
# \fBinstalladm export -n sol-11_1-i386 -p prof1 \e\fR
\fB-o /home/admin/prof1.xml\fR
.fi
.in -2
.sp

.sp
.LP
\fB/home/admin/prof1.xml\fR を変更します。

.sp
.in +2
.nf
# \fBinstalladm update-profile -n sol-11_1-i386 \e\fR
\fB-f /home/admin/prof1.xml -p prof1\fR
.fi
.in -2
.sp

.LP
\fB例 35 \fR初期のサーバー認証を設定する
.sp
.LP
セキュリティーの構成における最初の手順は、サーバー資格の割り当てです。サーバーのすべてのセキュリティー資格を自動的に生成するには、次のコマンドを使用します。

.sp
.in +2
.nf
# \fBinstalladm set-server --generate-all-certs\fR
Generating server credentials...
The root CA certificate has been generated.
The CA signing certificate request has been generated.
The signing CA certificate has been generated.
A new certificate key has been generated.
A new certificate has been generated.
Generating new encryption key...
To set the OBP encryption key for server authentication only, enter this OBP command:
  set-security-key wanboot-aes 8bd64e25e00497f194fa93de2a92157c
enerating new hashing key (HMAC)...
To set the OBP hashing (HMAC) key for server authentication only, enter this OBP command:
  set-security-key wanboot-hmac-sha1 4cff95a8fb0b08699de9f1ca5e5251a796b497de
Configuring web server security.
Changed Server
Refreshing SMF service svc:/system/install/server:default
Configuring web server security.
.fi
.in -2
.sp

.LP
\fB例 36 \fR初期のデフォルトのクライアント認証を設定する
.sp
.LP
クライアントの識別情報をサーバーに対して確認できるように、デフォルトのクライアント資格を割り当てます。一連のデフォルトのクライアント資格を生成するには、次のコマンドを使用します。これらの資格は、クライアントの MAC アドレスか、またはそのクライアントが使用するインストールサービスを指定することによって資格が割り当てられていないすべての AI クライアントに使用されます。

.sp
.in +2
.nf
$ \fBinstalladm set-server --default-client-security \\fR
         \fB--generate-all-certs\fR
Generating default client credentials...
A new certificate key has been generated.
A new certificate has been generated.
Generating new encryption key...
To set the OBP encryption key, enter this OBP command:
  set-security-key wanboot-aes c17e4842331456680d818f4ef515f222
Generating new hashing key (HMAC)...
To set the OBP hashing (HMAC) key, enter this OBP command:
  set-security-key wanboot-hmac-sha1 f3e943d6669835264fcaf0f7fbfb80e45beea7f3
Changed Server
.fi
.in -2
.sp

.LP
\fB例 37 \fR特定の SPARC クライアントのクライアント認証を設定する
.sp
.LP
一意の X.509 資格と OBP 鍵を生成し、SPARC クライアントに割り当てます。

.sp
.in +2
.nf
$ \fBinstalladm set-client -e 2:0:0:0:0:0 \\fR\
         \fB--generate-all-certs\fR
Generating credentials for client 02:00:00:00:00:00...
A new certificate key has been generated.
A new certificate has been generated.
Generating new encryption key...
To set the OBP encryption key, enter this OBP command:
  set-security-key wanboot-aes 42a04f73ee6950859febb96d97b7d2bd
Generating new hashing key (HMAC)...
To set the OBP hashing (HMAC) key, enter this OBP command:
  set-security-key wanboot-hmac-sha1 7fbed772b69bf104e5e2f72a4c47d42b62bf074b
Changed Client : '02:00:00:00:00:00'
.fi
.in -2
.sp

.LP
\fB例 38 \fR特定のクライアントの OBP 鍵を表示する
.sp
.LP
SPARC クライアントが構成されたあとしばらくしてから、OBP でそのクライアントのセキュリティー鍵を設定する方法を確認する必要があります。必須の OBP 鍵を表示するには、installadm "\fBlist -e <macaddr>\fR" コマンドと \fB--verbose\fR オプションを使用します。

.sp
.in +2
.nf
# \fBinstalladm list -e 2:0:0:0:0:0 -v\fR
Service Name Client Address    Arch  Secure Custom Args Custom Grub
------------ --------------    ----  ------ ----------- -----------
solaris11_2  02:00:00:00:00:00 sparc yes    no          no

   Client Credentials?  yes
   Security Key? ...... yes
   Security Cert:
                  Subject: /C=US/O=Oracle/OU=Solaris Deployment/CN=CID 01020000000000
                  Issuer : /C=US/O=Oracle/OU=Solaris Deployment/CN=Signing CA
                  Valid from: May 20 10:20:00 2013 GMT
                          to: May 18 10:20:00 2023 GMT
   CA Certificates:
         d09051e4 Subject: /C=US/O=Oracle/OU=Solaris Deployment/CN=Root CA
                  Issuer : /C=US/O=Oracle/OU=Solaris Deployment/CN=Root CA
                  Valid from: May 20 09:50:00 2013 GMT
                          to: May 18 09:50:00 2023 GMT
   OBP Encr Key (AES) . 42a04f73ee6950859febb96d97b7d2bd
   OBP Hash (HMAC) .... 7fbed772b69bf104e5e2f72a4c47d42b62bf074b
   Boot Args .......... -
.fi
.in -2
.sp

.sp
.LP
表示される鍵およびハッシュは、ILOM または ALOM システムコンソールの ok プロンプトで OBP set-security-key コマンドを使用して設定できます。

.sp
.in +2
.nf
set-security-key wanboot-aes 42a04f73ee6950859febb96d97b7d2bd
set-security-key wanboot-hmac-sha1 7fbed772b69bf104e5e2f72a4c47d42b62bf074b
.fi
.in -2
.sp

.LP
\fB例 39 \fRAI サービスのすべてのクライアントにクライアント認証を適用する
.sp
.LP
次のコマンドでは、\fBsol-11_2-sparc\fR インストールサービスのすべてのクライアントにクライアントおよびサーバー認証を要求します。\fB\&'optional'\fR のセキュリティーポリシー値がデフォルト値です。

.sp
.in +2
.nf
# \fBinstalladm set-service -p require-client-auth -n\fR
sol-11_2-sparc
Security policy for service sol-11_2-sparc changing
from 'optional' to 'require-client-auth'.
Changed Service : 'sol-11_2-sparc'
Refreshing SMF service svc:/system/install/server:default
.fi
.in -2
.sp

.sp
.LP
\fBsol-11_2-sparc\fR インストールサービスのすべてのクライアントに有効なセキュリティー X.509 クライアントおよびサーバー認証資格を割り当てる必要があり、これらのクライアントはこれを指定する必要があります。これは SPARC インストールサービスであるため、すべてのクライアントで OBP ファームウェアのセキュリティー鍵を入力する必要があります。

.LP
\fB例 40 \fR指定されたインストールサービスのすべてのクライアントのデフォルトの資格を生成する
.sp
.LP
次のコマンドは、カスタムのクライアント資格を持っていない \fBsolaris11_2-sparc\fR インストールサービスのすべてのクライアントに帰属する資格を生成します。カスタムのクライアント資格を割り当てる例については、例 30「特定の SPARC クライアントのクライアント認証を設定する」を参照してください。

.sp
.in +2
.nf
# \fBinstalladm set-service  -n sol-11_1-sparc \\fR
  --generate-all-certs
Generating credentials for service sol-11_1-sparc...
A new certificate key has been generated.
A new certificate has been generated.
Generating new encryption key...
To set the OBP encryption key, enter this OBP command:
  set-security-key wanboot-aes 0bd1d30d603174b7fc3ee7fd7654c3c8
Generating new hashing key (HMAC)...
To set the OBP hashing (HMAC) key, enter this OBP command:
  set-security-key wanboot-hmac-sha1 35caa0c8596585c852f120d3872e9227e724496e
Changed Service : 'sol-11_1-sparc'
.fi
.in -2
.sp

.sp
.LP
また、これらの資格は、そのあと \fBcreate-client\fR サブコマンドを使用することによって \fBsolaris11_2-sparc\fR インストールサービスに割り当てられたすべてのクライアントにも帰属します。

.sp
.LP
デフォルトの資格を使用する場合は、複数のクライアントに同一の資格が割り当てられ、各クライアントが互いのインストールデータを表示できます。

.LP
\fB例 41 \fRセキュリティーのサマリーリストを生成する
.sp
.LP
"\fBinstalladm list\fR" を十分な承認付きで実行すると、サーバー、サービスまたはクライアント (あるいは両方) のセキュリティーのサマリーが一覧表示されます。

.sp
.in +2
.nf
# \fBinstalladm list -s\fR
AI Server Parameter  Value
-------------------  -----
Hostname ........... ai-server
Architecture ....... i386
Active Networks .... 10.0.0.1
Image Path Base Dir . /export/auto_install
Managing DHCP? ..... yes
Security Enabled? .. yes
Server Credentials? .. yes
Number of Services . 12
Number of Clients .. 4
Number of Manifests  19
Number of Profiles . 5
 
# \fBinstalladm list\fR
Service Name            Base Service          Status Arch  Type Secure Ali Cli Man Pro
------------            --------          ------ ----  ---- ------ --- --- --- ---
default-i386            solaris11_2-i386  on     i386  pkg  no     0   1   4   0
default-sparc           solaris11_2-sparc on     sparc pkg  no     0   0   3   0
solaris11_1_6_2_0-i386  -                 on     i386  pkg  no     1   0   2   2
solaris11_1_6_2_0-sparc -                 on     sparc pkg  no     1   0   1   2
solaris11_2-i386        -                 on     i386  pkg  yes    0   0   1   0
solaris11_2-sparc       -                 on     sparc pkg  yes    0   2   2   0

# \fBinstalladm list -c\fR
Service Name            Client Address    Arch  Secure Custom Args Custom Grub
------------            --------------    ----  ------ ----------- -----------
default-i386            00:11:22:33:44:55 i386  yes    yes         no
solaris11_1_6_2_0-sparc AA:BB:CC:DD:EE:FF sparc yes    no          no
solaris11_2-sparc       02:00:00:00:00:00 sparc yes    no          no
                        03:00:00:00:00:00 sparc yes    no          no
.fi
.in -2
.sp

.LP
\fB例 42 \fRセキュリティーの詳細なリストを生成する
.sp
.LP
"\fBinstalladm list -v\fR" を十分な承認付きで実行すると、サービスまたはクライアント (あるいは両方) のセキュリティー構成の詳細が出力されます (簡潔にするため、一部の出力は省略されます)。

.sp
.in +2
.nf
# \fBinstalladm list -sv\fR
AI Server Parameter      Value
-------------------      -----
\&...
Security Enabled? ...... yes
Server Credentials? .... yes
Security Key? .......... yes
Security Cert:
              Subject: /C=US/O=Oracle/OU=Solaris Deployment/CN=ai-server
              Issuer : /C=US/O=Oracle/OU=Solaris Deployment/CN=Signing CA
              Valid from: May 20 09:50:00 2013 GMT
                     to: May 18 09:50:00 2023 GMT
CA Certificates:
      d09051e4 Subject: /C=US/O=Oracle/OU=Solaris Deployment/CN=Root CA
               Issuer : /C=US/O=Oracle/OU=Solaris Deployment/CN=Root CA
               Valid from: May 20 09:50:00 2013 GMT
                      to: May 18 09:50:00 2023 GMT
      f9d73b41 Subject: /C=US/O=Oracle/OU=Solaris Deployment/CN=Signing CA
               Issuer : /C=US/O=Oracle/OU=Solaris Deployment/CN=Root CA
               Valid from: May 20 09:50:00 2013 GMT
                      to: May 18 09:50:00 2023 GMT
OBP Encr Key (AES) ..... 8bd64e25e00497f194fa93de2a92157c
OBP Hash (HMAC) ........ 4cff95a8fb0b08699de9f1ca5e5251a796b497de
Def Client Credentials?  yes
Def Client Sec Key? .... yes
Def Client Sec Cert:
               Subject: /C=US/O=Oracle/OU=Solaris Deployment/CN=Client default
               Issuer : /C=US/O=Oracle/OU=Solaris Deployment/CN=Signing CA
               Valid from: May 20 09:52:00 2013 GMT
                      to: May 18 09:52:00 2023 GMT
Def Client CA Certs .... none
Def Client OBP Encr Key  c17e4842331456680d818f4ef515f222
Def Client OBP Hash .... f3e943d6669835264fcaf0f7fbfb80e45beea7f3
\&...

# \fBinstalladm list -v -n solaris11_2-sparc\fR
Service Name   Base Service Status Arch  Type Secure Ali Cli Man Pro
------------   --------     ------ ----  ---- ------ --- --- --- ---
sol-11_2-sparc -            on     sparc iso  yes    0   2   1   0

   ...
   Supports Security? .. yes
   Security Enabled? ... yes
   Security Policy ..... require-client-auth
   Service Credentials?  yes
   Security Key? ....... yes
   Security Cert:
                 Subject: /C=US/O=Oracle/OU=Solaris Deployment/CN=AI Service sol-11_2-sparc
                 Issuer : /C=US/O=Oracle/OU=Solaris Deployment/CN=Signing CA
                 Valid from: May 20 10:33:00 2013 GMT
                         to: May 18 10:33:00 2023 GMT
   CA Certificates ..... none
   OBP Encr Key (AES) .. 0bd1d30d603174b7fc3ee7fd7654c3c8
   OBP Hash (HMAC) ..... 35caa0c8596585c852f120d3872e9227e724496e
.fi
.in -2
.sp

.LP
\fB例 43 \fRクライアント証明書を検証するための新しい CA 証明書を追加する
.sp
.LP
次のコマンドは、\fBcert.pem\fR という名前のファイル内に CA 証明書を追加します。

.sp
.in +2
.nf
$ \fBinstalladm set-server --default-client-security --ca-cert cert.pem\fR
Assigning default client credentials...
A new CA certificate has been filed.
Changed Server
.fi
.in -2
.sp

.sp
.LP
この CA 証明書は、それを必要とするすべてのクライアント証明書を認証するために使用できます。

.LP
\fB例 44 \fR新しい X.509 資格を割り当てる
.sp
.LP
次のコマンドは、インストールサーバーに新しい X.509 証明書と秘密鍵および新しい CA 証明書を割り当てます。

.sp
.in +2
.nf
$ \fBinstalladm set-server -A cacert.pem -K server.key -C server.crt\fR
Assigning server credentials...
The key has been replaced.
The certificate has been replaced
A new CA certificate has been filed.
Configuring security for user-specified server cert
Configuring web server security.
Changed Server
Refreshing SMF service svc:/system/install/server:default
.fi
.in -2
.sp

.LP
\fB例 45 \fRハッシュ値で CA 証明書を削除する
.sp
.LP
次のコマンドは、その CA 証明書を使用するすべてのクライアントの指定された CA 証明書を削除します。\fB--ca-cert\fR オプション引数の値は、その証明書の X.509 サブジェクトのハッシュ値です。CA 証明書を削除することを確認するプロンプトを抑制するには、\fB-y\fR オプションを使用します。

.sp
.in +2
.nf
$ \fBinstalladm set-server --delete-security \\fR
         --recursive --hash d09051e4
         Identifier hash: d09051e4
         Subject: C=US, O=Oracle, OU=Solaris Deployment, CN=Root CA
         Issuer: C=US, O=Oracle, OU=Solaris Deployment, CN=Root CA
         Valid from May 20 11:09:00 2013 GMT to May 18 11:09:00 2023 GMT
        This CA has the following uses:
                Note: this is the server CA certificate
                Client default
                Note: this is the root CA certificate
        Deleting this Certificate Authority certificate can prevent
            credentials from validating.
        Do you want to delete this Certificate Authority certificate [y|N]: y
          Identifier hash: d09051e4
          Subject: /C=US/O=Oracle/OU=Solaris Deployment/CN=Root CA
          Issuer: /C=US/O=Oracle/OU=Solaris Deployment/CN=Root CA
          Valid from May 20 09:50:00 2013 GMT to May 18 09:50:00 2023 GMT
        This CA has the following uses:
                Note: this is the server CA certificate
                Client default
                Note: this is the root CA certificate
        Deleting all references to Certficate Authority with hash value d09051e4
        Changed Server
.fi
.in -2
.sp

.LP
\fB例 46 \fRAI サーバーの構成パラメータの表示
.sp
.LP
AI サーバーのもっとも一般的なパラメータの現在値およびそのサマリーを表示する場合は、\fBlist -s\fR コマンドを使用できます。

.sp
.in +2
.nf
# \fBinstalladm list -s\fR
AI Server Parameter  Value
-------------------  -----
Hostname ........... ai-server
Architecture ....... i386
Active Networks .... 10.0.0.1
Default Image Path . /export/auto_install
Managing DHCP? ..... yes
Security Enabled? .. yes
Server Credentials? .. yes
Number of Services . 12
Number of Clients .. 4
Number of Manifests  19
Number of Profiles . 5
.fi
.in -2
.sp

.sp
.LP
詳細な情報や、あまり一般的ではないパラメータを表示するには、詳細モードを使用します。

.sp
.in +2
.nf
# \fBinstalladm list -sv\fR
AI Server Parameter      Value
-------------------      -----
Hostname ............... ai-server
Architecture ........... i386
Active Networks ........ 10.0.0.1
Http Port .............. 5555
Secure Port ............ 5556
Default Image Path ..... /export/auto_install
Multi-Homed? ........... yes
Managing DHCP? ......... yes
DHCP IP Range .......... none
Boot Server ............ -
Web UI Enabled? ........ yes
Wizard Saves to Server?  no
Security Enabled? ...... yes
Server Credentials? .... yes
Security Key? .......... yes
Security Cert:
               Subject: /C=US/O=Oracle/OU=Solaris Deployment/CN=ai-server
               Issuer : /C=US/O=Oracle/OU=Solaris Deployment/CN=Signing CA
               Valid from: May 20 11:09:00 2013 GMT
                       to: May 18 11:09:00 2023 GMT
CA Certificates:
      f9d73b41 Subject: /C=US/O=Oracle/OU=Solaris Deployment/CN=Signing CA
               Issuer : /C=US/O=Oracle/OU=Solaris Deployment/CN=Root CA
               Valid from: May 20 11:09:00 2013 GMT
                       to: May 18 11:09:00 2023 GMT
OBP Encr Key (AES) ..... 8bd64e25e00497f194fa93de2a92157c
OBP Hash (HMAC) ........ 4cff95a8fb0b08699de9f1ca5e5251a796b497de
Def Client Credentials?  yes
Def Client Sec Key? .... yes
Def Client Sec Cert:
               Subject: /C=US/O=Oracle/OU=Solaris Deployment/CN=Client default
               Issuer : /C=US/O=Oracle/OU=Solaris Deployment/CN=Signing CA
               Valid from: May 20 11:09:00 2013 GMT
                       to: May 18 11:09:00 2023 GMT
Def Client CA Certs .... none
Def Client OBP Encr Key  c17e4842331456680d818f4ef515f222
Def Client OBP Hash .... f3e943d6669835264fcaf0f7fbfb80e45beea7f3
Number of Services ..... 12
Number of Clients ...... 4
Number of Manifests .... 19
Number of Profiles ..... 5
.fi
.in -2
.sp

.LP
\fB例 47 \fR対話型モードの呼び出し
.sp
.LP
対話型モードに入るには、installadm コマンドだけを、パラメータを指定せずに実行します。例: 

.sp
.in +2
.nf
# \fBinstalladm\fR
installadm> create-service -n s11-1-i386 -a i386 -y
\&...
installadm> create-profile -n s11-1-i386 -f initial_profile.xml
\&...
installadm> quit
.fi
.in -2
.sp

.sp
.LP
同様に、対話型モードは、su で root 役割を使用して複数のコマンドを対話的に呼び出す場合に便利です。

.sp
.in +2
.nf
$ \fBsu root -c /usr/sbin/installadm\fR
installadm> create-manifest -n s11-2-sparc -f /tmp/manifest.xml
\&...
installadm> create-profile -n s11-2-sparc -f /tmp/static_net.xml
\&...
.fi
.in -2
.sp

.LP
\fB例 48 \fR複数のコマンドのバッチ実行
.sp
.LP
複数のコマンドをバッチモードで実行すると、すべてのコマンドが完了するまで SMF サービスのリフレッシュを遅延させられるという利点があります。

.sp
.LP
複数のサブコマンドを実行するには、最初にファイルを作成する必要があります。

.sp
.in +2
.nf
$ \fBcat >> /tmp/batch <<_EOF\fR
create-service -n my_sparc -a sparc
create-service -n my_i386 -a i386
create-manifest -n my_sparc -f /tmp/new_default.xml -d
create-manifest -n my_i386 -f /tmp/new_default.xml -d
\&...
_EOF
# installadm execute -f /tmp/batch
\&...
.fi
.in -2
.sp

.SH 終了ステータス
.sp
.LP
次の終了ステータスが返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 13n
.rt  
コマンドが正常に処理されました。
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 13n
.rt  
エラーが発生した。
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 13n
.rt  
無効なコマンド行オプションが指定された。
.RE

.sp
.ne 2
.mk
.na
\fB\fB3\fR\fR
.ad
.RS 13n
.rt  
サービスのバージョンは installadm ではサポートされません。
.RE

.sp
.ne 2
.mk
.na
\fB\fB4\fR\fR
.ad
.RS 13n
.rt  
変更が行われませんでした - 何もしません。
.RE

.SH 属性
.sp
.LP
次の属性については、\fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件\fBinstall/installadm\fR
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBaimanifest\fR(1M), \fBsysconfig\fR(1M), \fBickey\fR(1M), \fBai_manifest\fR(4), \fBservice_bundle\fR(4), \fBdhcp\fR(5), \fBsmf\fR(5), \fBenviron\fR(5)
.sp
.LP
Part\ III, \fI「Installing Using an Install Server,」\fR in \fI『Installing Oracle Solaris 11.3 Systems』\fR
.sp
.LP
\fI『Transitioning From Oracle Solaris 10 JumpStart to Oracle Solaris 11.3 Automated Installer 』\fR
