Alhadis/Silos/Solaris 11.3/ja_JP.UTF-8/man1m/netcfgd.1m
'\" te
.\" Copyright (c) 2010, 2012, Oracle and/or its affiliates. All rights reserved.
.TH netcfgd 1M "2012 年 6 月 1 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
netcfgd \- ネットワーク構成管理デーモン
.SH 形式
.LP
.nf
\fB/lib/inet/netcfgd\fR
.fi

.SH 機能説明
.sp
.LP
\fBnetcfgd\fR は、ネットワーク構成を管理するシステムデーモンです。このデーモンは、svc:/network/netcfg:default により自動的に起動されるので、直接起動しないようにしてください。これは、プログラミングインタフェースのコンポーネントではありません。
.sp
.LP
\fBnetcfgd\fR は、ネットワーク構成リポジトリへのアクセスを管理し、リーダーとライターが適切な承認を保持するようにします。必要な承認は、アクセスするデータベースの部分によって異なります。
.sp

.sp
.TS
tab();
cw(.56i) cw(1.01i) cw(3.93i) 
lw(.56i) lw(1.01i) lw(3.93i) 
.
ツール読み取り/書き込み承認 (または特権)
_
dladm書き込みsys_dl_config privilege
ipadm書き込みsolaris.network.interface.config
netcfg読み取りsolaris.network.autoconf.read
netcfg書き込みsolaris.network.autoconf.write
netcfgr/w wlanssolaris.network.autoconf.wlan
netadmプロファイルの有効化/無効化T{
solaris.network.autoconf.read solaris.network.autoconf.select
T}
.TE

.sp
.LP
\fBsolaris.network.interface.config\fR 承認および \fBsys_dl_config\fR 特権は、ネットワーク管理セキュリティプロファイルを使用して取得します。\fBsolaris.network.autoconf.read\fR 承認は、Basic Solaris User プロファイルの一部です。\fBsolaris.network.autoconf.wlan\fR および \fB\&.select\fR 承認は、Network Autoconf User プロファイルを使用して取得し、\fBautoconf.write\fR 承認および Network Autoconf User プロファイルに含まれている承認は、Network Autoconf Admin プロファイルを使用して取得します。
.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
_
インタフェースの安定性確実
.TE

.SH 関連項目
.sp
.LP
\fBsvcs\fR(1), \fBdladm\fR(1M), \fBipadm\fR(1M), \fBnetcfg\fR(1M), \fBnwamd\fR(1M), \fBsvcadm\fR(1M), \fBauth_attr\fR(4), \fBexec_attr\fR(4), \fBprof_attr\fR(4), \fBattributes\fR(5), \fBsmf\fR(5)
.sp
.LP
JDS/GNOME マニュアルページコレクションで利用可能な \fBnwam-manager(1M)\fR も参照してください。
