Alhadis/Silos/Solaris 11.3/ja_JP.UTF-8/man1m/ping.1m
'\" te
.\" Copyright 1989 AT&T
.\" Portions Copyright (c) 2011, 2013, Oracle and/or its affiliates.All rights reserved.
.TH ping 1M "2013 年 11 月 28 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
ping \- ICMP (ICMP6) ECHO_REQUEST パケットをネットワーク上のホストに送信する
.SH 形式
.LP
.nf
\fB/usr/sbin/ping\fR \fIhost\fR [\fItimeout\fR]
.fi

.LP
.nf
\fB/usr/sbin/ping\fR \fB-s\fR [\fB-l\fR | \fB-U\fR] [\fB-abdlLnrRv\fR] [\fB-A\fR \fIaddr_family\fR] 
     [\fB-c\fR \fItraffic_class\fR] [\fB-g\fR \fIgateway\fR [\fB-g\fR \fIgateway\fR...]] 
     [\fB-N\fR \fInext_hop_router\fR] [\fB-F\fR \fIflow_label\fR] [\fB-I\fR \fIinterval\fR] 
     [\fB-i\fR \fIinterface\fR] [\fB-P\fR \fItos\fR] [\fB-p\fR \fIport\fR] [\fB-t\fR \fIttl\fR] \fIhost\fR 
     [\fIdata_size\fR] [\fInpackets\fR]
.fi

.SH 機能説明
.sp
.LP
\fB ping\fR ユーティリティーは、\fBICMP\fR (IPv6 では \fBICMP6\fR) プロトコルの \fBECHO_REQUEST\fR データグラムを利用して、指定されたホスト (\fIhost\fR) またはネットワークゲートウェイ (\fIgateway\fR) から \fBICMP\fR (\fBICMP6\fR) \fBECHO_RESPONSE\fR を引き出します。\fIhost\fR が応答すると、\fBping\fR は次のように表示します。
.sp
.in +2
.nf
\fIhost\fR is alive
.fi
.in -2
.sp

.sp
.LP
この文字列を標準出力に書き出して終了します。そうでない場合は、タイムアウト (\fItimeout\fR) の秒数が経過すると、次の文字列を書き出します。
.sp
.in +2
.nf
no answer from \fIhost\fR
.fi
.in -2
.sp

.sp
.LP
\fItimeout\fR のデフォルト値は \fB20\fR 秒です。
.sp
.LP
\fBs\fR フラグを指定すると、1 秒ごと (間隔は \fB-I\fR で調整) に 1 つのデータグラムを送信し、\fBECHO_RESPONSE\fR を受信するたびに 1 行を出力します。応答がないと、\fBping\fR は出力を生成しません。2 番目の形式では、\fBping\fR は往復時間とパケットロスの統計値を計算し、終了時またはタイムアウト発生時にこれらの情報のサマリーを表示します。デフォルトの \fIdata_size\fR は \fB56\fR バイトです。\fIdata_size\fR コマンド行引数でサイズを指定することもできます。省略可能な \fInpackets\fR を指定すると、\fBping\fR は \fInpackets\fR 個の要求を送信するか、\fInpackets\fR 個の応答を受信するまで \fBping\fR 要求を送信し続けます。
.sp
.LP
\fBping\fR を障害分離のために使用する場合は、最初にローカルホストに対して \fBping\fR を実行し、ローカルネットワークインタフェースが動作していることを確認してください。
.SH オプション
.sp
.LP
サポートしているオプションは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-A\fR \fIaddr_family\fR\fR
.ad
.sp .6
.RS 4n
ターゲットホストのアドレスファミリを指定します。\fI addr_family\fR には \fBinet\fR または \fBinet6\fR を指定できます。アドレスファミリによって使用するプロトコルが決まります。引数が \fBinet\fR の場合は IPv4 を使用します。\fBinet6\fR の場合は IPv6 を使用します。
.sp
デフォルトでは、\fBIP\fR アドレスではなくホストの名前が指定され、ネームサービスのデータベースに有効な IPv6 アドレスが存在する場合、\fBping\fR はそのアドレスを使用します。それ以外の場合、ネームサービスのデータベースに IPv4 アドレスが含まれていれば、IPv4 アドレスを使用しようとします。
.sp
デフォルトの動作をオーバーライドするには、アドレスファミリとして \fBinet\fR または \fBinet6\fR を指定します。指定した引数が \fBinet\fR の場合、\fBping\fR はホスト名に関連付けられた IPv4 アドレスを使用します。アドレスが存在しない場合、\fBping\fR はホストが不明であることを示して終了します。ネームサービスのデータベースに IPv6 アドレスが存在するかどうかは確認されません。
.sp
指定した引数が \fBinet6\fR の場合、\fBping\fR はホスト名に関連付けられた IPv6 アドレスを使用します。アドレスが存在しない場合、\fBping\fR はホストが不明であることを示して終了します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR \fIflow_label\fR\fR
.ad
.sp .6
.RS 4n
プローブパケットのフローラベルを指定します。0 から 1048575 までの整数を指定する必要があります。このオプションは IPv6 でのみ有効です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR\fR
.ad
.sp .6
.RS 4n
フラグメントを無効にします。IPv4 の場合、これはフラグメント禁止 (DF) ビットを設定することを意味します。IPv4 および IPv6 の場合、これはデータグラムが送信されてもフラグメントを許可しないことを意味します。\fIdata_size\fR が MTU を超えている場合、\fBping\fR は、メッセージが長すぎるために送信が失敗したと報告することがあります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-I\fR\fI interval\fR\fR
.ad
.sp .6
.RS 4n
統計モードを有効にし、連続送信の間隔を指定します。デフォルトは 1 秒です。\fB-s\fR オプションの説明を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fR
.ad
.sp .6
.RS 4n
マルチキャストパケットのループバックを無効にします。通常、メンバーは送信インタフェース上のホストグループに属し、マルチキャストパケットのコピーがローカルマシンに配信されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-N\fR \fInext_hop_router\fR\fR
.ad
.sp .6
.RS 4n
次のホップのルーターを指定して、プローブパケットがパスに沿って指定したルーターを経由してターゲットホストに到着するようにします。このオプションを使用すると、基本的にシステムのルーティングテーブルがバイパスされ、プローブパケットのヘッダーが変更されないままになります。指定できる次のホップのルーターは 1 つのみです。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fItos\fR\fR
.ad
.sp .6
.RS 4n
プローブパケットの Type of Service (\fItos\fR) を指定された値に設定します。デフォルトは 0 です。0 から 255 までの整数を指定する必要があります。同じパス内のゲートウェイは、プローブパケットに設定された \fItos\fR の値に応じてプローブパケットの経路を変更できます。このオプションは IPv4 でのみ有効です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.sp .6
.RS 4n
経路を記録します。IPv4 の経路記録オプションが設定され、IPv4 ヘッダーの内部にパケットの経路が保存されます。経路記録の内容は、\fB-v\fR オプションと \fB-s\fR オプションを指定した場合にのみ出力されます。ターゲットホストが複数のエコー間で経路記録オプションを保持する場合や、\fB-l\fR オプションを指定した場合は、返送パケットのみに経路記録オプションが設定されます。このオプションは IPv4 でのみ有効です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-U\fR\fR
.ad
.sp .6
.RS 4n
\fBICMP\fR (\fBICMP6\fR) パケットの代わりに \fBUDP\fR パケットを送信します。\fBping\fR は、ターゲットホストから \fBICMP\fR (\fBICMP6\fR) \fBPORT_UNREACHABLE\fR が返送されることを期待して、\fBUDP\fR パケットを各ポートに順に送信します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.sp .6
.RS 4n
マルチホームの宛先のすべてのアドレス (IPv4 と IPv6 の両方) に対して \fBping\fR を実行します。出力は、宛先の各 \fBIP\fR アドレスに対して 1 回ずつ \fBping\fR を実行した場合と同じように表示されます。このオプションを \fB-A\fR と同時に指定すると、\fBping\fR は指定されたアドレスファミリに含まれるアドレスだけを検索します。\fB-s\fR オプションとともに使用して \fInpackets\fR を指定しないと、\fBping\fR は宛先アドレスをラウンドロビン方式で継続的に検索します。\fInpackets\fR を指定すると、\fBping\fR は宛先の各 \fBIP\fR アドレスに \fInpackets\fR 個のプローブを送信して終了します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-b\fR\fR
.ad
.sp .6
.RS 4n
この接続でのみ大域 IPsec ポリシーをバイパスし、暗号化せずにパケットを送受信します。このオプションは、ネットワーク接続のトラブルシューティングを IPsec と切り離して行うために使用できます。このオプションでは、システム全体のポリシーがこの接続でバイパスされるため、使用できるのはスーパーユーザーまたは sys_net_config 特権が付与されたユーザーのみです。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fItraffic_class\fR\fR
.ad
.sp .6
.RS 4n
プローブパケットのトラフィッククラスを指定します。0 から 255 までの整数を指定する必要があります。パス内のゲートウェイは、プローブパケットに設定された \fItraffic_class\fR の値に応じてプローブパケットの経路を変更できます。このオプションは IPv6 でのみ有効です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
\fBSO_DEBUG\fR ソケットオプションを設定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR \fIgateway\fR\fR
.ad
.sp .6
.RS 4n
ルーズソースルートゲートウェイを指定して、プローブパケットがパスに沿って指定したホストを経由してターゲットホストに到着するようにします。ゲートウェイの最大数は IPv4 で 8、IPv6 で 127 です。IPv6 のゲートウェイ数は、リンクの \fBMTU\fR などの要因によってさらに制限されることがあります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fI interface_address\fR\fR
.ad
.sp .6
.RS 4n
IPv4 のマルチキャストパケット、および IPv6 のマルチキャストパケットとユニキャストパケットの両方に使用する送信インタフェースアドレスを指定します。マルチキャストパケットのデフォルトのインタフェースアドレスは、(ユニキャストの) ルーティングテーブルから決定されます。\fIinterface_address\fR には、リテラル \fBIP\fR アドレス (\fB10.123.100.99\fR など)、インタフェース名 (\fBeri0\fR など)、またはインタフェースインデックス (\fB2\fR など) を指定できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
ルーズソースルーティングを使用して、指定したホストとの間でプローブパケットを送受信します。通常は \fB-R\fR オプションとともに使用します。\fB-g\fR を使ってゲートウェイを指定すると、それらのゲートウェイを 2 回ずつ (つまり、宛先への送信と宛先からの受信の両方向で) 経由します。\fB-U\fR オプションを指定すると、このオプションは無視されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.sp .6
.RS 4n
ネットワークアドレスを数字で表示します。通常、\fBping\fR は受信したパケットから抽出した IP アドレスに対して名前の逆検索を実行します。\fB-n\fR オプションを指定すると、逆検索がブロックされるため、\fBping\fR はホスト名ではなく IP アドレスを出力します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIport\fR\fR
.ad
.sp .6
.RS 4n
プローブで使用されるベース \fBUDP\fR ポート番号を設定します。\fI\fRこのオプションは \fB-U\fR オプションとともに使用します。デフォルトのベースポート番号は 33434 です。\fI\fR\fBping\fR ユーティリティーは、このベースを起点にして \fBUDP\fR パケットの宛先ポート番号を設定し、プローブごとに 1 ずつ増分します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
通常のルーティングテーブルをバイパスし、接続しているネットワーク上のホストに直接送信します。直接接続しているネットワーク上にホストがない場合は、エラーが返されます。このオプションを使用すると、ルーターデーモンによって削除されたインタフェースを介してローカルホストへの \fBping\fR を実行できます。\fBin.routed\fR(1M) を参照してください。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.sp .6
.RS 4n
1 秒に 1 つのデータグラムを送信して、統計情報を収集します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fIttl\fR\fR
.ad
.sp .6
.RS 4n
ユニキャストパケットおよびマルチキャストパケットの IPv4 生存期間または IPv6 ホップ制限を指定します。ユニキャストパケットのデフォルトの生存期間 (ホップ制限) は、\fBipadm\fR(1M) \fBset-prop\fR サブコマンドで \fBicmp_ipv4_ttl\fR プロパティー (IPv4) および \fBicmp_ipv6_hoplimit\fR プロパティー (IPv6) を使って設定できます。マルチキャストパケットのデフォルトの生存期間 (ホップ制限) は 1 ホップです。「\fB使用例\fR」を参照してください。詳細については、\fBipadm\fR(1M) を参照してください。
.LP
注 - 
.sp
.RS 2
プロパティー名が「\fB_\fR」 (下線) で始まる場合があります。これらはプロトコルの非公開プロパティーであり、変更または削除される可能性があります。\fBipadm\fR(1M) を参照してください。
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
詳細情報を出力します。ターゲットホストからの応答以外の、すべての \fBICMP\fR (\fBICMP6\fR) パケットを表示します。
.RE

.SH オペランド
.sp
.ne 2
.mk
.na
\fB\fIhost\fR\fR
.ad
.sp .6
.RS 4n
ネットワーク上のホスト
.RE

.SH 環境
.sp
.LP
MACHINE_THAT_GOES_PING が NULL 以外の値に設定された場合、ping(1M) は \fB--s\fR オプションが指定された場合と同じようにこれを処理します。これをスクリプトから使用するときは注意してください。
.SH 使用例
.LP
\fB例 1 \fRIPv6 で \fBping\fR を使用する
.sp
.LP
この例では、\fBping\fR を使ってホスト \fBxyz\fR のすべての IPv6 アドレスにプローブパケットを 1 つずつ送信します。ユーザーによる割り込みがあるまで 1 秒間隔で \fBICMP6\fR \fBECHO_REQUEST\fR が送信されます。

.sp
.in +2
.nf
istanbul% \fBping -s -A inet6 -a xyz\fR
PING xyz: 56 data bytes
64 bytes from xyz (4::114:a00:20ff:ab3d:83ed): icmp_seq=0. time=0.479 ms
64 bytes from xyz (fec0::114:a00:20ff:ab3d:83ed): icmp_seq=1. time=0.843 ms
64 bytes from xyz (4::114:a00:20ff:ab3d:83ed): icmp_seq=2. time=0.516 ms
64 bytes from xyz (fec0::114:a00:20ff:ab3d:83ed): icmp_seq=3. time=4.943 ms
64 bytes from xyz (4::114:a00:20ff:ab3d:83ed): icmp_seq=4. time=0.485 ms
64 bytes from xyz (fec0::114:a00:20ff:ab3d:83ed): icmp_seq=5. time=2.201 ms
^C     
----xyz PING Statistics----     
6 packets transmitted, 6 packets received, 0% packet loss     
round-trip (ms)  min/avg/stddev = 0.479/1.583/4.943/1.823
.fi
.in -2
.sp

.LP
\fB例 2 \fR\fBipadm\fR を使用してホップ制限を設定する
.sp
.LP
次のコマンドは、\fBipadm\fR(1M) を使用して IPv4 および IPv6 ホップ制限を設定します。

.sp
.in +2
.nf
# \fBipadm set-prop -p _ipv6_hoplimit=100 icmp\fR
# \fBipadm set-prop -p _ipv4_ttl=100 icmp\fR
.fi
.in -2
.sp

.SH 終了ステータス
.sp
.LP
次の終了ステータスが返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
正常終了。マシンは稼働しています。
.RE

.sp
.ne 2
.mk
.na
\fB0 以外\fR
.ad
.sp .6
.RS 4n
エラーが発生しました。不正な形式の引数が指定されたか、マシンが稼働していませんでした。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件network/ping
.TE

.SH 関連項目
.sp
.LP
\fBifconfig\fR(1M)、\fBin.routed\fR(1M)、\fBipadm\fR(1M)、\fBndd\fR(1M)、\fBnetstat\fR(1M)、\fBrpcinfo\fR(1M)、\fBtraceroute\fR(1M)、\fBattributes\fR(5)、\fBicmp\fR(7P)、\fBicmp6\fR(7P)
