Alhadis/Silos/Solaris 11.3/ja_JP.UTF-8/man1m/prtconf.1m
'\" te
.\" Copyright (c) 1989, 2012, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH prtconf 1M "2012 年 3 月 8 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
prtconf \- システム構成の出力
.SH 形式
.LP
.nf
\fB/usr/sbin/prtconf\fR [\fB-V\fR] | [\fB-F\fR] | [\fB-x\fR] | [\fB-bpv\fR] | [\fB-acdDlPuv\fR] 
     [\fIdev_path\fR]
.fi

.SH 機能説明
.sp
.LP
\fBprtconf\fR コマンドはシステム構成情報を出力します。この出力には、メモリーの総量やシステム周辺機器の構成 (デバイスツリー形式) が含まれます。
.sp
.LP
コマンド行にデバイスパスを指定した場合、\fBprtconf\fR は、そのデバイスノードに関する情報だけを表示します。
.SH オプション
.sp
.LP
サポートしているオプションは、次のとおりです。
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 7n
.rt  
コマンド行に指定したデバイスの祖先であるデバイスノードをすべて (つまり、ルートノードまで) 表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-b\fR\fR
.ad
.RS 7n
.rt  
プラットフォームを特定するため、ファームウェアのデバイスツリーのルート設定を表示します。これらの設定の内容は「name」、「compatible」、「banner-name」、および「model」です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 7n
.rt  
コマンド行に指定したデバイスノードをルートとするデバイスサブツリーを表示します。つまり、コマンド行に指定したデバイスノードの子孫であるデバイスノードをすべて表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 7n
.rt  
ノード名に加え、PCI および PCI Express デバイスのベンダー ID とデバイス ID を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR\fR
.ad
.RS 7n
.rt  
デバイスツリー内のシステム周辺機器ごとに、周辺機器を管理するために使用されているデバイスドライバの名前を表示します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 7n
.rt  
デバイスノードに関連付けられた \fB/dev/chassis\fR の場所を表示します。\fB-v\fR が使用されると、\fB-l\fR も暗黙的に指定されます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR\fR
.ad
.RS 7n
.rt  
コンソールフレームバッファーが存在する場合、そのデバイスパス名を返します。フレームバッファーが存在しない場合、\fBprtconf\fR はゼロ以外の終了ステータスを返します。このフラグは単独で使用する必要があります。prtconf は、コンソールの名前、フレームバッファーのデバイス、またはゼロ以外の終了ステータスだけを返します。たとえば、SUNW, Ultra-30 上のコンソールフレームバッファーが \fBffb\fR であれば、prtconf は次の値を返します。\fB/SUNW,ffb@1e,0:ffb0\fR。このオプションは、\fB/dev/fb\fR から実際のコンソールデバイスへのシンボリックリンクを作成するときに使用できます。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.RS 7n
.rt  
SPARC プラットフォーム上のファームウェア (PROM) または x86 プラットフォーム上のブートシステムが提供するデバイスツリーから取得した情報を表示します。このオプションを使用して表示されるデバイスツリー情報は初期構成のスナップショットであり、後で行われた構成変更は正確に反映されない場合があります。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR\fR
.ad
.RS 7n
.rt  
疑似デバイスの情報も出力します。デフォルトでは、疑似デバイスの情報は出力されません。 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.RS 7n
.rt  
\fB-v\fR とともに使用して、デバイスごとの情報を表示します (ベンダーおよび管理リストのプロパティーがある場合はそれを一覧表示します)。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 7n
.rt  
詳細表示モードを指定します。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR \fR
.ad
.RS 7n
.rt  
プラットフォームに固有な \fBPROM\fR (SPARC プラットフォーム) またはブートシステム (x86 プラットフォーム) のバージョン情報を表示します。このフラグは単独で使用する必要があります。出力は文字列です。文字列の形式は決まっておらず、プラットフォームに固有です。
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.RS 7n
.rt  
当該システム上のファームウェアが 64 ビット対応であるかどうかを報告します。既存のプラットフォームの中には、64 ビットカーネルを実行するためにファームウェアをアップグレードする必要があるものもあります。この操作が当該プラットフォームで適用されない場合、つまり、ファームウェアがすでに 64 ビット対応である場合、prtconf は何も表示せずに、ゼロの終了ステータスを返して終了します。この操作が当該プラットフォームで適用される場合、つまり、ファームウェアが 64 ビット対応でない場合、prtconf は標準出力に説明メッセージを表示して、ゼロ以外の終了ステータスを返して終了します。64 ビットカーネルを実行するためにファームウェアをアップグレードする必要があるかどうかの詳細については、プラットフォームのハードウェアドキュメントを参照してください。
.sp
このフラグは他のすべてのフラグを無効にするので、単独で使用する必要があります。
.RE

.SH オペランド
.sp
.LP
次のオペランドがサポートされています。
.sp
.ne 2
.mk
.na
\fB\fIdev_path\fR\fR
.ad
.RS 12n
.rt  
ターゲットとなるデバイスマイナーノード、デバイスへのパス、または、デバイスリンクへのパスです。これらデバイスノードの構成情報が表示されます。
.RE

.SH 終了ステータス
.sp
.LP
次の終了ステータスが返されます。
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 12n
.rt  
正常終了
.RE

.sp
.ne 2
.mk
.na
\fB\fB0 以外\fR\fR
.ad
.RS 12n
.rt  
\fB-F\fR オプションを指定した場合 (SPARC のみ)、ゼロ以外の戻り値は、出力デバイスがフレームバッファーではないことを意味します。\fB-x\fR オプションを指定した場合、ゼロ以外の戻り値は、ファームウェアが 64 ビット対応ではないことを意味します。それ以外の場合には、ゼロ以外の戻り値はエラーが発生したことを意味します。
.RE

.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/core-os
インタフェースの安定性不確実
.TE

.SH 関連項目
.sp
.LP
\fBfuser\fR(1M), \fBmodinfo\fR(1M), \fBsysdef\fR(1M), \fBdriver\fR(4), \fBdriver.conf\fR(4), \fBattributes\fR(5)
.sp
.LP
\fI『Sun Hardware Platform Guide』\fR
.SS "SPARC のみ"
.sp
.LP
\fBopenprom\fR(7D)
.SH 注意事項
.sp
.LP
\fBprtconf\fR コマンドの出力はシステムにインストールされている \fBPROM\fR のバージョンに大きく依存します。したがって、出力は潜在的にあらゆる状況の影響を受けます。
.sp
.LP
\fBdriver not attached\fR というメッセージは、現在、デバイスの当該インスタンスにドライバが接続されていないことを意味します。一般に、ドライバは必要に応じてロードおよびインストールされ、(そして、ハードウェアのインスタンスに接続され)、デバイスが使用されないときはアンインストールとアンロードされます。
.sp
.LP
x86 プラットフォーム上で \fBprtconf\fR \fB-vp\fR を使用すると、\fBprtconf\fR \fB-v\fR の部分的な情報が表示されます。\fBprtconf\fR \fB-vp\fR の整数設定の値を正しく解釈するには、バイトスワップが必要になる場合があります。
