Alhadis/Silos/Solaris 11.3/ja_JP.UTF-8/man1m/smbd.1m
'\" te
.\" Copyright (c) 2008, 2011, Oracle and/or its affiliates. All rights reserved.
.TH smbd 1M "2011 年 8 月 23 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
smbd \- SMB サーバーデーモン
.SH 形式
.LP
.nf
\fB/usr/lib/smbd\fR
.fi

.SH 機能説明
.sp
.LP
\fBsmbd\fR デーモンは、Windows クライアントなどの \fBSMB\fR クライアントからの \fBCIFS\fR/\fBSMB\fR 要求を処理します。このデーモンを実行できるのは、\fB{PRIV_SYS_SMB}\fR、および \fB/var/run\fR ディレクトリに書き込むための十分な特権を持つプロセスだけです。
.sp
.LP
\fBsmbd\fR デーモンは、使用可能なすべてのトランスポートを介して、\fBshare\fR(1M) コマンドまたは \fBzfs\fR(1M) \fBset share\fR コマンドを使用して自動的に起動されます。デフォルトでは、\fBsmbd\fR は、\fBNBT\fR (NetBIOS-Over-TCP) トランスポートおよび \fBTCP\fR トランスポートを介して起動されます。
.sp
.LP
\fBsmbd\fR が \fBNBT\fR を介して起動された場合は、次のサービスが起動されます。
.RS +4
.TP
.ie t \(bu
.el o
NetBIOS ネームサービスが \fBUDP\fR ポート 137 上で起動されます。
.RE
.RS +4
.TP
.ie t \(bu
.el o
NetBIOS データグラムサービスが \fBUDP\fR ポート 138 上で起動されます。
.RE
.RS +4
.TP
.ie t \(bu
.el o
NetBIOS セッションサービスが \fBTCP\fR ポート 139 上で起動されます。
.RE
.sp
.LP
\fBsmbd\fR デーモンが TCP を介して起動された場合は、SMB サービスが TCP ポート 445 上で起動されます。
.sp
.LP
同時に実行できる \fBsmbd\fR のインスタンスは 1 つだけです。
.SH 終了ステータス
.sp
.LP
次の終了ステータスが返されます。
.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.RS 13n
.rt  
デーモンがクリーンな状態で終了しました。
.RE

.sp
.ne 2
.mk
.na
\fB95\fR
.ad
.RS 13n
.rt  
デーモンが致命的エラーで終了しました。
.RE

.sp
.ne 2
.mk
.na
\fB96\fR
.ad
.RS 13n
.rt  
デーモンが構成エラーで終了しました。
.RE

.SH 属性
.sp
.LP
次の属性についての詳細は、\fBattributes\fR(5) のマニュアルページを参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件service/file-system/smb
_
インタフェースの安定性不確実
.TE

.SH 関連項目
.sp
.LP
\fBps\fR(1), \fBsvcs\fR(1), \fBshare\fR(1M), \fBsharectl\fR(1M), \fBsmbadm\fR(1M), \fBsmbstat\fR(1M), \fBsvcadm\fR(1M), \fBzfs\fR(1M), \fBsmb\fR(4), \fBsmbautohome\fR(4), \fBsystem\fR(4), \fBattributes\fR(5), \fBsmf\fR(5)
.SH 注意事項
.sp
.LP
サービスの有効化、無効化、再起動などの管理操作を \fBsmbd\fR サービスで実行するには、\fBsvcadm\fR コマンドを使用します。サービスのステータスに対するクエリーを実行するには、\fBsvcs\fR コマンドを使用します。
.sp
.LP
\fBsmbd\fR サービスは、サービス管理機能により、サービス識別子 \fBsvc:/network/smb/server\fR の下で管理されます。
.sp
.LP
\fBsmbd\fR サービスが無効になっている場合は、その \fBauto_enable\fR プロパティーが false に設定されていないかぎり、\fBshare\fR(1M) コマンドまたは \fBzfs set share\fR コマンドによって有効にされます。
