Alhadis/Silos/Solaris 11.3/ja_JP.UTF-8/man1m/zonestatd.1m
'\" te
.\" Copyright (c) 2010, 2013, Oracle and/or its affiliates.All rights reserved
.TH zonestatd 1M "2013 年 11 月 20 日" "SunOS 5.11" "システム管理コマンド"
.SH 名前
zonestatd \- ゾーン監視デーモン
.SH 形式
.LP
.nf
\fB/usr/lib/zones/zonestatd\fR
.fi

.SH 機能説明
.sp
.LP
\fBzonestatd\fR は、システムのブート中に起動されるシステムデーモンです。このデーモンは、ゾーンによるシステムリソースの使用を監視するほか、\fBpsrset\fR \fB psets\fR、pool \fBpsets\fR、リソース制御設定などのゾーンおよびシステム構成情報を監視します。
.sp
.LP
このデーモンは、ゾーン管理ソフトウェアにより自動的に起動されるので、直接起動しないようにしてください。これは、プログラミングインタフェースのコンポーネントではありませんが、非公開インタフェースに分類されます。
.SH セキュリティ
.sp
.LP
各非大域ゾーン (NGZ) 内の \fBzonestat\fR サービスを適切に機能させるには、大域ゾーン内の \fBzonestat\fR サービスをオンラインにする必要があります。各 NGZ の \fBzonestat\fR サービスは、システム構成および使用状況データを直接読み取るのではなく、大域ゾーン上の \fBzonestat\fR サービスから読み取ります。
.sp
.LP
\fBsolaris-kz\fR ブランドの場合、\fBzonestat\fR サービスは完全に分離されます。
.SH 属性
.sp
.LP
属性についての詳細は、マニュアルページの \fBattributes\fR(5) を参照してください。
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
属性タイプ属性値
_
使用条件system/zones
_
インタフェースの安定性非公開
.TE

.SH 関連項目
.sp
.LP
\fBprctl\fR(1), \fBsvcs\fR(1), \fBzonestat\fR(1), \fBacctadm\fR(1M), \fBpooladm\fR(1M), \fBpoolcfg\fR(1M), \fBrcapadm\fR(1M), \fBsvcadm\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5), \fBzones\fR(5)
.SH 注意事項
.sp
.LP
\fBzonestat\fR サービスは、サービス管理機能 \fBsmf\fR(5) によって、次のサービス識別子として管理されます。
.sp
.in +2
.nf
svc:/system/zones-monitoring:default
.fi
.in -2
.sp

.sp
.LP
有効化、無効化、または再起動要求など、このサービスに関する管理操作は、\fBsvcadm\fR(1M) を使用して実行できます。サービスステータスを照会するには、\fBsvcs\fR(1) コマンドを使用します。
.sp
.LP
\fBzonestat\fR サービスには、次の SMF 構成プロパティーがあります。
.sp
.in +2
.nf
config/sample_interval
.fi
.in -2
.sp

.sp
.LP
このプロパティーは、\fBzonestatd\fR サンプリング間隔を設定します。これは、ゾーン監視デーモン \fBzonestatd\fR がリソースの使用状況のサンプリングに使用する間隔です。また、プロセッサセットの変更、リソース制御の変更、ゾーン状態の変更などの構成変更を判定するためにも使用されます。
.sp
.LP
デフォルトの間隔は 5 秒です。
.sp
.LP
\fBzonestat\fR サービスは、拡張アカウンティング機能を使用します。まだ有効になっていない場合は、プロセスアカウンティングリソースの追跡が有効になり、プロセスアカウンティングファイルが構成されます。\fBzonestat\fR サービスは、その構成された間隔でプロセスアカウンティングログを出力します (\fBzonestat\fR(1) を参照)。
.sp
.LP
拡張プロセスアカウンティングが外部で有効になっている場合、\fBzonestat\fR サービスは、構成に従ってそのプロセスアカウンティングログを使用します。アカウンティングログは出力されませんが、外部でアカウンティングログが出力されている場合には、このサービスは正しく動作します。
