Alhadis/Silos/Solaris-11.3/man7d/elxl.7d
'\" te
.\" Copyright (c) 2010, 2012, Oracle and/or its affiliates. All rights reserved.
.TH elxl 7D "5 Jan 2012" "SunOS 5.11" "Devices"
.SH NAME
elxl \- driver for 3Com Etherlink XL Ethernet controllers
.SH DESCRIPTION
.sp
.LP
The \fBelxl\fR driver supports network interfaces based on the 3Com Etherlink XL family of Ethernet controllers. Supported devices include the 3c900 and 3c905 families. The 3c900 family devices are 10 Mbps only devices, while the all other devices are generally capable of 100 Mbps.
.sp
.LP
The 3c905 devices that include an RJ-45 interface support IEEE 802.3 autonegotiation of link speed and duplex mode. For such devices, the link settings can be viewed or modified using \fBdladm\fR(1M) with the properties described in the \fBieee802.3\fR(5) manual page.
.sp
.LP
The 3c900 family of devices do not support any form of autonegotiation and normally default to half-duplex on the 10BASE-T port, if such a port is present.
.sp
.LP
For devices that include more than one physical port, the physical port defaults to a device-specific selection, which is normally a twisted-pair (10BASE-T or 100BASE-TX) port if one is present. This driver does not support automatic media detection.
.sp
.LP
A different port can be selected using \fBdladm\fR with the \fB_media\fR property. This property can be set to one of the following values, limited by the physical ports that are present.
.sp
.ne 2
.mk
.na
\fB\fBaui\fR\fR
.ad
.RS 10n
.rt  
Selects the AUI port for 10BASE5 operation. Link status is not reported in this mode.
.RE

.sp
.ne 2
.mk
.na
\fB\fBbnc\fR\fR
.ad
.RS 10n
.rt  
Selects the BNC port for 10BASE2 operation. Link status is not reported in this mode.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfl-fdx\fR\fR
.ad
.RS 10n
.rt  
Selects the 10BASE-FL fiber interface in full-duplex mode. Link status is not reported in this mode.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfl-hdx\fR\fR
.ad
.RS 10n
.rt  
Selects the 10BASE-FL fiber interface in half-duplex mode. Link status is not reported in this mode.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfx-fdx\fR\fR
.ad
.RS 10n
.rt  
Selects the 100BASE-FX fiber interface in full-duplex mode.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfx-hdx\fR\fR
.ad
.RS 10n
.rt  
Selects the 100BASE-FX fiber interface in half-duplex mode.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmii\fR\fR
.ad
.RS 10n
.rt  
For 100 Mbps devices, selects the 100BASE-TX, 100BASE-T4,or external MII port (whichever is present on the device.) IEEE 802.3 autonegotiation is used to select the actual speed and mode of the link.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtp-fdx\fR\fR
.ad
.RS 10n
.rt  
For 10 Mbps devices, selects full-duplex 10BASE-T operation.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtp-hdx\fR\fR
.ad
.RS 10n
.rt  
For 10 Mbps devices, selects half-duplex 10BASE-T operation.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/elxl\fR\fR
.ad
.RS 26n
.rt  
64-bit kernel driver module (x86)
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(1.83i) |cw(3.67i) 
lw(1.83i) |lw(3.67i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBnetstat\fR(1M), \fBieee802.3\fR(5), \fBattributes\fR(5), \fBdlpi\fR(7P)
