Alhadis/Silos/Solaris-11.3/man7d/fcp.7d
'\" te
.\" Copyright (c) 2004, 2012, Oracle and/or its affiliates. All rights reserved.
.TH fcp 7D "5 Jan 2012" "SunOS 5.11" "Devices"
.SH NAME
fcp \- Fibre Channel protocol driver
.SH DESCRIPTION
.sp
.LP
The \fBfcp\fR driver is the upper layer protocol that supports mechanisms for transporting \fBSCSI\fR-3 commands over Fibre Channel. The \fBfcp\fR driver, which interfaces with the Sun Fibre Channel transport library \fBfctl\fR(7D), supports the standard functions provided by the \fBSCSA \fRinterface. 
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/fcp\fR\fR
.ad
.RS 27n
.rt  
64-bit ELF kernel driver (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/fcp\fR\fR
.ad
.RS 27n
.rt  
64-bit ELF kernel driver (SPARC)
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes: 
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC
_
Interface StabilityUnknown
_
Availabilitysystem/io/fc/fc-scsi
.TE

.SH SEE ALSO
.sp
.LP
\fBprtconf\fR(1M), \fBdriver.conf\fR(4), \fBattributes\fR(5), \fBfctl\fR(7D), \fBfp\fR(7d)
.sp
.LP
\fIWriting Device Drivers for Oracle Solaris 11.2\fR
.sp
.LP
\fIFibre Channel Physical and Signaling Interface (FC-PH) ANSI X3.230: 1994\fR
.sp
.LP
\fIFibre Channel Generic Services (FC-GS-2) Project 1134-D\fR
.sp
.LP
\fIFibre Channel Arbitrated Loop (FC-AL) ANSI X3.272-1996\fR
.sp
.LP
\fIFibre Channel Protocol for SCSI (FCP) ANSI X3.269-1996\fR
.sp
.LP
\fISCSI-3 Architecture Model (SAM) Fibre Channel Private Loop SCSI Direct Attach (FC-PLDA) ANSI X3.270-1996\fR
.sp
.LP
\fIFabric Loop Attachment (FC-FLA), NCITS TR-20:1998\fR
