Alhadis/Silos/Solaris-11.3/man7d/hci1394.7d
'\" te
.\" Copyright (c) 2005, 2012, Oracle and/or its affiliates. All rights reserved.
.TH hci1394 7D "5 Jan 2012" "SunOS 5.11" "Devices"
.SH NAME
hci1394 \- 1394 OpenHCI host controller driver
.SH SYNOPSIS
.LP
.nf
\fBfirewire@unit-address\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBhci1394\fR host controller driver is an IEEE 1394 compliant nexus driver that supports the \fI1394 Open Host Controller Interface Specification 1.0\fR, an industry standard developed by Sun, Apple, Compaq, Intel, Microsoft, National Semconductor, and Texas Instruments. The \fBhci1394\fR driver supports asynchronous transfers, isochronous transfers, and bus reset management. The \fBhci1394\fR driver also supports the nexus device control interface.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/hci1394\fR\fR
.ad
.sp .6
.RS 4n
64-bit SPARC ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/hci1394\fR\fR
.ad
.sp .6
.RS 4n
64-bit x86 ELF kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86, PCI-based systems
_
Availabilitysystem/io/ieee-1394
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBieee1394\fR(7D)
.sp
.LP
\fIIEEE 1394 - IEEE Standard for a High Performance Serial Bus\fR 
.sp
.LP
\fI1394 Open Host Controller Interface Specification 1.0\fR
