Alhadis/Silos/Solaris-11.3/man7d/hwarc.7d
'\" te
.\" Copyright (c) 2009, 2013, Oracle and/or its affiliates. All rights
.\"  reserved.
.TH hwarc 7D "12 Dec 2013" "SunOS 5.11" "Devices"
.SH NAME
hwarc \- HWA Radio Controller Driver
.SH SYNOPSIS
.LP
.nf
hwa-radio@unit-address
.fi

.SH DESCRIPTION
.sp
.LP
The \fBhwarc\fR driver is a USBA (Solaris USB Architecture) compliant client driver that supports Host Wire Adapter Radio Controller, specified in Wireless Universal Serial Bus Specification, Version 1.0.
.sp
.LP
The \fBhwarc\fR driver handles the Radio Controller Interface of an HWA device and properly controls the UWB (Ultra Wideband) Radio in the device. The driver controls an HWA device to Scan, Start/Stop Beacon, Get IE, and so forth.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/hwarc\fR\fR
.ad
.RS 29n
.rt  
64-bit SPARC ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/hwarc\fR\fR
.ad
.RS 29n
.rt  
64-bit x86 ELF kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
_
Availabilitysystem/io/usb
.TE

.SH SEE ALSO
.sp
.LP
\fBadd_drv\fR(1M), \fBprtconf\fR(1M), \fBrem_drv\fR(1M), \fBupdate_drv\fR(1M), \fBattributes\fR(5), \fBhwahc\fR(7D), \fBusba\fR(7D), \fBuwba\fR(7D), 
.sp
.LP
\fIWriting Device Drivers for Oracle Solaris 11.2\fR
.sp
.LP
\fIUniversal Serial Bus Specification 1.0, 1.1 and 2.0 - 1996, 1998, 2000\fR
.sp
.LP
\fIWireless Universal Serial Bus Specification 1.0\fR
.sp
.LP
http://www.usb.org
.sp
.LP
http://www.oracle.com/us/sun/index.htm
