Alhadis/Silos/Solaris-11.3/man7d/i40evf.7d
'\" te
.\" Copyright (c) 2014, Oracle and/or its affiliates. All rights             reserved.
.TH i40evf 7D "9 Dec 2014" "SunOS 5.11" "Devices"
.SH NAME
i40evf \- Intel 10/40GbE Virtual Function Driver
.SH SYNOPSIS
.LP
.nf
/dev/i40evf*
.fi

.SH DESCRIPTION
.sp
.LP
The i40evf 10/40 Gigabit Ethernet driver is a multi-threaded, loadable, clonable, GLD-based STREAMS driver supporting the Data Link Provider Interface, \fBdlpi\fR(7P), on the virtual function of Intel XL710 10/40 Gigabit Ethernet controllers.
.sp
.LP
The functions of i40evf driver include initialization of the virtual function, frame transmit and receive, promiscuous and multicast support, and error recovery and reporting.
.sp
.LP
The i40evf driver works on the virtual function of Intel XL710 10/40 Ethernet controller only when the SR-IOV capability of the controller is enabled.
.SH CONFIGURATION
.sp
.LP
The i40evf driver is managed by the \fBdladm\fR(1M) command-line utility, which allows VLANs to be defined on top of i40evf instances. For more details, see the \fBdladm\fR(1M) man page. Link aggregation is not supported on one or more i40evf interfaces.
.sp
.LP
The i40evf driver does not support link configuration. The link configuration is controlled by the physical function of the XL710 controller, which is supported by the \fBi40e\fR(7D) driver.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/i40evf*\fR\fR
.ad
.RS 30n
.rt  
Special character device.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/i40evf\fR\fR
.ad
.RS 30n
.rt  
64-bit device driver (x86).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/i40evf\fR\fR
.ad
.RS 30n
.rt  
64-bit device driver (SPARC).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/i40evf.conf\fR\fR
.ad
.RS 30n
.rt  
Configuration file.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitydriver/network/ethernet/i40e
_
ArchitectureSPARC, x86
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBnetstat\fR(1M), \fBdriver.conf\fR(4), \fBattributes\fR(5), \fBstreamio\fR(7I), \fBdlpi\fR(7P), \fBi40e\fR(7D)
.sp
.LP
\fIWriting Device Drivers for Oracle Solaris 11.3\fR
.sp
.LP
\fISTREAMS Programming Guide\fR
.sp
.LP
IEEE 802.3ae Specification, IEEE - 2002
