Alhadis/Silos/Solaris-11.3/man7d/ixgbevf.7d
'\" te
.\" Copyright (c) 2011, 2012, Oracle and/or its affiliates. All rights reserved.
.TH ixgbevf 7D "5 Jan 2012" "SunOS 5.11" "Devices"
.SH NAME
ixgbevf \- Intel 10Gb PCI Express NIC Virtual Function Driver
.SH SYNOPSIS
.LP
.nf
\fB/dev/ixgbevf*\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBixgbevf\fR 10 Gb NIC Virtual Function driver is a multi-threaded, loadable, clonable, GLD-based STREAMS driver supporting the Data Link Provider Interface, \fBdlpi\fR(7P), on Intel 10-Gigabit PCI Express Ethernet controllers the 82599 NIC and later NICs. 
.sp
.LP
The \fBixgbevf\fR driver functions include controller initialization, frame transmit and receive, promiscuous and multicast support, and error recovery and reporting. 
.SH APPLICATION PROGRAMMING INTERFACE
.sp
.LP
The cloning character-special device, \fB/dev/ixgbevf\fR, is used to access the virtual functions of the 82599 NIC and other later Intel 10Gb NIC devices installed within the system.
.sp
.LP
The \fBixgbevf\fR driver is managed by the \fBdladm\fR(1M) command line utility, which allows VLANs to be defined on top of \fBixgbevf\fR instances and for \fBixgbevf\fR instances to be aggregated. See \fBdladm\fR(1M) for details.
.sp
.LP
You must send an explicit \fBDL_ATTACH_REQ\fR message to associate the opened stream with a particular device (\fBPPA\fR). The \fBPPA\fR ID is interpreted as an unsigned integer data type and indicates the corresponding device instance (unit) number. The driver returns an error (\fBDL_ERROR_ACK\fR) if the \fBPPA\fR field value does not correspond to a valid device instance number for the system. The device is initialized on first attach and de-initialized (stopped) at last detach.
.sp
.LP
The values returned by the driver in the \fBDL_INFO_ACK\fR primitive in response to your \fBDL_INFO_REQ\fR are:
.RS +4
.TP
.ie t \(bu
.el o
Maximum \fBSDU\fR is \fB1500\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Minimum \fBSDU\fR is \fB0\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBDLSAP\fR address length is \fB8\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBMAC\fR type is \fBDL_ETHER\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBSAP\fR (Service Access Point) length value is \fB-2\fR, meaning the physical address component is followed immediately by a 2-byte \fBSAP\fR component within the \fBDLSAP\fR address.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Broadcast address value is the Ethernet/IEEE broadcast address (\fIFF:FF:FF:FF:FF:FF\fR).
.RE
.RS +4
.TP
.ie t \(bu
.el o
MAC type is \fBDL_ETHER\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBSAP\fR (Service Access Point) length value is -\fB2\fR, meaning the physical address component is followed immediately by a 2-byte \fBSAP\fR component within the \fBDLSAP\fR address. 
.RE
.RS +4
.TP
.ie t \(bu
.el o
Broadcast address value is the Ethernet/IEEE broadcast address (\fIFF:FF:FF:FF:FF:FF\fR).
.RE
.sp
.LP
Once in the \fBDL_ATTACHED\fR state, you must send a \fBDL_BIND_REQ\fR to associate a particular \fBSAP\fR with the stream.
.SH CONFIGURATION
.sp
.LP
By default, Link speed and mode can only be 10000 Mbps full-duplex. See the \fIIEEE 802.3ae Specificiation\fR for more information.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/ixgbevf*\fR\fR
.ad
.sp .6
.RS 4n
Special character device
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/ixgbevf\fR\fR
.ad
.sp .6
.RS 4n
64-bit device driver (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/ixgbevf\fR\fR
.ad
.sp .6
.RS 4n
64-bit device driver (SPARC)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/ixgbevf.conf\fR\fR
.ad
.sp .6
.RS 4n
Configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitydriver/network/ethernet/ixgbe
_
ArchitectureSPARC, x86
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBnetstat\fR(1M), \fBdriver.conf\fR(4), \fBattributes\fR(5), \fBdlpi\fR(7P), \fBstreamio\fR(7I)
.sp
.LP
\fIWriting Device Drivers for Oracle Solaris 11.2\fR
.sp
.LP
\fISTREAMS Programming Guide\fR
.sp
.LP
\fIIEEE 802.3ae Specificiation, IEEE - 2002\fR
