Alhadis/Silos/Solaris-11.3/man7d/mwl.7d
'\" te
.\" Copyright (c) 2009, 2012, Oracle and/or its affiliates. All rights reserved.
.TH mwl 7D "5 Jan 2012" "SunOS 5.11" "Devices"
.SH NAME
mwl \- Marvell 88W8363 IEEE802.11b/g Wireless Network Device Driver
.SH DESCRIPTION
.sp
.LP
The \fBmwl\fR IEEE802.11b/g wireless network device driver is a multi-threaded, loadable, clonable, GLDv3-based STREAMS driver supporting the Marvell 88W8363 IEEE802.11b/g wireless network device.
.SS "Configuration"
.sp
.LP
The \fBmwl\fR driver performs auto-negotiation to determine the data rate and mode. The driver supports only BSS networks (also known as \fBap\fR or \fBinfrastructure\fR networks) and \fBopen\fR (or \fBopen-system\fR)  or \fBshared system\fR authentication. 
.sp
.LP
For wireless security, WEP encryption, WPA-PSk, and WPA2-PSK are currently supported. You can perform configuration and administration tasks using the \fBdladm\fR(1M) utility.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/mwl\fR\fR
.ad
.RS 28n
.rt  
Special character device
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/mwl\fR\fR
.ad
.RS 28n
.rt  
64-bit ELF kernel module, x86
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/amd64/mwlfw\fR\fR
.ad
.RS 28n
.rt  
64-bit ELF firmware kernel module, x86
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availabilitydriver/network/wlan/mwl
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBattributes\fR(5), \fBdlpi\fR(7P), \fBgld\fR(7D)
.sp
.LP
\fIIEEE802.11b/g - Wireless LAN Standard - IEEE, 2003\fR
