Alhadis/Silos/Solaris-11.3/man7d/myri10ge.7d
'\" te
.\" Copyright (c) 2007-2009 Myricom, Inc. All Rights Reserved. Use is subject to license terms.
.\" Portions Copyright (c) 2009, 2012, Oracle and/or its affiliates. All rights reserved.
.TH myri10ge 7D "5 Jan 2012" "SunOS 5.11" "Devices"
.SH NAME
myri10ge \- Myricom Myri10GE 10Gb PCI Express NIC Driver
.SH SYNOPSIS
.LP
.nf
/dev/myri10ge*
.fi

.SH DESCRIPTION
.sp
.LP
The \fBmyri10ge\fR Gigabit Ethernet driver is a multi-threaded, loadable, clonable, GLD-based STREAMS driver that supports the Data Link Provider Interface, \fBdlpi\fR(7P), on Myricom Myri10GE 10-Gigabit Ethernet controllers. 
.sp
.LP
The \fBmyri10ge\fR driver functions include controller initialization, frame transmit and receive, promiscuous and multicast support, multiple transmit and receive queues, support for TCP Large Send Offload, support for TCP Large Receive Offload, and error recovery and reporting.
.SS "Application Programming Interface"
.sp
.LP
The cloning character-special device, \fB/dev/myri10ge\fR, is used to access all Myricom Myri10GE 10 -Gigabit Ethernet dev ices installed within the system. 
.sp
.LP
The \fBmyri10ge\fR driver is managed by the \fBdladm\fR(1M) command line utility. dladm allows VLANs to be defined on top of \fBmyri10ge\fR instances and for \fBmyri10ge\fR instances to be aggregated. See \fBdladm\fR(1M) for more details.
.sp
.LP
You must send an explicit \fBDL_ATTACH_REQ\fR message to associate the opened stream with a particular device (\fBPPA\fR). The \fBPPA\fR ID is interpreted as an unsigned integer data type and indicates the corresponding device instance (unit) number. The driver returns an error (\fBDL_ERROR_ACK\fR) if the \fBPPA\fR field value does not correspond to a valid device instance number for the system. The device is initialized on first attach and de-initialized (stopped) at last detach. 
.sp
.LP
The values returned by the driver in the \fBDL_INFO_ACK\fR primitive in response to your \fBDL_INFO_REQ\fR are: 
.RS +4
.TP
.ie t \(bu
.el o
Maximum \fBSDU\fR is \fB9000\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Minimum \fBSDU\fR is \fB0\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBDLSAP\fR address length is \fB8\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBMAC\fR type is \fBDL_ETHER\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBSAP\fR (Service Access Point) length value is \fB-2\fR, meaning the physical address component is followed immediately by a 2-byte \fBSAP\fR component within the \fBDLSAP\fR address.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Broadcast address value is the Ethernet/IEEE broad- cast address (\fBFF:FF:FF:FF:FF:FF\fR). 
.RE
.RS +4
.TP
.ie t \(bu
.el o
Once in the \fBDL_ATTACHED\fR state, you must send a \fBDL_BIND_REQ\fR to associate a particular SAP with the stream.
.RE
.SS "Configuration"
.sp
.LP
Link speed and mode can only be 10000 Mbps full-duplex. See the \fIIEEE 802.3 Standard\fR for more information.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/myri10ge*\fR\fR
.ad
.sp .6
.RS 4n
Special character device.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/myri10ge\fR\fR
.ad
.sp .6
.RS 4n
64-bit device driver (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/myri10ge\fR\fR
.ad
.sp .6
.RS 4n
64-bit device driver (SPARC)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/myri10ge.conf\fR\fR
.ad
.sp .6
.RS 4n
Configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
_
Availabilitydriver/network/ethernet/myri10ge
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBnetstat\fR(1M), \fBdriver.conf\fR(4), \fBattributes\fR(5), \fBdlpi\fR(7P), \fBstreamio\fR(7I)
.sp
.LP
\fIWriting Device Drivers for Oracle Solaris 11.2\fR
.sp
.LP
\fIOracle Solaris 11.2 Programming Interfaces Guide\fR
.sp
.LP
\fISTREAMS Programming Guide\fR
.sp
.LP
\fIIEEE 802.3 Standard\fR
