Alhadis/Silos/Solaris-11.3/man7d/npe.7d
'\" te
.\" Copyright (c) 2005, 2013, Oracle and/or its affiliates. All rights reserved.
.TH npe 7D "4 Jan 2012" "SunOS 5.11" "Devices"
.SH NAME
npe \- PCI Express bus nexus driver
.SH DESCRIPTION
.sp
.LP
The \fBnpe\fR nexus driver is used on X64 servers for PCI Express Root Complex devices that provide PCI Express interconnect. This driver is compliant to PCI Express base specification, Revision 1.0a.
.sp
.LP
This nexus driver provides support for the following features: Access to extended configuration space, IEEE 1275 extensions for PCI Express, Base line PCI Express error handling and PCI Express MSI interrupts.
.SH FILES
.sp
.ne 2
.mk
.na
\fB/platform/i86pc/kernel/drv/amd64/npe\fR
.ad
.sp .6
.RS 4n
64-bit ELF kernel module.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex64 PCI Express-based systems
_
Availabilitysystem/kernel/platform
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBpcie\fR(4), \fBpcie_pci\fR(7D)
.sp
.LP
\fIPCI Express Base Specification v1.0a\fR \(em 2003
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fIIEEE 1275 PCI Bus Binding\fR \(em 1998
