Alhadis/Silos/Solaris-11.3/man7d/ohci.7d
'\" te
.\" Copyright (c) 2006, 2012, Oracle and/or its affiliates. All rights reserved.
.TH ohci 7D "6 Jan 2012" "SunOS 5.11" "Devices"
.SH NAME
ohci \- OpenHCI host controller driver
.SH SYNOPSIS
.LP
.nf
\fBusb@unit-address\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBohci\fR driver is a USBA (Solaris USB Architecture) compliant nexus driver that supports the \fIOpen Host Controller Interface Specification 1.1\fR, an industry standard developed by Compaq, Microsoft, and National Semiconductor. 
.sp
.LP
The \fBohci\fR driver supports bulk, interrupt, control and isochronous transfers. 
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/ohci\fR\fR
.ad
.RS 28n
.rt  
64-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/ohci\fR\fR
.ad
.RS 28n
.rt  
64-bit SPARC ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/ohci.conf\fR\fR
.ad
.RS 28n
.rt  
driver configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86, PCI-based systems 
_
Availability system/io/usb
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBehci\fR(7D), \fBhubd\fR(7D), \fBuhci\fR(7D), \fBusba\fR(7D)
.sp
.LP
\fIWriting Device Drivers for Oracle Solaris 11.2\fR
.sp
.LP
\fIUniversal Serial Bus Specification 2.0\fR
.sp
.LP
\fIOpen Host Controller Interface Specification for USB 1.0a\fR
.sp
.LP
\fIIntroduction to Oracle Solaris 11.3                 Administration\fR
.sp
.LP
http://www.oracle.com
.SH DIAGNOSTICS
.sp
.LP
All host controller errors are passed to the client drivers. Root hub errors are documented in \fBhubd\fR(7D). 
.sp
.LP
In addition to being logged, the following messages may appear on the system console. All messages are formatted in the following manner:
.sp
.in +2
.nf
WARNING: <device path> <ohci><instance number>>: Error message...
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
\fBUnrecoverable USB Hardware Error.\fR
.ad
.sp .6
.RS 4n
There was an unrecoverable USB hardware error reported by the OHCI Controller. Please reboot the system. If this problem persists, contact your system vendor.
.RE

.sp
.ne 2
.mk
.na
\fBNo SOF interrupts have been received. This OHCI USB controller is unusable.\fR
.ad
.sp .6
.RS 4n
The USB hardware is not generating Start Of Frame interrupts. Please reboot the system. If this problem persists, contact your system vendor.
.RE

.sp
.LP
The following messages may be entered into the  system  log. They are formatted in the following manner:
.sp
.in +2
.nf
<device path> <ohci<instance number>): Message...
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
\fBFailed to program frame interval register.\fR
.ad
.sp .6
.RS 4n
For an unspecified reason, the frame interval register has been nulled out by the Uli M1575 chip. Please reboot the system. If this problem persists, contact your system vendor.
.RE

