Alhadis/Silos/Solaris-11.3/man7d/qlcnic.7d
'\" te
.\" Copyright (c) 2011, 2014, Oracle and/or its affiliates. All rights reserved.
.TH qlcnic 7D "24 Mar 2014" "SunOS 5.11" "Devices"
.SH NAME
qlcnic \- QLogic 10 Gigabit Ethernet Driver
.SH SYNOPSIS
.sp
.in +2
.nf
/dev/qlcnic*
.fi
.in -2

.SH DESCRIPTION
.sp
.LP
The \fBqlcnic\fR 10 Gigabit Ethernet driver is a multi-threaded, loadable, clonable, GLD-based STREAMS driver that supports the Data Link Provider Interface, \fBdlpi\fR(7P), on QLogic \fBqlcnic\fR 10-Gigabit 82xx, 83xx, and 84xx based Ethernet controllers. 
.sp
.LP
The \fBqlcnic\fR driver functions include controller initialization, frame transmit and receive, promiscuous and multicast support, multiple transmit and receive queues, support for TCP Large Send Offload, support for TCP Large Receive Offload, and error recovery and reporting.
.sp
.LP
The \fBqlcnic\fR driver supports SR-IOV capability on QLogic 83xx and 84xx based controllers.
.SS "Application Programming Interface"
.sp
.LP
The cloning character-special device, \fB/dev/qlcnic\fR, is used to access QLogic \fBqlcnic\fR 82xx, 83xx, and 84xx 10-Gigabit Ethernet devices installed on the system.
.sp
.LP
The \fBqlcnic\fR driver is managed by the \fBdladm\fR(1M) command line utility. \fBdladm\fR allows VLANs to be defined on top of \fBqlcnic\fR instances and for qlcnic instances to be aggregated. See \fBdladm\fR(1M) for details.
.sp
.LP
You must send an explicit \fBDL_ATTACH_REQ\fR message to associate the opened stream with a particular device (\fBPPA\fR). The \fBPPA ID\fR is interpreted as an unsigned integer data type and indicates the corresponding device instance (unit) number. The driver returns an error (\fBDL_ERROR_ACK\fR)  if the \fBPPA\fR field value does not correspond to a valid device instance number for the system. The device is initialized on first attach  and deinitialized (stopped) at last detach.
.sp
.LP
The values returned by the driver in the \fBDL_INFO_ACK\fR primitive in response to your \fBDL_INFO_REQ\fR are:
.RS +4
.TP
.ie t \(bu
.el o
Maximum \fBSDU\fR is \fB9000\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Minimum \fBSDU\fR is \fB0\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBDLSAP\fR address length is \fB8\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBMAC\fR type is \fBDL_ETHER\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBSAP\fR (Service Access Point) length value is \fB-2\fR, meaning that the physical address component is followed immediately by a 2-byte \fBSAP\fR component within the \fBDLSAP\fR address.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Broadcast address value is the Ethernet/IEEE broadcast address (\fIFF:FF:FF:FF:FF:FF\fR).
.RE
.RS +4
.TP
.ie t \(bu
.el o
Once in the \fBDL_ATTACHED\fR state, you must send a  \fBDL_BIND_REQ\fR to associate a particular \fBSAP\fR with the stream.
.RE
.SS "Configuration"
.sp
.LP
Link speed and mode can only be 10000 Mbps full-duplex. See the \fIIEEE 802.3 Standard\fR.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/qlcnic*\fR\fR
.ad
.RS 30n
.rt  
Special character device
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/qlcnic\fR\fR
.ad
.RS 30n
.rt  
64-bit device driver (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/qlcnic\fR\fR
.ad
.RS 30n
.rt  
64-bit device driver (SPARC)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/qlcnic.conf\fR\fR
.ad
.RS 30n
.rt  
Configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
_
Availabilitydriver/network/ethernet/qlcnic
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBnetstat\fR(1M), \fBdriver.conf\fR(4), \fBattributes\fR(5), \fBdlpi\fR(7P), \fBstreamio\fR(7I)
.sp
.LP
\fIWriting Device Drivers for Oracle Solaris 11.2\fR
.sp
.LP
\fIOracle Solaris 11.2 Programming Interfaces Guide\fR
.sp
.LP
\fIStreams Programming Guide\fR
.sp
.LP
\fIIEEE 802.3 Standard\fR
