Alhadis/Silos/Solaris-11.3/man7d/rtw.7d
'\" te
.\" Copyright (c) 2007, 2012, Oracle and/or its affiliates. All rights reserved.
.TH rtw 7D "5 Jan 2012" "SunOS 5.11" "Devices"
.SH NAME
rtw \- RealTek 8180L 802.11b Wireless NIC driver
.SH DESCRIPTION
.sp
.LP
The \fBrtw\fR \fI802.11b\fR wireless NIC driver is a  multi-threaded, loadable, clonable, GLDv3-based  STREAMS driver supporting RealTek 8180L chipset-based NIC's.
.SH CONFIGURATION
.sp
.LP
The \fBrtw\fR driver performs auto-negotiation to determine the data rate and mode. Supported \fI802.11b\fR data rates are 1, 2, 5.5 and 11 Mbits/sec. The default is 11. 
.sp
.LP
The \fBrtw\fR driver supports only BSS  networks  (also  known as \fBap\fR or \fBinfrastructure\fR networks) and \fBopen\fR (or \fBopen-system\fR) or \fBshared system\fR authentication.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/rtw*\fR\fR
.ad
.sp .6
.RS 4n
Special character device.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/rtw\fR\fR
.ad
.sp .6
.RS 4n
64-bit ELF kernel module (x86).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availabilitydriver/network/wlan/rtw
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBattributes\fR(5), \fBgld\fR(7D), \fBdlpi\fR(7P)
.sp
.LP
\fI802.11 - Wireless LAN  Media  Access  Control  and  Physical Layer Specification\fR \(em IEEE, 2001
