Alhadis/Silos/Solaris-11.3/man7d/zyd.7d
'\" te
.\" Copyright (c) 2008, 2012, Oracle and/or its affiliates. All rights reserved.
.TH zyd 7D "5 Jan 2012" "SunOS 5.11" "Devices"
.SH NAME
zyd \- ZyDAS ZD1211/ZD1211B USB 802.11b/g Wireless Driver
.SH DESCRIPTION
.sp
.LP
The \fBzyd\fR \fI802.11b/g\fR wireless driver is a multi-threaded, loadable, clonable, GLDv3-based STREAMS driver supporting the ZyDAS ZD1211/ZD1211B USB chipset-based wireless devices.
.SH CONFIGURATION
.sp
.LP
The \fBzyd\fR driver performs auto-negotiation to determine the data rate and mode. Supported \fI802.11b\fR data rates are 1, 2, 5.5 and 11 Mbits/sec. Supported \fI802.11g\fR data rates are 1, 2, 5.5, 11, 6, 9, 12, 18, 24, 36, 48 and 54 Mbits/sec. The \fBzyd\fR driver supports only BSS networks (also known as ap or infrastructure networks) and open (or open-system), shared key and WPA/WPA2 authentication. Supported encryption types are WEP40, WEP104, TKIP and AES-CCMP.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/zyd*\fR\fR
.ad
.RS 25n
.rt  
Special character device.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/zyd\fR\fR
.ad
.RS 25n
.rt  
64-bit kernel module (x86).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(0i) |cw(5.5i) 
lw(0i) |lw(5.5i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availability driver/network/wlan/zyd
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBattributes\fR(5), \fBgld\fR(7D), \fBdlpi\fR(7P)
.sp
.LP
\fI802.11 - Wireless LAN Media Access Control and Physical Layer Specification\fR - IEEE, 2001
